{"product_id": "B0B2DJDCPX", "product_name": "SWAPKART Fast Charging Cable and Data Sync USB Cable Compatible for iPhone 6/6S/7/7+/8/8+/10/11, 12, 13 Pro max iPad Air/Mini, iPod and iOS Devices (White)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹209", "actual_price": "₹499", "discount_percentage": "58%", "rating": "3.9", "rating_count": "536", "about_product": "[High Compatibility] : This iphone data cable supports with iPhone 6,6s,6 plus,6s plus,7 7 plus ,8 8plus,x,xs,11 pro max,12 mini pro max,13 mini pro max iPad Air, iPad mini, iPod Nano and iPod Touch|[Fast Charge&Data Sync ] : It can charge and sync simultaneously at a rapid speed, Compatible with any charging adaptor, multi-port charging station or power bank ,for fast charging ,fast adapter is must.|😍【Durable Spring Protection】：The easy-to-break connection port is protected by spring, which is a flexible and durable cable.You can use it with confidence.|【 Ultra High Quality】: According to the experimental results, the fishbone design can accept at least 20,000 bending and insertion tests for extra protection and durability. Upgraded 3D aluminum connector and exclusive laser welding technology, which to ensure the metal part won't break and also have a tighter connection which fits well even with a protective case on and will never loose connection.|【 Good After Sales Service】-Our friendly and reliable customer service will respond to you within 24 hours ! you can purchase with confidence,and every sale includes a 365-day worry-free Service to prove the importance we set on quality.", "user_id": "AEBHZQJ4R2TZ57GOCSTMIP53F4JQ,AHSESHUAGEFQ62M3KYV3EK5K77FQ,AFB3MTOE4VW2XO6RTJGIWJYH5OBQ,AF7CJCAKRIAY4BVN77BTSZYXXIZA,AHW6UBYJXSPOMQVGP74VQ74BO55Q,AGIAEJN4RPI6Z5ABV733VJMBUZLA,AHUELVJPFM3FEIMF2DE7OTNQD5VQ,AHPVTM2FDYB3YW3MXB523JWJTLQA", "user_name": "Vinay,Amazon Customer,Naveenkumar Vemula,sumit,Ajay,vivek rajpooot,drravish,8309-873146", "review_id": "R2LX1M52C4KNJA,R2BXIXVBJUUUEC,R19EYLO6N0AKLG,R2PGJZAQVR5XQE,R20A9E5E100YPR,RTSX75DFGY3VC,R1WGYKGMT7EHPY,R1ZXKR6UFH5VNW", "review_title": "Value for money,Nice product,timely delivered with good packeging,Good in quality,Quite nice cable,  Go for it,Good product , value for money,Worth buying,Nice", "review_content": "Packing is good .. they have sent a box for itAlso the quality looks good and decently fast chargingGood product for the price paid,Nice product,nice charging cable for low cost.,Highly recommended,Quite nice cable in this price, charging my iPad smoothly  Go for it,I like the product and resnable precise.,Worth buyinh,Nice", "img_link": "https://m.media-amazon.com/images/I/41KmCJuybRL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SWAPKART-Charging-Compatible-iPhone-Devices/dp/B0B2DJDCPX/ref=sr_1_465?qid=1672903018&s=computers&sr=1-465"}
{"product_id": "B08Y7MXFMK", "product_name": "Offbeat® - DASH 2.4GHz Wireless + Bluetooth 5.1 Mouse, Multi-Device Dual Mode Slim Rechargeable Silent Click Buttons Wireless Bluetooth Mouse, 3 Adjustable DPI, Works on 2 devices at the same time with a switch button for Windows/Mac/Android/Ipad/Smart TV", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹1,099", "actual_price": "₹1,499", "discount_percentage": "27%", "rating": "4.2", "rating_count": "2,375", "about_product": "► 【2.4G WIRELESS DUAL MODE AND BLUETOOTH 5.1】The upgraded version mouse with Dual Mode Connection and LED lights adds more fun to the boring office life. It can work on TWO DEVICES, connecting one device through Bluetooth and the other through 2.4GHz USB Receiver. You could switch the mode between two devices by just toggle switching.2.4GHz mode works with laptop, desktop or any device with USB port, simply plug the USB receiver and play directly.|► 【 RECHARGEABLE AND ENERGY SAVING】 : The mouse built-in rechargeable battery, with a charging cable. No need to change batteries. To save power and for long-term usage, the mouse will automatically enter into the sleep mode after 11 minutes of inactivity, it can be waken up by clicking any button.|► 【PLUG/PLAY AND ADJUSTABLE DPI】No need to install any driver, just plug the USB receiver into your laptop and the mouse starts to serve. 2.4GHz wireless technology provides powerful and reliable connection, effective up to 10 meters of range. Switch DPI levels among 800, 1200 and 1600 to to meet your needs with high precision. Advanced Optical Tracking Technology ensures greater sensitivity for precise tracking on a wide range of surfaces.|► 【SILENT CLICK & ERGONOMIC DESIGN】Silent click Mouse with anti-fingerprint finish offers your hand maximum support and comfort. Silent button reduces 90% noises, which makes it an ideal wireless mouse for office and personal use. Symmetric and ergonomic design makes this mouse fit for both left and right hand, naturally curved grip of the mouse makes it comfortable and perfect, avoids hand fatigue for long term use. Slim and portable design makes the mouse your best travel companion.", "user_id": "AGLOZNSKAGH5XUZEAZ3FZTQ22CHQ,AFAT7XOWTWEFHD5OPAUPOMHDS6ZQ,AFOQM6Q5YBLXIBXQ3OX462DOEJTA,AHRIS5H6Y3RZXHEWWOIH4G2LYJRA,AEHJFSE7VES6WCXZMR7OAQ6W7NIQ,AEGAHQJXL5G7G3Q7RBN6RDVGUTVA,AF6HEKQ4VQN3LEYA35NQCEG6LAWQ,AEYIX2KJOD6M2ELCQRD2AQATBBKQ", "user_name": "Surajit Patra,Dixitkotadiya,Abishek Stephen,Dev,Subrata Nath,balakumar mohan,Pratik,Sekhar Kommuri", "review_id": "RK1D5GNVFWW81,R1J8O3B5JA0UAZ,R2MSW0Q2BS0Y0P,RSN8DME4CMZOS,R2FWC32CELK3AN,R1S08DNN0E78R7,R1ASEJB3TZPPVG,R1X9I04FF3QE0A", "review_title": "Android & IOS,About Mouse,Broke after two weeks - Update: Product replaced twice and it works now,Good,A perfect one,A decent device for daily use,Overall a good product,So far so good!", "review_content": "You can use android & ISO devices.,Mouse is very good but bluetooth option can't support in macbook pro,Update 3: I have received the replacement mouse for the replacement mouse. It seems to work fine till date. Sometimes it hangs and I have to restart it but compared to previous ones it is fine. Not 100% reliable but the customer service and replacement has been good. Would recommend the product if you have a backup mouse with you as it is not completely reliable.Update 2: The replacement mouse broke within 2 days. It stopped working completely and the mouse cursor doesn't even move. Asked for a refund but they are sending me another mouse after testing it for a week. I am losing hope.Update 1: I contacted their WhatsApp customer service number, they arranged for a replacement immediately and I received it after a week. I had to use an old mouse in the mean time.I used to trust offbeat products but I am greatly disappointed as this mouse broke just after two weeks. The mouse pointer moves erratically on it's own. The return window closed two days ago and I can't return this broken garbage. I will file a complaint to consumer court if I am not refunded.,Good,I use apple's magic mouse regularly which is a superior one for obvious reasons (stylist design, it supports gestures, battery backup is unparallel).This offbeat mouse is almost as per in terms of ergonomics and design.We can not expect this mouse to support gestures (at this price point and innovation) but does the job well. The good part is, you have dual modes of connecting, dongle and Bluetooth. Decorative lights are a plus.  I tested this mouse connecting to MacBook and works all well.For battery and charging, I am not able to comment yet as not used for long term.Overall a happy buy.... :),Good battery life, Adjustable DPI works well, easy to use & switch devices, Bluetooth is sorted, RGB has low illumination. Basic everyday use Bluetooth mice.,It's a good productUsing it since 6 monthsHappy with the battery life.Quality could've been better.,No issues so far and quality is good. Liked the design too.", "img_link": "https://m.media-amazon.com/images/I/31dnZ234ZOL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Offbeat-Wireless-Bluetooth-Rechargeable-Adjustable/dp/B08Y7MXFMK/ref=sr_1_466?qid=1672903018&s=computers&sr=1-466"}
{"product_id": "B086Q3QMFS", "product_name": "Classmate Drawing Book - Unruled, 40 Pages, 210 mm x 297 mm - Pack Of 4", "category": "OfficeProducts|OfficePaperProducts|Paper|Stationery|Notebooks,WritingPads&Diaries|CompositionNotebooks", "discounted_price": "₹120", "actual_price": "₹120", "discount_percentage": "0%", "rating": "4.5", "rating_count": "4,951", "about_product": "The cover design of the notebook is subject to change, it depends on stock availability|Pack Of 4 - Unruled Drawing Book, 40,Pages, 210 mm x 297 mm|Notebooks for every subject for hassle-free note-taking during classes or lectures.|Classmate uses elemental chlorine free paper|This notebook consists of quality papers", "user_id": "AENWPLS2BHDMH4O6DD7EYV5DOGHQ,AGWEZX7ZMZNEDPVTPFZIOKD3RUJQ,AE4JUNCUKPAHHGNR2OJEXJ64ZJOA,AH3AYKWBYIOGWAQURE34B6PGJWLQ,AHQXC2MQJWWBWFCLJQWZ4KCT6BCA,AF2GCLO5T7RRFOW2NCDF2POWFGLQ,AGPAK6ELVZPVKQ7GEZ7IUHNK2C3Q,AFQKN26SJVBLDXPECZHMTIAYVLSA", "user_name": "a.john,Sonika sharma,Umadevi,tarun,venkatesh k c,Anumod,Olivia,Syed", "review_id": "RSVV6T480YK7W,R22DHM4LC4189N,RS51GZQV4URIF,R3KIJ4STUFAA1,R3VBGTOFWPE9OQ,R34NVGOBJPJX6D,R20XKKJEEML1C9,R8EZGLNJWYUI0", "review_title": "Good product for beginners,Wonderful,Good,Rate is affordable,Nice will order again,Very good deal,Super,Drawing books", "review_content": "Good for learning drawing for kids. MRP of product is 120 (4 books , 30 a piece)  but amazon charged 140 initially. Contacted customer service and got the difference in amount back.,Great work experience.....,Valuable,Good product at affordable rate,Nice will order again,Very good deal,Paper texture is good. Best at this price,My kids like the drawing books n it's value for money", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41KFL-3kiUL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Classmate-Drawing-Book-Unruled-Pages/dp/B086Q3QMFS/ref=sr_1_468?qid=1672903018&s=computers&sr=1-468"}
{"product_id": "B08498H13H", "product_name": "HP GK320 Wired Full Size RGB Backlight Mechanical Gaming Keyboard, 4 LED Indicators, Mechanical Switches, Double Injection Key Caps, and Windows Lock Key(4QN01AA)", "category": "Computers&Accessories|Accessories&Peripherals|PCGamingPeripherals|GamingKeyboards", "discounted_price": "₹1,519", "actual_price": "₹3,499", "discount_percentage": "57%", "rating": "4.3", "rating_count": "408", "about_product": "Convertible dynamic mixing can easily adjust the brightness and switch display modes, and the variety of light eff ects are dazzling and exciting, and your desire to fi ght is stimulated.|50 million times ultra-long lifetime mechanical switch, A variety of mechanical buttons let you experience different knocks.|Matt double Injection Keycaps With a magnetic ring to eliminate interfering signals and transmission error|1 year manufacturer warranty on the device from the date of purchase.", "user_id": "AG4CULPDENY6NXR67DNAQU5VM42Q,AE6XZBRHYTRKG33Z6UGCG7EUQ2UQ,AFLCRL5P6JC24SEQTM6ASIJUVC2A,AECBTAP3SOAAMWUSNGBILNOOM5DQ,AEC5C3VXEKLH62ITNOMMUYIE2CAA,AFB6GXJEM6T4SHB3BQJ5G4UC5VAA,AFTCVC4B2DKVF5IF7GQYAWOA2X3A,AHFYGXWTFW2WTUEEYAKS3BYPQQ3A", "user_name": "Lingaraj Naik,Vinod Patidar,Shubham Soni,Himraj,Anonymous22,NRD AZ Customer,Koushik Roy Chowdhury,Govind S.", "review_id": "R3I9XKM92J6MPP,R3LL7D9XJ1KM17,RYLP8P4MU9IXE,R33MZE2UWBBE68,R1R07DE8BH5DW4,RR4IXFU8KX870,R32JIC0LIX3QC8,R33RK3EZHCIJ1U", "review_title": "I was skeptical at the beginning but now love it.,It is mechanical keyboard,Very Good Build quality, price of Rs.1500/- is justified.,Amazing,Great budget keyboard,Value for money,Very good performance,It is good if you get it under 2000 otherwise don't buy it", "review_content": "At the sub 2000 INR price range, I was doubtful to buy a mechanical keyboard as there are a lot of disappointing pseudo mechanical keyboards available at this range. I already had a logitech G213 prodigy which was great with it's membrane so I almost thought of not buying it. But after much thought I bought it. It turns out to be amazing. It has a key cap remover included which is a great bonus. Each click feels responsive and great, I am typing 15+ wpm with this compared to my G213. The size is a bit small for a full sized keyboard and the RGB is somewhat painful. But other than that , it is the best keyboard in this price range.,Good keyboard for people who loves typing sound 😊,Nice product, Very Good Build quality, price of Rs.1500/- is justified. and i have written the review using the same key board.,Best budget friendly,A very good keyboard to begin your mechanical keyboard journey with. This is much better than any membrane keyboard you will ever use.Been using for more than 1 year and still working fine, although the blue switches slowly lose their crisp sound but that is expected from this brand of switches.,Value for money, I wish i could coustomise to colour of RGB  but rest it's very good.,Very good product 👌 and perfectly working well,Hello guys today I am going to tell you about HP GK 320 gaming keyboard so it cost me around 1700 and I give the ratings from 5 star I will give it three star because it have some RGB issues and I recommend you only buy this keyboard if you get it under 2000 if it cost over 2000 I recommend that don't buy this keyboard", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/414js-21FqL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/HP-GK320-Gaming-Keyboard-4QN01AA/dp/B08498H13H/ref=sr_1_469?qid=1672903018&s=computers&sr=1-469"}
{"product_id": "B07LFQLKFZ", "product_name": "Parker Moments Vector Timecheck Gold Trim Roller Ball Pen (Black)", "category": "OfficeProducts|OfficePaperProducts|Paper|Stationery|Pens,Pencils&WritingSupplies|Pens&Refills|LiquidInkRollerballPens", "discounted_price": "₹420", "actual_price": "₹420", "discount_percentage": "0%", "rating": "4.2", "rating_count": "1,926", "about_product": "Mode: Roller ball pen|Pen opening mechanism: Cap off/cap on|Ink color: Blue, warranty: 2 years|Country of Origin: India", "user_id": "AG23N2Z5CVKFJZ6ZLIYU4NQTDKFA,AG2T5VLGSYCC4K6VINWC2USGSDJQ,AHZHDTTEM2NV5MW3BUGSBU63WTWQ,AGCFGQ3GOFTORIPXP5KJ7ZIB56ZA,AGZMM56YS4MIVU5GTMUXWREFS7PA,AE6IJ467G5TQ72ECC4ESEAAE2BUA,AFU3MFN7EXNXOFFXW7NUKIKIKOAA,AGQYYL7HPZZCZQXA3ZV66J6RXZTA", "user_name": "Amit  Kumar Chaudhary,Ankita Kakkar,Neelam Chouhan,Amazon Customer,Ajayaraman,Jaspal singh,Nishant arya,Tharun Sharma", "review_id": "R2CZ99K13VTGRS,R34J3428JVACPO,R2F41WQEBTUTFF,RD1MU2VG6M6UQ,R1SIJVA8560EVD,R21LU3V1GD14WH,R2F33G5FCPMU0I,R3BJSYU0KEIL4K", "review_title": "Nice but few Cons (*that you must read*),Smooth,Nice,Somewhat good.,Its ok,Very nice pen,Nice product,Best parker pen with very cool design", "review_content": ",Writes smoothly,Nice,The look and feel of the pen is amazing, being a Parker its extremely smooth. But the lid of the pen case is broken so it would be embarassing if you are gifting it to someone and they find it broken.,Nice,Very nice pen but not ball pen jel pen,,Its the best parker pen 🤩I have every used and it have came my 😲main😲parker pen I have 10 to 15 pens of parker😅🤪 but this is my main pen now😁 don't think twice just go with it 😃😁its the best pen pls buy 😏if get a chance😏 . Very good Amazon😄", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31-wcLwDaBL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Parker-Moments-Vector-Timecheck-Roller/dp/B07LFQLKFZ/ref=sr_1_470?qid=1672903018&s=computers&sr=1-470"}
{"product_id": "B00LY17RHI", "product_name": "Camlin Elegante Fountain Pen - Black/Blue/Red", "category": "OfficeProducts|OfficePaperProducts|Paper|Stationery|Pens,Pencils&WritingSupplies|Pens&Refills|FountainPens", "discounted_price": "₹225", "actual_price": "₹225", "discount_percentage": "0%", "rating": "4.1", "rating_count": "4,798", "about_product": "Handcrafted with Gold plated nib|Brass Cap Chrome body|Elegant design", "user_id": "AE6FSULFZEB65U7FWSETNHLBP5JQ,AGV3YW3GZJTWUP4FC7UBOYRWEFUQ,AE6HGV4SSK2V4C4QVOKY42KZW2DQ,AH2NX4DPPSUUQYJJYAECCBRBJK6Q,AEJ47MXJRDNX6VPRKKW5KD56SAFQ,AEHOGFWLLZ3VXB3FKNIMZU5QBQQQ,AGCU4M3EJ346F7J4DKXK4C6FKXKQ,AHH4X42X46T6KKBR7G3L7TCGV3OA", "user_name": "Rayees Tigadi,ajay,Tathagata Chakraborty,Rajendra,Nihal Rathod,KOVENTHAN G,Pushpita Mitra,Neeraj", "review_id": "R1KPESOANRAUT2,R2765UCQGUXR8Z,R1MIY4MLC7OEMH,R13HF7067D65NX,R2GFTD22MUWJXJ,R22XIU2YN41JLY,R3Q3101C0DYUP7,R3V7O33VH25ONB", "review_title": "Good Pen at Low Cost,... have been reading about this pen which I would like to answer,Decent (at this price),Very nice.,Not for speedy write...,Nice pen good quality could be more smoother,Smooth,Superb Fountain Pen for all types of users", "review_content": "First of All Delivery of Amazon: It was as specified no delays. Hence, appreciate it.Packaging: Not Good. The box was tempered, torn and damaged.Product: Ordered Black, received brown. Didn’t replace as the Color didn’t much mattered. Issue is with the seller though.Performance: The pen of good. Robust, feels cheap however, looking at the price not to complain. Writes smooth.For anyone who wants to enter into fountain pens, can start with this as it does the job.Edited: Have been using this pen for over 3 days now, I am facing issue of nib dryness. If I don’t use the pen for sometime. The pen doesn’t write at all. I have to wet the nib or do something or the other in order to make it start writing. It writes great when it starts writing. But the initial pick up is really bad. I have a platinum preppy too. It’s a better option to go with if the budget is tight. However, there we have good writing but bad looks.,Few points I have been reading about this pen which I would like to answer. (Compared with two other pens- Parker Vector and Luxor V5)1. Grip  Read in couple of reviews regarding the thick grip and the \"curve\" at the grip which makes it awkward to hold. Honestly, have not felt so at all. The grip is pretty medium, larger than Parker Vector and comparable to the Luxor V5. It wont create any problems holding it. I am an average 5'10 and people of same build, hand and finger size wont be any problem. Also on Parker Vector the metal body starts to feel slippery due to metal, small grip and feels tiresome after writing couple of pages. Been nice to hold the Elegante and feel firm in hand, it makes one feel like holding a pen with substance :) .2. Nib and feeder:  It says Fine on the nib and it is comparable to the Luxor V5 0.5 and Parker Fine nib. Few claim it is 0.7 / medium kinds. Its all about the pressure on puts when writing it. I just touch the nib on paper and rest the pen does, so would say- it is Fine. It is way too smoooooother and fluent than Parker which felt a bit rough. Parker Fine nibs give a feedback making it bit of a dragging experience. However on Elegante the nib just flows and slides over the paper. It is not only the nib but also the feeder which ensures the nib slides. The feeder ensures that there is even flow of ink through out the writing experience. The writing it leaves is slightly wet and not dry, personally i prefer that over the dry and dragging. This ensures that one gets to write about 6 pages i.e 12 sides without a refill.3.  Plastic construction and feel in hand:  The cap is made of brass(as they say). The cap has a \"matte\" finish, not a glossy one. The clip and top is glossy. Gives a fair enough good contrast to add some \"looks\" to it when taking it out of the pocket :D . The pen itself- very much plastic. If I try to weigh both the cap and pen separately, roughly they feel of same weight, it is that light weight ( just a feel factor how I felt). However this does not mean it is a cheap construction. It has fallen from 2 floors down and did not crack anywhere, so would say its good strong plastic. It makes one feel pretty solid holding it. The size if compared to other two is larger. It rests pretty well in between my thumb and index finger(which parker does not, Luxor does) , hence never needed to put the clip on the rear. Without the clip it is very much balanced (Parker and Luxor both feel well balanced without the cap placed on top) , with clip Elegante and Parker feel a bit -top heavy.4. Ink filling:  Personally always been a fan of eyedroppers(good old school days) , however this comes with the standard piston filling( as seen in the photo by Hari). When I immersed the nib in the pen and pulled the piston it just filled half. Had to dip the whole nib till the grip when it got filled. In parker just dipping the top nib was sufficient. For Luxor pulling the whole top part out and then refuel it seemed very tedious. Some other reviews I read people have tried removing the piston converter and used it as eyedropper!!! Few said it worked , few said it leaked. Need to substantiate it. Not sure and hence wont try this out to spoil such a nice piece. If anyone has tried would love to hear your experience.5. Writing after 3 weeks:  For Luxor, it works immediately! Even after 6 months it worked like magic. For Parker bit of dipping, or couple of splashing out and it starts. For Elegante it did not start immediately. From school days used to have an Airmail (unfortunately misplaced it when i shifted) it used to work like a beauty even after 3 weeks. Elegante on this aspect did not fair so well. However, how many of us are not going to use their Pen for 3 weeks, always something to write, sign or pen down :) . It worked fairly after a break of one week.6. Colour:  Personally the \"looks\" of a pen hardly matter to me. Its the balance in hand and the nib which are the real heart and soul. We pay crazy on high class pens just for the looks. For few people this matters more- individual choice and nothing against it.  Parker gives a good classy look, Luxor makes one feel more of a student than a person with authority or executive. Elegante would be a mix of both and middle of both. Neither a college going look nor an Executive look. On looks it does fair enough justice- The cap and two metal rings is all that makes it stand apart. Would have loved if they would have made more colours than Maroon, Black and Blue. Nonetheless these colours are the royal colours and pretty good than what Reynolds have- bright designs which are more for school going kids to attract them. This does enough for me.7. Spare Nibs and feeder:  Not sure if there are spare nibs available online. I am at a location which is 100s of km away from any civilization in a jungle or a desert and only way is to order online (thankfully speed post delivers faster than couriers :lticaptd: ) . After using this nib, I would personally not place any other nib. I am pretty happy about it. (always good habit to have spare nibs, dont know when one drops it and needs to change).8. Recommended for:  Its a must for student. At this price range where one is still studying and not earning, this sounds a good buy, though not the best as Luxor beats this is VFM. Parker, would never recommend it for students. If someone wants to carry it for exams- carry 2 atleast, all due to the limited piston converter capacity. Luxor- would be best. If you are an executive sitting in a board of meetings where you want to make a statement by what you carry then there are many other alternatives. This is fair on looks and pleasure for writing :)  :)  :) .9. Value for Money:  For a standard person like me or a student, Luxor beats Elegante and Parker. However for a fountain pen- This is an excellent VFM :)Well, this sums up my experience after using it. Anyone has anything more to add to this or share their side we all would love to hear it,★ First of all, it came in a really bad condition. The package was almost flattened. All thanks to the people connected with the transition and delivery. Thank God it doesn't have any dent.★ Secondly, it is probably a used product. Because it came with the smell of ink in it out of the box.★ Thirdly, the brand claims that it is having a fine nib, but probably according to the European standards. I am a Pilot lover, so I know what fine nib is. This is medium sized nib at its best according to the standards of Pilot. Using a pen with fine nib is like having a perfect orgasm. You remember the experience for a long time. The handwriting also becomes better. That's lacking in this pen.* Thankfully it doesn't squirt ink every now and then like most of the other cheap fountain pens. I had two Wingsungs. Those were unbearably squirty.★ Fourthly, the grip is average.★ Fifthly, if you are a beginner, you may go for it, as it will obviously let you get used to the fountain pens. You may use it as a day to day pen.BUT DON'T STICK WITH THIS ONE ONLY. EXPLORE THE WORLD OF PILOT IF YOU HAVE THE BUDGET. TRUST ME, YOU WON'T LOOK BACK TO A PEN LIKE THIS. I WAS GIFTED A PILOT CROCODILE FINE NIB BY MY MOM. I WANT TO KEEP MY MEMORIES WITH THIS PEN SAFE. SO I DON'T USUALLY USE THAT. THAT'S WHY I'VE BOUGHT THIS ONE.★ Lastly and most importantly, a suggestion to the buyers, to make your pen experience ergonomic, please don't put the cap on the backside. Open the cap, keep it aside and unleash your writing...,very nice pen., it's really amazing very smooth writing.thank you seller & amazon.,Its not for speedy writing, if you are use for signature its cutting off character,...., Some time spread over ink. And some time character cutting.... Cheap plastic product but at a 200 good for beginners.,I've been using this pen for about 3monthspros:Build quality for this price is amazinggold Nib looks amazingcons:Nib comes out easily,Just that the neck area of the pen was little broad for me to get used to ..,Guys I have started using fountain pens again a few months back. I had used all types of fountain pens during my school days like COLLEGE brand eye droppers, Camlin, Parker (made in USA), Hero (China made). Recently I am using Platinum Preppy which is very smooth and excellent pen and yes expected since it is Japan made. This the Camlin Elegante is our very own Made in India pen. It makes us proud. Just superb pen. Very smooth. It is actually a no nonsense pen. Only thing...since I had read a few negative reviews about this...I am using it with PILOT BLUE ink. I don't know whether ink quality is further improving its performance or what? Whatever it may be.....This pen with Pilot ink combination rocks...just superb experience of writing with THE FOUNTSIN PEN. Thank you Camlin and Thank you Amazon", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/21C8ziy-IJL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Camlin-Elegante-Fountain-Pen-Black/dp/B00LY17RHI/ref=sr_1_476?qid=1672903018&s=computers&sr=1-476"}
{"product_id": "B07W14CHV8", "product_name": "CARECASE® Optical Bay 2nd Hard Drive Caddy, 9.5 mm CD/DVD Drive Slot for SSD and HDD", "category": "Computers&Accessories|Accessories&Peripherals|HardDriveAccessories|Caddies", "discounted_price": "₹199", "actual_price": "₹799", "discount_percentage": "75%", "rating": "4.1", "rating_count": "7,333", "about_product": "Compatible 4 Channels switch help to improve the compatibility.You can try to move \" A\"\"B\"\"C\"\"D\" if your Laptop can not read HDD.|Compatible with: 2.5\"/9.5mm SATA HDD or SSD, Hard drive NOT include.100% Brand New 9.5 mm-thick caddy|Fully integrated into laptop, no cables/PSU/software driver need.Fast & Reliable connection in laptop, just as the primary HDD Make NTFS hard drive if you are using it as a New in Disk management|Supports 99% Laptops with 9.5mm size DVD Writers. Please email or call us if you have query regarding to compatibility with your Laptop|Replace with your current panel 2nd Hard Drive Bay for Laptops 9.5MM, SATA to SATA Add a second hard drive to your laptop, enlarge storage space Replace your current 9.5mm optical drive.", "user_id": "AF3I4EPZQIK3OVITINOGTUMCWQ7A,AFGJUJ3SUS35KINKLVKUSSPQOF7Q,AFLU4N3XW4NR5F76OYE32MFHFNDQ,AEBQPMPROYPTAQLTNBBFS4OQBYGQ,AGS4LZEEXWBXM5YCLRHDMZFDHVXQ,AGTW4HJCRU3PV3RWFQZ3OY7A6FLQ,AHKHL25G2FSHGHSMWDVH47N2IEFQ,AGY7TVIILTBSFMWBPYTIWLTOEZ2Q", "user_name": "Prabakaran V,Chinmay Nayak,SAGAR B PUDABANGI,Gurmeet Bhamra,paras jamkar,panchal,ABUZAID,AaaaBokkaLe", "review_id": "R15FTQ3OTL54HG,R5WNQOBU27J2R,R30NWHS9ZD2AZJ,R3MZE0LEVB688M,R8HUCZYM2F8UJ,R3NK0HFG8JUGIP,R3MEDM094JOZHW,R8TG7TKO28ONS", "review_title": "Perfect For HP Laptop,Okay,Good,Worst Product by Seller,Above average,Product achha laga,Working fine,Worth the Price - Front Panel cover not included as shown in product description", "review_content": "It's cool, it's working, same product i received, they showing in cover photo.In this Box- CD Cady, Screw driver, 4 Screws.Easy to install,Before to use this slot, must check BIOS setup in your laptop.,Screws to hold HDD were missing,Good,Worst Quality wise + Not working Properly + Cheap class Circuit plate used inside Caddy, lagging issue after installation + Unable to open & run games after using this caddy because of worst transfering speed request to every one don't waste your money in this type of product.,Won't fit perfectly with crucial ssd,but will work without any issues .,I like it,Working properly no any issue,For the price, this is really good and easy to install. Front Panel cover not included as shown in product description. Alignment needs to be checked properly when installing. Compatible with HP15-ac122tu Notebook.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51ca6eZ+j3L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Optical-Drive-Caddy-Universal-9-5mm/dp/B07W14CHV8/ref=sr_1_483?qid=1672903019&s=computers&sr=1-483"}
{"product_id": "B0B9BXKBC7", "product_name": "WeCool S5 Long Selfie Stick, with Large Reinforced Tripod Stand up to 61 Inch / 156 Cms, Ultra Long Multi Function Bluetooth Selfie Stick with 1/4 Screw Compatible with Gopro, Camera, and Ring Light", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Photo&VideoAccessories|SelfieSticks", "discounted_price": "₹1,799", "actual_price": "₹3,999", "discount_percentage": "55%", "rating": "4.6", "rating_count": "245", "about_product": "64\" Tall Cell Phone Tripods with 7 section adjustable telescopic poles, the phone selfie stick tripod stand is tall enough, can be adjusted from 12in to 64in. Therefore, this selfie stick for iPhone can capture a wider landscape with different Height|3 in 1 Design with Stable Base : Can be used as extendable Tripod for phone and camera as Phone Floor Stand. This Selfie Stick for iPhone can be quickly switched between the table tripod and selfie stick mode. Is compatible with gopro and Camera|360° Rotatable Selfie Stick Bluetooth : The mount of the tripod stand can freely rotate 360°, which can be quickly ratoted the screen horizontally and vertically , and the mount arm can be 190°flipped to shoot pictures at various angles.|Compact Size and Travel Friendly : After Being folded , the long selfie stick is just 12 Inches. So it can be easily packed in your bag, or Backpack without taking up more space. Perfecet choice for Travelling, Hiking and Camping. Very Sturdy Design|Large ABS reinforced non-slip Stable tripod-The tripod is very stable when it is mounted with phone or camera standing on desktop or ground,because it has non-slip silicone pads at the bottom of each foot and the lets have additional support|1/4 Screw Widely Compatible-The selfie stick comes with both a phone mount and a 1/4 screw,can be used at the same time.The 1/4 screw can be connected with Gopro digital camera and ring light.|The phone mount is compatible with most smartphones , support 360 degree rotation vertical and horizontal shooting , better for live stream , photo and video shooting , makeup , youtube watching", "user_id": "AFPYH3UF3GB4RNX3MX46AXFM2FTQ,AGWEQHJSUA4YCG44RKCCKPFNHNYQ,AER7URKAHGBZZUO54FO5YIX3BOJA,AEPCLRI6TOAXADIFPVP6BVUV6ZYA,AHMJGVHC6Z2PFDPRVL3FFO6HVWEQ,AHV4FNKMIPRVWQREJHBT3T7KQH3Q,AHHJWO56X2DQATPTWFHER2LAVAGQ,AGXRHQVYZUCT2IESEBL3JYAJ7ZNA", "user_name": "Sujili v,Paras Jain,Shailendra,supreeth achar,Anthony S.,SUMAN SEN,Wellwisher,Richa", "review_id": "R2MI4KSWYUEMDR,R2MNYKDL2UII1M,R2C6TUBM6IVLB0,R3VJF3LZ7XK3WV,R351DYT9RZYVC0,R2127U989S6ZZU,R29GQ8L9MVSU6H,R2H35ITTKGQLBH", "review_title": "Good,Good Product but Little expensive.,Happy with the purchase,Good buy in price range,Best travel companion,For instagram reels zoom in and zoom out switch is not available,MUST BUY FOR EVERY ONE WHO OWNS A MOBILE PHONE !!!,A good selfie stick", "review_content": "Good,Thoda sa kam stable hai, phone lagane ke baad thoda bohot hilta zaroor hai. Build quality thodi aur achi hoti, to pakka value for money hota.,We’ve been using it for around 2 months, it’s good, sturdy, Bluetooth connectivity is also good.Overall a good purchase.,Good buy in price range,If you travel, it’s your best companion. Has a great stability and length. It’s one of my best buy and cannot think of a vacation without it. No more need to awkwardly ask strangers to take photos, set the best angle and capture the moment. The service from WeCool support team is super cool as well.,Good product....but more efficient expected,Amazing Product. As a Youtuber and an Instagram Content Creator, this is the best gadget I like to have in my Back bag all the time. I even use this to record my live classes without making any scenes out there, since this is very handy and lucid. Moreover, their service is excellent. WHY ARE YOU STILL READING REVIEWS? ORDER NOW.Find my videos in Instagram using this S5 at shankarkumaran tamil,The selfie stick is sturdy and very good", "img_link": "https://m.media-amazon.com/images/I/41fDM4QUfvL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/WeCool-Reinforced-Function-Bluetooth-Compatible/dp/B0B9BXKBC7/ref=sr_1_484?qid=1672903019&s=computers&sr=1-484"}
{"product_id": "B09F5Z694W", "product_name": "Canon E4570 All-in-One Wi-Fi Ink Efficient Colour Printer with FAX/ADF/Duplex Printing (Black)- Smart Speaker Compatible, Standard", "category": "Computers&Accessories|Printers,Inks&Accessories|Printers|InkjetPrinters", "discounted_price": "₹8,349", "actual_price": "₹9,625", "discount_percentage": "13%", "rating": "3.8", "rating_count": "3,652", "about_product": "Printer Type- Ink Efficient, Functionality - All-in-One (Print, Scan, Copy, Fax); Printer Output - Color; Connectivity - Wi-Fi, Wi-fi Direct, USB, Canon Selphy App; Scanner Resolution - 600 x 1200dpi; Apple Airprint - Yes|OS Compatibility - Windows 10 / 8.1 / 7 SP1 (operation can only be guaranteed on a PC with a pre-installed Windows 7 or later) macOS v10.13.6 ~ 11.0 Chrome OS; Duplex - Auto; Enlarge/reduce option - No; Mobile connectivity - Yes|Maximum Print Speed (color) - 4.4 ppm, Maximum Print Speed (Monochrome) - 8.8 ppm; Print cost Monochrome - 1.8; Print cost color - 4.5; Maximum Print Resolution - 4800 X 1200 dpi|Max paper thickness -64 to 275 GSM; Smart Speaker compatible; Power wattage of printer - OFF: 0.3W, Standby (scanning lamp is off) (USB connection to PC): 0.8 W, Copying (USB connection to PC): 7W|Ideal usage - Home and Small Office, Regular usage (200 prints per month); Included Components - Printer, Power cord, 1set of PG47 & CL57s ink cartridge, user manual, installation CD, USB cable|Print yield is based on the consumption data from the succeeding ink cartridge and not the first ink cartridge. Yield will be low if printing photos. Compatible Ink Cartridge - PG-47 (Black), CL-57s (Color) Print Yield - 400 prints (Black and White), 180 prints (Color) As per ISO/IEC 19752, ISO/IEC 19798;Use only original Canon Ink Cartridge. Using counterfeit ink will harm your printer and render the warranty void|Paper size (A4, A5, B5, LTR, LGL, Envelope (#10, DL), 10.16 x 15.24 cm (4 x 6in), 12.7 x 17.78 cm (5 x 7in), 20.32x 25.40 cm (8 x 10in) [Custom size] Width: 101.6 - 215.9 mm Length: 152.4 - 676 mm)", "user_id": "AFXXFWMGUKQDP27JRILRUKME7R4Q,AE6JO5FOQR3D3UE4GTIJT5FVRNKA,AHT5FELZRNJ4ITAESWGATN2COH3A,AECMC4ZTLI2FFUQHAXVILRVCNJHA,AGIPLO4AJSNUVZ3ASVSHC2BZXFFQ,AH2KQR23MJYSJCXDH3J6AUCON5FA,AES2TTA7I6H32D6TO6IGDCI7DFOA,AH33GQ3GIETSNVJGQPQOFZIQBR5Q", "user_name": "Sachin Goel,RONI.A.P.P.POONTHOTTAM,ELDO K MATEW,Ankur Kunal,Karan,Amazon Customer,Prashanth Mettu,Rahul Gupta", "review_id": "R323N508KO5VMR,R1C2X37S59TO4B,R25UIJAM26JMGL,R3B7Y8E7QNUYOP,R1PH3YZVBU4KKT,R2WLFM05B2CXXU,R3DCHC8ODVBGAP,R36UJ8EW67NBJ8", "review_title": "A seamless printing experience, with scope for improvements in set up,Good One,Very user friendly when compare with others,Best for home use,Good for home use,good printer,Good,Good for occasional printing. Extremely easy to use", "review_content": "I bought this item in August 2022, and the delivery and packaging was as good and sturdy as I've come to expect from Amazon. Using the printer from my Macbook is a breeze over wifi, although printing over wifi from Android requires some poorly designed app from Canon and has no direct support.The only couple of issues I faced with this printer were during setup.1. Scanning the qr code for the setup guide didn't actually lead to much of a guide, rather a boilerplate page. I would only much later find out the way from that page to the actual guide. Canon could do a better job of surfacing the online guide, as the image clarity in the included hard copy is quite poor.2. Installation of cartridges seemed to take forever - I must have removed and re-inserted them almost 5 times before they were properly detected. No error messages showed up, and I didn't know if I had recieved a faulty product, or if I was doing something wrong.3. Never having owned a printer, and always using either copy shops or the huge laser printers at work, I ended up making a mistake in setting up the paper tray, leading to a jam at the first print itself. Thankfully it was straightforward to open up the printer from the back side and remove the torn pieces. Canon could do a better job of demonstrating how to set up the paper sheets - clearer access to the online guide might've helped here.Except for the these minor concerns in setup, I'm enjoying using this printer surprisingly, since printers (alongside projectors ) are usually the worst items ever developed by the electronics industry. I've used all the features so far - print ( colored, double sided), scan and copy and not faced any issues with quality, wifi or the cartridges.< Information on the number of color and black-and-white sheets from the initial set of cartridges to be added when I run out>,good scanner & printer,Installation procedure is very simple and priter quality is high. I had a Xerox copier, but istallation of scanner option could not complete.,If you are purchasing it for your home use, don't look any further. It has got all the functions you'll find in a 20-30k worth printers. All in one includes print, scan, copy and fax as well, Colour, adf, duplex printing, wifi. You download the app in ur phone and give print commands via mobile itself. Only two issue that I faced, firstly the print quality(which I'll speak to the service center) and secondly is the total quantity of color prints. I have only taken out couple of color printouts bad already the level of ink is 90%. I guess I'll have to purchase a larger cartridge.,Very good printer. Sometimes back to back printing cases paper blockage. But overall very happy,gud printer but printing cost is expensive. in this price range features are very nice.,I got this printer ion 02Nov2022, After 15days of usage ..I'm unable to print as it is showing Color & black ink is low ..i have print less than 50pages ...and in description they told that 400pages yield which is totally wrong.,Cannon E4570.This was launched as a successor for E4270 (I searched everywhere but couldn't find a credible source to explain the differences between the two). I researched extensively before purchase to find a printer which will fullfil the following criteria for me - wifi enabled (so that we can print with smartphone without opening the laptop), clear color print (decent for child's homework, photo quality not required) and cheap to run. E4270 seem to fit all the criteria, so I ordered this. Even the canon authorised showroom didn't have E4570 in stock, so ordered the E4570 off Amazon.Summary - fullfills top two criteria. Though is a little expensive if you do more than the occasional print.Delivery was 3 days earlier than the delivery date shown on Amazon, so that was great. It was just the printer box, with no outer packing. The box was sealed with cello tape, and not sealed, so I suspect it had been opened at some point. Thankfully, all the components were there, and the seal on the printer and cartridges were intact, so i was ok with the delivery.Setup was smooth on both my smartphone and laptop over wifi. I never had to use the usb cable. Setup was through the canon app on phone and the canon website (link for both given in manual), which guides step by step on how to setup. I did not face any challenges and the setup and printing has been smooth from all devices.Color prints are a bit faded on plain paper (75gsm). This might be a function of the paper and not the printer. The black&white prints are crisp and sharp. The print speed is decent.The only negative is the amount of ink consumption. While the box says 180 color prints and 300 b&w, both my cartridges are showing at 80% after 4 color print and around 30 b&w. Specially for color prints, the printer tends to drop the cartridge level by a notch after just 2-3 prints. I suspect the color cartridge will not last longer that 30-40 full color pages. Refilling the cartridges a few times is of course an option, but it is messy and requires practice. This is fine for me as I need color prints very rarely.A special mention for the ADF and duplex printing. Both the features are extremely useful. Duplex printing is especially unique in this price range, and comes in very handy while printing larger documents.Overall, I am happy with my purchase after couple of weeks of usage. I will update the review if I run into any issues.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31AZelC8URL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Canon-E4570-Efficient-Printing-Compatible/dp/B09F5Z694W/ref=sr_1_485?qid=1672903019&s=computers&sr=1-485"}
{"product_id": "B0B25LQQPC", "product_name": "Crucial P3 500GB PCIe 3.0 3D NAND NVMe M.2 SSD, up to 3500MB/s - CT500P3SSD8", "category": "Computers&Accessories|Components|InternalSolidStateDrives", "discounted_price": "₹3,307", "actual_price": "₹6,100", "discount_percentage": "46%", "rating": "4.3", "rating_count": "2,515", "about_product": "Impressive read/ write speeds up to 3500/3000MB/s|Spacious storage up to 4TB|Solid Gen3 performance. Micron Advanced 3D NAND. NVMe PCIe 3.0 M.2 (2280).|Performs up to 45% better than the previous generation⁴|Dynamic write acceleration. Multistep data integrity algorithm.", "user_id": "AFJAEGGXB3SFKV3CIQG672BJD3HQ,AGT25A2JUMFSTJ6FK7AJZIFRHRIA,AGB5B7QDVRRWO43PODQ7BRQBS4PQ,AF7XW2VZLPVXOMLEC2WU7FPUJ66Q,AFP74SQR57V4DO4IH2RW3KKQBGZA,AFCYUWRUBILFTKYMBHMVJSIJKK5Q,AFW7SE27ST3TM7KFAGQEORGOCQJQ,AEL3GVS4JNKIOZHRQCGE6CUJISDQ", "user_name": "Ashwin,Spidey Rage,Placeholder,Shreyas Ghare,Sandeep Kadam,Amazon Customer,anuragnaidu,Naveen Saran Singh", "review_id": "R2ZRD154AT00TN,R3L76N34IVRAX6,R12UEJEYKOVC8X,R3GAOZKSESNEO4,R2DFA3EK07XPQO,R11GWINZ2PW06X,R19LZZQS4ZQGQ6,R2SH0PV3XYF4NG", "review_title": "Good P3 Nvme for entry level,Awesome,Sometime not showing in laptop,Great product at good price,Unable to detect SSD? Funny but use \"mdsched.exe\".,Fantastic performance and reduced boot time with my Lenovo S145,Crucial SSD's are \"Bang for the Buck\" but it does not come with a screwdriver, hear me out.,Good product at this price point.", "review_content": "Best for this price range, all-rounder in gaming and productivity.,Nice,Sometimes ssd not showing in the laptop,Also giving screw for mounting the ssd.,MS Windows:I have got this nvme m.2 P3 and i was unable to find it anywhere in the Disk Management (\"diskmgmt.msc\") or Device Manager (\"devmgmt.msc\"), neither as RAW/unallocated, nor Unknown Device. Although i was able to detect in BIOS (mine is basic for current usage - 07WP95), so i did not give up:Funny it may sound, no repair app. worked except for Windows Memory Diagnostic (Win+R -> \"mdsched.exe\") -> Restart now and check (recommended) -> Let it run for a while (mine took a 30 minutes i guess, i did not keep track of) -> after reboot you will find it (choose GPT in diskmgmt.msc) RAW and use it however you wish.For linux users:I did not try this there (coz i quit distro hopping also) but a year before i was able to find partitions (by Ventoy) which are not visible in Windows (anywhere), they are visible in my favorite utility: GParted (not sure if it were available on Windows though) use GPT table here as well.,Fantastic performance and reduced boot time with my Lenovo S145. Boot time has reduced from few minutes to 15 sec. Running performance is very much improved. Just go for it. Only concern is , I dont see the screw with this SSD to fix it in laptop.,Does not come with a screwdriver, had to buy a separate tool kit just for this simple installation, other than that everything else is perfect. Great speeds and performance, did a little benchmark using crystaldiskmark and I've gotten good scores overall.NOTE: that I recommend using momentum caching provided exclusively by crucial firmware/software which allows you to boost your overall performance of your SSD at the cost of more ram usage, and if you are using momentum caching make sure to ONLY use it if you have a laptop with a battery backup or If a PC than a UPS since I've seen data loss and corruption happening due to abrupt power lost and data files getting corrupted and lost forever if you were in the middle of something. This was my experience and I'm happy with the product so far, great job crucial.,Good product done some test speed was around 3100 MBps as my system was not very new but it is a good product value for money at this price point.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/318lV0rfJoL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Crucial-500GB-PCIe-NAND-3500MB/dp/B0B25LQQPC/ref=sr_1_486?qid=1672903019&s=computers&sr=1-486"}
{"product_id": "B07GVGTSLN", "product_name": "Wayona Usb Type C Fast Charger Cable Fast Charging Usb C Cable/Cord Compatible For Samsung Galaxy S10E S10 S9 S8 Plus S10+,Note 10 Note 9 Note 8,S20,M31S,M40,Realme X3,Pixel 2 Xl (3 Ft Pack Of 1,Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹325", "actual_price": "₹1,299", "discount_percentage": "75%", "rating": "4.2", "rating_count": "10,576", "about_product": "Fast Charge & Data Sync: Fast charge& data transfer USB A to USB C, conforming to the USB Type C Specification version 1.1, 56kilohm, which ensure a safe charging at 4.8A Maximum. Charging and syncing 2 in 1, data transfer speed up to 480Mbps.|Extreme Durability: Over 10000 bending tests,This type c cable is far more durable than the same price, Premium nylon braided type c cable adds additional durability and tangle free.|Convenient Design:The light and space-saving 1M USB Type C cable, it’s perfect for your Home, the office desk, always keep your space tidy, super easy to carry and convenient for traveling, making your life more convenient.|Wide Compatibility: This USB A to USB C Charger Cable compatible with Samsung Galaxy S10e S10 S10 plus S9 S9 plus S8 S8 plus, Note 10 Note 10 plus Note9 note8, a40 a50 a70 a80 A3 A5 2017, Sony Xperia XZ3 XZ2 Premium XA2 XA1,XZ1, Moto G6 G6 plus G7 G7 power G7 play G7 plus Z Z2 Z3 X4, LG G8 G7 G6 G5 V40 V35 V30 V20, Googel Pixel 2 xl, HTC 10 U11.|Premium Service: Wayona promise you the reliable guarantee for your top rated USB C charger cords rope, and 24/7 customer service for our every client, please do not hesitate to reach us.", "user_id": "AEXK37TSBFHSP2TYE63YPKETWQ7Q,AEKMVX2VDNNX4ZFXI67SGKMJGZAQ,AFEIIEKX6JEHS3CPGCSIYLGCNKFA,AFDYUQAM7Y56P4R5CREI5OBPHSLA,AGEPZSRFODWZ4XUTXO2HNWLJIMJA,AH25HG24NISHLQPFOZA77WS5CUFQ,AFZ7US7H622UBLYL4ZX2XEHT7FHQ,AFDDH5QGUJ2NHJZBIAPEQVUIQCKA", "user_name": "Sunil Funde,Biju Abraham Thomas,Samir,Rahul Sharma,Avninder Singh,Tribhuvan more,N Patel,Bhavy kachhadiya", "review_id": "R10365HEDURWI9,R5RP542IMC4OI,RX2HFWXTTQDTS,R2636VYPMOZV9,RW2Z2YM3K8UV5,RVNGA0FEAXYHI,R2K7MABWMAQE26,R33YS4PO3JWU23", "review_title": "Nice product .,Good quality Braided cable, VFM,Good cord, but has Earthing issue,Ok,Good product. Little bit fast charger for phones like redmi.,Fast charging is working properly,Money value product 👌,Cable a Nice product", "review_content": "Sturdy packing, good product!,Have used this brand cable for my iPhone and iPad before, so when my wife's Samsung charger cable gave up the ghost in less than 6  months, I ordered this. Braided, visibly high quality cable, unlike the flimsy and highly overpriced OEM cables from Apple and Samsung. I have been using my iPhone cable from Wayona for more than 1 1/2 years and still going strong.  Hope this C cable will give a similar performance,I like Wayona chords and especially the long ones. But I get a slight shock - like a static discharge - when I touch my phone while charging with these two cords. Other cords with same charger are okay.,Ok,Cable looks solid and length is also good.Little bit fast charging I observed for phones like Redmi.It also looks solid so I am expecting it to work for atleast 1 year,build quality and fast charging feature,Unbreakable, good quality,Cable a Nice Product", "img_link": "https://m.media-amazon.com/images/I/41J6oGU8w5L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Wayona-Cable-Braided-Charger-Smartphones/dp/B07GVGTSLN/ref=sr_1_487?qid=1672903019&s=computers&sr=1-487"}
{"product_id": "B01LYLJ99X", "product_name": "HP v222w 64GB USB 2.0 Pen Drive (Silver)", "category": "Computers&Accessories|ExternalDevices&DataStorage|PenDrives", "discounted_price": "₹449", "actual_price": "₹1,300", "discount_percentage": "65%", "rating": "4.2", "rating_count": "4,959", "about_product": "The high gloss durable metal finish of the HP v222w makes for a perfect complement to ultrabooks.|Approximate the length of a quarter and the included key-fob makes it perfect for on-the âgo storing!|Offers a sleek and slim way to store and share your music, photos, files and more.|For product related query contact brand customer support for faster resolution", "user_id": "AFRA4BGAKHDU2PFBCHKEPSVG5OYA,AENPE6KZIPHD7QUDJVPDKRMTR2UQ,AEW7M23YLNN4FJNU2N6DLN3BAZMA,AF5EUX755HPX32CSZZYARRK6VSRA,AGEWLEEAALGWMCPDGMT4H5OVJI2A,AEL3EZQDKJFXIQ6MBXGKGGKVZGYQ,AG77EF477UX6JHDRZFZM23ZRG5HQ,AFBOZIRKFRPTQJZKZE7CFSSDK2WQ", "user_name": "jatin.,sushil Kumar,Darunte S. C.,jayesh patel,T.Kothandaraman,M Badrinath Sarangapani,Sukhwindar Singh,Rajesh", "review_id": "RHINAF5XZTNSB,R2MV5SCZODNS7N,R29OYK770YQY7B,R2Z7DBSSRDF206,R2OXL4LSDBE7OC,R26JU6NE3CKF6P,R1G19TM00P58C,R1BI8J8CW8LH64", "review_title": "Unhappy with storage.. actual storage is 57Gb,Most amazing sound , Really unbeatable better than any  another similar products  .,Nice,Esy to use,Pendrive,Nice and small,Value for money,Good", "review_content": "https://m.media-amazon.com/images/I/71mathm1apL._SY88.jpg,Really, first of all, I found it bulky not sure whether it has good sound or loud sound but believe me guys if you are a sound lover just go for it. It has a really good sound as every sound is separated &  crystal clear.,Nice,Ya satisfactory work. Speed okay,Performance is very good.,64 GB in such a small size! Wow,Value for money,Good", "img_link": "https://m.media-amazon.com/images/I/31cOcZC4n7L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/HP-v222w-Flash-Drive-64GB/dp/B01LYLJ99X/ref=sr_1_488?qid=1672903019&s=computers&sr=1-488"}
{"product_id": "B014SZPBM4", "product_name": "Duracell Ultra Alkaline D Battery, 2 Pcs", "category": "Electronics|GeneralPurposeBatteries&BatteryChargers|DisposableBatteries", "discounted_price": "₹380", "actual_price": "₹400", "discount_percentage": "5%", "rating": "4.4", "rating_count": "2,111", "about_product": "Long Lasting Power Guaranteed|Our best battery, suited for everyday devices with extra performance for high drain devices|Duralock technology keeps unused Duracell batteries fresh and powered for up to 10 years in ambient storage|Available in AAA, AA, C, D and 9V sizes", "user_id": "AEGQJH2NIAS54T7WKAHKVEO4B67A,AFDH4NWAAHAVKPQVBCSZEHPVFYRQ,AHHMIBI4WD5JRIXCHLFWBDUBUANQ,AESHIA4Q3VBR5HCJJMRGUIBHBQKA,AHV6JCRY6F36XXVSJAQ3SKYLHUFQ,AFXAZGN66ICO6QGG2A4PZVZMPUJA,AEVIV42RTEB4DEQLJOVPRLGAJBRA,AHC5UZYDEQJY55XHOYR4Y7YYPDIQ", "user_name": "Md asif akhter,KIRAN T,Hanuman sarda,Pranav Chaudhary,V Vijayaraghavan,Placeholder,SHAIK IBRAHIM,Nitin Tanna", "review_id": "R1RXFMVZ8EKN3Q,R2YX4PL3F59OHC,RUDJ9ISAQDD3B,R308RAFFO7RANL,R2AV85XOQ7KR6O,R1ZFK8N1J8X6BY,R18VD7VF8AEMCV,R35JPXHI3F33IB", "review_title": "Battery,Good buy,Bigger than expected,Best Battery for cooking stove,Great batteries,Good,GOOD,Wrong size", "review_content": "Duracell never disappoint you,Good,https://m.media-amazon.com/images/I/811nzyzU05L._SY88.jpg,I use these batteries in my faber stove (4 Burner) and i assume many of you will be buying for the same purpose. It is long lasting and easily lasts in my house for 6-8 months without showing and signs of discharge. In the past 3 years, I’ve never experienced a single incident of leakage from this battery. Duracell Ultra batteries are the best for high power appliances to last long. This pack of 2 will easily last you an year.,Like:1) The batteries are in good condition.2) I required for Gas Stove. By putting this battery, I could light the burner without any hiccups.3) Cannot talk about durability as I have bought few weeks back.,Nice,GOOD,", "img_link": "https://m.media-amazon.com/images/I/51BGUyveMfL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Duracell-Alkaline-Battery-Duralock-Technology/dp/B014SZPBM4/ref=sr_1_490?qid=1672903019&s=computers&sr=1-490"}
{"product_id": "B08CZHGHKH", "product_name": "BESTOR® LCD Writing Tablet/pad 12 inches | Electronic Writing Scribble Board for Kids | Kids Learning Toy | Portable Ruff for LCD Paperless Memo Digital Tablet Notepad E-Writer/Writing/Drawing Pad Home/School/Office (Black)", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|GraphicTablets", "discounted_price": "₹499", "actual_price": "₹1,399", "discount_percentage": "64%", "rating": "3.9", "rating_count": "1,462", "about_product": "BESTOR 12-inch size Graphic Tablets for drawing, you can also carry it around everywhere. Furthermore, the child-safe material construction of this device makes it ideal for school, office, or car. Even, you can use this notepad as a message board for elderly people.|Compact and light design can be easily put into backpack and take it to anywhere. It can keep children quiet and busy when they are in home, car, airplane or in restaurant. Small size allows kids to put in the backpack or schoolbags.|[Advanced Technology]:This E-Writing Board adopt the newest LCD pressure-sensitive technology, LCD writing surface creates lines of different thickness based on how hard you push - just like paper and pen,this version of screen has been widely praised.|[Lock & Erase Button]:Writing pad come with feature lock and un-lock, so that child can not remove anything.Erase your image or words with only touch of a button, convenient for kids drawing, making notes lists drafts doing the math and business etc.|[Environmentally friendly and a money saver]:you don't need to waste money on papers, pencils or erasers anymore, one writing tablet can repeat 100, 000 times. The inside Battery can be used at least 9 months which means Super low energy consumption.", "user_id": "AGRDTPMUHWAPVCLIT32C7WW2V6JA,AG6JGI37HP3HKED7FYSE6HNY2OZA,AHGX46NEAGEBIMLPLC4TB3Z342QQ,AGU6A55DL2E56WX7673GFMC6HEYQ,AHORMKJSJGUFFI6JCZP3AGVQIIPQ,AEPHE5IYH65CT6E4RFVU2QFQ5RDQ,AGBSKFFDGK7DFN3J54X4VMY7MUIA,AGBBOHCULMY33RU5XRNNOVVN2ZGQ", "user_name": "SUBODH RAJ M S,Amazon Customer,Saurabh kumar,Aarif,Yash,Amazon Customer,Yoginder Kumar,Asif Farooque", "review_id": "RXZ81N4MLYOJV,RSP3LVQQTLFHS,R2UXGNDYUTV459,R28D154XP60HC3,R2JGEMVYSCKSMJ,RTYO6OF7GIUIT,R1VM0YRY453I9F,R380AS2WJQL3HN", "review_title": "Kids will love it,Good,Good product 👍,bestor is best,Nice Product for kids,Very costly than others,Good,Most sophisticated product for our mother earth.", "review_content": "Bought it for my niece. It's very convenient for kids to use it. The product serves as a slate, but with the advantage that kids can quickly write and draw dust-free and erase on a single click. The brightness of the screen could have been better.,Worthable product,,https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71iGsGyDR8L._SY88.jpg,Thank you Amazon, it's a very nice writing pad what I expected and very useful for kids. It's easy to use and saving stationary,Product is ok ok type. Cost should be around 300 as item used by children and we can't expect much life.,Value for money,Light weight,thought to be bigger in size. But OK u can go with it. You have to be in a well lit room to do any srub on this pad. Pls comment... Ye extra 2ab Kaha se aaya ab pata chala mathematicians... Aur jet kaise radar se bachega... #pappuPM", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41sK3J5ZQIL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Bestor-Portable-Paperless-Digital-Writing/dp/B08CZHGHKH/ref=sr_1_491?qid=1672903019&s=computers&sr=1-491"}
{"product_id": "B0B2RBP83P", "product_name": "Lenovo IdeaPad 3 11th Gen Intel Core i3 15.6\" FHD Thin & Light Laptop(8GB/512GB SSD/Windows 11/Office 2021/2Yr Warranty/3months Xbox Game Pass/Platinum Grey/1.7Kg), 81X800LGIN", "category": "Computers&Accessories|Laptops|TraditionalLaptops", "discounted_price": "₹37,247", "actual_price": "₹59,890", "discount_percentage": "38%", "rating": "4.0", "rating_count": "323", "about_product": "Processor: 11th Gen Intel Core i3-1115G4 | Speed: 3.0 GHz (Base) - 4.1 GHz (Max) | 2 Cores | 4 Threads | 6MB Cache|Display: 15.6\" FHD (1920x1080)| TN Technology | 220Nits Brightness | Anti Glare || Memory: 8GB RAM DDR4-2666 | Upgradable Up to 12GB || Storage: 512 GB SSD|OS and Software: Windows 11 Home 64 | Office Home and Student 2021 | Xbox GamePass Ultimate 3-month subscription*|Graphics: Integrated Intel UHD Graphics || Design: 1.99 cm Thin and 1.7 kg Light|Battery Life: 45Wh Battery | Upto 7 Hours | Rapid Charge (Up to 80% in 1 Hour) || Ports: 2x USB-A 3.2 Gen 1 | 1x USB-A 2.0 |1x Headphone / microphone combo jack (3.5mm) | 1x HDMI 1.4 |1x 4-in-1 media reader (MMC, SD, SDHC, SDXC)|Camera (Built in): HD 720p | Fixed Focus | Privacy Shutter | Integrated Dual Array Microphone|Smart Learning Features : Lenovo Aware | Whisper Voice | Eye Care", "user_id": "AF5IDL42LBZCZ7A5YDGM2QFNUHEQ,AHPQHJVDA6JHFNRN7OBYTBTJXBYQ,AF5ZRMB3EOZXTXOOBVEVJTGZ2XFA,AFK4JLZVY6JQ3VZHAVISLJ72RAAQ,AFS27RNTNLFALK27VK3TX4JHPA5Q,AH75IN5WV5BWRPLR7QFKFIN6XLEQ,AGE3DIZBUUHDRMIUR37KDA5WMESQ,AEYMSQGEOI3PJTI3DKWC2ANWVIMA", "user_name": "Mb,Amazon Customer,Adnan Malik,AD,Pradeep Rajbhar,Saikiran kopalli,Amazon Customer,Aryan S.", "review_id": "R2WGS6Q7F9F4Y5,R1VS2WU12H9Z2C,RMPKJJKZC848Y,R4AMYK7Z8U971,R2RU2H3FY7R8JW,R2BQB4B9QNZ12P,R1B7GP3CDJYWX3,R1XRDM19EARF9P", "review_title": "Value for money laptop for normal usage,Works well, no issues,Worth it,RAM upgradability an issue,Value for Money,Kopalli,Excellent product....worth it...,Battery 3 h", "review_content": "If you are looking for a decent laptop and resonably priced this is the one. I liked the laptop and carries out my normal daily task with ease. Booting is quite fast and infact automatic boot once you lift the upper panel. Quite fast and snappy no lags with good audio quality. The only  complain is all the ports are on the left hand side of the laptop that makes it inconvenient. Also one more missing element is type c port. Overall a decent product.,Works well, and no issues. Got the warranty registered with Lenovo to match the purchase date. The laptop speed is fast. Battery backup is fine. So far no signs of over-heating.  The screen resolution is good. The initial default setting of brightness was too high, however a darker theme is easier on the eyes.  Overallreading comfort is good.  Windows 11 and lifetime MS office apps are good/as expected.  This is a good laptop for students, home use activities, DIY, etc...  The MacAfee LiveSafe offer popup of rs 199 was good for a years protection. The Two year default lenovo warrant is as advertised.  The Sound is loud from the speakers. Keyboard quality if good.  Upgradability from 8GM to 12GB/DIMM max is good to have for future. The 512GB SSD is fast. Can be upgraded to a TB in future.  Overall quality is good, nothing to complain about. Did not need any installation support.,Value of money,One RAM module is soldered down. so matching 8gb ram sticks can't be installed. Good choice for 32-35k budget. Windows 11 is a pain point.,Being an IT person i was hesitant to go for it but ultimately baught it and it was right decision. Laptop is good for normal home use.,Battery 3 - 4hr coming,Excellent product....great experience....,Battery power 3 h", "img_link": "https://m.media-amazon.com/images/I/41PnIUzyYML._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Lenovo-IdeaPad-Warranty-Platinum-81X800LGIN/dp/B0B2RBP83P/ref=sr_1_492?qid=1672903019&s=computers&sr=1-492"}
{"product_id": "B078W65FJ7", "product_name": "boAt BassHeads 900 On-Ear Wired Headphones with Mic (White)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|On-Ear", "discounted_price": "₹849", "actual_price": "₹2,490", "discount_percentage": "66%", "rating": "4.2", "rating_count": "91,188", "about_product": "Enjoy powerful, dynamic sound with punchy bass and clear, natural vocals with the responsive 40mm Neodymium drivers, balanced sound for a complete listening experience|Its sleek, lightweight and compact design makes portability extremely convenient|The on-ear headphones with swivel earcups offers flexible wearing and a comfortable fit for everyone|Easy to carry, easy to store headphones are engineered for music on the go|The tangle-resistant cable with 3.5mm audio jack comes with a built-in mic and control for calls and playback|1 year warranty from the date of purchase", "user_id": "AFM6IHWXNLXOBO3JZTO5DN5QJROQ,AHXEMXDI7LE4FLGEUHSK426PVKOQ,AG6HMWEV2ABV7VF344EGP4SNMLHQ,AGNK4GKNE65RYXUXCDFO6B22NXCQ,AGVHESKGY3VL6CHECT2G2NPFWYWQ,AGTATACN5LUOY6XTHGLDJV2TV7JQ,AFFGWYKF2QF2IRGERWSNOLQ2QW7A,AF6WO26Y4PHPBSGOCHOH66BVQ6HA", "user_name": "Sayan,Lucky,Anish Kadivar,Surjit pharmacist,Aniket Ghole,Vicky kashyap,Kushal,Nrup", "review_id": "R1ENIO169KEJPW,R1V9WVGGU6G0SZ,R1CS1EB6REPXU6,R124CFJ8HVQXQW,R2UUTWT22U0UM4,R1NKNVVZBRBSKX,RIZ4B3XEDA5K2,R2N30KA75TRVCA", "review_title": "Definitely good but wire is too short,Never expected an easy on pocket brand like BoAt winning heart the way apple does! Good product,Good headfone on budget,Nice,Quality is promised.,simply awesome,Value for money,Sound and mic quality good but not comfortable", "review_content": "Product is good. It's definitely a peace for ears because the padding is also very good. One thing that I don't like is the wire is too short.,Never expected an easy on pocket brand like BoAt winning heart the way apple does! Good product In 800rs,Good product,Superb,The headphones live up to your expectations coming at an affordable price.The sound quality is top notch. Talking about the noise cancellation feature, it indeed cancels out the exterior noise, I had put it on my ears, played a song and simultaneously played another song on my TV, I really could not hear my TV's sound. I liked the design and it feels quite appealing.Now I have two problems with the headphones firstly being it cannot be put on for a longer period of time. Adds a little bit of stress over your ears and they start to ache not much though but that's quite a concern. Second being the length of the wire, it's very long and often it annoys you because it doesn't get fit into pockets and all quite easily. Overall a quality product at this rate and I recommend to buy anyone who's interested and willing to give a shot at buying this headphones.Packaging of the product can be much better. I'm unsatisfied with the delivery of this product.,It was my second boat product which I have purchased and 1st headphone more than five hundred. and its experience is simply awesome. I have been using it past 11 months.,The sound quality is perfect, even when the sound volume is around 10 - 12,The sound is very good for price and mic quality is also decent but it is not comfortable. Your ears feel pain when you take it off, but for this price range it is the best thing.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41ZeJ53ij3L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Heads-900-Wired-Headphones-White/dp/B078W65FJ7/ref=sr_1_493?qid=1672903019&s=computers&sr=1-493"}
{"product_id": "B08S74GTBT", "product_name": "Zebronics Astra 10 Portable Wireless BT v5.0 Speaker, 10W RMS Power, 15* Hours Backup, 2.25\" Drive Size, up to 6.4\" Mobile Holder Support, Carry Handle, USB, mSD, AUX Input and FM Radio with Antenna", "category": "Electronics|HomeAudio|Speakers|OutdoorSpeakers", "discounted_price": "₹799", "actual_price": "₹1,999", "discount_percentage": "60%", "rating": "3.7", "rating_count": "418", "about_product": "Wireless Portable Speaker with Mobile Holder|Easy to Carry handle|Supporting Bluetooth, USB, AUX & Micro SD Card|Adjustable FM Antenna|Media/ Volume Control, Call Function|Built-in rechargeable battery|Mobile Holder supports upto 16.25cm size phones", "user_id": "AE42EZDBUFSJZGL66F275G54PSUA,AHFGOPCKQ4SMDFRKGLYFOAKTYXUA,AHW2UJ6K5LK5BL7LHAD72ZGWJ4MA,AEPWUTZXVJGKU724YMMK4AFRB73Q,AGJ3RV3MOS7D4IMNR7PHFGTDGKPA,AFUWFYMER6VM4ARW5VTGF3KEYM5A,AGFVVKJUZWYWIXOOMYTJYRV4ZSZA,AEL4TWNZSN7KFL3W76ADWINWR6KA", "user_name": "ESWARAN,Amal Gopinath,DODDI GOVINDA RAO,Vinita kumari,Chidambar Kakathkar,Hari,Siddhath Gowtham,Hari Bhaskar", "review_id": "R1PUDD2V2KQP06,R1LRN5EFJ0Y717,R1S7Q7UW9FO9LY,R3J9HR69Y4XKV5,RQ6P92L8AVQVW,R3L08DWQKGHDK7,R2EUWEVREWQ4SL,R1POJ3SHK8MNS0", "review_title": "Super product,Worst antenna.... It came out while adjusting...wastage of money,Nice product,Good,A Must Have product.,Poor sound,Wothy,Useful product if you watch movies in mobile.", "review_content": "Super product,Worst product,Too good product,Good,Since long I was waiting for someone to manufacture a simple mobile set of pocket radio size so that I could listen online stations with reasonable sound quality.  As we know  what ever qualities a modern mobile set may have, the audio produced by it is always dry with no bass content.  So either we have to connect it to a music system or have to use headphones which are harmful to ears in the long run. Recently when I was surfing internet I saw this product which looked like an old radio.  On verifying the details I found this fulfills my requirement and without delay I placed order.Zebronics Astra 10 is having excellent audio quality with sufficient bass and treble content  just  like radios of olden days. The hollow space around the speaker adds to the bass  effect.  If we rotate the set and make the speaker to face us, the sound becomes more crisp.  Even with full volume  sound does not distort.Bluetooth connectivity also is marvelous  and connects within no time and there are no breaks and delay in audio transmission.  Battery backup also appears to be good.  After fully charging once I am using it daily and after 3 days still it is showing 80% charge.  Though there is no provision to know the remaining charge in the product, the mobile from which we are connecting bluetooth  shows the details.Normally we can not expect much from FM Radio in such type of gadgets. But this product is exception for that.  By attaching a small wire to the whip antenna I could listen FM station situated 200 KM away as if was local one.Aux, USB and mSD card facilities also work well.But I felt the on/off switch should have been some what sturdy.  Long press type button would have been a better option. Also scanning of FM stations  should have been on long press instead of single press to avoid accidental scanning.Over all it is a great product.To give it a nostalgic look while enjoying online radio,  I used the picture of our old National Ekco Radio's tuning dial as the home screen of the mobile.I use this for personl TV audio listening as well.Chidambar KakathkarMangalore,Poor sound quality,Worthy,You cant use it if the mobile is slim or more petite. I bought this for my mom; her mobile is a slim model and doesn't have a case, and the mobile keeps falling if you tilt it. Overall it is a good product.", "img_link": "https://m.media-amazon.com/images/I/41uoxHxPDaL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/ZEBRONICS-Zeb-Astra-Wireless-Portable-Function/dp/B08S74GTBT/ref=sr_1_495?qid=1672903019&s=computers&sr=1-495"}
{"product_id": "B0B9BD2YL4", "product_name": "KINGONE Wireless Charging Pencil (2nd Generation) for iPad with Magnetic and Tilt Sensitive, Palm Rejection, Compatible with Apple iPad Pro 11 inch 1/2/3/4, iPad Pro 12.9 Inch 3/4/5/6, iPad Air 4/5, mini6", "category": "Electronics|Mobiles&Accessories|MobileAccessories|StylusPens", "discounted_price": "₹2,599", "actual_price": "₹6,999", "discount_percentage": "63%", "rating": "4.5", "rating_count": "1,526", "about_product": "【2022 latest iPad Magnetic Charging】 The latest iPad pen developed by KINGONE provides true wireless charging without cables, just like Apple Pencil2. Automatic Bluetooth pairing and charging. You can keep charging your iPad while you carry it. It also perfectly solves the problems of obvious heating, slow charging, and sudden crash of the iPad when charging other wireless charging styluses. You can use it without any worries|【Ultra-High-Precision 0-delay】KINGONE's latest iPad pencil is equipped with the latest ultra-high-precision chip, which solves various problems such as slow response, disconnection, delay, and misalignment of other styluses. Whether you're drawing or taking notes, you can use it comfortably and have the same writing comfort as the Apple Pencil as if you were writing on real paper|【Excellent Easy of Use】This iPad stylus uses physical buttons. Compared with other touch switches, there will be no accidental power on/off, which greatly improves the ease of use and experience. 6 major functions such as quick screenshot, handwriting in the text box, shape correction, and return to the [home screen] with a single switch, enjoy iPad anytime, anywhere! Additionally, the nib is interchangeable with Apple Pencil 1st/2nd generation for a wide range of applications|【Tilt Sensing & Malfunction Prevention】KINGONE's latest iPad stylus is equipped with anti-palm touch and tilt sensing functions, allowing your hands to rest naturally on the iPad, just like drawing on paper. You can dynamically adjust the thickness of the lines according to the placement angle of the chip, and draw and write as you like. The perfect gift for parents, kids, friends, colleagues, and classmates!|【Compatible Models & Warranty】Pay attention to the applicable models! Please check your iPad model before purchasing. Compatible Models: iPad Pro 12.9-inch (3rd/4th/5th/6th generation), iPad Pro 11-inch, iPad Air (3rd/4th generation), iPad mini 6. If you have any questions during use, please don't hesitate to contact us", "user_id": "AEAX7BRPDS3NSYCZQBQDL5DGZDVA,AFI76LT4UP2L3SFJMDMH2C5SM6RQ,AFK4TVL4GOKGSKXKVD4ROM3NWE3Q,AFNAPG6Q3WJAMY4MYDEV2W7JSPLQ,AF645AUHJGIUD7JY2VHG5TBNYNQQ,AHZZFBL24XXVLW6H44MOB6LBHH5A,AEV5AKL64UCEJJJCSVVBLHHWU7SQ,AHCDJWUO4YVS63AGSZWF2QHS7QPA", "user_name": "Ak,Jitesh,anil,Umpo,G'DAS ENTERPRISES,Neetu,Vaibhav Adsul,Alok", "review_id": "R1HOV97NOJFX4W,R3BIRU7WH404ND,RAU26U2KP1OQH,R15BZZ2VBVMJ4V,R29G5QZ1EZB3KF,R3UFXXP9B7DVUJ,R1RVSNGA4SCXX4,R2HT0UTCAOMW1J", "review_title": "Quite Good,good pencil,Value for money,Brilliant,Value for moeny product,Must to buy this pencil,Problemsolver,It works as advertised", "review_content": "After 10 days of use bhaut acha chl rha ha and I will review again aapko bata dunga kessa ha Thoda time BaadBut Product acha ha Abhi tak kuch kharab nahi hua and mene bhe isska khayal rakha ha,pencil is good working good but build could be better,Excellent experienceWorks well with Ipad Pro 11 inch (2022)Good battery lifeNo need to buy overpriced apple pencil,Brilliant product. Adds value to the iPad. Thankfully the alternative to otherwise expensive brand pencil.,Really a great product by king one ❤️🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥. When i purchased the pencil I am doubt full about the quality of product but now a month I used it its amazing product by kingone and it's no doubt best alternative for the apple pencil , even it supports wireless charging that's make it amazing and battery is also to good . Osm product and I didn't faces any ancidental power off as other pencils it's cool and automatic swich off in it's idel time save battery it like all rounder I can made a note and draw the paintings and so many other things .I am a student it's saves moeny it's best in one forth price of original one Cool......,Great quality with noags,For all those who can not afford the Apple Pencil, this one is a real problem solver. Its a little hard to get used to the pencil but works like a charm. zero issues. Lovely product,Initially I was sceptical using this pencil, because it kept skipping lines and became unresponsive. But after a while it became as smooth as original. You must go for it if pressure sensitivity is not what you are looking for. With wireless charging and button shortcuts it’s the best budget pencil. I will update my review to 5 stars ⭐️⭐️⭐️⭐️⭐️ after using and testing it for a while if it passes all the criterion. Thankyou.", "img_link": "https://m.media-amazon.com/images/I/217Lv1D3bHL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Wireless-Generation-Sensitive-Rejection-Compatible/dp/B0B9BD2YL4/ref=sr_1_496?qid=1672903019&s=computers&sr=1-496"}
{"product_id": "B0BMXMLSMM", "product_name": "Lapster 65W compatible for OnePlus Dash Warp Charge Cable , type c to c cable fast charging Data Sync Cable Compatible with One Plus 10R / 9RT/ 9 pro/ 9R/ 8T/ 9/ Nord & for All Type C Devices – Red, 1 Meter", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹199", "actual_price": "₹999", "discount_percentage": "80%", "rating": "4.5", "rating_count": "127", "about_product": "-1 meter type c to c cable fast charging cable Convenient for all types of USB C Laptops, Tablets, And Smartphones.|-6.5 Amp USB C Cable compatibility with All 60W 45W 30W 18W 15W USB-C Power Adapters, Support Pd 3.0 And Qc 3.0 Fast Charge for Your Devices. Data Transfer Speed Is Up To 480Mbps Of USB 2.0. Note: Not Support Video Transfer.AM|-USB C To C Cable Support Warp Charge For One plus 8T, One plus 9/9 Pro, Too Fast Charge For MacBook Air 13 Inch 2020/2019/2018, For MacBook Pro 13/15/16 Inch AM|Compatiblity with type c to c cable fast charging cabe is Newest 2020/2019/2018/2017/2016, For iPad Mini 2021, For iPad Pro 12.9/11 Inch 2020, For Google Pixel 6/6 Pro/5/4A/4 Xl/4/3A Xl/3A/3 Xl/3/2 Xl/2, For Samsung Galaxy S21 Fe 5G/S20 Fe 5G/Note 20 Ultra/Note 20/S20/S20+/S20 Ultra, Galaxy Z Flip 3, Galaxy Z Fold 3, And More Devices.|65 watt type c cable is in Premium Silicon Coating, High-Quality, Prolong Bending Lifespan , Pure Copper Core, . Both USB C Connectors are Designed with An Advanced Emark Chip for Higher Efficiency & Safer Charging for Your One plus 8T. Output Delivery At 6.5A 10V Max, 65% Charging Capacity Only Takes 30 Minutes, Saving Your Valued Time.", "user_id": "AHFENRYJG4LPXDTUGEMG335VICSQ,AGSV37DJ5QTUYOXFJNPD4W7GXVFA,AGDEVIAYABTMIJLTYWTUS5M5VBTA,AFKDGUQ5TMGT3PXBDHAWPRE5CACQ,AHWENSYYF2QDH3EX4REMVGBEMMLQ,AGJOGZAGBMX7PBCUAILD2YIM5MAA,AF5EHUH4GWB7JZ3PZ53Z2DOYK5WQ,AHHT4VWMFYSASNW6RH2Q65C6YNDA", "user_name": "Nadhiyarasan,Saurabh Aggarwal,Dibya,Sai Sriya,Sayed,Bhupendra Verma,Yash suhagiya,Manuj Patel", "review_id": "R14ZOPYFHOYYRQ,R1GQH74NUCJZZ7,R1BNWIYBRSI1Z6,R347KU67LE6JEH,RMGA8IGV2WQDX,R2782FIPC5T4KM,R220M468LVHIE1,RA1PNAU355MLG", "review_title": "Super charger in lapster,Best among the rest,Classy product and authentic one,Excellent product,Worked fine ,thank you,Stylish and flexible cable,Amazing,Value for money product", "review_content": "Best quality,The product looks original-like and is perfectly working with my OnePlus 8T. Good Type-C to C buy, recommended over other companies.,its a very good product and yet a reliable and durable cable to get yourself connected,Cable is good and support 65 w fast charging. I am use this cable to my one plus 8t mobile phone. This cable also speed in transfer to data. Cable price is also low. Thanks for seller to provide best quality and durability cable in low price. I am happy for saying this cable is all-rounder.,The product worked  fine for me. Got this at good price,Flexible and toughness is best workAnd also in samsung m31s mobile fast charging,I bought this cable for my nothing phone 1 it's amazing, fast charging is working very well I've tried this also my samsung mobile, and result was fabulous, thanks,Initial impressions are good. It is supporting ulatra fast charging on my OnePlus 9 pro.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/3135yilFsfL._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Lapster-compatible-OnePlus-charging-Compatible/dp/B0BMXMLSMM/ref=sr_1_497?qid=1672903019&s=computers&sr=1-497"}
{"product_id": "B0141EZMAI", "product_name": "Gizga Essentials USB WiFi Adapter for PC, 150 Mbps Wireless Network Adapter for Desktop - Nano Size WiFi Dongle Compatible with Windows, Mac OS & Linux Kernel | WPA/WPA2 Encryption Standards| Black", "category": "Computers&Accessories|NetworkingDevices|NetworkAdapters|WirelessUSBAdapters", "discounted_price": "₹269", "actual_price": "₹800", "discount_percentage": "66%", "rating": "3.6", "rating_count": "10,134", "about_product": "USB WiFi Adapter: Fast wireless transmission at up to 150 Mbps ideal for video streaming, gaming and internet calls|USB 2.0 Interface: Supports high speed USB 2.0 interface for a seamless experience|Advanced Security: Supports 64/128 WEP, WPA, PA2/WPA-PSK/WPA2-PSK(TKIP/AES) wireless security|Nano Design: High performing nano-size design for portability|Easy Installation: Includes quick installation and configuration guide", "user_id": "AGMJ6TDLOVZIR5ZU65TLJFSLG2BQ,AGPK7U5SHXBYBXEWBTRCIAZSB6LQ,AHXYETFF4XMSAI4VAHP24XL5SSTA,AGMUJCTMBNQBOGHL6UPSSF4KSNUA,AGEUQD256CS42A6PDKDB75VZRADA,AHGA46UDDADBRAB5FOHX6XY2DBVQ,AHUVYZMQ6PWI54UXP7SLLS4ZU46A,AHVS66CFEP5AXDC35N4ME4SU4X5Q", "user_name": "SQL,ARUN KUMAR,veer,Ravi shankar,Shivam Kumar,ramesh,Bibin,Hem Roy", "review_id": "R3AZDEK3MQA3RA,RXF3HCCBWV0VB,R6CVYFDUXBS36,R1QMN1WQJIWAB7,R2MOVGGWRV4ZPE,R2Z00XYFTN4T2Y,R294UWCBOTKD8H,R3NPDCAH895UHB", "review_title": "Will not work with new system,Veri good,Ok product,Access wifi signal.,👍,very good,Good Product,8139EU based okayish but low reception", "review_content": "Was working fine with window 10 old computer but is not installable with new system on Window 11,Overall very good item,Easy to install ok signal,This was used to accesd wifi connectivity for desk top, and TV, worked fine,👍,like,Good product, satisfied with its performance.,It worked on most devices where driver could be installed, even worked with linux system too but for the reason I bought simply didn't get solved with it.. though not returning it as it worked in my computer without any issues.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31mgo4D-kPL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Receiver-300Mbps-802-11b-Wireless-Network/dp/B0141EZMAI/ref=sr_1_498?qid=1672903019&s=computers&sr=1-498"}
{"product_id": "B07QMRHWJD", "product_name": "SWAPKART Portable Flexible Adjustable Eye Protection USB LED Desk Light Table Lamp for Reading, Working on PC, Laptop, Power Bank, Bedroom ( Multicolour )", "category": "Computers&Accessories|Accessories&Peripherals|USBGadgets|Lamps", "discounted_price": "₹298", "actual_price": "₹999", "discount_percentage": "70%", "rating": "4.3", "rating_count": "1,552", "about_product": "14 Highlight LED Lamp,super bright white light|Long life lasting LED Lamp life expectancy up to 10000hours|smooth and high-class, small and light weight|standard USB, plug directly into USB to take power|Super-saving power, the power consumption is less than 40ma", "user_id": "AETGW4KBMIJPPNVLPKB7R7O3FSQQ,AEYRRD5MDFEO4UXUUKZ4HYJIWCXA,AECQXTLQHIUJGVCJRIZGBG74HZMA,AEG6WS6DQBW7RUYV5N6Z4QKCWSPA,AGE6GHTP6TZV6IMHAQU3X3GSEVGQ,AFPJLOHRAM3HFFNXMWTZN7GT5FMA,AHI2MWHMTDESX4HL7HFIN5B2URKA,AEDP3USNSZXGRPOONSUFGDM7YDKA", "user_name": "Bhawna,Abhishek C,Richard P.,Vivek,Sonali G.,Chandramohan,Michael,Amazon Customer", "review_id": "RTNU6RMF947TL,R2EDFUKTI01DH4,R2DXZK9Y1QZKSU,R1X0SKU3MLH5BS,R3RR7IUQGDTSNR,R2Z407G3IUP73E,R2JFEOGWTTUVMM,R3F3YRVOF923CK", "review_title": "Can be use as table lamp or emergency light for room,Very flexible 👍,Working perfect great,Value of the product,good product as per price,Good enough but no controls to dim,Excellent,Nice product", "review_content": "bright enough to read in close proximity, can light up room. get little heated but not an issue. build quality is good. Bit pricey for sure but can't go wrong with it. Hope manufacturer put switch for on/off.,Very useful for WFH,Working perfect great... Product,The product is simply adjustable and brightness is enough for a study tableEase of useRecommended for students,I found it matches my requirement and also good by material used..overall good buying decision,Enough brightness but there is no control to turn off or dimmable from the led light. Like Mi LED light have option to dim and switch off. But it doesn't have, so turn off or turn on the light, you will need to plug in or remove it from power bank. Can't keep connected in power bank as it always turns on light when connected,If the button of Adjustable of brightness was present....then the product was marvelous,It is helpful for me in my wfh at late night due to this product light is switch off and everybody will sleep without any distraction and also I can complete my work", "img_link": "https://m.media-amazon.com/images/I/41d-eh65JLS._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SWAPKART-Portable-Reading-Working-Bedroom/dp/B07QMRHWJD/ref=sr_1_499?qid=1672903019&s=computers&sr=1-499"}
{"product_id": "B07W7Z6DVL", "product_name": "Infinity (JBL Fuze 100, Wireless Portable Bluetooth Speaker with Mic, Deep Bass, Dual Equalizer, IPX7 Waterproof, Rugged Fabric Design (Black)", "category": "Electronics|HomeAudio|Speakers|OutdoorSpeakers", "discounted_price": "₹1,499", "actual_price": "₹2,999", "discount_percentage": "50%", "rating": "4.1", "rating_count": "25,262", "about_product": "Compact Portable Bluetooth Speakers. Wireless Bluetooth Streaming, Charging Time 3.5H@ 5V0.5A|Dual Equaliser Modes for Normal & Deep Bass Output. 9 Hours Music Playtime Under Optimum Audio Settings|IPX7 Waterproof Design. Audio Specifications : Frequency Response 120Hz - 20KHz . Signal to noise Ratio 70dB (Aux)|Pair 2 Infinity Fuze 100 Speakers with Dual Speaker Connect Technology|Speakerphone|Rugged & Durable Fabric Material|1 year manufacturer’s warranty", "user_id": "AHBISYTXOMEMKDTXVEKH57D2X3RA,AEOSGU32LYFVLXEHETK4QU4UDWEA,AE3MPP4472M7T34QT5674QU2XC3A,AHGDXMKQ7B3CJHLZ3GCXWMDMPGSQ,AF6OH7C5LOWQK2VR6DKMNSKHMUFQ,AFLY6EXAO7CNVWL2AVBQVO224Y3Q,AF6SSEMMZHBAKRV5BGIBKWRCNCTA,AHUMH22K5KBLNH2K2GA3EEXOWSPQ", "user_name": "Sreekumar KURUMALIKKAL,Mukund,ADITYA GUPTA,dev,Abraham,Mahendra,Rahul G,Vivek Kumar", "review_id": "R2NQLS6I62ASDV,RIT3TAH74G3JM,R3V03S1XKJWJ4F,RTNPJ485GGG0B,R37FLGM56SKQDQ,R3LPNHIQDOG8J9,R13ZLVXBTCNIUC,R1CEC872UPQJTP", "review_title": "Good Handy Bluetooth Speaker,Very Nice,Medium,Worth to the money,4.5,Good,Value for money,Value for money is good....", "review_content": "Good Bass and Treble. Good Sound Quality.,Good product in this price,In this more irritating is the deep bass after putting speaker in deep bass the volume automatically decrease when there is a bass in the song and volume is only for the room it can't be used in bigger room's,As little giving good sound specially during video chat in laptop.,Crisp and clear balanced sound.Good bass for its size.Value for money,Good,Value for money,I feel good with this item", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51UH57Cs5hL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Infinity-Fuze-100-Waterproof-Portable/dp/B07W7Z6DVL/ref=sr_1_500?qid=1672903019&s=computers&sr=1-500"}
{"product_id": "B07WMS7TWB", "product_name": "Pigeon by Stovekraft Amaze Plus Electric Kettle (14289) with Stainless Steel Body, 1.5 litre, used for boiling Water, making tea and coffee, instant noodles, soup etc. 1500 Watt (Silver)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Kettles&HotWaterDispensers|ElectricKettles", "discounted_price": "₹649", "actual_price": "₹1,245", "discount_percentage": "48%", "rating": "3.9", "rating_count": "1,23,365", "about_product": "CLASSIC DESIGN: The classical mirror polish of the appearance makes your electric kettle unique and aesthetic, which can match any type of kitchen design and 360° swivel base is connected with standard power cord for safe usage and convenient storage|CORDLESS POURING: The electric kettle can be easily lifts from its swivel base for easy filling at the sink and graceful serving without the hassle of a power cord; it can also be returned to its power source from any direction, great for right and left-handed users.|CONVENIENT: The cordless & BPA-Free electric electric kettle makes a striking presence on any kitchen counter or buffet in preparing and serving and it is easy for storage|FAST BOIL: This 1500W electric kettle has concealed heating elements and can boil up to 1.5 litres of water in 5 to 7 minutes, quicker and safer. Start your day with a cup of instant lemon tea, green tea, hot water.|EASY CLEAN: Use white vinegar, baking soda, water, cleaning bottle brush and microfiber cloth to clean your electric kettle and keep it looking new.|Water Level Indicator: No", "user_id": "AHHCE7SDKWRKQDLFXF2YNMGODDRA,AEJQ5PXFKFXUBKWMC5RYF2WLEZSQ,AGZDR3Y6MNTBZRSP754LCZGHCLPQ,AE4DHHEU4Y3LQBPIJKXC4IBXB4WQ,AEJ674BKH3ZTC2JQA5PMMQ62I7MA,AFVIELPXTPPBI7HXOXX72AIPJHGQ,AF7V6CVPDC3UJNI3UODXF5FCU4XA,AFYCNW74WYKEQYYNUDBTD4V45H2A", "user_name": "ba_doh,Asim Kumar Ghatak,Deepak Sharma,Ujjval Rathod,Shiva Sai Crisna,NANDA KISHORE Patra,Amazon Customer,Danish Shah", "review_id": "RVSI68M0EPAVZ,ROQNJTEGAA7VN,R1YNME95M4J2H7,R17RLWB0UMGULZ,R3N9JK1RH8STLG,R30Y52H4BDOPGE,R2VJ4LI8OPJ6TJ,R9N6QZH6MI5P4", "review_title": "All your questions answered in this review,Just fine for the price,Its okay okay according to price.,Good for winter times to boil the water,Bass fitting loose,Good product, no issue after using 2months,Good matereal,Only disadvantage is the cord length.", "review_content": "Somehow Amazon sucks when you want to select an electric kettle. There are no options to filter your choices based on the parameters that matter. It is easy to fall into the trap of an ongoing deal and end up buying something that falls short of what you need. In this review I will answer your questions about the PIGEON AMAZE PLUS 1.5L ELECTRIC KETTLE.1. Can I trust the reviews for this ad? Are they genuine?Probably yes. But know that the seller lists several types of PIGEON Kettles in the same ad. Unless the review refers to this particular model - you could well end up seeing a review of a product and buying a different one. The ratings are also an aggregated mix. There could be 10 negative review of the product you are seeing and 10 positives for the other products. The page will show you a neutral review. That's the game sellers are playing these days - to avoid negative reviews. I have posted a picture of the stove I am referring to in this review.2. WATTAGE: Important because this tells how quickly the water will heat up. This one is 1500W - meaning that you can switch it on ... brush your teeth and find the water is boiled. Great time saving !! My earlier one was 900W and it used to take 10-15 minutes of patient waiting. The gas stove boiled water faster. This one takes about 3-4 mins to heat 2 mugs of coffee3. CABLE LENGTH: Most of these kettle makers skimp on the cable length. I have purchased kettles to find they have only a 2-foot long cable ... and I had to return them. This one has cable length of 22\" (slightly more than one meter) - which is allows a comfortable distance between the kettle and the plug.4.  CONNECTOR:  This one uses a 6A plug - which is most common in India. Be careful because from >1500W onwards, most kettles use a 16A plug and that is not always available at the place where you want to place the kettle. Strictly speaking, it should have a 16A plug, but then this is kept on for short intervals only.5.  CAPACITY:  1.7 litres as mentioned - though I could not see markings for max and min levels. This is good enough to make 4-5 decent sized mugs of coffee6.  COOKING OTHER STUFF:  The ad says only water - but I see no reason why you cannot heat Maggi etc. Maybe you can. But avoid milk as the expanding effect will cause spills and this can have adverse effects.7. LOOKS: Quite okay for the price. It will not make your kitchen look bad - and neither will it enhance the looks. This is the most common look that an electric kettle can have.8. PERFORMANCE: I have used for 2 days only. No complaints so far. There is a 1-year guarantee card accompanying the product9. HANDLE: Very convenient feel when you lift it it from the heating cradle. Does not feel very heavy even if there is a full 1.7L of water.10. NEGATIVES: This is a steel jug. The outside will automatically heat up. If you are used to a plastic outside in your previous kettle, you need to be a little careful.VERDICT - \"BUY\"(at the time of writing this review, this costs less than Rs 700. I have seen that sellers tend to inflate prices as they get my positive reviews - therefore I am also mentioning the price range based on which I gave this product a 5 star review),The body is very lightweight and doesn't feel sturdy. Does the job of heating water fast and that's it. Cord length could be a little longer. The plastic parts doesn't feels sturdy. The top cap has a smaller dia so a man's hand has a trouble fitting it inside the container during cleaning and can easily cut our hands. Overall it's okay.,Its quality was not too much good, light quality product but according to price its okay.Easy to use product & good for save time.,Good product for boiling water. shock proof. So no worries.hahaha,Cattle bass fitting not currently,Good product,Go for it,Amazing  product.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31na34LxwmL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Pigeon-Amaze-Plus-1-5-Ltr/dp/B07WMS7TWB/ref=sr_1_5?qid=1672923591&s=kitchen&sr=1-5"}
{"product_id": "B00H47GVGY", "product_name": "USHA Quartz Room Heater with Overheating Protection (3002, Ivory, 800 Watts)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|ElectricHeaters", "discounted_price": "₹1,199", "actual_price": "₹1,695", "discount_percentage": "29%", "rating": "3.6", "rating_count": "13,300", "about_product": "Meant for Spot Heating; Voltage/Frequency: 230V/50Hz/1 Phase|Room Size: Upto 150 sq ft; Ideal for a small room only, i.e., up to 120 sq. ft. Touch Sensor: No. :Tip-over Switch : Yes|Safety tip over switch cuts off the heater in case it tilts or falls; Powder coated finish to prevent corrosion|Designed for low power consumption; There are two heating positions to suit your comfort|Country of Origin: India", "user_id": "AFF4TQVTALIJ24PF3PWD376ONLXQ,AHF4Q46ABHEW3O6SZQMAXB6R6ZLA,AGKD2FZGZLQPA3VITZMPXL2OQMHA,AEF46LTPVXW3BL7J4RETUFLLW3RA,AEKFSZLXX2ULI3U46YCZPRILVW6A,AESYTC5OIXBUIDGPDE53XYOENLWA,AEV4CXMHUNKPH56BNTAMEH7EOMZA,AHFXBNDCOX7XWOQ3AG6PTK6LOF2A", "user_name": "Sudesh,sayan mukherjee,SS,Ritu Doloi,Sudip Mandal,Yash Raj,Abhay Dogra,Tajammul Hussain", "review_id": "R2PFPVD7QTRJC6,RI7CEYXWJ4WUJ,R26D8KBCMOE84W,R19IYA3EBVQNHL,R28KN014376DH8,R2MRD2AYGLWP61,RXV0W64L9ITU1,R1VBNBY9DR8FJ9", "review_title": "Good and affordable room heater,Good for tight spaces,Short shelf life,Niceeee,Very good product,It's good,Heating capacity,Good", "review_content": ",Good product for tight spaces and easy to replace as well.,One of the filaments lasted about 7 days of usage. Waiting to see how long the other lasts.,I like this product as compare to price it’s look worthy. Hope will work like this in future too.,Good for one small room (120sq ft),Good,Heating capacity is not that much good.,Good product", "img_link": "https://m.media-amazon.com/images/I/514Zxz-eqKL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Usha-Quartz-800-Watt-Overheating-Protection/dp/B00H47GVGY/ref=sr_1_6?qid=1672923591&s=kitchen&sr=1-6"}
{"product_id": "B07VX71FZP", "product_name": "Amazon Brand - Solimo 2000/1000 Watts Room Heater with Adjustable Thermostat (ISI certified, White colour, Ideal for small to medium room/area)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|FanHeaters", "discounted_price": "₹1,199", "actual_price": "₹2,000", "discount_percentage": "40%", "rating": "4", "rating_count": "18,543", "about_product": "Powerful 2400 RPM copper winded motor for quick heating and can be used vertically or horizontally (kindly refer to images)|Do not worry if you experience some burning smell when you run your room heater for the 1st time. This is due to the motor varnish getting heated for the 1st time. The problem should not recur in subsequent usage. If it does, please contact our Customer support|Caution - Always use the product with 16A socket. Using it on lower rating sockets may result in melting of socket or the plug. This is 2 KW heater. It will consume 2 units per hour when operated on high heat setting.|Air throw range of 10 feet which is ideal for small to medium sized room; Product can be placed both vertically and horizontally (kindly refer to images)|Cool, Warm or Hot wind selection knob for heat setting; Please note that regulator changes heating power & not actual fan speed|Lightweight (1.15 kg) for easy portability between rooms; Plastic body with rust-free metal grill front|Built-in overheating protection;Power: 2000 watts; Operating Voltage: 220 - 240 volts; Package contents: 1 Room Heater and Instructions Manual|This model Fan Speed is fixed, not regulated by knob", "user_id": "AHMOBOPW4OAANJ3VXXWX2QGJA6NA,AF5IGDDLQ6JNALQVE2QDWW3Y7GFQ,AEH7AAYSP6ZITYT2K6PDMCY4PGTA,AG4RZDXIU2IUVLGT75YVH3KJTEUQ,AGWTF5MKOLD3VVQUFRQEPN2F7TCQ,AEEPWPF5DKQ2OMNUTMCXXLZLF3RA,AEFXFHQQRNGTHNUGCIDULRC6BHLQ,AFSTZARBDNESVFT7AANAHBHV3QUQ", "user_name": "Amazon Customer,Prince kumar,Rosy Thakur,Dheeraj,Amazon Customer,Neel Sengupta,Anu Jain,Srini", "review_id": "R35ER803GJHN21,R28J7FISAIMQI1,R1Y9J4QQ06U3WN,R1Q08JSHK5T03E,RTTCI4WPA20T0,R1PC85VCE15LM6,R3AIUHXWWU3Y64,R2UO2UH9UCUYJ0", "review_title": "Compact and easy to you,Good work 👍,Good,Good product,Good product,Lovable and nice product,Nice product,Compact and easy to use. Suitable for a room", "review_content": "Good product under Rs. 1100..Easy to use...,Good product ❤️Thanks 👍,It's a mini blower with good heating. Cute and easy to use. However, it requires a big socket.,Best quality good look,Good product and quality,Superb,https://m.media-amazon.com/images/I/717tDJ+J30L._SY88.jpg,Compact and easy to use. Suitable for a room", "img_link": "https://m.media-amazon.com/images/I/41ITfQhGHfL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Amazon-Brand-Solimo-2000-Watt-certified/dp/B07VX71FZP/ref=sr_1_7?qid=1672923591&s=kitchen&sr=1-7"}
{"product_id": "B07NCKMXVZ", "product_name": "StyleHouse Lint Remover for Woolen Clothes, Electric Lint Remover, Best Lint Shaver for Clothes", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|LintShavers", "discounted_price": "₹455", "actual_price": "₹999", "discount_percentage": "54%", "rating": "4.1", "rating_count": "3,578", "about_product": "✅REJUVENATE FABRICS & KEEP TIDY - Restore your clothes and fabrics to a fresh new look! Powerful engine can easily and gently remove fluffs, lints, pilling, fuzzes and bobbles from fabrics like bed sheets, cushions, sweaters, woolen coats, curtains, carpets and more!|✅MAKE ALL FABRICS LOOK BRAND NEW: Even the highest quality of fabrics require a little rejuvenation every now and then, and this Fabric Shaver features a sharp stainless steel razor blade that will make quick work of damaged fabrics and make them look good as new.|✅ERGONOMIC DESIGN WITH A BATTERY POWERED MOTOR: Specially designed and lightweight with a 180° handle so it's easy to grip while you efforlessly defuzz your fabrics at any angle. The motor generates a strong suction when the blades are rotating for maximum effect.|✅EASY TO USE: Simply push the switch on button and gently skim it across the fabric in a circular motion to remove all the unwanted excess. Once the fabric is back to pristine condition, the excess tray slides out to empty. The expanded blade surface covers a larger area, finishing the job quicker and easier.|✅DUAL PROTECTION The adjustable height spacer protects your garments from being cut or snagged or caught. It also protects and reinforces your hands from accidentally touching the shaver foil. A cleaning brush is included in the pack to help you easily clean your appliance after use.", "user_id": "AGQZ46RQ5YJFVCSGI4BJGNXB7DZA,AFS6PV7PIU6VP4IPE6ED6EG75Z6A,AFDOCCV3LNI3FFF37HOQKLRU4NCQ,AH37HVSNIOJ3DJOGCWS6UFXOKR4Q,AFHIBNHDDDHLLVSXTV4DRYLOWM5A,AHUXZUPCP7X4ZSLLP3S3M23PTTLQ,AHJ3NVF3ERE5CN626OPOX6AEPQ2A,AGHQDSDG5ATRKOSV5HZPFFQBJ5KQ", "user_name": "vipul agnihotri,Banshul Garg,AJIT KUMAR,HIMANSHU S.,zamasu,madhu,charanbir,Ayangla Kichu", "review_id": "R3C4MJ8AHKD85X,R37VBDPMWP0C2Q,RW0LXEHCN4GNH,R15XRU3CK9QJH5,R3249U1QZNGT1F,R2YWR1DW9SZNN2,R3LUVGT7CIHP3C,R71B6O4PJPF1A", "review_title": "Good Product,Nice product,Good product,Good,I made my sweaters look like brand new.,Nice product,Perfect to clean lints easily,Good Product", "review_content": "Tried on woolen clothes and it really worked. Really a useful product but only reason I am giving 4 star is because of the short wire length. Wire length should be bit longer else its amazing product.,Easy to useTime takingBut cleans clothes,https://m.media-amazon.com/images/I/81QEgA-FO1L._SY88.jpg,Good for this price range but not sure about durability but product is good,It does it's job very well, It gave new life to my clothes. I just have a single complain and that is regarding its dust collector lid or container it is little bit loose because of this sometimes all dust and wool particles spills all around.,Easy to use.. I like this product, all my problems of clothes are solved.,Nice product i really like it easily clean lints 👍 but caps was little loose,It's a decent product and very easy to handle. Not sure of the durability as it's been over a week only. Will update the review after some few months.", "img_link": "https://m.media-amazon.com/images/I/415CYtympZL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/StyleHouse-Remover-Woolen-Clothes-Electric/dp/B07NCKMXVZ/ref=sr_1_8?qid=1672923591&s=kitchen&sr=1-8"}
{"product_id": "B0B61DSF17", "product_name": "beatXP Kitchen Scale Multipurpose Portable Electronic Digital Weighing Scale | Weight Machine With Back light LCD Display | White |10 kg | 2 Year Warranty |", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|DigitalKitchenScales", "discounted_price": "₹199", "actual_price": "₹1,999", "discount_percentage": "90%", "rating": "3.7", "rating_count": "2,031", "about_product": "✅ [LCD Screen] : A wide LCD screen display makes this scale easy to read, and it automatically locks its reading when the data is stable.|✅ [Multiple Features] : There are multiple features on the scale, such as an ON/OFF mode, a tare function, a unit exchange function, and an overload indicator.|✅ [Salient Features] : BeatXP kitchen weighing has Wide Screen Display, Automatic Data Locking, Low Power Consumption, Low Battery Indicator, High Precision Sensor, When the scale is overloaded, the scale will appear O/C.|✅ [Flat Surface] : To ensure accurate measurements, place the Kitchen weighing scale on a flat surface.|✅ [Color] : This scale is white in color and made from PVC", "user_id": "AFMJDZKFVMHFW64W22IJYRZLNS7A,AFQ7WK2RARMAY3NCZVYXQ5OH2XGQ,AEGVHZAPQ2JZ5NRAROTG75MC6PUQ,AHXQBGXJGDE2LRTXCTNKJA4ELAEQ,AEY3S4MECAO4HYQZYG4CTY7EQAOA,AGL76XCJ2EWY36ABPD25DHZRMQMA,AFUC5YIDC3M4XEGLETZWLMIFJT6A,AFTW6YWBCDN5KJ4MWVXSFPHJRD5A", "user_name": "Anurag a.,Shivam Singh,Amazon Customer,m.ganesan,P Santhosh Kumar,Amazon Customer,sk,MAHTAB ANWAR", "review_id": "R3RYMJ2WU0SE6K,R227GDWBCUSPRB,R286TLT09XAP0T,RIM7DE0ZQWVZC,R25KRHUD4YX0FP,R213I1AK7MT44H,R7MF48JTCLE3I,R35SELFZYYMUZP", "review_title": "Value for money and accurate,Nice,Very reasonable price, product was nice,Good,Nice product.. Value for spending,Light weight,Super,JUST WOW 🤩🥳", "review_content": "It is really good product it is showing accurate weight just 1-2 gram errors. Sometime you can get less accurate product then you can return it and reorder but at this price it is best.,Nice,Good at this price and iam satisfied,Working well,An essential part of kitchen and handy equipment.. Good product. Reviewed after one month used for couple of time ..,Good use in kitchen and other,For small weight its too good go for it,", "img_link": "https://m.media-amazon.com/images/I/414Cwv2guxL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/beatXP-Multipurpose-Portable-Electronic-Weighing/dp/B0B61DSF17/ref=sr_1_10?qid=1672923591&s=kitchen&sr=1-10"}
{"product_id": "B07VQGVL68", "product_name": "Glun Multipurpose Portable Electronic Digital Weighing Scale Weight Machine (10 Kg - with Back Light)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|DigitalKitchenScales", "discounted_price": "₹293", "actual_price": "₹499", "discount_percentage": "41%", "rating": "3.9", "rating_count": "44,994", "about_product": "Wide LCD screen display, easy to read, Automatically locks the reading when data is stable|Low power consumption, Low battery indicator,Tare function, Maximum Capacity 10kg|The scale will automatically switched off when it is in non-use condition in order to save power|High-precision tension meter sensing system, 1G Measuring Increments, Power by 1.5V 2 x AA batteries|Color: White, With 3 Button on the scale, that is on/off,Mode,Tare, Material: PVC|Place weighing scale on flat surface to use", "user_id": "AG2KSOZBBZY3A37U4Q273OYH2IAQ,AE2KY7GO5HPPGPTMF2M5Q2GT7AXA,AE7B5IIEKRJEPJUD7MU45QZIRLYQ,AHKEH7HFR3AZJEZMS2FU4B3SFCCQ,AGXNLZFFY7QM6ZYXUJ7VLPXH6DXQ,AFFOKWDBWHTD73ESMLG5EHU6D64Q,AG3H5M4RSVVBD3XRPC4MVFPUGTRQ,AFYA3XLIG4JUAVDGJR6XDG4XZXOQ", "user_name": "Akil,Sravann,Arun,Priyanka Bhura,Aniket Kumar Ray,Ashok.,Arun,B.SRINIVAS", "review_id": "R2EGEMPWBI2FRM,RVKAO44KF8EF2,RI96NGZIWTIRY,R3P7QO38TZ591S,R1S48QX02VP0F8,RHPAZK9629WGB,R2FCIF9RYZF42Z,R1PDWR0TBE0Y7C", "review_title": "If it had charching support.,Worth product,Cost effective,Good,Good for the price,Accurate,You can use it for everyday purposes,Good", "review_content": "Everythings good but cells die within a couple of month.,Worth product,Econamical,Product is good.,Not 100% accurate, but good to use for the price,Meets the purchase of purpose.,The machine looks the same and works perfectly. I had to return the first delivery due to the fault in battery cover and they replaced it within a few days. The accuracy is a bit off so i weigh the items again and again and use the majority result.,Like", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31p014p14mL._SX342_SY445_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Multipurpose-Portable-Electronic-Digital-Weighing/dp/B07VQGVL68/ref=sr_1_11?qid=1672923591&s=kitchen&sr=1-11"}
{"product_id": "B01LWYDEQ7", "product_name": "Pigeon Polypropylene Mini Handy and Compact Chopper with 3 Blades for Effortlessly Chopping Vegetables and Fruits for Your Kitchen (12420, Green, 400 ml)", "category": "Home&Kitchen|Kitchen&Dining|KitchenTools|ManualChoppers&Chippers|Choppers", "discounted_price": "₹199", "actual_price": "₹495", "discount_percentage": "60%", "rating": "4.1", "rating_count": "2,70,563", "about_product": "Unique string function to chop vegetables and fruits with ease;Package Contents: 1-Piece Handy Chopper.Blade Length: 3 centimeters|Eco-friendly design, no electricity required;Warranty: 30 Days Warranty, Only On Manufacturing Defects|Made from unbreakable ABS plastic for long-lasting use, Material: Polypropylene (PP);Sturdy 3-blade design made from Stainless Steel, As this chopper by Pigeon can be opened and detached easily, cleaning is an easy task using lukewarm water, mild detergent and a soft cloth.Power Requirement: Manual|Size Name: Standard", "user_id": "AGJTPXSZDYEWZM76UMJXCHUUPJSQ,AH4ON4ZDRHM5PWVW6725NRNU6VCA,AHTTCQ7A5VN7L4335W3VEZG6QDQA,AFL5LUHNIIKW6G6GPQML7SFN2W5A,AFHJ53JKOT2VWMLKXNADZHOFDMCA,AF3DB2GLX5C4YCCPB7CJYRQPANTQ,AH723Y45K7AIA5HG27CCBVDZQPYA,AGDB3UZ4G544VVY2ZDHJUI6KOLJQ", "user_name": "Harshit,Fazeela,Chiranjiv Singh,Joseph Ka,Rohit Kalyan Khaparde,saikumar venkatesham dusa,Dhanu Muthukumaran,Commandant Rizvi", "review_id": "R284SZGRNQQXYS,R3O2GOW05S3YSF,R28FXK3KNQP51T,R10HDAKYPSY8DY,RRHPL4BMSGAYI,R36VHNVQVB9LZQ,RM8OH7G4FEYF2,R281F6NM4QUQ2K", "review_title": "Nice chopper,Small easy use n clean,Not good,Good,Good,Probably the best purchase for my mom!,String issues,Good product.", "review_content": "1st product came faulty got it replaced , replacement is still working as good as new after a few months , recommended as it seems once you get a proper product it is long lasting , do get your faulty one replaced if you get it though.,Ya I love it this for easy to use and clean very useful when u want to chop a juicy tomato or leafy veggi and also size also quite good for smaller family,Do not work after 15 days,Good and smooth working,Good,Easy to operate,The product was good to use for chopping , especially for office goers like me... But the only issue I face was the string will get stuck when it's pulled over sometimes.. That's the issue I face... But great product though,Good product.", "img_link": "https://m.media-amazon.com/images/I/41cVgYgAKpL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Pigeon-Stovekraft-Plastic-Chopper-Blades/dp/B01LWYDEQ7/ref=sr_1_12?qid=1672923591&s=kitchen&sr=1-12"}
{"product_id": "B07VNFP3C2", "product_name": "Prestige 1.5 Litre Kettle 1500-watts, Red", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Kettles&HotWaterDispensers|ElectricKettles", "discounted_price": "₹749", "actual_price": "₹1,245", "discount_percentage": "40%", "rating": "3.9", "rating_count": "31,783", "about_product": "Warranty: 1 year warranty provided by the manufacturer from date of purchase|Max 3 differentiators great features - i)automatic cutoff ii) 360 degree swivel base iii)single touch lid locking. Lockable Lid:Yes|Power: 1500 watts, Voltage(V): 230|Capacity: 1.5 liters , Power: 1500 watts|Customer should not wash the base of the kettle|For queries please call our customer care on all days from 8AM - 8PM|Customer should not fill the kettle above the maximum limit mentioned inside the kettle, it they overfill, at the time of boiling, water will touch the lid and due to the heat plastic smell might come and also due to overfilling leakage will happen", "user_id": "AEDCFJT7COKZ3DP4YGWKH6KU7LAA,AFCOSVW2NHSFLPG7O5EKP2YRUERQ,AEI6GYSN3UARZSSWIR5HYUEF44XQ,AHCOKF4M3PRZWEENXHMFXKAZSYBA,AE3Z6FOZQTLXHRH3FSDWSUVG774Q,AH2OOR5NWZ5OB4GTDQ24D6CS6DNQ,AHWLIKXRCLQS7T7SHUAAJOKBQTLA,AHBYDX5JRGNFCSRBXDXTITOBNQ5Q", "user_name": "Sib,Deepak Kumar,Amazon Customer,Karthik Ganesan,jivan surse,Parthasarathy.R,Satish Kumar Pandey,Ashish", "review_id": "R3QP7PGD3SMG5I,R3ANC3TLK8732Y,RE9NKZ6CH2C3S,R2KGRD3G11ZE61,R38DXL79EKGXCA,R3MFG4MODO6DW6,R1X00FRQGJ1J7M,R1SX47T0QOY50H", "review_title": "Good Product Worst Delivery,Overall is ok but outer steel kafi hot 🔥 ho jata he,jo kids k liye kafi harmful he,Nice product,Lovely Product, but filtering holes are big for Ants to get in,Don't buy prestige water kettle product,best product,Medium,Heats up on handle and sides.", "review_content": "The 1st product i got was damaged then i request for replacement and their pain strated after 5 days of continuing follow up my product got replaced. Amazon delivery guys are too rude these days.. And no wonder customer care will give the generic SOP reply.. but anyways now product got delivered and it's good.. but feel like over expensive colour and quality is average.,I like this product but i dislike outer steel makes very very hot 🔥 after full charged,Only disappointed with the cord length.,Lovely ProductSturdyNice colorIssue is, if your house has 🐜... Water filtering holes are big enough. I've to dispense leftover water everyday & wash the pot, before heating.,In 3 months it stops working and service center almost close in Pune so I am very frusteted by this product. Bad service by prestige so never go for this product.,very good product,Medium type,The fiber or plastic handle becomes hot, so does the outer body. Difficult to handle immediately after heating. It is easy to clean. Cord length is medium but enough to keep the kettle at 4 m height above ground when kept vertically in line with electric switch.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41JCf4kTKgL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Prestige-1-5-Kettle-1500-watts-Red/dp/B07VNFP3C2/ref=sr_1_16?qid=1672923591&s=kitchen&sr=1-16"}
{"product_id": "B00LUGTJGO", "product_name": "Bajaj RHX-2 800-Watt Room Heater (White)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|ElectricHeaters", "discounted_price": "₹1,399", "actual_price": "₹1,549", "discount_percentage": "10%", "rating": "3.9", "rating_count": "2,602", "about_product": "Efficient Warmth: Ideal for use in in small rooms, this noiseless 800 Watts heater provides instant heating during winters. Effective Cord Length (in meters) 1.5|Personalized Comfort: Customize to your heating needs with two heat settings (500 W/ 1000 W)|Peace of Mind: Featuring dual safety device: Tip over switch against tilting and a Thermal fuse|Reliable & Safe: Our room heaters are dependable and they also come with a 2 Year warranty", "user_id": "AGI3LMXQXP4MEFM4NDQTJTXXQBVQ,AFC2IZIMLDQRHPP6HME2J34YYOOQ,AGRB3PSBBGROCDVUZ4T5NQCFGULA,AFV6EB63VB7UKYIEUYKNYEXHV5IA,AHS5BOPH3WRQV2BD4IWZRGDYQVVQ,AFYWFSV7SQAJW6KLYQN4D5OVIUNA,AH4GBZYOUGBQQ2XQQHY6WKQZTIKQ,AFFBDPS3XMGKIVKYZIMXQZJGEI7A", "user_name": "Shanu SwamiKohar,susheel,Shubham Tiwari,Amazon Customer,hemant,Rehan alam,J.S.,Ankit kumar singh", "review_id": "R2556DFD2ZXACT,RT20S82LT3HZF,R5PBZ2AGECCNG,R1XSSAS2EQFOVQ,R2HJ4MWS6TL6WQ,RVBQL14APCWFY,R2WCBDYBF6XI7R,R9MK42KRU62FP", "review_title": "Quality is fine,Good,Minimum electricity maximum heat.,Light weight portable and easy to operate,Nice product,Don't buy it,Value for Money,It's average product", "review_content": "Normal heat by this product.,Good,Quit good,https://m.media-amazon.com/images/I/61s-GPKkkZL._SY88.jpg,,Don't buy it because 10-11 day it will work well after that it start heating more and more ,it is plastik body,Value for Money,heating is normal", "img_link": "https://m.media-amazon.com/images/I/519JHuNt1RL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Bajaj-RHX-2-800-Watt-Room-Heater/dp/B00LUGTJGO/ref=sr_1_17?qid=1672923591&s=kitchen&sr=1-17"}
{"product_id": "B01MQZ7J8K", "product_name": "Prestige Electric Kettle PKOSS - 1500watts, Steel (1.5Ltr), Black", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Kettles&HotWaterDispensers|ElectricKettles", "discounted_price": "₹749", "actual_price": "₹1,445", "discount_percentage": "48%", "rating": "3.9", "rating_count": "63,350", "about_product": "Max 3 differentiators Great Features - i)Automatic Cutoff ii) 360 Degree Swivel Base iii)Single Touch lid locking|Voltage: 230V; Wattage: 1500W. Heating Element:Yes|Warranty: 1 Year, BSNL/MTNL|i) Power - 1500 watts ii) Capacity - 1.5L iii) Material- Stainless Steel iv) Concealed Element|Troubleshooting guidelines: i)Never operate the appliance empty ii) Never lift the kettle from the base when the unit is in operation.|The large opening in the top allows easy access to the smooth, seamless Stainless Steel interior for easy cleaning of mineral deposits|Features : Power indicator light that lights up as it begins to boil water and automatic shut-off after boiling ; Its water level indicator enables you to easily measure the amount of water you need", "user_id": "AGYJ6QNPZV2B6GT2AC4MVSENRPQQ,AHGQK5T2FWW7VSK76KSD6XOP72BQ,AE72VFMVHB7UT4FFROPQ4KJPAAQQ,AFNFRCOPOSSJLZQELMABX23PG4HQ,AGG5AUMCUIQNY4UVAAJCUF4SBIXQ,AETJFXXUOXIZDBIMIPODYJPTTB5A,AH6ZJI3PGOEZ6VHZ6GDE7XLD5KTQ,AH4ODBOTYE45XNPWGDCJX2BJ4ZVA", "user_name": "dgp raju,Amazon Customer,Dipu,Annamalai,prakash srivastava,Ranjeet Pandey,Bk,Narendra Verma", "review_id": "R2HZ5T2XT2798Y,R28I6WAWTMIYM4,R3EU822EF5KFY,RAKJKLDU074QU,RS7UBBKWLI55Z,R27KBQUHQTGHED,R3F2RL6ZJQTR56,RZF02EKCFFWGK", "review_title": "Very nice,Good product,Packaging,Good , quick hot water suite,Good product,A plus kettle,It’s ok,Good product 👍🏼", "review_content": "Good product,Working good. Water is boiling within 2 min. Steel finishing is normal and not shining.,Product is working fine for now but lets whats gonna happen. and yeah the packaging could have done better :),Good, most suitable winter use.,Good product,Review after some month of used. No problem yet. Good Quality..Valuable price.,Okay productGood to handle,Very nice product thank you Amazon", "img_link": "https://m.media-amazon.com/images/I/41XXjVSLyGL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Prestige-Electric-Kettle-PKOSS-1500watts/dp/B01MQZ7J8K/ref=sr_1_18?qid=1672923591&s=kitchen&sr=1-18"}
{"product_id": "B01GFTEV5Y", "product_name": "Pigeon by Stovekraft Cruise 1800 watt Induction Cooktop (Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|InductionCooktop", "discounted_price": "₹1,699", "actual_price": "₹3,193", "discount_percentage": "47%", "rating": "3.8", "rating_count": "54,032", "about_product": "Pigeon Cruise Induction Cooktop Comes with 7 segments LED display for power and temperature. This Induction Stove comes with high-grade electrical that protects against short circuits. It's superior top plate cans with-stand very high temperatures, making it very durable;Smart timer for hands free cooking , Cord length : 1.3 meter. Worktop Material:Carbon Steel, Preset timer - auto switch off , Soft push button, Temperature Control: Manual|Induction Stove comes with 93-percent energy saving technology;Safety Standards: Cruise Induction Stove will start working only when the Induction base Cookware is kept on the top|Included: 1 - Pigeon Cruise Induction Stove and User Manual;Power Input: 220 V and Power Consumption: 1800 Watt|Warranty Description: 1 Year On Product", "user_id": "AFVYGOA4AWO77UIPMUNH6YSKSB5A,AEJMVHQ4LOSVJQ5BOXQREVQBC5RQ,AGZFPOD265HIFGO55KLY54L2IWQA,AFKT7G2UM46AJTJZXWBFXXH36B7Q,AGS6NNHGXGDDXIK4A2KFIXOO3A4Q,AENVIDMF6GS74EEWE2EBBUD3EURA,AHGBW4HBRJEUNLSHM376MUW2QCIQ,AGNGCIEWFRNNNYEDUUFQRBBWAVFA", "user_name": "Amazon P.,Snt,Rajesh,Soniya singh,Md Ramiz Raja,Amit Rawat,Ganesh,TOBIN KERALA", "review_id": "RRHMKA6B4XPL7,RY4GOMU0VCJ6I,R2UUJP85K7YKSM,ROS8J8LJM2XVI,RAIDTB825PVVB,R3OQN6ALK8PU16,R2UQJ0K34UMKUX,R3G0MU15OGGN78", "review_title": "It helps to know about what it can and can't do while purchasing.,Good but slightly slow,Product good but its take long time to cooldown,लाजवाब हे,Good,Value for Money,Piegon induction stove,Good", "review_content": "If you are buying this as a secondary cooking appliance  or you need a portable stove, go for this.Also buy thin induction compatible utensils. It takes a very long time for thick vessels to heat up before you can start cooking.As a primary cooking appliance, this doesn't suit as it's very time consuming. Can be used for keeping things hot or slow boiling milk etc.Also had to request a warranty repair. The request was served within 2 days. The contact information is present on the warranty card.,Just received it. Though the product looks new, there are few scratches here and there making me unhappy.Compared its performance with other induction cook top that I have (with same amount of water at same temperature in the same vessel).Sadly this cook top is a tad slow to boil compared to the old one.But, I think that is okay, because the old one which I have is Rs. 1000 more than this one.,Product good but its take long time to cooldown,कमाल का प्रॉडक्ट हे,Good,Value for Money,Good product.easy to operate,Value for money..", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/411pUp4t0OL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Pigeon-Stovekraft-Cruise-1800-Watt-Induction/dp/B01GFTEV5Y/ref=sr_1_20?qid=1672923591&s=kitchen&sr=1-20"}
{"product_id": "B00NW4UWN6", "product_name": "Prestige PKGSS 1.7L 1500W Electric Kettle (Stainless Steel)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Kettles&HotWaterDispensers|ElectricKettles", "discounted_price": "₹1,043", "actual_price": "₹1,345", "discount_percentage": "22%", "rating": "3.8", "rating_count": "15,592", "about_product": "Content: Prestige Electric Kettle 1.7L with concealed element and detachable power base|Net Quantity: 1 unit : Warranty: 1 year.Water Level Indicator:Yes|Specifications - power - 1500 watts , Voltage: 230V, Material- stainless steel, concealed element|Troubleshooting guidelines - Never operate the appliance empty, Never lift the kettle from the base when the unit is in operation|Specifications - power - 1500 watts, Material- stainless steel, concealed element|Great Features - Automatic cutoff, wide mouth for easy cleaning, single touch lid locking|Includes: main unit, user manual, warranty card", "user_id": "AGQPAKYDQNK56M5SRVNDN4XOEDKQ,AGA3QPDGKGEZFTLXEDT75FTCIVJQ,AEHY4R257RX5JX5BBSG5AHMO6GSA,AGE2X752RF7ALEWIUKXEJLXE65AQ,AGIGNDQO5K5X7LAIW7FW6U4Z2ENA,AERK5QQB3RYTBTTOGUJ5ZR7BD55Q,AEUMBCFNMBKPZ24SALMXIQDSHJGQ,AHHNW3TC4PO5FFOT44YTXIBYQWGQ", "user_name": "Vikash Kumar,PD,ASHISH CHAUHAN,Kush,Tahseer,Imran Khan,Nikhil Anand,MD Altaf Hussain", "review_id": "R2OV4KZZ6XRELD,R2NCVAGOIOJ3T9,R3IT25FXKUMTLG,R11NV4VR04QD1Q,R23TFS98AJGVBP,RLO8C2QNQ5TH,R15DH1CRJ7FWKD,R35TV0FXFCYQ7I", "review_title": "Recommended but not Best,Good,Good product but due to glass lid take care with children,Not 🚫 suitable to boil milk and eggs,It is a nice product,Not worthy of investing,Not good. prestige brand name only,Its difficult to clean and and also from handle leakage takaes place.", "review_content": "This review is after 6 month use of the kettel. Product is good if you need to heat water not milk.Initially there were no issue in Auto cut but last week it stopped working.Overall in this price range i will say Yes for this.,Very useful. My needs are fulfilled. Thank you.,Good product,Product looks good but Boiling milk in this kettle burns the base of the kettle it becomes full black and brown ,And eggs don't get boiled in a single go .,Nice product,After 2 months of usage, some issues have come up. Once it gets to the boiling point, it should automatically switch off but it keeps on bubbling till it is switched off manually. Next is that the water vapors and heat can be felt through the kettle on/off switch which I believe is dangerous. We ordered this trusting Prestige to be of high quality but it doesn't satisfy the purpose.,After using only one month kettle on /off switch is not working and red light is also not working.Some times it's boiling time is too fast and some times too slow.,This catle works good but difficult to clean .", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41J3yWKhnxL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Prestige-PKGSS-Electric-Kettle-Stainless/dp/B00NW4UWN6/ref=sr_1_22?qid=1672923591&s=kitchen&sr=1-22"}
{"product_id": "B01NCVJMKX", "product_name": "SHOPTOSHOP Electric Lint Remover, Best Lint Shaver for Clothes,Lint Remover for Woolen Clothes ,Lint Remover for Sweaters", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|LintShavers", "discounted_price": "₹499", "actual_price": "₹999", "discount_percentage": "50%", "rating": "4.1", "rating_count": "4,859", "about_product": "Smoothly takes off the lint from fabric suitable for sweaters, woollens, blanket . Timely clean the lint box . Great fabric grooming tool durable. Good quality material. Portable, easily fits bags. Lightweight elegant handle design. Skid proof design easy to operate..|Please clear the blade area and fuz container after use ..|Superior quality product SHOPTOSHOP Electric Lint Remover, Best Lint Shaver for Clothes,Lint Remover for Woolen Clothes ,Lint Remover For Sweaters|After using lint fuzz remover sweater will look just like new|Smoothly takes off the lint from fabric suitable for sweaters, woolens, blanket", "user_id": "AGTBYZOGBXCBMYG2AN7LT4WYRZRQ,AFDWZMVLTXWWCX2UZVGVO5JLXCYA,AFXVKJMZW54XSXP6CQHUWEDPUDEA,AG4W4DLB7L3TFL5MDB7P465HOLDA,AGVEAOLFUM3KCYMH2CDHGD2NKGVA,AENJD2WI3N6QPTI4MTSQ5JABLCHQ,AFDV7XXJCNSWA3R466A2OB6WX66Q,AE4WFHYQM5DHVK4TJMYABWXRPMHA", "user_name": "Jagroop Singh,abhilash g.,gagan deep singh,Akshay Tibrewal,Priyanshu deval,Amazon Customer,Satinder kumar Gautam,anuj saxena", "review_id": "R2MP2RC761IOHP,R2ZSKNB3CB2RWC,R35EVJOKZHKDLL,R2HBA84L1S9KKW,RDWMFBKOBMYGY,R2Z9AE3YXBSR2C,R30A4W4FNOBF2H,R3MS03C3MG2C7C", "review_title": "Serves the Purpose,GOOD TO USE but price is high,Does the job well,Go for it.,Good product,Very good product and life saver in winters,Easy to use,Solve the problem of lint on woollen fabrics", "review_content": "The lint remover actually removes the lint :). It is not a gimmick but an actual working machine. it gives new life to the winter clothes which were of no use due to heavy lint all around. Using this small machine you can remove lint and see the difference. I used it on 2-3 clothes and am very happy with the result. Let me describe the pros and cons:Pros:1. Very easy to use2. Removes any kind of lint3. it also removes lint that is not visible i.e. of the same color which gives rough look to the cloth making it look older. so your clothes look a bit like the new ones.4. lint is collected in a container that is easy to cleanCons:1. The process is very very slow. you need to move the machine on the cloth surface a number of times.2. the build quality is plasticky like cheap toys. it may break if fallen on a hard surface.3. the cable length is very small. The plug comes off the socket easily. you need to sit very close to the socket making it a bit difficult to use sometimes.4. the lint collector comes off very often5. the rotor blades make a weird noise as if they are going to break.6. the BIGGEST PROBLEM is that you need to sit for prolonged periods to make your clothes lint-free which strains your neck badly and if you are suffering from cervical then forget it. you will use it once and will never touch it again. however, you can make an arrangement to hang the clothes on a wall hanger and remove lint by keeping your neck straight.other than that it is a good product and can be tried.Thanks,product is good overall, working fine but the seller should pack it more carefully as i received the upper detachable part in a broken condition as it is  non replaceable makes it more difficult for the customer,but coming to the working part the product quality is good, wotks fina and removes everything easily.a must buy product for winter.,I have used a similar product earlier but this one works better and size is also very effective, using is very ergonomic and like I said, does the job well. Come with a small brush to bruah off samll residue on the fabric. Would recommend buying this. Delivery and packaging was good too.,Easy to clean easy to use. Does the job. Received the product fast and in perfect condition. There is a leaflet inside promising 6month warranty. If it provides that it's teh perfect product for this price.,This is very product it cleans all lint from my woolen clothes but it have 1dislike store area is very less and slim it have problem for cleaning store area and the product is very good,This is very good. Life save in winters to remove lint from your costly winter wear. I have used it on some heavy lint area in my inner wear and it’s really removed the lints and now I can wear my inner again.,product is so satisfying and easy to use that a child can remove lint from his clothes. product overall is satisfying expect the the compartment where lint get consolidated it gets loose in every movement,Product is good and solve the lint problem very effectively so go for it", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51MWh9t3Z2L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SHOP-Plastic-Sweaters-Blankets-Multicolour/dp/B01NCVJMKX/ref=sr_1_23?qid=1672923591&s=kitchen&sr=1-23"}
{"product_id": "B00O24PUO6", "product_name": "Orpat OEH-1260 2000-Watt Fan Heater (Grey)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|FanHeaters", "discounted_price": "₹1,464", "actual_price": "₹1,650", "discount_percentage": "11%", "rating": "4.1", "rating_count": "14,120", "about_product": "Meant for Spot Heating; Safety Mesh Grill; 100% Pure Copper Wire Motor for longer life|Room Size: Upto 250 sq ft|Ideal for a small/medium sized room only. Makes some noise due to fan|Non sagging, stitching type and long life heating element|Safety cut-off , Auto-revolving Heater , Overheat Protection , Touch Sensor|Thermal cut-off for added safety|Two heat settings-1000 watts and 2000 watts", "user_id": "AE6PYJAIQ4PNYJNVMWW6NOCP2SPA,AGQBKNH24HGPL3INPZWJQ4GFRDJA,AHWV6EKDNZ7ZGNEPMUJNXT7JHSRA,AFR4RHGUIRKKR7YFRFXHRHPBAEDQ,AETZFDQIFECA7GMZHIA2CHVPLIJQ,AHIP2HW7P357NTKOSI5YIEQVN27Q,AF2QTRAXJNM6RNHLGYYPDJ32KOOQ,AHDQ55QTDUSZWLSZABNYVS34WPFQ", "user_name": "Sandeep,Rajiv,Adarsh Patel,Devansh Hooda,Vikram Babar,Varalaxmi,Shadab khan,Suresh Prasad", "review_id": "R7PI4N37TBENX,R3I2QVDWKPGC9X,R2LQQ6C82WI6BM,R3FO563J6UPF3T,R24CIFW4SYVOYS,RU9KVASNZ0OC3,R1OQURWFW1ZVPV,R2CKGXKYTAVL1F", "review_title": "Best in this range,Product is gud but shipped damaged product but new 1 is gud,Good but should be more better from company,Average product,Does it's job well,Good product,Working this product very smoothly.,Very good much 🙏🙏", "review_content": "This is best heater in this range. Only  You need 16amp socket to use this.,Product is gud to use n easy to handle but it was damaged from the joint as it seems it was opened and/or repaired, also it not in the plastic wrapper in the company box...Yesterday i.e. the next day on 28.12.22, I received d replaced product by d seller n it was well n neatly packed n working quite well.. so I reviewed the earlier rating from 3 star to 5 star...👍,Awesome product, but the packing was worst,very disappointed from Amazon, the box was broken &some scratches also,,This is sufficient for one room use, especially for baby in winter, it's very good at heating the room. Worth of money.,God product,I used this product since January 2022 and now this device working smoothly and very easy.,Lu", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41DwZuxPCaL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Orpat-OEH-1260-2000-Watt-Heater-Grey/dp/B00O24PUO6/ref=sr_1_24?qid=1672923591&s=kitchen&sr=1-24"}
{"product_id": "B07GXPDLYQ", "product_name": "PRO365 Indo Mocktails/Coffee Foamer/Cappuccino/Lemonade/Milk Frother (6 Months Warranty)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|HandBlenders", "discounted_price": "₹249", "actual_price": "₹499", "discount_percentage": "50%", "rating": "3.3", "rating_count": "8,427", "about_product": "✅【Get Creamy Froth Quickly】With a higher speed motor, this milk frother spins quickly and smoothly. It makes best creamy froth with milk heated . Enjoy your favorite coffee with foam topping in seconds.|✅【For Perfect Froth】This coffee frother is powered by 2 AA batteries, it brings creamy froth instantly. Within 1 minute, you get a glass filled with milk foam for your coffee.|✅【Enjoy Your Latte Anywhere】Missing your morning latte when travelling? Just take this portable frother on the road. Small yet effective, easily to make your cafe style cappuccino|✅【100% Satisfaction] We aim to provide high quality product, and stand behind it with a full replacement service. In case you have any issues, just contact us and we will make it right for you, at any time!", "user_id": "AHMFATKIPX3KHDWWE63O3F5UM3DA,AFKMOTBVCZEGAYHCXPFHV4PFTD3A,AGGH7NCERRPXKHPP6E4WC7RFWO4A,AGEWO7FPEHZGQ5BE5EA74C32GCPQ,AF7LH47LBG5ORFG2V4LDGVM7IJQQ,AH7OVX5ZLGYOQAEYLGW6GTEW7DVA,AGZPS6UBMMPBTMNAETWPQEHSXKYA,AEX7B6KZABJXFXZJRIAGCYLDKM7Q", "user_name": "iVan,Priyanka Das,DC,Shivnandan Gautam,Riya Sagar,Ritika,Prabha S.,G MAHABOOB BHASHA", "review_id": "RC4P64ZDVMZCM,R36FWR9CD7IDB9,RZIKHTHHFH1HV,R1TGDKQE54FA2J,RW5C887MDJQZV,R13SM3HJNFXCUQ,R28PNX6EWUIWHL,R28EVOHYE4S212", "review_title": "Working ok, but shape is not that good,Doesn’t froth and creates a mess,Very low power,Product is not working smoothly...after very hard press the button then it works.,Ok ok,Finally!,It would be nice if you give batteries along with product in this price. Thanks,Good", "review_content": "It works as expected, but the shape of the handle is not very comfortable. It is not feeling very handy to hold the device and press the button at the same time, sometimes the battery  door opens while using it.,It’s easy to use but creates a mess when I try to make coffee froth. Doesn’t form froth also. Only runs under liquid.,The frother stops spinning in even slightly dense liquid.,Product is not working smoothly...after very hard press the button then it works.,Easy to use and nice product. But cream stucks in it sometimes,Can finally make frothy dalgona coffee without losing my arm lol worth it! Coffee came out really well and so easy to use,,Good", "img_link": "https://m.media-amazon.com/images/I/31MmLP6awML._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/PRO365-Electric-Coffee-Stirrer-Frother/dp/B07GXPDLYQ/ref=sr_1_25?qid=1672923591&s=kitchen&sr=1-25"}
{"product_id": "B01C8P29N0", "product_name": "Bajaj DX-6 1000W Dry Iron with Advance Soleplate and Anti-bacterial German Coating Technology, White", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹625", "actual_price": "₹1,400", "discount_percentage": "55%", "rating": "4.2", "rating_count": "23,316", "about_product": "R.D. & COMPANY Majesty DX 6 1000-Watt Dry Iron (White)", "user_id": "AEWW4RY2BE6FRKM6CVAJ2Z4ZTR7Q,AHJRPRAXBOIRLYMCRQ4HCACPXDVQ,AFCCVMGUWTBRWJCYRW6PAMN5AXLQ,AEL3F2M663FPAM5NGOPIHDLQLQGA,AGTBHLMFZBZYGUWZPZRHRJVZKZ3A,AHK7J2EVK33WETV524DZPUYL24YQ,AFT2MH26JCXVVBN73QZEFU3ZCQ4A,AEPUWVGQ64XTHKV2C3CFSR5Y34SA", "user_name": "Chittibabu M,Sagarjit,Samiran Mondal,ᴀᴅᴡᴀɪᴛʜ,Ramjan khan,Vijay k.,Ramakrishna Dey,shivani johari", "review_id": "RN09522VLQZIP,RCXEZXWETXG3,R3NJ39MOXXHP2D,R350NLPEFNPHPG,R1P56R44Z4N1H6,R3PQCDKA1JZC5J,RF5IPHWYF1726,R1ABBZP8P5GKQD", "review_title": "Worth the money..,Good product,This is Good,Super product,Good product,Average product but value for money,For daily use,Heat temprature very slow", "review_content": "Light weight. Easy to use. But the Packaging is really problem, I opened with a fear that product might be damaged. It was not thankfully !!  No covering nothing, first time felt very bad on Packaging issue.. need to improve on that,The item just got delivered today. The product specifications says it has 360° swivel cord, but actually it has 180°.  Otherwise the productbis very good. 2 years warranty card present. I will update after usage.,Very Good Couality Iron And Faster Heat And Easy To Handel ,,, Nice product,Light weight,Go for it,My initial experience was slightly disappointing, but after exchanging the product its working well, satisfactory,100% -perfect,According to price good but heating element not heat property not to much heating overall goog", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31ke2NdHJ-L._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Bajaj-Majesty-1000-Watt-Iron-White/dp/B01C8P29N0/ref=sr_1_26?qid=1672923591&s=kitchen&sr=1-26"}
{"product_id": "B08KDBLMQP", "product_name": "Croma 500W Mixer Grinder with 3 Stainless Steel Leak-proof Jars, 3 speed & Pulse function, 2 years warranty (CRAK4184, White & Purple)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MixerGrinders", "discounted_price": "₹1,290", "actual_price": "₹2,500", "discount_percentage": "48%", "rating": "4", "rating_count": "6,530", "about_product": "Powerful Motor - 500W motor for best grinding experience even with tough ingredients like black whole gram (dal) for preparing tasty vadas and dosas; Power requirement: 230VAC, 50Hz|Specialized stainless steel blades helps you to cut even the toughest ingredients and gives the finest paste and purees for daily cooking of chutneys, dips, masalas and pastes; Motor overload protection for safety|3 detachable stainless steel jars with polished blades for fine grinding (Wet & Dry Grinding Jar (0.5 Liters), Liquidizing & Blending Jar (1 Liters), Chutney Jar (0.3 Liters)) and The jars are leak-proof for spill-free grinding experience; Jar Material: Stainless Steel ; Blade Material : Stainless Steel ; Body Material: ABS body|This product does not require installation. Safeguards your motor by automatically shutting it off in case of over heating; Power Cord: 1.5M|Warranty - 2 years serviceable onsite warranty; Manufactured In: India", "user_id": "AGEWFIJDNQ73TIDHQIEMY6PTF7SQ,AGWAYDRCPJOSWY4HN36O4426WURQ,AG3JTK7QUAB6PSV7ECWRFCZCWNYQ,AETCTQA5AB7VTMMOTMZW2HNO264Q,AGBSGY5FA7YYUAR7KJTBGDEZ6TXA,AFIUVXNEPQTVOPLMJ5462QTEWXRQ,AHMTTSRZB6U63UH4TW6J63UXIYEQ,AEFHQZEKUBGETK53T6ASRZZROQRQ", "user_name": "Om Shankar,Praburaj,keertika Banshiwal,venkatesh,Masluddin,Shubham Chauhan,S.Safura,Amazon Customer", "review_id": "R1SSAFQAM97XHV,R131W5582A5499,RDE1ESVYI4CAI,R2RN8NCKNI5DZ4,RRQ95R1ZRK9NS,R3PJ930B4YQATF,R2V2HJSJQBW2CM,R1C7QRPXGO6AI3", "review_title": "Best products,Ok,Short Nd sweet product,Good,About warranty card,Good,Good 👍,It's affordable but cheap quality", "review_content": "पार्टी में फिश बनाने के लिए लगातार लगभग 5किलो लहसुन ,पोस्ता दाना , सरसो तथा अन्य मसाले की पिसाई की,Ok but quality not good,Thoda product small h baki sb mst h,Good,I did not get warranty card,Good for small family.,OK 👍,If you can afford it, go for more well known brands in the mixer business. This one is cheap quality but great for the price.Please note that there's a burning smell for quite a few uses. Also, if you grind for more than 10-15 seconds, it tends to 'trip'. Then you have to let it cool down and push the red button at the base to restart it.You can easily make dosa batter, chutneys etc. Just soak the rice and urad dal overnight since it's not very sturdy.", "img_link": "https://m.media-amazon.com/images/I/41i1uzCEyWL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Croma-500-Watt-Grinder-CRAK4184-Purple/dp/B08KDBLMQP/ref=sr_1_27?qid=1672923591&s=kitchen&sr=1-27"}
{"product_id": "B078JDNZJ8", "product_name": "Havells Instanio 3-Litre Instant Geyser (White/Blue)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹3,600", "actual_price": "₹6,190", "discount_percentage": "42%", "rating": "4.3", "rating_count": "11,924", "about_product": "LED Indicator: Colour-changing LEDs that change from blue to amber to indicate the hotness of the water|Outer Body: Rust and shock proof ABS outer body for long life|Inner Tank: Stainless steel inner tank of 304 grade|Power Cord: Fire retardant power cord for maximum safety|0.65 MPa Bar Pressure: Suitable for high rise buildings and pressure pump applications|ISI Marked and ISI certification|Capacity: 3 liters, Heating element: Copper Heating element", "user_id": "AF7XWA4GXXWKOYLWWKGKZIP5O7DQ,AHDS5LB3MMUPNWTCDQEXTSXOPSOQ,AGNIQYBJFY2NWMGIXJQQRKWAENEQ,AGJVSVELOXYVHW65UU77WNDG45XQ,AFHVZ4KFVKXPO55UNZLOJEQIUQYQ,AFV4TP7EA6GRZX4WZUQTAFBWIR2Q,AE7IAOHK4VD5SU2NV3WDE5Y5TVHA,AEUJMQ7IHJCECNPJLEOKEI4JLDPA", "user_name": "Amazon Customer,Lucky,Pranav M.,Kavin Kellan Kelveen,Yash Tanwani,Amazon Customer,Sunita,SOFTIZON", "review_id": "R1A8JNU8MFLA7O,R2U25KOA2BKH1Z,R2KGC42T422YER,R35EUWKBBEGRNB,R3ATDC4RIULGSV,REILW6738EJTP,R1YLD6RPVA8MU9,R2F1RVL1LCI2S", "review_title": "Worthy, best for bucket bathing:,Water heater that does the job right,Works as promised and the installation was quick..,All good,Good product.,Worthy product to buy.,Easy to install.,Nice product and good service", "review_content": "Worth the penny:Used for 2 days, on time delivery, next day installation by havells and every good installation support from havells.Water gets heating within 5 mins and you have to open half tap for continuous flow of hot water. Sufficient for bucket bathing and the good part is heating indication. One thing is missing in the geyser is Temp control, but overall Best in this price range (3 ltrs).,The product was delivered on time and as promised by Amazon.Upon receiving the water heater, I received a text from Havells for the installation of the product. The installation process was smooth apart from the fact that one needs to purchase a 16A three-pin socket (wall plug not included with the water heater). There are no installation charges and my only gripe with the water heater is no plug!!The water heats up very quickly (5 mins approx.) and retains temperature for good 4 hours. Light indicators show heat stages (Heating or Heated) Even though one will find many alternatives at better prices additional costs for installation and accessories should be taken into account.Bonus marks for getting the design correct.,It's compact yet efficient. Does its job well. I expected a bit quicker heating though. Installation guy came the very next day. All the accessories required was provided in the package.,But light is not working not within 2 weeks,Easy to install. Value for money.,Its a good product in terms of usability, easy to useAll in all its a great Instant geyser product with this price range. Installation was easy and it’s meets our expectations I would recommend this product to purchase.,Easy installation. Purchased for kitchen. Working well.,Nice product and good service", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31991seDfcL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Havells-Instanio-3-Litre-Instant-Geyser/dp/B078JDNZJ8/ref=sr_1_28?qid=1672923591&s=kitchen&sr=1-28"}
{"product_id": "B01M5F614J", "product_name": "Morphy Richards OFR Room Heater, 09 Fin 2000 Watts Oil Filled Room Heater , ISI Approved (OFR 9 Grey)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters", "discounted_price": "₹6,549", "actual_price": "₹13,999", "discount_percentage": "53%", "rating": "4", "rating_count": "2,961", "about_product": "The oil-filled radiator with 9 fins will ensure that the warmth reaches the farthest corners of your room. The thin fins allow the heat to be transferred more rapidly from the heater into the room, raising the temperature in the room in just a few minutes;Adjustable thermostat to maintain desired room temperature. Touch Sensor : No|Castor wheels with mounting plate for easy mobility, Back cover & humidifier;Power selection knob|Warranty: 1 year on product;Power: 2 watts|Includes: Oil filled radiator and Warranty card|Size Name: Standard", "user_id": "AHVZAVZYUTJOGQMHGNQVLQSOJNOQ,AF6ZNHSI6WAZLVT262M2JAHJGLNA,AFPDQ7U6JPPT2K2VW6KANBWLNFAA,AEJKIHINZUORIJHJTKKC4LLSLI3A,AFG4PDUEAAG3L4OYGKZOSPZYY3OA,AFMGKNFQZYEZLDII52VE3BSLNNYA,AFCYURWTX5HHOTUJUFX3TTTWICTQ,AGS7F3T2TCPZLLH6EIC7FAFKKCPQ", "user_name": "S Y,Budhi Tangu,Lukram slim,Naveen Vashisht,Amazon Customer,Amazon Customer,Deepak,Blush Bunny Organics", "review_id": "R352VUE5QTHFFF,R2RC6R2E0OMNQ9,RJ12UME7RFM5D,R22YTLRMKBWQM,R3BTY7HUJDNKG8,R3R812J0VVBD0A,R32X1CLMKWWKDE,R12N4I2XRPP114", "review_title": "Good product and recommend too,Good Purchase,It cannot warm a room of less than 100 square feet,Fan not working,Awesome,Good 9 Fin Oil Filler Room Heater from Morphy Richards,Good product for health conscious people,Really good product, Screws are available under lower thermocol", "review_content": "During winter it keeps room temperature hot which reduced cold. We really enjoy the product,If your place is air tight this 9 fin Radiotor heater will be enough. But my place is not air tight that's why I am not satisfied.,Product could use a user manual.Number of fins required for so and so size of rooms needs to be described,Can not working. We are just using it without fan. Don’t have patience for exchange/return now.,Overall good,Good 9 Fin Oil Filler Room Heater from Morphy Richards. Reduced one star as there is no PTC Fan in this. Remaining all features working as expected.,Good product. Used 10 kWh unit electricity for full night run in Agra with min temperature at 7degrees. Keeps the small 10x10 foot room warm enough to be able to sit in light jacket.Heats up room slowly as expected, unlike coil based heaters. But less danger and doesn't impact skin.Easy to setup the rollers.For a bigger room, go for 11fins model and not 9 fins model.,People who are saying that screws didn't come. Please check under lower thermocol. Screws are there. I raised return request bought new Morphy richards from store and found this thing. So cancelled the return request. I got 2 now because of this issue. Why Morphy richards? Why hiding it away where people are not able to find it?Overall product is really good, please go for it.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31HzCDKv6ZL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Morphy-Richards-OFR-09-2000-Watt/dp/B01M5F614J/ref=sr_1_29?qid=1672923591&s=kitchen&sr=1-29"}
{"product_id": "B083GKDRKR", "product_name": "Havells Aqua Plus 1.2 litre Double Wall Kettle / 304 Stainless Steel Inner Body / Cool touch outer body / Wider mouth/ 2 Year warranty (Black, 1500 Watt)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Kettles&HotWaterDispensers|ElectricKettles", "discounted_price": "₹1,625", "actual_price": "₹2,995", "discount_percentage": "46%", "rating": "4.5", "rating_count": "23,484", "about_product": "Auto shut off function|Integrated stainless steel function. 360° Cordless Kettle|304 stainless steel interior with no plastic|Energy saving, cool touch outer body with no scalding hazard|Wide mouth for ease filling, pouring and cleanin", "user_id": "AE42ODBABKBHKRL2PW5XSBEB2IWQ,AFZVZZKBT4ICJLQIMTJ2ZK44UMIQ,AHZDTJJ7PM3GN33LCJB2YWN4QCZA,AEZ25F4GGF4YOFE6XLJ2SN6TNRGQ,AECUHYUPESWI2DB5JMEZQF77VWOA,AEJJNCWMRDOBBFSPLRZQ6BPGI3OA,AFK3PX2HPROWVOD27NFYCUDWKRGQ,AG67OUXW2WVTJESMZA7F2RPZXWGQ", "user_name": "neeraj vashisht,Krunal Golwala,Sangeeta Yadav,Amazon Customer,koustav,ompal singh,Sunil,A truly Amazonian", "review_id": "R28QM0P3RHPNCA,R2C7MCJCGZE9XH,RBX2T333MBFDW,RGOII6UHDBYOT,RDVZX2VNEXWBJ,RIIJNBY14TAEF,RNHUBO94L9NVZ,R2E1X7DV8KUF1D", "review_title": "Good product,Good Product,Very easy to use but my mom wanted a transparent one,Very good product,4 on 5,overall good,Nice,Elegant & Sturdy!", "review_content": "Good product,The product is good if offer is applied.,Like the way it looks,Very good produce, quality is really good. we've been using this from last 8 months, works perfectly fine.,We've been using it for 2 years and there's no issues yet. We have carried along with us for travelling as I have a small baby. And u need to boil water every now and then. I not only use it for boiling water. We make tea/coffee, boiled egg, boiled apple and also Maggie while travelling 🙂 One star deducted because of the length of the chord.,wire short,Nice,It's awesome!Much more than expected. 👍🏼So elegant and sturdy... Performance is too good... Functionality is great. I loved the size... neither small nor big... It's very suitable and convenient to our family need. Easy to use and carry. This is my first day review after receiving... but I can assess the quality, as using electric kettles since years... Thanks Havells & Amazon ❤️", "img_link": "https://m.media-amazon.com/images/I/31S74o1sCSS._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/HAVELLS-Kettle-Coffee-Boiler-Stainless/dp/B083GKDRKR/ref=sr_1_30?qid=1672923591&s=kitchen&sr=1-30"}
{"product_id": "B097R2V1W8", "product_name": "Bajaj Splendora 3 Litre 3KW IWH Instant Water Heater (Geyser), White", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹2,599", "actual_price": "₹5,890", "discount_percentage": "56%", "rating": "4.1", "rating_count": "21,783", "about_product": "ABS outer body with SS tank|Copper heating element with efficient longer life|Suitable for 6 bar pressure|Unique Weldfree joint in outer metal body|It come with fire retardent cable and neon indicator for heating", "user_id": "AFQCUNSSU6YNN2GEJ2262U55BWYQ,AHBHL7H673C44RP62CLQ7UQASFPA,AEZPAJHK366QB5JCBQNS26MJHZKQ,AHS5BOPH3WRQV2BD4IWZRGDYQVVQ,AE3XNUB7K2MKUGB4H4KY2JY7WVQQ,AHQY4GZWNNMFCUAMF636EUJ6VJCQ,AER5B5J5MQT3PMDDBKQQ5AMBCELQ,AHTQKXAE7KNE4O3RPOSYYJMMGOLQ", "user_name": "Pranesh, Chennai,Pushp Raj,Prakash,hemant,Sunil Mahato,shweta s. sawant,SAPNA,Amazon Customer", "review_id": "R3C9QHHIKL25X,R2GR5HNF37OK9H,R2D3UNSYPKZPEU,RWC90IUA5DUMH,RB3V1I84PKVH4,R12D2U23M2187O,R2TJFFSM0TFRTM,R22G5J4Q8W0QFW", "review_title": "Received used product requested replacement,Good product,Tiny bomb,Very nice,works well, but its a really small tank,Very good,Value for more,Instantly", "review_content": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/615Pfq26J+L._SY88.jpg,Instant warm or hot water. Connection pipes are not provided this time.Due to this the total cost rises up to ₹3000. Previously it was provided with the heater.,Very nice and working well taking 2-3 minutes for 3 liters. For one bath we using twice, means 6 liters hot water. No temprature control and not included connecting pipes.,Very nice,works well. just as described. looks great and easy to installhowever the tank is really small, so it keeps switching on when taking a bath. Especially if u have a shower the pressure gets lower trying to heat it all up,Easy to install and operations,A very fantastic product at this point,Suitable for 2-3 persons", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31zh7GQSkfL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Bajaj-Splendora-Instant-Water-Heater/dp/B097R2V1W8/ref=sr_1_28?qid=1672923592&s=kitchen&sr=1-28"}
{"product_id": "B07YR26BJ3", "product_name": "KENT 16052 Elegant Electric Glass Kettle 1.8L 2000 W | Blue LED Illumination | Borosilicate Glass Body | Boil Drying Protection | Used as Boiler | Milk | Tea | Water & Soup | 1 Year Warranty", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Kettles&HotWaterDispensers|Kettle&ToasterSets", "discounted_price": "₹1,199", "actual_price": "₹2,000", "discount_percentage": "40%", "rating": "4", "rating_count": "14,030", "about_product": "Power - 2000 W|Capacity - 1.8 L|Durable and Long-lasting", "user_id": "AFDP6MHD6SSBGTNIH6VX4FQDKNUQ,AGOYO7V7CGV5RA6ZABQLCA25AA6Q,AH7E646VV2CGNVST6ONFXBGJW3UQ,AEGUITV4JAB3VYFYBCTJPGIHXAHQ,AEGN7HVNZ43GTPKGZMHH2CUDQ6GQ,AEU4KWBPB2M6CZASQ7PZ5GFSYSZQ,AFEX2Y2RWUU2SSU4VYFKNX77YU7A,AEJQYFK5UHOS5NSQUPYPSTE7DRQA", "user_name": "manoj tanwar,Ravi M.,CHAPPA RAVIKUMAR,Shameem Z.,varsha nale,ਚੰਦਨਦੀਪ ਸਿੰਘ ਬਾਲੀ,Sherry,Saket", "review_id": "R2CHW3XC8GDNT5,RFAF6MDWADF00,R23QEG8B7XCK1D,R2S0FMCLE93A6C,R3FVV3CRZDOTB4,R32B17ZRIFM6DK,R3V12FGGUVZMOD,RH6S639ZX7JLT", "review_title": "Great Design , Heating ,Usage ,Easy to clean but doesn't maintain the temperature for long,easy to use,Nice,Works well.,it is a good product time saving.,Good kettle at such price,Beautiful..is the word..very happy with purchase ♥️♥️♥️,Owsm", "review_content": "Everything is fine in this product but the only cons for this product is once you heated water it doesn't maintain that temperature and gets cold very soonother than that everything is great like design , heating ,usage ,easy to clean,good to use,Nice product,The only problem with this kettle is that you have to restart again and again,good to use and time saver.,Overall good. Other features could be added like keeping warm. Apart plastic body can be improved,Product works efficiently..the blue light is truly amazing..only pblm is with cord length..which is short... otherwise...it's a nice product ♥️Thank you Amazon once again..,Good for home and out of home useVery fast response for hot nature", "img_link": "https://m.media-amazon.com/images/I/4150hW2kHwL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/KENT-Elegant-Electric-Kettle-Silver/dp/B07YR26BJ3/ref=sr_1_29?qid=1672923592&s=kitchen&sr=1-29"}
{"product_id": "B097R45BH8", "product_name": "Bajaj New Shakti Neo 15L Vertical Storage Water Heater (Geyser 15 litres) 4 Star BEE Rated Heater For Water Heating with Titanium Armour, Swirl Flow Technology, Glasslined Tank (White), 1 Yr Warranty", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|StorageWaterHeaters", "discounted_price": "₹5,499", "actual_price": "₹13,150", "discount_percentage": "58%", "rating": "4.2", "rating_count": "6,398", "about_product": "Copper element with efficient longer life|Suitable for 8 bar pressure|Unique Weldfree joint in outer metal body|It comes with Titanium glass lined enamel coated mild steel tank|Installation is not provided free by the brand", "user_id": "AF4RZTGOIDIWKKEFQWE3PIURRV2Q,AG4ATWAPS6UTAKDEZLP43YRIHKVQ,AG7WPF7DVFD23RMJ7UATEGMI6ASQ,AGQDAPNRFPKXPBX7IO6D5PZ5U6WA,AHHIYGP3CYZMZCQ75JLV6FKKXFYQ,AEONAJKQPOJFD47DLBXAD656UMPQ,AFVVQAUFB2HFUQO6U752FCLT53RQ,AFJXMQS4GNTUM3XD54H5AH62S7XQ", "user_name": "Arijit,RED DEVIL,Nirab,Ritesh Srivastava,Amazon Customer,MUTHUKANNAN R,Y VSREDDY,Shashank Verma", "review_id": "R3F6A5JNIS8BKN,RJIVL7YN5KMKL,R5B8NDUDBMN6W,R23GKZFUJMY8QV,RDYVX68OZFVLI,R1LP0ND0ZDZGGH,R2TF08PD7O9XTJ,R1IDV66IOQUN6C", "review_title": "Overall good performance,No things,Nice product,Good deal with Bajaj . It compact & less area coverage.,GOOD,Fast delivery,Not working,Quality product at affordable price", "review_content": "The product is good for 4 members family. It takes 15 minutes to deliver hot water (temp set to 75%). I have checked that it keeps water temparature intact for 6 - 8 hours if not utilized. Insstallation is eazy task. Overall performance is good till date.,Just ok,Nice product,Its Quite a good deal, I Have been using this for last 1 Year bajaj Neo Shkati 15 lt. , lacking is  Conncection pipe and Haning Bolt and Installation  is not provided by Company.  Other wise a good deal IN Rs. 5300 Festival Sale,GOOD VALUE FOR MONEY,I like Bajaj geyser.  already last 17 years we used only one Bajaj geyser now its second.,Not working,This geyser is a quality product, and can easily serve a family of 4.The water heating does not take much time and there is auto cut off to save electricity. Temperature control also works well, overall a steal deal for price below 6000.Totally recommended for usage.", "img_link": "https://m.media-amazon.com/images/I/31U-ACCgQ1L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Bajaj-Shakti-Heater-Multiple-Safety/dp/B097R45BH8/ref=sr_1_30?qid=1672923592&s=kitchen&sr=1-30"}
{"product_id": "B09X5C9VLK", "product_name": "Lifelong LLMG23 Power Pro 500-Watt Mixer Grinder with 3 Jars (Liquidizing, Wet Grinding and Chutney Jar), Stainless Steel blades, 1 Year Warranty (Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MixerGrinders", "discounted_price": "₹1,299", "actual_price": "₹3,500", "discount_percentage": "63%", "rating": "3.8", "rating_count": "44,050", "about_product": "3 jars liquidizing jar (1.5 liters), dry or wet grinding jar (0.8 liters), chutney jar (0.35 liters)|Operating Voltage: 220 - 240 volts, Frequency: 50Hz 1Phase|The mixer has three blades at the bottom that grinds all your ingredients to a smooth paste or powder ; Revolutions: 18000 RPM ; Material: Stainless Steel|3 speed control motor; Multi-functional blade system|Operating noise levels between 80-90 dB; Initial burning smell is to be expected due to evaporating varnish, which is normal|Lifelong LLMG23 Power Pro Mixer Grinder comes with 1 Year Domestic Warranty from the date of purchase", "user_id": "AFHU7KCA3ZL6XOL3PYSGYJM4LAZA,AESFKEVRHPM6BNLUQT46FFXXXHUA,AH4CB6DJWIC6OY3KIOSDCPJLII4Q,AHGGKBW74PHXCYDZCZL3DQ5ZXYQQ,AEEWA3EFIRGINHXPIZFLU74HKVXQ,AGOJAM5G7KHARFVDHTRDFHZGR2IA,AEXVKGPHYLNTVNLQTB56KSFVNQ5Q,AHNI4MEMANGCZNN7HIVCE73ZLBTQ", "user_name": "shardendu dwivedi,JAYDEB BANERJEE,santosh,Prachi shukla,9625766449,RKPal,Sri,kapil Singh", "review_id": "R13NH1L2MEEDOH,R2EJHR16R59BAG,R3HAH8XOGKHIXW,R17F67QP052I6V,R1ALQKLZ6VYQ60,R1BT7T8Z44ABYG,R2XLWIOFDI6ZSP,R2S1CVBMATHCP6", "review_title": "Overall satisfactory in this price range,Nothing,Noiselesss and good material quality,Pocket friendly,I like this product,Superb item.,Lifelong mixer,Best product by longlife", "review_content": "Overall satisfactory in this price range,We bought more than 15 nos of Mixy but one package did not contain the lids of the 3 jars. kindly arrange to send us urgently.rgdsJaydeb Banerjee,Very nice product,i really like it specifically specifications and price.,Super,Very good product. Absolutely reasonable price. Great.Jio Lifelong.,At this price tag, it is worth mixer with three jars.,Best in this price.", "img_link": "https://m.media-amazon.com/images/I/413sK6yat-L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Lifelong-LLMG23-500-Watt-Liquidizing-Stainless/dp/B09X5C9VLK/ref=sr_1_31?qid=1672923592&s=kitchen&sr=1-31"}
{"product_id": "B01C8P29T4", "product_name": "Bajaj Majesty DX-11 1000W Dry Iron with Advance Soleplate and Anti-bacterial German Coating Technology, White and Blue", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹599", "actual_price": "₹785", "discount_percentage": "24%", "rating": "4.2", "rating_count": "24,247", "about_product": "360 Degrees swivel cord. Steam Burst : No|American heritage coating non stick sole plate|Dual color|Safety plus thermal fuse|Other Comfort Features: Multiple Temperature Levels|Warranty: 2 years on product|Power: 1000 watts, Frequency: 50 Hz, Power Input: 230 V ; Indicator light for on and off ; Automatic Shut Down and Temperature Control ; Cord length: 1.7m", "user_id": "AHWC6QG7WU35GLKYM6XTOTHAXCIQ,AHUMG2C3F47APL74MJHMZGU3GHPQ,AF76BLD2T2D257G2MT7QQIC6TPEA,AGMFUQGKKH2I3HTOGMMFWPKY4UIA,AGHVNRHBJBY3T6MVECCGKYF2E7LQ,AEIC54X2ISV3NK4SBJUMSTJWRMLQ,AGKP6HWXW4AV5DK5A4GJ7EJ4TFUA,AHVOBL5JCW6AGGH3Z34W5I3ZLOZQ", "user_name": "Suri Babu,Sumedha Thakur,Arunava g.,Pratik,Shubham Padwal,Rakesh kumar,Prudhvi Raju,Apurba Pandey", "review_id": "RJRMSM1RS2W29,R1FUD6WTEWE55Z,R4GY3NDK1NKOJ,R38TZP7WV0VCU6,R181U3E7BIFOGL,R2DYRVQL68LUYF,R384I01GDFXYKP,R2PHC69QRUFILG", "review_title": "Good product at this price,An excellent product experience. Does job well at this price range..,Ok,overall good at this price,The Steel around the handle gets hot too!,Light weight product,Nice,A good iron for the reasonable price, tepreture control..", "review_content": "It is very easy to iron but the iron box was too small and there is power off button,its automatically on and off,Amazing product purchased at good price.,Ok,worth product at this price,The Steel around the handle gets hot too! Other than that this product is good.,I am useing this products from 4 month, and  buy the product no loss of money  ,most valuable product in this price range  ,so please buy and uses thanks 👈👈👈👈,Good product,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/711PBdCVuvL._SY88.jpg", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41jBJfPQFwL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Bajaj-Majesty-1000-Watt-Iron-White/dp/B01C8P29T4/ref=sr_1_33?qid=1672923592&s=kitchen&sr=1-33"}
{"product_id": "B00HVXS7WC", "product_name": "Bajaj Rex 500W Mixer Grinder with Nutri-Pro Feature, 3 Jars, White", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MixerGrinders", "discounted_price": "₹1,999", "actual_price": "₹3,210", "discount_percentage": "38%", "rating": "4.2", "rating_count": "41,349", "about_product": "Wattage: 500 W; Voltage: 220-240V ; Revolution: 20000|No of Jars: 3; Jar Size: 1.20 Litre liquidizing jar, 0.8 Litre multi purpose jar, 0.3 Litre chutney jar; Jar Material: Stainless Steel; Body Material: ABS; Cord Material: PVC; Blade Material: Stainless Steel; Speed Control: 3 speed control with incher for momentary operation|Do not worry if you experience some burning smell when you run your mixer grinder for the 1st time.This is due to the motor varnish getting heated for the 1st timeThe problem should not recur in subsequent uses. If it does, please contact Brand Service Centre; Since your mixer grinder runs on a powerful motor, there will be some noise. If the noise level seems abnormal, please contact Brand Service Centre|Since your mixer grinder runs on a powerful motor, there will be some noise, if noise level seems to be abnormal then please contact brand customer support team; Do not worry if you experience some burning smell when you run your mixer grinder for the 1st time|Sturdy stainless steel jars for liquidizing , wet/dry grinding and chutney making|Easy grip jar handles|Multi-functional blade system. Elegant body design", "user_id": "AE23RS3W7GZO7LHYKJU6KSKVM4MQ,AEQUNEY6GQOTEGUMS6KRUEYNXJSQ,AGYPIE5BICV44WEEEPJVEFQOCJSQ,AFR7CEQKWZE53IHHOWBIPAMYKL4Q,AGBV7FBP4SEITF6UKRFKTV7O32IA,AHQVOY54QKPIQZIJ57JKCGQPVV3Q,AEMCVRRD3XQRGFHC2VFCXHJEMESQ,AFBWXU7DUWCIK5MRDCLBXWTWN7ZQ", "user_name": "Mithila Saha,Satyam Raj,Kaneez noori,Pankaj,Ananya saroj,Kishori jha,Anuj,KUSHAL VANWANI", "review_id": "R143O8SM7QE4W5,RQBZ31QLH40O,R3KZC4ST0RAK64,R2PVFA4RIQ1WL1,R2XIVM74HXUSEW,R1C7Q0M8AFXEVH,R3A13PH3SRI7XM,RX58FZYTDEIBU", "review_title": "Just go for it.👍🏻,3 PIN Plug should be there,Mixer is good as well as jar is good.But packing is very bad.,Too much noise,Good quality product......,Good,Nc,Useful", "review_content": "Product is so good but packaging was so bad😠.,Not able to plug JN sockets just because it has 2 pin plug,Packing is too bad. Mixer is good,Except noise everything looks good. Very irritating noise.,I like the product most. Worth for money...Fully sastisfy from this product.. Thanks amazon,Produce noise but good 👍,Nice,Useful", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31rucE-db2L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Bajaj-Rex-500-Watt-Mixer-Grinder/dp/B00HVXS7WC/ref=sr_1_34?qid=1672923592&s=kitchen&sr=1-34"}
{"product_id": "B096YCN3SD", "product_name": "Lifelong LLEK15 Electric Kettle 1.5L with Stainless Steel Body, Easy and Fast Boiling of Water for Instant Noodles, Soup, Tea etc. (1 Year Warranty, Silver)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Kettles&HotWaterDispensers|Kettle&ToasterSets", "discounted_price": "₹549", "actual_price": "₹1,000", "discount_percentage": "45%", "rating": "3.6", "rating_count": "1,074", "about_product": "Stainless steel body, concealed element and single touch lid locking|High capacity of 1.5L, ideal for tea and coffee ; Operating Mode: Corded ; Heating Element: Concealed ; Water Level Indicator: No|360 degree swivel base for usage convenience|Over-heating safety protection|Automatic cut-off when water has boiled to ensure safety and power saving|Power: 1500 watts; Operating Voltage: 220 - 240 volts|Includes: Electric kettle and Warranty card", "user_id": "AHM4ZOXDCO5UNP4WQUXKP4NWX64A,AGHJ3BRARYIXJRGPKDIOLJYK4U2A,AFPA2366UQ6OXRQN6CDE6GBLHHIA,AG7C4WOSISFMNRWDAGVEOHVNUYSQ,AEN7C6UI4MTHHJN4TQDCCHDDJC3Q,AG57LS7SGNITPOERH5OV4VQHSVJA,AEQX24T5VMQGIZE6EZ3F5LKQP6EQ,AFP3BW7UQEWCU2KNQEJDKWTCDXRA", "user_name": "Kiran jot,Salman Ahmad,Neelam Rawat,Nawaz Akhtar,Jitu,Saikat Bose,Toshit D.,satisfied customer", "review_id": "R2QR5PM0ELMWD3,RZFX345XRS4V2,R352PKGSDAV1AW,R1ADWIR5IE7VTW,R3MBQFNM21T9KF,R1SOOON7GH1FJU,R3JFY66W19993Z,R2T4620MS8F12N", "review_title": "Well over all iits nice, make sure the lid of kettle has stell casing,cord should been long,Product is ok.,Product,Easy to use,Good,Good Product.,Product body looks week . Hope it stays long .,Good looking but not very strong. What else can you get for 499", "review_content": "Well over all iits nice, make sure the lid of kettle has stell casing,cord should been long,Cord is very shortWeight is okEasy to use,Wonderful product...easy to use....go for it,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71uxqREChTL._SY88.jpg,Economically good product,Good Product,Overall product good & value to money . Hoping it works well as its body looks a bit week,Mine did not work so had to be returned though", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41h9kA2Tt7S._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Lifelong-LLEK15-Electric-Stainless-Warranty/dp/B096YCN3SD/ref=sr_1_35?qid=1672923592&s=kitchen&sr=1-35"}
{"product_id": "B09LQH3SD9", "product_name": "Lifelong LLQH922 Regalia 800 W (ISI Certified) Quartz Room Heater with 2 Power settings, Overheating Protection, 2 Rod Heater (1 Year Warranty, White)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|ElectricHeaters", "discounted_price": "₹999", "actual_price": "₹2,000", "discount_percentage": "50%", "rating": "3.8", "rating_count": "1,163", "about_product": "Power : 800 Watts (with 2 Power settings – 400 Watts and 800 Watts)|Meant for Spot Heating; Voltage/Frequency: 230V/50Hz/1 Phase|Powerful and Stylish Room Heater for Room Size: Upto 150 sq ft|Safety tip over switch cuts off the heater in case it tilts or falls|Designed for low power consumption and silent noiseless operation|Cord Length (in meters : 1.5)|Country of Origin: India", "user_id": "AHFAYARHKASPMG7VH6BITH7O52SQ,AE7XJTRAUD7W4BJAEVEKHQ5GDJIA,AG6SHJNJ2HSGSXQLN3COPFEMZ7UA,AHFLEWWPES5LH4ZHJGDJ7OJR2Z7A,AGQRMUQ4NGNWNHTYIPKAKIDKCFMQ,AFCRKUO577ZOIVRSZNAU4PXSM2ZA,AGSDGCCAX3E4CZSREKNHJSIKKYWA,AHTHQNIPIGKQNVMT2PV4MGD5OZJQ", "user_name": "divya,priyanka sahi,vivek sharma,Syed Z,Shivi,Ramesh REPAKA,Varun,saurabh", "review_id": "R2OBP2X45UMKY,R1G8BV220OV6QB,RSCD0432EVS8F,R2UUNBV2RXZFTV,R19ESU0Z989JZ,R20ZKROW9KONFG,R16LDZIOWBV5AK,R2A0LOXVERHXL7", "review_title": "Impressive in first use,SUPERB IN ALL DEPARTMENT. BEST IN THIS PRICE RANGE,Nice product,Worth the price,It is value for money but I don't think it will last very long...,The dizion is good and comportable.,Good product,Durability may be an issue", "review_content": "I have just received the product within One day delivery... Service was very fast..The product is economical and works well. I have already used other product from Lifelong Brand and they worked perfectly so really happy with this Brand.,My mom loved it. It's tiny but SuperPerformer,Producing heat upto 1 or 2 mt.Room can get heated up with in 30 min.,Value for Price Paid, It's working good so far 1st Day,Hardly used it a week and I notice dark bands on the elements....!,Very comportable to use.But defect of safety device's,https://m.media-amazon.com/images/I/51gF-cDgkfL._SY88.jpg,Durability is an issue", "img_link": "https://m.media-amazon.com/images/I/51DxyRgcEdL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Lifelong-LLQH922-Certified-Overheating-Protection/dp/B09LQH3SD9/ref=sr_1_36?qid=1672923592&s=kitchen&sr=1-36"}