{"product_id": "B09C6HXFC1", "product_name": "Duracell USB Lightning Apple Certified (Mfi) Braided Sync & Charge Cable For Iphone, Ipad And Ipod. Fast Charging Lightning Cable, 3.9 Feet (1.2M) - Black", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹970", "actual_price": "₹1,799", "discount_percentage": "46%", "rating": "4.5", "rating_count": "815", "about_product": "Supports Ios Devices With Max Output Up To 2.4A|Up To 10, 000+ Bend And 10, 000+ Plugging And Unplugging Test Ensure This Cable A Longer Lifespan|Ensure Fast And Stable Data Transmission Up To 480 Mbps|2 Years Warranty|Compatible Designed To Work Flawlessly With Mfi Or Apple Devices, Iphone, Imac, Ipad Etc|1.2M Tangle Free Durable Tough Braiding Sync & Charge Cable", "user_id": "AFNYIBWKJLJQKY4BGK77ZOTVMORA,AFCTNNMP2LZLY5466YJ5AY3JE5ZA,AG3XBWOAL65DJSBHJ7LQ2K54HJKQ,AF2ZFMLJS4UBCGZO4FMJTEPP6MHA,AFBZMRHC4GXUU7KNAK4OBKORDF6Q,AHSIQL276K7X2UP72QOOOWNVRSXA,AF3D6X5NQWOBOEVVH2Y37N55AKZQ,AFWOTSQXCQJLZ653Y7ACEZADKGYQ", "user_name": "Prasannavijayaraghavan G.,Preet Sikka,Theeban Raj,Nishikant,Gurpreet S.,Manoj,SP,Ashutosh", "review_id": "R12D1BZF9MU8TN,R32MNCWO5LGFCG,RZU3UK8OZKD6X,R3BSTKR3JUW6GY,R1ARVYPXS4XPB7,R1V6GDYE2IBX8O,R28EG2PXZTJL90,R2SQNU7OIOOLHT", "review_title": "Good cable for car,Good substitute for orginal,Better Value for money Product,Way better than the original,Absolutely amazing.,Namm hi kafi hai,Very good,As the names say Durable cell it a durable cable ;-)", "review_content": "I trust this product! Works well with car play!,Very good quality and charging is fine. As good as original,Build quality is awesome, best lightening cable ever seen, better than a official  lightening from If ur looking for a cable close your eyes and go for it 🔥 or you can buy a (Amazon basics) one I was using that for past 3 years that a bit a cheaper side, I recommend both these cables had better build quality and value for money,Gr8 product overall,Just loved it, very good charging speed.,,Good quality,it well packed, all sealed coveredthe wire looks of a very good qualityrecommended!!!!", "img_link": "https://m.media-amazon.com/images/I/41TZJiPRRwL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/DURACELL-Lightning-Certified-braided-Devices/dp/B09C6HXFC1/ref=sr_1_126?qid=1672903001&s=computers&sr=1-126"}
{"product_id": "B00A0VCJPI", "product_name": "TP-Link TL-WA850RE Single_Band 300Mbps RJ45 Wireless Range Extender, Broadband/Wi-Fi Extender, Wi-Fi Booster/Hotspot with 1 Ethernet Port, Plug and Play, Built-in Access Point Mode, White", "category": "Computers&Accessories|NetworkingDevices|Repeaters&Extenders", "discounted_price": "₹1,469", "actual_price": "₹2,499", "discount_percentage": "41%", "rating": "4.2", "rating_count": "1,56,638", "about_product": "Range Extender mode boosts wireless signal to previously unreachable or hard-to-wire areas flawlessly|Miniature size and wall-mounted design make it easy to deploy and move flexibly|Easily expand wireless coverage at a push of Range Extender button|Ethernet port allows the Extender to function as a wireless adapter to connect wired devices|Tether App allows easy access and management using any mobile device|LED Control function includes a Night Mode for peaceful sleep", "user_id": "AG2X6MXVRQJD5VE7SYKNUNWVOQRQ,AHHZNQQE76XX2RN65TJO57ZXDDLQ,AGQ36NZXZMWU5W2JFXIK5GCM4MUA,AFBV4HQOSFPQYP63ELMOYRE32V6A,AH6SINCM4KQ3L4MEBRPK3MNHX6HA,AHSLNF7XKYX4LHL3JCCWY2KKNEAA,AGNSJO5LAO5FKSHPW3UDKZQLPONQ,AGSA37ZLXWHMSL74K3NMUHKGHWXA", "user_name": "Satya Sai Behera,Ashwanth G Kumar,Chetan,Shefali agarwal,Amazon Customer,ANIL G.,Rishi,Abishek kb", "review_id": "RU4VUDDZCAKWJ,R3F278LDDKWR82,R1NBKTUA3TDF0X,R1SXNGZHUU7T1A,R19G9M4DV85UZR,RI0WQOZ9OHFQR,RMHY4XGSZT7UR,R84PM9B4EXEQX", "review_title": "Okay to use,Worthy product ...!!!!👍,Single band. 2.4 ghz only,Difficult,Valued for money,So far all is good,Ok,it’s for 2.4Ghz", "review_content": "It's a china product to be clear. Look and feel is good. Base of the device is little wider, so if you have 3-pin socket points consecutively then ysing the next socket could be difficult.The wi-fi signal strength is good as extender but it reduces internet speed. For example my internet speed is 30 mbps which I get if directly connected to my primary router / network. But if connected through extender it downgrades to 18-19 mbps. Overall okay to use. I would have been happy to see a made in India device as the price is also not very low, but unfortunately India is not manufacturing any.. it seems.,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/716UbI+jJjL._SY88.jpg,Single band is an ancient technology.This device will supply only 2.4 ghzThat means 5ghz will not be available in your room where you choose to use this.,It was difficult to use and install at first, after that it’s been working perfectly with great signal strength!,It is a good product valued for money but I think it should be sometimes give low speed,I wish I could have ordered dual band ...But so far it's giving satisfactory service,Working fine,Product is ok but it’s only for 2.4ghz mistakenly got it", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/21n1BGPOHBL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/TP-Link-TL-WA850RE-300Mbps-Universal-Extender/dp/B00A0VCJPI/ref=sr_1_127?qid=1672903001&s=computers&sr=1-127"}
{"product_id": "B00UGZWM2I", "product_name": "COI Note Pad/Memo Book with Sticky Notes & Clip Holder with Pen for Gifting", "category": "OfficeProducts|OfficePaperProducts|Paper|Stationery|Notebooks,WritingPads&Diaries|Notepads&MemoBooks", "discounted_price": "₹198", "actual_price": "₹800", "discount_percentage": "75%", "rating": "4.1", "rating_count": "9,344", "about_product": "It is a diary style desk organizer,memo note pad with a closed size of 7.5 X 4.5 inch appox|It has 3 sizes of sticky note pad & 1 pad of loose sheets with clip holder and a pen|No. of sheets in sticky note pad of yellow(appox size 4 x 3 inch ) ,pink(appox size 3 x 2 inch ) are 50 approx|No. of small strips / flags (size 2 x .5 inch ) are 20 approx.Each color and no.of loose sheets( size 7 x 4 inch ) are 50 apprx and the colored small stripes/flags will be arranged randomly|Colored stripes and pen design is indicative and might show slight variations", "user_id": "AENFXWHBX7R7PZG2Q67PXLFGPHAQ,AESZWZDE27MOGUHBRLCLXLVPGAFQ,AG4UQP4EKBXW3ZFQFIEGYNY2UHWQ,AFOLBZKWUZVF4PQ33ISHI3DEFDUA,AFV6VAGYLU35VYPDF7TN4ZJOCTWA,AGA4MZI3ZKNPYUXSJ5OHUNI7EJPA,AFJCL4S4SSCDXKTSMZJQ7DWNWQBA,AFRUA3JDKXTUMZLL7DF6FA632JVQ", "user_name": "Ghazal,Vishwajeet,PREETI RAWAT,Karthi,Punjal s.,Anjali,Amazon Customer,jezz.ralte", "review_id": "R1XME75YUKM2OB,RZ4IS44C3AS2F,RDD5TKKRXAHI6,R3IYQJAV7Z3IIJ,R1OUFD8RNQEGRO,RUTSM8SFB6IK1,RD1I9V3J84SRN,R19Y060OGX1449", "review_title": "Multipurpose and time-saving,Good notepad for travelers,Nice for the personal stuff,Super 👍,Most amazing product.,Too costly,Useful product,Good", "review_content": "Compact product to use during travels or even at home. I don't need to search for different items. I can just grab it and use it for multiple purposes. Go for it!,Good for taking notes and reminders in a single pack.,This is especially for those who are used to be more comfortable to be organised.,Nice product,You can carry it with you anywhere.... There is no need to worry about space. You can makea list make a note and absolutely you can re-use it.,Product is good indeed I wanted to buy it for long but it is costly,,Today i received my package and yeah it is really cute.Not fully satisfied with the cover but overall its good. Worth it. It is all in good condition and it also comes with a pen too.  Really recommend you to buy ut.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41oLhpKArFL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/COI-Sticky-Notes-Holder-Gifting/dp/B00UGZWM2I/ref=sr_1_128?qid=1672903001&s=computers&sr=1-128"}
{"product_id": "B00R1P3B4O", "product_name": "Fujifilm Instax Mini Single Pack 10 Sheets Instant Film for Fuji Instant Cameras", "category": "Electronics|Cameras&Photography|Accessories|Film", "discounted_price": "₹549", "actual_price": "₹549", "discount_percentage": "0%", "rating": "4.5", "rating_count": "4,875", "about_product": "10 sheets of Instax film compatible with Fujifilm Mini cameras- Mini 8, Mini9, Mini 11, Mini 90, Mini 40, Liplay and Mini Link Printer|Mini films comes with superb grain quality which produces vibrant colors and natural skin hues.|Press the button and capture your moment of joy which develops instantly into beautiful pictures.|Film size - 54(w) x 86(h) mm|Picture size - 46(w) x 62(h) mm|Number of prints - 10 per pack|Country of Origin: Japan", "user_id": "AHVAI77H64YMRRMLITKJ5FPYALPQ,AGRSF3JCWR3L4M2GULFI4A4KCZKA,AGBRAMADVM5J4BNY7O4WWXMTYEBA,AHX5AFYII54YJY4XSBZU3HV2PN2A,AFTD5SG4EQFZYMU5MFGH4URN6PKQ,AEESPVBBOGON4LQB5OV3CCXNRKJQ,AG4FDTJABUWBNHOQZ6CDMPEV5VFA,AE637NV55PORSWGNKW547AAOV3VA", "user_name": "Nidhi,Nilanko Halder,Seenu,Daring Darcy,Vivek L.,Arpan Seth,Rajiv Ratta,MUKUL", "review_id": "RPGQI0SP1LWQD,RQ38JN12KFAGP,R3HYEK5C8SAQU7,R3B1AQRLPRCM0G,R2ZAAKRLUZBNOY,RINQEFDY3172H,R3S8DLWTVTZT74,R2889VE9YMT0EZ", "review_title": "The quality is surprisingly good! Happy with the purchase!!!,Perfect,Good,Good product! Original stuff with exp date 2024-05! Worth the money!,Could get used to it,Good,This product should not be played with fiddle with it or or open it roughly,Cool", "review_content": "https://m.media-amazon.com/images/I/6171Cw2IlPL._SY88.jpg,100% genuine and perfect product.,Good,Worth the money as its a fun experience to use instant cam!Product is original with good packaging!,The top most amazing feature is it makes pictures look like the old 80’s.. but one problem is few don’t develop at all.,Nice, as per expectations,This is bad after 1 month,Okay productWorth the purchase.", "img_link": "https://m.media-amazon.com/images/I/51fEftU7HAL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Fujifilm-Instax-Instant-Fuji-Cameras/dp/B00R1P3B4O/ref=sr_1_129?qid=1672903001&s=computers&sr=1-129"}
{"product_id": "B0B3MWYCHQ", "product_name": "Fire-Boltt Ring 3 Smart Watch 1.8 Biggest Display with Advanced Bluetooth Calling Chip, Voice Assistance,118 Sports Modes, in Built Calculator & Games, SpO2, Heart Rate Monitoring", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹2,999", "actual_price": "₹9,999", "discount_percentage": "70%", "rating": "4.2", "rating_count": "20,881", "about_product": "Fire-Boltt is India' No 1 Wearable Watch Brand Q122 by IDC Worldwide quarterly wearable device tracker Q122.【Bluetooth Calling Watch】- Fire-Boltt Ring 3 enables you to make and receive calls directly from your watch via the built-in speaker and microphone. This smartwatch features a dial pad, option to access recent calls & sync your phone’s contacts.;【1.8 inch HD Display】- This smartwatch has a 1.8” TFT LCD Full Touch Display with a 2D High Hardness Glass for super protection and a high resolution of 240*286 pixels with a Rotating Button for smooth usage|【118 Sports Modes】- Be your own coach while you can track over 118 sports mode with professional analisys. 【Real Time Health Tracking】- With an advanced intellegent algorithm combined with optical heart rate sensor to monitor your heart rate all day, even during exercise. Track your blood oxygen (SpO2) levels and indicate a healthy life;【Full Metal Body】- This watch is long lasting and durable with its metal body feature 【Voice Assistant】- Command your mobile phone with your smartwatch, the watch has a voice assistant built in to make work easy and fast|【Built In Mic & Speaker】- Enjoy listening to your favourite tunes on the watch and experience HD Calling through the built in Mic;【Smart Notification】- Get all your mobile phone notifications on the watch and stay updates about trends, meeting emails and much more. 【Remotely access smartphone features】- Click pictures, change music tracks on the watch with a single touch.; 【360 Health Ecosystem】- With this watch track your heart rate, calorie, step count and multiple sports modes with easy touch;【Play Games On Your Wrist】- Play 2 mini games in your pastime or leisure time.|【Multiple Watch Faces & Smart Controls】 - The Smartwatch has multiple Watch Faces;【How to activate Bluetooth Calling】- To enable Bluetooth Calling Function, first connect it to the compatible app. Once connected, manually go to the phone's Bluetooth settings and pair this smartwatch (Bluetooth Name: BSW043_Phone). Upon pairing, you will get a notification: Connected for calls and audio.|Compatible Devices: Smartphonetablet; Case Material Type: Stainless Steel; Band Color: Black; Color Name: Black; Band Material Type: Silicone; Included Components: 1 Smartwatch, 1 Manual, 1 Magnetic Charger, 1 Warranty Card; Clasp Type: Tang Buckle; Human Interface Input: Buttonstouch Screen **Disclaimer** The Charging USB needs to be connected to a 4.7V to 5V charging adapter for best battery backup|【Superior Battery】- Charge the watch for 90 mins merely for 3 days of exquisite battery life.Band Width:20 millimeters.Water resistance depth:1 meters", "user_id": "AHZNSNBVKQR4OGJAQHE4DCDA4YHA,AFBW6COTZXGHQMWVDUOSXVUCCIHQ,AFFRU7QVLXG4LNG6JKQKJ23KBA2A,AF5E74KNXXYBJVMG7HUYXNRNYY3A,AF4F4SKVD2UU7ZBJFZNNBK7ORIGA,AF3IVRFFILSUOKAXKRZBFBDRF7MQ,AF23WB7B2XKLYCA3KXEGKSBWYKOA,AHAJNAQDV3BHN5AYLY3LOWFJCS6A", "user_name": "Anirban,Abhi Khaire,Sachin,Tanisha bhoir,Jitendra vishwakarma,Archana,NILESH,Ajay", "review_id": "R1AIQQLE21YDXS,R26ABOIUJ8UXJ7,R93L2MCBC4Y90,R2GDAM50Z413JN,R16TI1N60Q41BB,R1UEYEMD03OA5C,R16D88E4TNGL3M,R1WSNRYZ7VK0KB", "review_title": "pocket friendly  smart watch for people who loves large  screen.,Value for money,Value for money product,My watch is not charging,Service,Good but it's not working now,GREAT PRODUCT....,Good product", "review_content": "Smart watch is good with proper large displayvoice assistance siri for iphone userscalling facilityface time facilityOne deficiency that you are unable to message or type text in WhatsappIf you have small wrist dont go for it or else its a perfect choice for your loved ones.,This is the first time that i have purchased a smart watch. A good watch for newbies like me with lots of amazing functionalities. Apart from that, this watch is a value for money at this price range. The sleep tracker works decently well, could have been better. We can call directly using the watch, i like that feature well. Need not reach for phone everytime. The screen touch is also well. There are lots of watch faces which you can change to or upload one from your own galary which is a plus point. The product looks exactly as shown in the pictures. The calorie and heart beat tracker are also quite accurate. The watch is a bit uncomfortable to watch at times, but otherwise the straps are good and strong,I have been using this watch since a month and its really great. All features are working quite well and connectivity with phone is also good.Screen quality may be improved.,Actually my smart watch BSW043 Ring 3 is not charging 2 to 3 days. It's off I tired to msg fireballs but it alway say to follow our page on Instagram. And when we follow its shows you their new offers. I don't know what to do now. I just submitted the warranty form.,The watch worked for the 2-3 Months and got switched off automatically and Rear Panel also got opened automatically..,I didn't charge it for 2 days, now after charging also it is not getting on,I have been using this watch since a month and its really great. All features are working quite well and connectivity with phone is also good.,Product quality and look was good but have some issues after few months usage", "img_link": "https://m.media-amazon.com/images/I/41ziJKWj9LL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Fire-Boltt-Bluetooth-Assistance-Calculator-Monitoring/dp/B0B3MWYCHQ/ref=sr_1_130?qid=1672903001&s=computers&sr=1-130"}
{"product_id": "B09DG9VNWB", "product_name": "Samsung Galaxy Watch4 Bluetooth(4.4 cm, Black, Compatible with Android only)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹12,000", "actual_price": "₹29,999", "discount_percentage": "60%", "rating": "4.3", "rating_count": "4,744", "about_product": "Only compatible with Android Smartphones (Runs on Wear OS Powered by Samsung)|Bioelectrical Impedance Analysis Sensor for Body Composition Analysis, Optical Heart Rate Sensor.|Health Monitoring features such as Advanced Sleep Analysis & Women's Health.|Enhanced Fitness tracking lets you track 90+ workouts; Enriched App availability and connectivity with Wear OS, Powered by Samsung. Typical Usage Time (Hours): up to 40 Hours.|Connectivity Technology: Usb; Item Type Name: Smart Watch; Included Components: ‎Galaxy Watch::Watch Strap::Wireless Charger::Quick Start Quide", "user_id": "AEPLUJYB5UT2XVP7A2NSNSCOCVLA,AEM3SCJOCJZZLGUXTB75C57SOVNQ,AEBRBDIZFIWDBOXITGLYRRSVZBTA,AF3GJDKWGWNKAWFJPJWX5GB75VHQ,AGCDYE3ROZ5D6RN2F6OGXL4I72RA,AEXQ4SRRBRCQ6ZBY2R2Y3FP7YCFA,AF6ME2VTJURUMEZJMGCC27XEYDPA,AGFPWV2V26QRXMWUSTSGYQRVLW4Q", "user_name": "Kshitij D.,gaurav agarwal,Brijnandan Singh,Div j,Sarath Ramesh,Yatindra A.,RINKAL PATEL,Kumaresan", "review_id": "R3KPZ8P5M4PG72,R2HSDBDLRKBOC0,R2EI8C7FUKOSDO,R3BRLV8FDVV6QB,R1YHHQ223HBPE9,R2UAVXBGV8WK3N,RPTZZYC6X5HF,R327KYMPRK1R5H", "review_title": "LTE features (no other feature tested),Decent watch,Good not great,Great watch let down by battery life,Good fit, good apps,Wanted faster charging and better camera feed.,Mobile app Needs to be improved facing connectivity issues,Good", "review_content": "When I purchased this watch, I thought it couple be used to send sms, make calls, access notifications without being connected to the phone. I knew that third party notifications required the phone to be connected to the internet, but I thought the watch could place calls and send texts even if the phone is switched off. The product I ordered can only make calls when disconnected from the phone. Features such as SMS (surprising since this is an LTE version) and notifications (this includes watch apps such as outlook) that require internet are only synced with the watch on e it is connected to the phone VIA BLUETOOTHI did not check other features as the main reason I ordered this watch was accessibility to notifications without phone.,I have been using this since June'22. It looks good on the wrist,and has all useful features like calling,reading and replying whatsapp messages.The battery is too low though, I keep it switched off at night(I.e. never used it to track sleep), yet have to charge every couple of days. Plus it gets charged slow.,All features of the watch is good but battery backup is very poor. After full charge it runs 36-40 hours but after average uses it will run 20-22 hours only.,It's amazing with the lte function now I don't lug my phone to the gym!! But the battery life sucks and have to charge twice specially when I use lte ,also it heats for some reason and needs to cool down once in a while that time the watch automatically goes into hibernation and starts after some timePositives areAccuracySleep trackingO2 monitorRemote lte connectionWears amazing on the wristGreat screenNegativeBattery life,Using it for 1 month. Fits well, have wireless charger. You can also charge it from your phone if your phone supports wireless charging. One thing which is common to most smart watches is when you're traveling in bus or car in a bumby road, it will assume you are jogging and congratulate you for completing daily tasks 😄,Charging is too slow, which is to be expected.Unless you have a samsung flagship phone, you won't be able to see camera app on the watch, and you'll have to get third party applications, and they're just horrible.,Product is goodPros1 health accuracy is high2 ui is good3 Design and build quality is also goodCon1 app is not that good and facing connectivity issues,Good", "img_link": "https://m.media-amazon.com/images/I/31CuxaU77jL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Samsung-Galaxy-Bluetooth-Compatible-Android/dp/B09DG9VNWB/ref=sr_1_131?qid=1672903001&s=computers&sr=1-131"}
{"product_id": "B09Y5MP7C4", "product_name": "Noise Buds Vs104 Bluetooth Truly Wireless in Ear Earbuds with Mic, 30-Hours of Playtime, Instacharge, 13Mm Driver and Hyper Sync (Charcoal Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹1,299", "actual_price": "₹3,499", "discount_percentage": "63%", "rating": "3.9", "rating_count": "12,452", "about_product": "Up to 30-hour playtime: Get set for a day full of music and then some more.|Instacharge: Enjoy 150 minutes of playtime in just 10 minutes of charge.|Tru Bass: Experience sound that hits the right note every single time via the 13mm speaker driver.|Colourful ear tips: Colour your music the way you want and mix-match the ear tips with the buds to suit your style.|Bluetooth v5.2: Lag-free and fuss-free connection is on the way.|Hyper sync: The earbuds are ready to play in a matter of seconds, all thanks to the one-step syncing process.|Touch control & Voice assistant: You are in control always no matter how you want to get your work done.", "user_id": "AHLPMR4VVPOQ2YOHBFOZ55D7OUVQ,AFXQR65B2ONAPVNIFV6RMMJXATAQ,AHKIW5FEJBZVHD4MH7LBRDKXFJTA,AE4XZRBGX3OYZRK6X25BK6UW7KPA,AFA2RHFCGLLADX2Y6VEUWDGJZPNA,AFTW5AE7RXGZCZGGGE5CIVC6ODMQ,AH3VCCMOSINF7Z5TWDQPIJTI7LNA,AHQQ5CAMLDWCOYQLE46VT6DT7T6A", "user_name": "Achint,Anish,bhomick bhaskar,Sumit,Des Raj,Amazon Customer,Gursimranpallah,Amit Ahluwalia", "review_id": "R2XES5SVJG8YP1,R3ISE0B84H2FC4,R32PBSE5T01GP3,RF7XT25GUKMXL,R90ADLZBP2L4B,R1ININDVW54554,RSL20NEE3CM3Z,R8NGRUX0L544R", "review_title": "BUDGET TWS,Does its job,Bhomick bhasker,Noise is nice,Des Raj,Noise -Good one,It's sound quality,It's worth it", "review_content": "HONEST REVIEW :-I got these buds in ₹895/- and I only buy earbuds because of the music, movies, series...MUSIC EXPERIENCE- 4.5/5 (Tbh I like to hear balanced music like crystal clear sound with a balanced bass but yeah if you are bass lover then just think again before buying it)BATTERY - 5/5HYPERSYNC - 5/5BLUETOOTH - 3.5/5 (I checked the box and there it's written Bluetooth 5.3 but its range is low and that's not up to my expectations... But It will work for me...) So yeah if you are just buying it for Bluetooth 5.3... just think again...INSTACHARGE- 5/5 It actually works very well...BUDS- 4.5/5 ( In ear design is good and they fits perfectly also you can do workout, exercise, running etc... but if your own ears are somewhat different like so big then it's your problem Although it comes with different buds sizes so u can try them...;)Buds are really so light so yeah I personally like them...CALLING EXPERIENCE (VOICE/VIDEO CALL) 3.5/5These buds don't come with ANC Mode so please don't buy them just for ANC...And incall range is too low... :(  which I really don't expected... (But It will work for me),The sound quality is good, no doubt. But on a personal note, such buds dont suit my ear. Others who used it liked it though,very bad quality of product. Stop working after 2 months.please dont waste your money on this earbud.,Good sound/ good bass/all features is nice/Good in room or silent place...some background noise come in open area like road... during travel...but this prob in all companies,Like at this price , but noise cancellation is not so good.,Good product for this amount, rarely facing issue while redmi 10,For my listing music and it has great quality,The sound quality is very clear and the range is very good but the bass is not that great", "img_link": "https://m.media-amazon.com/images/I/31YW3+kpZQL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Noise-Bluetooth-Wireless-30-Hours-Instacharge/dp/B09Y5MP7C4/ref=sr_1_132?qid=1672903001&s=computers&sr=1-132"}
{"product_id": "B01DJJVFPC", "product_name": "Duracell Ultra Alkaline AAA Battery, 8 Pcs", "category": "Electronics|GeneralPurposeBatteries&BatteryChargers|DisposableBatteries", "discounted_price": "₹269", "actual_price": "₹315", "discount_percentage": "15%", "rating": "4.5", "rating_count": "17,810", "about_product": "Lasts up to 100% longer* (*Longevity performance compared to the Minimum Average Duration of the 2015 IEC AAA Motorized Toy test. Results may vary by device or usage pattern.)|Our best battery, suited for everyday devices with extra performance for high drain devices|Duralock technology keeps unused Duracell batteries fresh and powered for up to 10 years in ambient storage|Available in AAA, AA, C, D and 9V sizes|Superior Nylon top closure helps preventing our batteries from leakage", "user_id": "AFPSD5MVTPICFIXY5LKKTXSG7ZEA,AGJBM3XS26DC7YAEKR4MCLGOYVBA,AEZQUPHUINOCTERMXT3HOTVPLYGQ,AFSBPCLAH6PSYUW2CO7D3SLAZDXQ,AH6XCAUGFE76YB4KK6DPMXFQJFGA,AGFWFWJXJOOOZJGBRVWUFFHZVMVQ,AGKJJHQERUQMMSYWWDLXSY5VNH7A,AFXICPXB4TFIKV3SCE3LBN5W5QCQ", "user_name": "Aadi Injal,A RAMU,S.S.Sohi,Shaifali M.,Mahesh Kumar,Shubham shukla,Rahul,Vimal Raj", "review_id": "R3NINARQVMB04K,R3V669AZP1XAAF,R20I705WTEEW1V,RY83C96248L5V,R26RSSJWPNLVT2,R19L3YHA555YWV,R1ZAZH2LQQV1BO,R2X7KQZQ9OM9SP", "review_title": "Longevity isn’t as long as I thought it would be,Good,Value for money,the expiry date and price covered by an external sticker. Can't make out anything,Good,Excellent customer service..,Good product,Good", "review_content": "I used these for my wireless mouse which is a razer deathadder v2. One of these would last exactly from a week to two. Was weird because I used the mouse same way with each but some of the batteries would die out quicker than expected. Should be fine if you’re using it something less taxing like a wireless mouse,Good,For wall clocks & SC/TV remotes,The batteries delivered in ok condition but can't make out the life or actual price as covered by an external sticker on top of it,Nice,Battery life is excellent as compare to other brands,Nice,Good", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41ZrxS9SpwL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Duracell-Alkaline-Battery-Duralock-Technology/dp/B01DJJVFPC/ref=sr_1_133?qid=1672903001&s=computers&sr=1-133"}
{"product_id": "B07DFYJRQV", "product_name": "JBL C200SI, Premium in Ear Wired Earphones with Mic, Signature Sound, One Button Multi-Function Remote, Angled Earbuds for Comfort fit (Blue)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹799", "actual_price": "₹1,499", "discount_percentage": "47%", "rating": "4.1", "rating_count": "53,648", "about_product": "True Powerful Bass|Premium matallic finish with better & Ergonomics|Noise Cancelling Microphone|Quick Launch Access to Google Assistant / Siri|One-Button Universal Remote with Mic|Lightweight and Comfortable with 3 sizes of ear tips|What's in the box : 1 pair JBL C200SI headphone, 3 sets of ear tips (S, M, L), 1 Warranty and safety card", "user_id": "AFFSKDBFEU4DW4HMBLQ52IQXBHZA,AF6PMNNWP4CSP7MYSQ6UMLKNRUJQ,AEMSMWVWDYLWF3I3SCHPJPDTS5QQ,AGTCJJ32K5W5TMGLW3ZYSCOMHWVA,AGAO5NDUOORFZEJW3M27SHMV4IVA,AG4QLX5GRMA774DI4ZA6VHAWPXGA,AG4ZT4XUVYDG34W6WLOXQPYYMX2Q,AFG4YVV6ZDOXBWVY4WW7EZ7FABJQ", "user_name": "Amazon Customer,Viswas Reniguntla,Shreyas mc,KARAN,vishnu pareek,Sinu,Rohan Magar,Gokul", "review_id": "RO083A44QXKV9,R3C3602BFFOSHL,R3CJ93AM926Y16,RG0532BEQHFMJ,R664LC5TVQ8FY,R351V55RSSHHKF,R1O8VW90GF66XT,R15LLQQDFS6UUR", "review_title": "The price should be less than 500, not a very great product.,Good earphones,Average,Good earphone,Good for common men.,Nice headphone,Good looks but bass is not good as aspected..,Nice product", "review_content": "I was using  JBL C100 SI,  and this time bought JBL C200SI,  and honestly i couldn't feel much difference between this. One common thing about these are the cheap wire quality.  JBL could have address this.,I have used it for listening songs and I can say it is good earphones for that price,Average, expected too much but sound quality is good but bass is not that great. Overall good product,Earphone has good sound quality,Avarage,Nice headphone,https://m.media-amazon.com/images/I/61q50WnB0TL._SY88.jpg,Best sound quality. Only issue is the paint coating started pealing off from the head piece and the wire at the connector end chipped off gradually.", "img_link": "https://m.media-amazon.com/images/I/31z+0UyRo2L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/JBL-C200SI-Ear-Headphones-Mystic/dp/B07DFYJRQV/ref=sr_1_134?qid=1672903001&s=computers&sr=1-134"}
{"product_id": "B08L879JSN", "product_name": "Acer EK220Q 21.5 Inch (54.61 cm) Full HD (1920x1080) VA Panel LCD Monitor with LED Back Light I 250 Nits I HDMI, VGA Ports I Eye Care Features Like Bluelight Shield, Flickerless & Comfy View (Black)", "category": "Computers&Accessories|Monitors", "discounted_price": "₹6,299", "actual_price": "₹13,750", "discount_percentage": "54%", "rating": "4.2", "rating_count": "2,014", "about_product": "21.5 Inch VA Panel Full HD 1920 X 1080 Resolution Monitor I 250 Nits Brightness I 178 / 178 View Angle|Connectivity Options : HDMI and VGA Ports with Inbox HDMI Cable|5MS Response Time 75Hz Fast Refresh Rate|Eye Care Featues Includes Bluelight Shield I Flickerless I Comfyview|Wall Mount Ready I -5 to -20 Tilt Adjustment", "user_id": "AEKLUZARDMPMWERNPZFR6JD3BYBA,AFZLO4JX4Y2XDISGVAWMFE4GIZZA,AFGENKSKOZGTS6YYL5CYWKMV5MCA,AF4XQLEHSE3N5EXHAFITQTURTKUA,AEOHSSPCLSTWA4MAPWJJLJHSJDMQ,AFWL3FG6OEIIFL3TUJIB76DXYWXQ,AEUYQQW6ZI6DK2MJQTX2O7SNRENA,AHCEHLGVT3XPNMBLTOFSQRRZ3ZTQ", "user_name": "Mr. Nøbødy,Muzammil Khan,Nitish kumar,Yatharth Patil,Sathish,Alpesh Rathva,Suman R,virtual", "review_id": "R12NQTT6JQ7IUU,RY86UV8SMZI90,R2AAYZE6G6UIAU,R39Q207BAEQQWR,RSZFFKU0IDHKS,R2GFFY2F5H41KG,R36TOBMRAZCRCQ,R2DCMA2LKZOX95", "review_title": "Good monitor in this price range,My Best Buy in 2022,Average product for daily use. And some gaming.,its a good 1080 monitor,Nice product,price relaetd issue,Worth monitor this price,Decent monitor at this price with limitation", "review_content": "Good product i am giving this review after 2months of use and i have ha good experience with this monitorThe only problem you may face is the control panel is not user-friendly it is different to operate it.,,Good pics and good gaming all are top in this price range va panel is good.,it's alright as long as you are not expecting musch from it,Worth for money and best for home use. Screen size also good and eye protection is best,quality vis this product is good but after i deal for another order suddenlty price become high 35 %  why ! in just 1 day  , Answer me ! is it jock,Worth monitor this price,Monitor is good if you're not doing heavy graphic design activity, coz display become bit pixallated in dark. I checked this is not issue of my display driver or HDMI out. But image is crisp and good refresh rate for office applications. Good buy at this price, but if you can afford costlier monitor, then look for someone having hight adjustment options. This one not having any.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41m4oS2gbcL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Acer-Features-Bluelight-Flickerless-Comfyview/dp/B08L879JSN/ref=sr_1_135?qid=1672903001&s=computers&sr=1-135"}
{"product_id": "B08TDJNM3G", "product_name": "E-COSMOS 5V 1.2W Portable Flexible USB LED Light (Colors May Vary, Small) - Set of 2 Pieces", "category": "Computers&Accessories|Accessories&Peripherals|USBGadgets|Lamps", "discounted_price": "₹59", "actual_price": "₹59", "discount_percentage": "0%", "rating": "3.8", "rating_count": "5,958", "about_product": "Portable, easy to use|LED lights for maximum illumination|Plugs into any USB port|Multipurpose Energy Use|4Pcs of USB light.", "user_id": "AEJGZNKM5ZGH6UY2YX537NWNWYDQ,AGZGGK6OUCCSLXO34PHT72EFVDQA,AERTNA7V2HRIEPGANADEJFCY524Q,AHXQK2APPFORQPV6E43FW2W6DVVQ,AEMKH7NSGFU5YGYOC54RHG54WHXQ,AEITY7VD7DALKLQUEG6PFVIR4OIQ,AFUAADADBTTU3YB2FUJQC3C6IEBQ,AH7F7ZZ6T36PJAYQ5CEN62XKFPMA", "user_name": "Ravi Kumar s/o Devraj,anil-kumar,Soumith,Drew Arsenic,Jigar,Tamanna,H.N.GNANESH,Mihir Bhatti", "review_id": "R3CEIRJ8YFRONO,R3ICE0RT3T14TH,R17764XIRZDB5H,RI1X7COS2IBOL,R33A1O2FLMSC3Z,RHFEA5EOYKD7Q,R1GTW2UMC0N8KZ,R33OGOISGY92FA", "review_title": "Good,Product as described,Good for the price,Value for money,Good Product,Good product,Continue bright 3days no complaints,59 Rupees worth it", "review_content": "Good,Product is as described, good we can use it,Good for the price,These are not super bright but i like them since small in size and can be folded.Easy to carry when travel and can be used with poerbank.I use it sometimes as night light on my charger facing to ceiling or at wall.,Loved it,Nice one,Worthy product at this lowest price,Good lighting and good quality", "img_link": "https://m.media-amazon.com/images/I/413phG1P5UL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/COSMOS-Portable-Flexible-Light-Colours/dp/B08TDJNM3G/ref=sr_1_136?qid=1672903001&s=computers&sr=1-136"}
{"product_id": "B06XSK3XL6", "product_name": "boAt Dual Port Rapid Car Charger (Qualcomm Certified) with Quick Charge 3.0 + Free Micro USB Cable - (Black)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|AutomobileChargers", "discounted_price": "₹571", "actual_price": "₹999", "discount_percentage": "43%", "rating": "4.3", "rating_count": "38,221", "about_product": "Charges compatible devices up to 4 times faster with Qualcomm Quick ChargeTM 3.0 Technology. Detachable Cable|Compatible with all USB and type C powered devices including Quick Charge 2.0 etc.|Built-in safeguards to protect your devices against excessive current, overheating and overcharging|Boat rapid charge comes with exclusive Smart IC optimum smart charging technology for Apple and other non-Qualcomm quick charge enabled devices up to 5 V/3 amps", "user_id": "AFGPLYW6L6FYUGQDND7QGCRL2H2Q,AE3W6H2PP2KKMVEDIF4Z2RANULGA,AFERB3TDE3HAUIGGRZAO7LNF7SYA,AEC6SV7YUF3HQVEMSZOXIOJORZ2Q,AHHQF6UWD53IPS32OWDH7PX3LWWA,AEWG4B4DLLS74A5D5D2WYKSH4ZNA,AFYPBI2BVOVJGI2FTGVRG7IPNYTA,AFIOILAIZXRGBCG63U6QWKUJUL6Q", "user_name": "suraj,Bharanidhar,S.B.Vignesh,Srikanth GR,Hari,Shashi,Palanivel raja N,Pavan Singh", "review_id": "R9OEDGO6AP6W,R18J04KXIBBB6N,R70MW25QBMRGK,R3AX6PA4E2TM2G,R7HUKVB4XODCQ,R1J8EL6DD8FXI4,R1GYAYF8LG0P4Y,R2O8NMN02QCYQT", "review_title": "Good product,Value for money,Car charger,Good product,A good product- must have accessory for car,Good charger,Good,बहुत ही अच्छा चार्जर है", "review_content": "Still using it , have ordered long time back, easy to use and install,Value for money,Nice,I received a used product first and then wrote in comments for proper quality check of seals not tamperedAmazon did their job in QC and sent me a new product which was sealed and unopenedProduct is good Can charge 2 devices at same timeThis parallel charging will damage the charger Use it only when needed,A good car charger! Must have product. I was using it for the past 3 months, I'm charging my phone and car air pump. Working smoothly without any issues.,Good,Good,Good", "img_link": "https://m.media-amazon.com/images/I/41fRp5O-PrL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Dual-Charger-Qualcomm-Certified-Charge/dp/B06XSK3XL6/ref=sr_1_137?qid=1672903001&s=computers&sr=1-137"}
{"product_id": "B07YNTJ8ZM", "product_name": "Zebronics ZEB-COUNTY 3W Wireless Bluetooth Portable Speaker With Supporting Carry Handle, USB, SD Card, AUX, FM & Call Function. (Green)", "category": "Electronics|HomeAudio|Speakers|BluetoothSpeakers", "discounted_price": "₹549", "actual_price": "₹999", "discount_percentage": "45%", "rating": "3.9", "rating_count": "64,705", "about_product": "Zeb-county is a compact and handy portable speaker that comes with multi-connectivity options like wireless BT/USB/micro SD and AUX. Wall Mountable Satellite : No|The speaker comes with a call function along with a built-in fm radio too|Speaker impedance 3Ω|Frequency response 120hz-15khz|Charging time 2.5H|Playback time approx. 10 hrs|1 Year warranty-from the date of purchase|To connect to FM: Switch the speaker to FM mode and connect the micro USB cable to the micro USB port of the speaker and leave the other end free (this cable will act as the FM antenna).", "user_id": "AFQ44B5ISCXUWKFHZL7HTRTYWZKA,AF3IECP2JCTQZRF55RNIHBLIVL2A,AFLK6ZRFGVUE3QE7RXQXHDOPPJUQ,AFPXGO2U6B5RAACITVCFJZEUNRKQ,AEQRAZQWNHPRGHNIFYNEIKPYOH6A,AE54CJI2T5ADE7M3QPQN7LC7ECTA,AGMN7AH7PCCN7UGWGCPJQLH2SWWA,AEAATGPU3JDB35QPGDBHURZCAH2A", "user_name": "Bhuwaneshwar kathlane,Jainit mukeshbhai Chauhan,Mahesh prajapati,Sonu Kumar,narender,Rajkumar jain,Bani panda,Dhiraj Tiwari", "review_id": "R2SK5PPC2ZKCL5,RD7IHEAUK0KA6,R32GOT9K2GCKQG,R2ODSY8YMSYDBQ,R1GJIXYJ1WCO16,R3F1T36YXCNJUT,R1TWYPGF1F4VJW,R2ZI8M3NTETFJT", "review_title": "To good,Build material,Super,Good product,Budget bluetooth speaker which serves the purpose of low volume on a phone or laptop,best,It's OK to use in small room. But for Outdoor activities it will not meet our expectations.,Awesome product", "review_content": "Bahut hi achha product hai badhiya saund and bluetooth connectivity,Build material is plastic body. However, sound was good,Nice,Sound quality is goodBattery performance good,It is a satisfactory Bluetooth speaker and is perfect choice for those who are looking for a budget wireless speaker for their laptop or mobile phone with low volume issues or for those who need some portable music device and who dont want to shell out lot of money. It serves these purpose very well and is not pricey. Why I am saying all this……First things first, I got this at 549 (the black one only as rest of the colors were way too pricey and choice of colors can be sacrificed in such a case). 2. My laptop and phone volume  is too low and watching a video or listening to music on these devices is not a good experience. So here too this speaker served the purpose as connectivity is excellent, size of speaker is conveniently small, lightweight and battery backup is damm awesome. After a complete charge I used this speaker for continuously for about 6 hours at about 80% volume and still the speaker is left with 60% charge. I cannot comment right now for the charging time as it arrived with more than 70% charge and I just topped it to full. Bluetooth connectivity is exceptionally good upto 10 mtrs. FM reception is average without connecting the data/charging cable but it is awesome if the cable is connected. It has only four buttons and all the functions are controlled by these buttons only. First button “M” is mode which when pressed switches from Bluetooth to FM to Aux to Usb/memory card. Transition of switching is flawless. Volume up/down keys are used to change volume and switch the channels. Long press changes the volume and short press/click changes the channels in FM or changes the track via Aux. Most usefull feature of this speaker is its mic. Yes, you can actually use this speaker (when connected to phone) to talk with someone and that too with no connectivity issues. Voice clarity is very good for the calls made. MUSIC CLARITY IS NOT VERY GOOD. (READ CONS FOR THIS). Quality of the plastics used seems good and feels durable.CONS. Sound quality is just average.  Voice call clarity is very good where music is not dominant. But when it comes to music, this speaker struggles to deliver quality. People are complaining in reviews that it doesnot produce any bass, but actually its is the bass produced by the speaker which deteriorates the quality. This is understandable for this product as it just has one tiny speaker inside and if manufacturer makes it to produce some bass will definitely deteriorate the music quality. But this is manageable and you can ADJUST THE MUSIC EQUALIZERS in your laptop or phone to get pretty decent music quality. This is the reason I don’t consider its music quality a con for the product. There’s one limitation about charging connector to. It comes with a charging port compatible to A/B type connector, so if you have a charger with data cable supporting “C” type connectors, you are bound to use the charging cable supplied with speaker only. So you cannot keep just one common cable with you to charge both your phone and speaker. Instead you will have to carry two different cables. This speaker does not come with a charger, so you will have to use your mobiles charger (5v, 1A)  for the purpose. But for the price rage, this seems reasonable.Useful tip for buyers: Most of the smart phones will display battery percentage left in the speaker. But you can install any of these two apps “Bluebatt” or “Bluetooth check ringtone and show battery level” from the playstore, if in case your phone is unable to fetch battery data from speaker.What you get in complete package: 1 unit of Bluetooth speaker, 1 cable which has Aux connector, USB connector and (A/B type) micro Usb connector, 1 tiny  user manual.Quality of packaging: Excellent, sturdy,  packaging used by Cloudtail to secure the company’s product packaging. Manufacturing date was of May-2021.,I like it,Portability and Bluetooth connection is good.,Awesome 😎👍", "img_link": "https://m.media-amazon.com/images/I/41goRo3UXhL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zebronics-Zeb-County-Bluetooth-Speaker-Function/dp/B07YNTJ8ZM/ref=sr_1_138?qid=1672903001&s=computers&sr=1-138"}
{"product_id": "B09KGV7WSV", "product_name": "KINGONE Upgraded Stylus Pen, iPad Pencil, Ultra High Precision & Sensitivity, Palm Rejection, Prevents False ON/Off Touch, Power Display, Tilt Sensitivity, Magnetic Adsorption for iPad 2018 and Later", "category": "Electronics|Mobiles&Accessories|MobileAccessories|StylusPens", "discounted_price": "₹2,099", "actual_price": "₹5,999", "discount_percentage": "65%", "rating": "4.3", "rating_count": "17,129", "about_product": "25MIN FAST CHARGE & UPGRADED NIB - 5 minutes of charging will give you 2 hours of use. It can be used continuously for more than 10 hours with a full charge of 25 minutes ALSO improved accuracy, sensitivity, and durability, precise point control writing, no scratches on the screen, no lag/offset/break, higher sensitivity, no resistance|PALM REJECTION - You can put your hand comfortably on the screen when drawing or writing with palm rejection, no need to wear gloves for more convenient writing or drawing which fits people who take notes or draw pictures on iPad for a long time!|TILT FUNCTION & MAGNETIC ADSORPTION - The latest tilt-sensing technology, You only need to adjust the angle to draw the picture you like, just like using a pencil. In addition, Magnetically be able to attach the iPad Pro (3rd Gen only) side face, no more rolling and prevent loss and more portable also it has a flat surface to prevent it from falling|USB-C CHARGING & LED CHARGING DISPLAY - Kingone digital pencil has upgraded the LED power display function. Compared with the other pen, this new feature can more easily know the remaining power and it will automatically turn in \"Sleep Mode\" after idle for 5 minutes to save power. And the stylus support 10 hours of continuous working and 180 days standby time for about 1 hour per charge|ACCIDENTALLY ON/OFF PREVENTION - Kingone use Double tap ON/OFF on stylus which can prevents from accidental switch OFF, No need Bluetooth, just tap the end of the pencil twice to turn it on/off, Avoiding the problem of accidentally turning on/off by mistake touch once which can save a lot of power and greatly improve the experience; Kingone IPad Stylus Pen for 2018 and later: iPad (6/7/8/9 Gen), iPad Pro (3/4 Gen), iPad Pro 11 inch, iPad Air (3/4 Gen), iPad mini (3rd gen) 5/6 Gen)", "user_id": "AHJHHQWQ25VCIQHG5XMZN5MRZFYA,AFCFHU6B5RH4YN6DNTLUMY3CILHQ,AGLNHKFYTWDPKIAIQTE4UPB5I7ZQ,AEZKRUEG7M7P4JGJEVHMWZ3MGFPA,AHXWYJUQTCQRTQG3XYEAAYI3EURA,AHYAIOJLTBNK23OEWQ2BELX3PVXA,AHPP7A2M3LU7BWBZVIWXBNIVAPNA,AG6FKYZZA7HPN54KNFM5EIKJNDSQ", "user_name": "Ishwar Singh Sankhla,sai k.,Prathmesh Acharekar,T-y,Jasmin Gosrani,Pankaj,Mahesh,Muzafar", "review_id": "R1DVF8WQYO780,R2B57KUCWYWDKX,R387VL6JFWOGER,R1OI6WSW06GR1S,R35O9XKPNRSYBT,R18TBS4UYVK90T,R2Y87EUNNJCKL7,R3KEMD6RG0SKOI", "review_title": "Really Satisfied with purchase.,DO NOT BELIEVE ANSWERS FOR QUESTIONS SAYING IT WORKS ON iPad Pro 10.5 inch (A1701),Does all the necessary stuff,No Double Tap Gesture,5 star product at this price,Very good product,Automatically off's itself,Value for money pen", "review_content": "Pros -Really like the stylus. It works fine , using it from last two months. Excellent for note taking. Tip quality is good doesn't wearing off. Extra tips provided. It provides all the functions which are mentioned. Charges quickly. Response time is really fast.Cons-Few times it automatically turned off while using, but not a big concern as it happens rarely.Not for professional sketching and drawing as it is clearly mentioned that it doesn't support pressure features.Conclusion -For price under 2k I think it is the best stylus.I am using it with iPad air 5.Didn't face any issues till now so don't know how helpful customer care support is.,So, the quality of packaging and product quality is pretty good. I’ve seen it turn off in just 30 seconds a couple of times but that’s all. By the way, I ordered it for my old iPad Pro 10.5 inch A1701 as I don’t want to buy new Apple Pencil at full price and I somehow couldn’t find the right alternative for 1st gen Apple Pencil either.. but I found some questions here answering it works for A1701.. after delivery, I found out it actually won’t work and then magically the right model of stylus was on my Amazon Home Screen when I wanted to return this. Gonna order a new one which KINGONE says works with A1701. Let’s see..,Very good product build quality is aluminium so feels premium working is good as well best for note taking and basic operations budget friendly .,Full recharge is completed in 18 mins👍 affordable price.👍 Wish Double Tap Gesture as at the apple pencil 2- ND gen.,Ease of use, accurate, all is good upto now and also looks good, feels good, feels premium. Product at this price deserves 5 star,Good product,While using it automatically off's itself this happen when it is in use. But worth buying than a expensive apple pencil ✏,", "img_link": "https://m.media-amazon.com/images/I/31jgUvSar0L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Upgraded-Precision-Sensitivity-Rejection-Adsorption/dp/B09KGV7WSV/ref=sr_1_139?qid=1672903001&s=computers&sr=1-139"}
{"product_id": "B08DPLCM6T", "product_name": "LG 80 cm (32 inches) HD Ready Smart LED TV 32LM563BPTC (Dark Iron Gray)", "category": "Electronics|HomeTheater,TV&Video|Televisions|SmartTelevisions", "discounted_price": "₹13,490", "actual_price": "₹21,990", "discount_percentage": "39%", "rating": "4.3", "rating_count": "11,976", "about_product": "Resolution: HD Ready (1366x768) | Refresh Rate: 50 hertz|Connectivity: 2 HDMI ports to connect set top box, Blu Ray players, gaming console | 1 USB ports to connect hard drives and other USB devices|Sound output: 10 Watts Output I 2 Speakers | DTS Virtual:X | Sound Type : Down Firing|Smart TV Features: Web OS Smart TV | Wi-Fi | Home Dashboard | Screen Mirroring | Mini TV Browser | Multi-Tasking | Office 365, Set WXHXD (with Stand ) mm - 739 x 472 x 168|Display: Active HDR | Display Type: Flat | BackLight Module: Slim LED|Warranty Information: 1 Year LG India Comprehensive Warranty and additional 1 year Warranty is applicable on panel/module from the date of purchase|Installation : For requesting installation/wall mounting/demo of this product once delivered, please directly call LG support (Please visit LG Website for Toll Free Numebrs) and provide product's model name as well as seller's details mentioned on the invoice", "user_id": "AHBNKB74LGTYUOKPAJBSKNFV45CA,AFIECTV45ADX5YPTE2VU6ORRHTGQ,AFDUJI7KG7VMZF4JGJHV4DBCA4OA,AEUWKSX5ZL7DWOOYVDOWJKBHOVXA,AHEJW5MYVFOQBEXD6BIUBB3PJBPQ,AEM2Y22BKLFYL5BK7SC56Q75ODOQ,AHWDVB4OO4S3YS5RYQZIDBNV6BUQ,AFCEDQXVCB4LUUBWXRJS6KRU62FQ", "user_name": "NIRMAL.N,Manoj kumar,SOMNATH DAS,Harsha,Pradhut Roy,MAHENDRA NATH DAS,Naveen Kumar,Gopi Sahu", "review_id": "R2PNR69G0BQG2F,R31A0WWDEYMKEW,R2C4XEWFLVU7JV,RYWES5AT5FQO6,R1PGWAY5TEWLT4,R32542OPR0QC4I,R2JDJEVZ2G7EEK,R36EHHPAQNSSOF", "review_title": "Sound quality,Very nice,Value for money,Good,Good for its price.,Good item,Budget friendly,Good", "review_content": "LG was always Good , correct delivery, good service but sound quality was poor. The speakers were fitted below the tv. No clear sound. That was the only problem.,Good videoGood vice,Picture quality is awesome.,Good at that price,Okay product, the OS has lags after about a year of use. This is the best you can get for the price tag it comes with.,I like it,Best one when it comes to bugdet, easy installation and handy features.,Good", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51v-2Nzr+ML._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/LG-inches-Ready-Smart-32LM563BPTC/dp/B08DPLCM6T/ref=sr_1_140?qid=1672903001&s=computers&sr=1-140"}
{"product_id": "B07KR5P3YD", "product_name": "Zebronics Wired Keyboard and Mouse Combo with 104 Keys and a USB Mouse with 1200 DPI - JUDWAA 750", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Keyboard&MouseSets", "discounted_price": "₹448", "actual_price": "₹699", "discount_percentage": "36%", "rating": "3.9", "rating_count": "17,348", "about_product": "Keyboard : Standard keyboard|Rupee key, Comfortable|Silent Durable keys|Mouse : Ergonomic design, Accurate optical sensor|High resolution enabling faster navigation", "user_id": "AE35OI7LDTOKU32IFQ3GQX5AOKFQ,AHT5CRFFKABTHYW4ECKZTQFY46NA,AEXIV3RFI5NFISHPIOIRBFCEMKUQ,AE4ADCFGK4BPHVK426KLAGJIECTA,AHGC4ISYSAWYL3CB4IONRS7WO2AQ,AHQQYHFW6CVRWYWGJ53LNZKKCSZQ,AEJOCAMBYG2VFPAYA67LRSSAMDBQ,AHESOERCB5FRKL7BYJ6QQHK4BMJQ", "user_name": "lucky,SALMAN S,Rahul Singh,INSOLARE ENERGY PVT Ld,Sandeep Kumar Sahu,Amazon Customer,Sudhanshu,Jp", "review_id": "R1JXCQXDJH1CEV,R3C6DZWAYPPVIX,R2RMNGCEK9JTR6,R2TWPQKNMIHDWC,R2GAXBVB8VNNFW,RS8LJM8U4MFL9,R36X9P0X5BIB9V,RC4NQGWR1VSW1", "review_title": "light weight okay in this price range,Value for money,Good,EASY TO USE,Value for money,this is no soft touch keyboard,Good product in this price range,Budget friendly", "review_content": "design of the keyboard and mouse lenght of the wire is short.,Value for money worth it .,Good,NICE PRODUCT,Good for lightweight use. Ocassional gaming can be done .  Uplifted keys.. keep your hands soft while typing.,Although it is quite cheap and works nicely for me, I think this is not for those who look for soft touch keyboard. Keys 'feel' lose and needed to be hit a little harder. Also, the Enter key is upside down compared to most keyboards around. As a result, the '\\ |' key is in the second row instead of the first. Could be irritating for those fast typing guys.,Go for it,Value for money 💸", "img_link": "https://m.media-amazon.com/images/I/3164hjUSFdL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zebronics-Zeb-JUDWAA-750-Wired-Keyboard/dp/B07KR5P3YD/ref=sr_1_141?qid=1672903001&s=computers&sr=1-141"}
{"product_id": "B08FB2LNSZ", "product_name": "JBL Tune 215BT, 16 Hrs Playtime with Quick Charge, in Ear Bluetooth Wireless Earphones with Mic, 12.5mm Premium Earbuds with Pure Bass, BT 5.0, Dual Pairing, Type C & Voice Assistant Support (Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹1,499", "actual_price": "₹2,999", "discount_percentage": "50%", "rating": "3.7", "rating_count": "87,798", "about_product": "Enjoy balanced sound without artificially enhanced Bass and volume that hurts your ears. This helps you enjoy the full bandwidth of crystal clear audio with no distortion|12.5mm Dynamic Drivers cased in ergonomically designed comfort fit earbuds|16 Hours Playtime under optimum audio setting, Bluetooth frequency 2.400 GHz - 2.4835 GHz|Quick Charging - 10 min of charge provides one 1 Hour playtime and while overall charging takes less than 2 Hours|Multi-Point Connectivity allowing seamless switch between two devices, Enjoy lossless quality music with Bluetooth 5.0|Audio Specifications : Frequency response 20 Hz – 20 kHz ; Impedance 20 ohm ; Sensitivity 118 dB SPL@ 1kHz 1mW ; Microphone sensitivity -25 dBV/Pa @1kHz|With 3 Button remote, access Hands free calling or enable Voice Assistance activation on your mobile device", "user_id": "AGZCXPBXKXIEQTY4AH7KM6OPQW3Q,AF7IPRBRDY6D4F7XVZW4QZZRI3KQ,AHGJXZZRXZB2T477ZTVMMKDT3LGA,AHXW4TW4TIIXXSXFZXBR2MWZLVQA,AGUQ57PHU2MEG2BIYVXDH5WDDDZA,AH2MCCISNTRUSC5FU5VOYCGL575A,AH4IURQX3DSNH4KLG3MFMVNAR64A,AFNBAIT26TZ4OJCNYY37T6SWDS3A", "user_name": "Amazonnig,Anurag,p_v_,Anil Kumar,Ignatius Nayan D'Rozario,Amazon Customer,Maulik Aryan,basraj", "review_id": "R3NMIVJ17E0X21,RB5W0IR72WUCL,RYFMIDRTCXL9G,RAXJMWTTGEC3N,R3NIYIIT389DWG,R9X812EYFQOYQ,R3JUK9JGV9M0OZ,R11666SEDDXZ66", "review_title": "Good headphones, the sound is good, not sure about comfort,Just Ok,Budget Entry Level Banger Headset,Good quality product,Good multipoint connectivity. Falls off the ear,Good quality, but battery draining,ANC very bad,Bluetooth not working after 4 month", "review_content": "The headband is really thin, therefore it starts to hurt after 15mins of use, I have wrapped a napkin around it for extra cushion but that doesn't look good if using outside. I wish the comfort level was better,Expected a better product from JBL. The Bass is quite low and has some disturbance also.,Best entry level NC headset with better sound quality. NC is not that good but cancels subtle noises and turn down down other noises. People talking are not canceled, only muted down. Sound is good for the price range(4/5). If you are looking for superior NC, try to buy sony xm4s wheb there is an offer which is my next headset to buy. The cushions are far too small to fully cover ear, they kinda rests on ur ear edges which is kinda painful over long usage. There was no sweating issue since the headphone has air holes and provide air circulation to ears. Charging time was around 1 hour. Battery life is so perfect, like u can charge this full and use it for a while week without NC with around 5to6 hrs of daily usage. So final verdict is bang for the bucks. If u r into NC, just go buy xm4s... 🏃,Good quality product,Very good for phone calls.The microphone is excellent. Much better than most Bluetooth earphones.The audio is clear, but the shape of the earbuds fails to direct the audio reliably across different types of ear sizes.JBL tried replicating the Apple earbud shape. Does not fit the ear snugly.Falls off often.,It's a good quality product but battery drains very fast.,ANC is just a gimmick on this one, bass is poor, don't buy if you need bass. Quality is good, looks nice. Comfort wise, the clamping force is a bit tight, if you like the cozy feel, good for gym or running. Sound isolation is good. Earcups are slightly small for over ear, would keep touching the edges of your ears, you may get used to it or not. Besides bass, the sound is good. Battery life and connectivity is good too. Boat has better base and more comfort, but they also fit loose, these fit tighter.,Overall good product but after 4-5 month Bluetooth not working", "img_link": "https://m.media-amazon.com/images/I/3118CXMdMUL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/JBL-Playtime-Bluetooth-Earphones-Assistant/dp/B08FB2LNSZ/ref=sr_1_142?qid=1672903001&s=computers&sr=1-142"}
{"product_id": "B01IBRHE3E", "product_name": "Gizga Essentials Professional 3-in-1 Cleaning Kit for Camera, Lens, Binocular, Laptop, TV, Monitor, Smartphone, Tablet (Includes: Cleaning Liquid 100ml, Plush Microfiber Cloth, Dust Removal Brush)", "category": "Electronics|Cameras&Photography|Accessories|Cleaners|CleaningKits", "discounted_price": "₹299", "actual_price": "₹499", "discount_percentage": "40%", "rating": "4.2", "rating_count": "24,432", "about_product": "3-in-1 cleaning kit, the 3-piece cleaning contains the essential items necessary for the proper maintenance and care of your optical equipment. It easily cleans dirt and dust. Effectively removes smudges and fingerprints from lenses, LCD and other optics.|Multipurpose cleaning kit for digital cameras, DSLR, camcorders, filters, lenses, binoculars, LCD, Laptops and other sensitive electronics, etc|Includes: 1 x Cleaning Liquid 100ml, 1 x Plush Microfiber Cloth, 1 x Dust Removal Brush|Every photographer knows the importance of keeping your camera in pristine condition, our cleaning kit provides all the tools you need to maintain your precious camera equipment|The cleaning kit is composed of carefully selected tools and materials to safely and effectively clean your camera and any other delicate optics, each item included in your cleaning kit is inspected for quality assurance before shipping", "user_id": "AFAVJJJRDJZCFKPZ4ACGTYBLRJBQ,AEZBJMTSQQ7IGWYTZDUQ24KXSFWA,AFGZQNTKB7GCYDFGCOV2MF2VBSXA,AHM3MJSP4J3IJUZE6ENH3352KDVQ,AFDE6CEFGDYLXV7SSVU7NCEZKXKA,AHNR5FBWUV4A5XSJXNBBK26US5XQ,AH2YX7BOKWSCK4CRS3U5IOHLPPQQ,AGNBRGWKNVYUJI43BQVDG7UPV6PQ", "user_name": "Siddharth suman,Soumayan Chakraborty,Papori,Agasthya,Jiten Sinku,Aleena,Ram Surat,Uday Kumar", "review_id": "R1B4X8ITOATQ0C,R5WG9NHM3YOOT,R3TAVI48RMGJX5,RILQMI1I1DYD1,R1R099R1LF5U9A,R26A4K18YPO7PL,R336HLDD03LJVQ,R21IQ39FHPMSQZ", "review_title": "Very fine product..,Good,Worth the money,Does what it says,Value for money product but brush is not good.,Easy to use,Good product,Worthable", "review_content": "Usable for cleaning tech kits.,Good product at this price,The microfiber cloths were perfect objects to clean my laptop screen. The brush was a bit rough, and the bristles kind of fans out while cleaning and you need to use your fingers to put it back to your original shape every now and then, which is not hygienic. Haven't used the cleaning solution, so cannot comment on that.,Well packaged and the product works great,Everything is nice but brush is not value for money.,Easy to clean laptop and even phone. Travel-friendly products.,Product is good however cloth quality could have better at this price. It is bit costly.,Worthable", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51LuP5KXg5L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Essentials-Gz-Ck-101-Professional-Micro-Fiber-Antibacterial/dp/B01IBRHE3E/ref=sr_1_144?qid=1672903001&s=computers&sr=1-144"}
{"product_id": "B01N6LU1VF", "product_name": "SanDisk Ultra Dual 64 GB USB 3.0 OTG Pen Drive (Black)", "category": "Computers&Accessories|ExternalDevices&DataStorage|PenDrives", "discounted_price": "₹579", "actual_price": "₹1,400", "discount_percentage": "59%", "rating": "4.3", "rating_count": "1,89,104", "about_product": "Compatible with Micro USB Type 'B' Android based Smartphones & Tablets. Windows 7, Windows 8, Windows 10, Mac OS X v10.9+ and higher|Free up space on your OTG-enabled Android phone|Back up your mobile photos, videos and contacts|Retractable design with dual micro-USB and USB 3.0 connectors|SanDisk Memory Zone application (available on Google Play) lets you easily manage your photos and videos|High-speed USB 3.0 performance with up to 130mbps file transfer from drive to computer|Manufacturer Detail: SanDisk InternationalLtd.c/o Unit 100 AirsideBusiness Park,Lakeshore Drive,Swords,Co. Dublin, Irelandmporter Details: Rashi Peripherals Pvt. Ltd. Rashi Complex,A Building,Survey186,Dongaripada,Poman Village,Vasai Bhiwandi Road, Dist. Thane,Maharastra 401208, India", "user_id": "AF7IXQKBUL6NEIQG4R53LMJJUGXQ,AFVFGVFOC6WUUL7VZ3ZSBDAFMPOA,AHIQYP5QKXYWXGJC5Z6YGIZVQTKA,AGCXB54PNFRXYGF7NLH66BHO6S7A,AGJTDMCUUNZJRJKAQGZNFBSZUAMQ,AEBHV4MEUEGYYUNRYNMTNAEZFRBQ,AEFIFJIV3YDBR7WKSDYX4JEQSCDA,AGJ7FX6Z4B7QEM6DG2BT26XG6XWA", "user_name": "Neeraj Vishwakarma,UD,M.Sathish kumar,Karthik,Kunjasha.v.kadu,Govind N.,Yogesh Tayde,Amima khatun", "review_id": "R3D9U8JX5A9TUJ,R35QH8XSF5Q7Q8,R2GIERTOOHJ61Y,R1C41WPHWU3HQU,R1KWYGPK5B25QW,R29JX6DV9W8CEX,R2NC01NL944UV6,R383NYRRUUA4RG", "review_title": "It takes Forever - to transfer anything. Maybe I - misunderstood \"Ultra\" or somebody missed \"Ultra-Slow\" in the model tag line.,Comprehensive Review of Product, Company & Seller,Desigh and usage,Good purchase not best,Sd card,Good Quality product,Pendrive Quality to Aacchi H Par , Storage 64 Gb Ki jagah 61 Gb Hi Milta H 3Gb Kam Milta H,Good", "review_content": "Update:I returned the drive with money reverted back.Seller was cooperative & reverted without hassle or communication.ABOUT THE BRAND SANDISK :xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxSanDisk is an Israeli-American manufacturer of flash memory products, including memory cards and readers, USB flash drives, and solid state drives. As of February 2015, it is the third-largest manufacturer of flash memory.SanDisk was founded in 1988 by Eli Harari, Sanjay Mehrotra and Jack Yuan with Sanjay mehrotra being the president & the CEO.On May 12, 2016, SanDisk was acquired by hard drive manufacturer Western Digital in a US$19 billion deal.WHY A DUAL- DRIVE, WHY 64 GB & WHY SANDISK?xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxBefore we proceed with the muscle-merits or the key features of the device, let’s have a quick look upon my personal selection process.Dual Drive : Apart from my need for a basic pen drive with sufficient storage, I chose to go with a dual drive that could work with my mobile devices to offload it of the memory burdens and play some stored media at instant whenever a desire crosses over. I could have gone with a basic pendrive with a USB to OTG adaptor cable but then I realized, in today’s comfort-seeking world, who’s will keep track for the tiny adaptor cable or moreover take the trouble every time to fetch it ,then fit it ,in event of a sudden mood swing for any mobile media requirement.64 GB : This capacity seemed to offer a decent compromise between storage, price & future proofing as with modern mobile cameras photos and videos shot are mostly of high resolution and larger size.64 GB ensures that you won’t have to empty it out any sooner or on a regular basis.Sandisk : In the recent few years, Sandisk after becoming a western digital brand has witnessed a tremendous growth in market capitalization, quality and brand image & offers the best value for money deals for an average usage.Moreover, could not find much, reputed brands in the Storage with OTG feature.A Note : Speed enthusiasts though should refrain from this version & should try its designated speedier extreme versions or other brands like transcend, Samsung.ABOUT OUR PRODUCT:xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx@ The device comes with the title “SanDisk Ultra - Dual Drive m3.0” and is the newer 2017 version of its previous iteration. Here I need to quote that the term “Ultra” came quite as a surprise to me as I found nothing in lines with a common understanding of Ultra. We will discuss it in detail in upcoming columns of speed.@ With a micro-USB connector on one end and a USB 3.0 connector on the other, the drive lets you move content easily between your android phones, tablets (with micro USB ports only) or laptops.Both the connectors are carved out of metal & the USB 3.0 connector is backward-compatible with USB 2.0 ports.@ SIZE : The size of the USB is quite small which can be good for easy storage in your pockets but might be tedious to find if misplaced.The USB fares around an inch in perfect closed condition and 1.5”inches when expanded at USB end.@ CONSTRUCTION: The device has a plastic body & the overall construction of the drive is just average. The retractable plastic column seems to the weakest link of all and would surely break if you accidentally step over it. However the actual drive storage portion is built of a rigid plastic and won’t give up so easily. Both the USB ports are built of metal which again is quite a relief.@ FIT & FINISH: Being equipped with a retractable mechanism & being too small, the drive is not so smooth to use & slide-in or out in a single shot and needs some getting used to but then most of the OTG drives are designed small and hence have some or the other odd way of conserving size.The USB ports fit comfortably in devices and pulling it out too is fairly easy.@ STORAGE FORMAT: Since the previous FAT32 version had a limitation of file transfer size of a maximum of 4 GB for a single file & NTFS was not compatible with mac OS so with increasing file sizes ex FAT format was devised which doesn’t have a size limitation like FAT yet is compatible with Mac as well. So our drive has only ex FAT & NTFS formats to choose & comes in ex FAT by default with 128 KB file allocation size. Increasing the file allocation size may increase the transfer speeds a little but will affect the storage capacity little too. Changing it from 128 to 256 KB increased my write speeds from 13 MB/s to 15 MB/s if that’s a relief to anyone.The format would surely work well with most of the TVs, tablets and mobiles though check it with the car audio head unit and try to change to NTFS if it doesn’t work.@ SPEED (  The de-merit detail )  : I have been a flagship gadgets freak all my life & Preliminary to my purchase I had doubts regarding its speed as quoted by fellow buyers but then I did not have speed in my mind as a primary motive for this & there were not many options for dual OTG device, So I took a leap of faith and went ahead with purchase.My basic intent was to load bulk movies from my laptop into it and watch it over my TV or mobile, However when I was transferring 6 movies of a total size 8.1 GB , it started showing 15 minutes which kept on getting higher & it felt like waiting forever for it to happen.Even for a single movie of 1.8 GB it took 2 minutes 30 sec by stopwatch to transfer. The write speeds started with 13 MB/sec and went down & down to 10-11 MB/sec. Even with my older Kingston DT elite 3.0 16GB,the write speeds were in excess of 21 MB/Sec.I admit I have a USB 2.0 port at my laptop yet I was never used to such low speeds ever. The tagline “Ultra” and mentioned speeds of 130 MB/sec (which I suppose is the rated max. speeds at USB 3.0 ports) felt like a dream and beyond exaggeration.Finally with every passing minute it became all the more unbearable and annoying. Even in NTFS format speeds were the same.I had never expected it to be this slow in this modern era of 2018, thus finally I decided to return it but I suppose I will only get a replacement & not reversal.I know that read-write speeds depend upon a lot of factors including transferred file type, format configuration of drive, configuration of host & destination device etc.Benchmark Crystal Disk mark scores for a file transfer of 500 MB size were 34 MB/s -Read & 19 MB/s – write which looked like a mere consolation. Transfer between my Samsung S7 mobile & S2 tablet too was not fast.Verdict : Yes my friends , all other reviews about this being slow to the point of being unbearable are absolutely right and maybe San disk should retag it as “Ultra-slow”.@ STORAGE : Out of the total name plate rating of 64 GB , the actual allocated space for usage is around 57 GB which is ok enough.@ WARRANTY : The product comes with a 5 year limited warranty which is one of the segment best offers.@ PRICE : I bought the device for 1530 bucks which was reasonable to me given the storage size, Dual drive & brand image. MRP over the pack was printed 2190 bucks & it was tagged made in Malaysia. Only if, it was a bit faster.FINAL VERDICT:xxxxxxxxxxxxxxxxxxxxxAll in all, in my personal opinion given the brand image, Ultra-tagline & modern day technology advancements, even if you try to be too generous or lenient upon the transfer speeds yet its hard to spare such a low Read Write rates.Even for routine tasks it will keep on reminding you of the compromise you made for a full price. It could have been a great all-rounder device coupled with the good brand reputation of Sandisk & 5 years of warranty, had its speed been any better.,COVERED HERE: Actual storage space, Heating, Mobile Phones, Tight Fitting on mobile phones, Speed, Formatting File System, Value for Money, Free App, Company, Brand, Seller.About Company, Product & Seller:1. SanDisk Ultra is a brand of Western Digital which is the same company that sells external hard-disk storage devices under the brand WD Elements and WD Portable.2. About 3 to 5 years ago, WD Elements & Portable drives of 2TB and 4TB were priced Rs. 1200 less than current day prices. They were sold by Cloudtail Seller on Amazon.3. Now SanDisk and WD drives are sold by Appario Retail Seller on Amazon.4. For best prices on SanDisk and WD products in India, the current seller has the lowest prices for authentic brand new products.5. Reason for higher prices for same brand's same capacity storage devices may be various - such as import duties, taxes, manufacturing costs, higher demand for the brand, etc.REVIEW: SanDisk Ultra Dual 64GB USB 3.0 OTG Pen Drive (Gold):1. STORAGE SPACE: Just as in external hard-disk drives, the actual usable storage space will be less than what is mentioned on the product.2. SAME AS OTHERS: For the 64GB pen drive, actual storage space available is 57.2GB. This is normal and not some fraud or fake advertisement. This is because it has FAT32 File System. Also, the device uses some space for its functionality and use.- In Linux OS laptop the available storage space on this FAT32 pen drive is shown to be 61.5GB. So that's 4GB more than what Windows OS calculates using their NTFS File System.3. HEATING: Even with just 10 minutes of use, you can touch and feel that the metal part of the pen drive is getting heated. But the performance of the drive has not got affected by the heat. This heating does not happen in WD external hard-disks and seems to be unique to small pen drives of various brands.4. MOBILE PHONES: The pen drive works with Android OS of Mi phones such as Redmi Note running Android including old Android Version 9 as well.5. TOO TIGHT FOR PHONES: The pen drive is a tight fit on mobile phones & tablets - so be careful when pulling it out so as to not damage your phone - because this is also the charging point for your phone. If you feel that your phone is too tight for this pen drive, then it is best not to use it for phone data storage management.6. VALUE FOR MONEY: Even if you don't use this pen drive for mobile phone - it is still the best price for a 64 GB pen drive with a USB 3.0 backward compatible with older USB ports on older laptops and computers.7. SPEED: The Speed is extremely good for Windows OS laptop, Linux OS laptop and Android Mobile Phones.8. FILE SYSTEM FORMATTING THE PEN DRIVE: Unless you are sure you won't use your pen drive on a particular device, don't format the pen drive to change its FAT32 File System.But For Example, If you have decided that you won't use it on mobile phones or tablets because the fitting is too tight and you don't want to risk damage to this point which is primarily used for charging - then go ahead and format the pen drive for your laptop.- With NTFS formatting you will see an increase in available storage space in your pen drive.- With your Linux system's file format, you will have better storage space than any Windows File System.- BEWARE that if the pen drive has NTFS File System then it won't work with mobile phones, tablets, laptops which don't have Windows Operating System. Same way, if you format the pen drive for Linux OS File System, it won't be recognised on Windows laptops, Android phones, tablets, etc.- if like most people you will be using this pen drive on laptops or other devices of friends or co-workers, then leave the existing FAT32 File System as it is.9. FREE APP: Memory Zone App for Android is bundled free in this pen drive. It is easy to install and doesn't take any Phone Permissions other than Storage Access. It is very useful App with easy user-interface. App takes 64MB storage space on Android Phones.- Features include: cleaning Junk Files that you may not otherwise know through your phone's File Manager App. Enable or Disable Automatic Backup to your pen drive. Add Cloud Storage such as Google Drive or Microsoft One Drive and Add MicroSD card storage to manage all your files from just one Memory Zone App. Restore Backup. Copy, Move, Delete, files as well as clean up WhatsApp related files. See available storage space on your phone. See data sorted into photos, videos, music, documents.10. BEWARE - Users of Memory Zone App should know that they agree to Terms of Use which include that if some government agency requests the company for information against piracy - such as illegal copy, storage, distribution of Movies, Music, Software, Books, etc as per DMCA copyright laws then the Company will provide the user's data to the government investigating agency to protect the intellectual property of content owners.OVERALL - best product in the market, at best price in Indian market, with features not offered by other companies for similar specs.,Value for money. May be desig can be improve for the sliding and handling,It was good with compatibility and storage of data but its slow in data transfer. It take so much time for moving and copying of files,Good quality,Good Quality product,Pendrive Quality to Aacchi H Par , Storage 64 Gb Ki jagah 61 Gb Hi Milta H 3Gb Kam Milta H par accha hai Original Pandrive Hपेनड्राइव ओरिजिनल हैं क्वालिटी भी काफी अच्छी हैं थोड़ा सा स्टोरेज कम मिलता हैं तीन जीबी का 64 जीबी कि जगह 61 जीबी ही मिलता हैं पर काम अच्छा करता हैं, इस्तेमाल करते टाइम थोड़ा गर्म  होता हैं पर अच्छा काम करता हैं |,Good", "img_link": "https://m.media-amazon.com/images/I/41sAt4BZydL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SanDisk-Ultra-Dual-64GB-Drive/dp/B01N6LU1VF/ref=sr_1_145?qid=1672903002&s=computers&sr=1-145"}
{"product_id": "B07XLML2YS", "product_name": "TP-Link Tapo 360° 2MP 1080p Full HD Pan/Tilt Home Security Wi-Fi Smart Camera| Alexa Enabled| 2-Way Audio| Night Vision| Motion Detection| Sound and Light Alarm| Indoor CCTV (Tapo C200) White", "category": "Electronics|Cameras&Photography|SecurityCameras|DomeCameras", "discounted_price": "₹2,499", "actual_price": "₹3,299", "discount_percentage": "24%", "rating": "4.2", "rating_count": "93,112", "about_product": "High-Definition Video —— Records every image in crystal-clear 1080p definition;Pan and Tilt —— 360º horizontal and 114º vertical range; Advanced Night Vision —— Provides a visual distance of up to 30 ft;Motion Detection and Notifications —— Notifies you when the camera detects movement|Sound and Light Alarm —— Trigger light and sound effects to frighten away unwanted visitors.;Two-Way Audio —— Enables communication through a built-in microphone and speaker|Safe Storage —— Locally stores up to 128 GB on a microSD card, equal to 384 hours (16 days) of footage. (Based on laboratory conditions)|Voice Control —— Free Up Your Hands with Voice Control —— Works with the Google Assistant and Amazon Alexa. (Google Assistant and Amazon Alexa are not available in all languages and countries)|Specific Uses For Product: Surveillance; Included Components: Tapo Pan/Tilt Home Security Wi-Fi Camera, Power Adapter, Quick Start Guide ,Mounting Screws, Mounti", "user_id": "AF3HHR5VANS5ZX2IATPSOZDFEP7A,AEGDY32LMHDQODUG3Y452L2DSSOQ,AFYM2YCDE6SZB4OHEG4NX7OWJI5Q,AGIT26W6BSDLN6OOXKXIYASNSPXA,AG6WNF3AQBACEWDTRW6UM2MALT2A,AHKRFXJ6RBOTGHZ2QFSLO5BBRHIA,AHMRH27KXXRCKPVINMYZCJRLSGZA,AGOU3P3LXMXSZTQLWKGNGS3Y5TYQ", "user_name": "Maxrock89,Ayush negi,Rakesh,prasanth,Suraj,Sudhi/Deeps,Vigneshraja,KONDOJU HEMANTHA CHARY", "review_id": "R3B27WULJTV0TX,R17QJ5UVWP6FA3,R3QKFVLI9WHP40,R3LEQKCCAHPSWR,R11H2N84QPASNY,R393EMOMYGZ5FU,R17HKZQD6S4TMP,R16FEY4VDG9V22", "review_title": "VFM indoor use (living room/bedrrom) use and clear view upto 120sqft rooms,Best camera in its segment but the app lags,Best,You have to pay to avail all services,All good,I was sent a used product...,Good Product,Upto mark", "review_content": "VFM indoor use (living room/bedrrom) use and clear view upto 120sqft rooms.Configuration is pretty easy for any novice. Night mode is good as well.Only flaw i feel is that the head portion is bulky while its resting stand is not heavy leading to the camera movements if not screwd down.,Best camera impressed me video quality is osome but the app lags,I like it,It is a very compact product that can fit almost anywhere. The only drawback is that most of the features that it offers are cloud based and requires you to pay to avail them.Features like \"rich notification\", where the phone notifications also contain a screenshot when the motion is detected, should have been included as part of free service (at least when connected to the same wifi). As of now, the only free notification that you get is an alert with the date and time the motion was detected and you need to open the app and wait for it to load up before knowing what motion had occured.AI motion detection also should have been a locally available free feature instead of relying on cloud. The normal motion detection is not very perfect and has few false positives.Also, a web UI would have been nice to have instead of relying only on the Tapo app to view and configure the settings.Overall, as a normal ip camera with recording, this is great but most features that it provides requires paid cloud connectivity which was disappointing and it lacks a web UI. Hence,I would recommend that you check other brands before deciding to buy this.,Very good for small shops or indoor for house care,It was definitely not a new sealed product. It looked like a returned product resold to me...it was dusty inside, original stickering worn out etc..  but the product works n i am ok with it.,,Tapo cam is very good and working as expected and 32gb sd card can record upto 3 days and continue in loop mode. We can see person and motion detection events", "img_link": "https://m.media-amazon.com/images/I/31pcbVy11RL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/TP-Link-Wireless-Security-Tapo-C200/dp/B07XLML2YS/ref=sr_1_146?qid=1672903002&s=computers&sr=1-146"}
{"product_id": "B086WMSCN3", "product_name": "boAt Airdopes 171 in Ear Bluetooth True Wireless Earbuds with Upto 13 Hours Battery, IPX4, Bluetooth v5.0, Dual Tone Finish with Mic (Mysterious Blue)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹1,199", "actual_price": "₹5,999", "discount_percentage": "80%", "rating": "3.9", "rating_count": "47,521", "about_product": "Drivers- These true wireless earbuds have powerful 6mm drivers for an enthralling playback experience|Dual Tone Finish- Its dual tone colours offer an aesthetical edge and define a true listening time|Playback- Airdopes 171 offers a nonstop playback of up to 3H with each charge and an additional 10H playtime with the included charging case|Lightweight- These true wireless earbuds weigh about 4g per each so you may keep them plugged for longer duration with comfort|IP Rating- Airdopes 171 is IPX4 rated for providing resistance against sweat, splash and dust scares.|Bluetooth- boAt Airdopes 171 offers true wireless experience with latest Bluetooth v5.0.|Control- The TWS earbuds offer easy access multifunction button controls with stereo calling feature", "user_id": "AEU6MYQDUVKLBHRXLKVRUIEWLX6Q,AHCIZVWUXAKRCE6KVLLMUKEL2QMQ,AGBUNLUGN3BK6UA3QIFOWGZVTLFQ,AH6WR7DW4S5LL5XV6UALLTX7XH6A,AFC5A2WLRTDARIZXW6FH3SDWVD5A,AHW76O7CH2OHYK2TO5A5BKXJMRTQ,AFEXISDUUT35W2QRLZHXXRXSAG6Q,AGB7Z7NMD5362JFEZKZOJJJHD5OA", "user_name": "Narasimha Rao,Anitha Dalwai,Sachin Ghadge,Udaya Shankar G,Abedh Babu,Neha,Hiro,KAPIL JINDAL", "review_id": "R9WFEPTQ1AVOT,R21UPDIAM0TVWB,RHZHGXAI6M674,R3IWE5ZPWKQ69C,RMVC4YY8V7RYM,R1G1RT7104E5RE,R14Q3C6MLJ03P2,R35VJEPZY0GU3B", "review_title": "Good,Bluetooth range coverage is poor,Good product,Below average product model,Good product.,Complaint,To be honest these ear buds are actually decent and legit,Nice Product", "review_content": "Good,Good product but Bluetooth coverage is poor. Gets disconnected often.,Good product but not comfortable, not fitted properly,I am writing this review after 1 year I have got this headphones it is almost 14 months now the right ear piece is not charging well even if I keep the office in the box for 4 hours 4 to 5 hours like that the charging is very low it's not full it's not getting full so this product last only for 1 year and in this one year the sound quality I can say it is very good but when I use it for so attend the calls the mic is very poor other person really can't able to hear me properly and also lot of noise.,Descent product. I purchased this product on Apr 2022 and still using it without any issues.,My left side one is not working, i reset this as per the manual but still is not working plz help me,I really like it's sound quality and Also the less in the Ear buds. Also bass quality is good but could have been a bit better. Overall this product is an awesome one 4/5 honetsly,For Music its very goodSize is little bigger as expectedCalling quality is above average", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41IAc+vLV7S._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Boat-Airdopes-171-Functionality-Resistance/dp/B086WMSCN3/ref=sr_1_147?qid=1672903002&s=computers&sr=1-147"}
{"product_id": "B003B00484", "product_name": "Duracell Plus AAA Rechargeable Batteries (750 mAh) Pack of 4", "category": "Electronics|GeneralPurposeBatteries&BatteryChargers|RechargeableBatteries", "discounted_price": "₹399", "actual_price": "₹499", "discount_percentage": "20%", "rating": "4.3", "rating_count": "27,201", "about_product": "Duracell Rechargeable AAA 750mAh batteries stay charged for up to 12 months, when not in use|Unused Duracell Rechargeable AAA 750mAh batteries are guaranteed to last 3 years|Duracell Rechargeable AAA 750mAh batteries come pre-charged, ready to use|Duracell Rechargeable AAA 750mAh batteries can be recharged 100's times|Suited for regularly used devices like wireless mouse or babyphone|They are available in AA 1300mAh and AAA 750mAh sizes|They work in any NiMH charger", "user_id": "AG2ICOYPSOV5SGBKFEYHGKCNK7PA,AGJ3OQ4X262D3MAQZ3CLCRVR5R3Q,AGWXCIC2IWWGNN5I4QTFMPSLSTHQ,AHG33NYBIPVHA7BABNXDT4NDZBMQ,AFWPPZRH2WVNMVTLFNXMAJCTTVFA,AG7Y7ZU2S5Y2H7UJX6AFGQSRB7ZQ,AHAVRPA7Z3PKTTWVBVUISCKI7RYQ,AHKW7DR7CHI2WL772IRNUK3SOAUA", "user_name": "T N Sivaji,Akku,V,Meet,MOHAMMED,Niranjan koyri,Tamil selvan,Puneet S.", "review_id": "R5L3FAFS6JXJF,R1VTQ25LXQX5UD,R6RJYAZUM5240,R1S8HH7X7WWELD,R3VAP7JD6S5Q9B,R2RJV9PK2QMAQJ,R2JSE9NKI4XHKF,R1LUV2WJODYVJ2", "review_title": "Works Good,Perfect replacement cell for trimmer,Wow,As they said in ad worth it,A good product,Fit for phillips trimmer.,Good,Good Product", "review_content": "Works good,Bought it to replace my Phillips QT4005 trimmer's 7yr old  battery cell.Old trimmer battery lost it torque... would not start without smacking it on the hand.Soldering the connections was bit tricky but i got it done by sanding both side surfaces of the new battery cell.New Duracell one does its job..trimmer works now like its supposed to.Its lasts more than 30+ minutes easily.Charges like its supposed to.I am satisfied with it. Saved an electronic device from being obsolete.If you want more performance..maybe get 900mah cell....but for me thats expensive...750mah is enough.Long term performance is to be seen.,Used for my philips trimmer. Gives a backup of more than 4-5 days,Really amezimg performance. I did not expected this much good and long performance. I am using diff company charger still these batteries fit well. And works for months. Good performance in good price,Charging is godd and battery is lasting longer after one charge,https://m.media-amazon.com/images/I/714qCj-ogHL._SY88.jpg,Good,It shows good battery life as of now.", "img_link": "https://m.media-amazon.com/images/I/418YrbHVLCL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Duracell-AAA-750mAh-Rechargeable-Batteries/dp/B003B00484/ref=sr_1_148?qid=1672903002&s=computers&sr=1-148"}
{"product_id": "B085194JFL", "product_name": "tizum HDMI to VGA Adapter Cable 1080P for Projector, Computer, Laptop, TV, Projectors & TV", "category": "Electronics|HomeTheater,TV&Video|Accessories|Cables|HDMICables", "discounted_price": "₹279", "actual_price": "₹499", "discount_percentage": "44%", "rating": "3.7", "rating_count": "10,962", "about_product": "Superior Stability: Built-in advanced Certified AG6200 IC chip converts HDMI digital signal to VGA analog signal. It is NOT a bi-directional converter and cannot transmit signals from VGA to HDMI.|Compact Design: Tizum HDMI to VGA adapter is compact & lightweight which makes it easy to carry, travel friendly and also saves space on your desk helping it keep clutter free.|High Definition Image Quality: The HDMI male to VGA female converter supports resolution up to 1920x1080 60Hz (1080p Full HD) including 720p, 1600x1200, 1280x1024 for high definition monitors & projectors.|Wide Compatibility: The adapter is compatible with Computer, PC, Desktop, Laptop, Notebook, Chromebook, PS3, Xbox, Set Top Box, TV & other devices with HDMI port. Note: Does not Support Audio.|Incredible Performance: It resists corrosion & abrasion; improves signal transmission; & protects HDMI port of your device to ensure a longer lifespan", "user_id": "AEO5FHWNOSFBT554DKQAG4ICBGFQ,AGIQ5Y7Q4MKZ542KKVFZLAIZV6GQ,AFD53TWXXCPJAYQJ7REZPW34AKKQ,AHBMHE56M3IAD7Z4KXUKREAZX3WQ,AFR4YULNFZZC5DJOWH2KNFAOM6BQ,AEP5UMK4KDMGZGBHBLZDB2R37OMA,AHLKQWAPXICPCSCIPIF6C6FOENOQ,AHTBS46SCEBGWK4SUH3FOQEORR3Q", "user_name": "aditya d.,Paranthaman,ashik rahman c,Rajas c.,Madan Tejaswi,Sumit,chaitanya srikrishna,subeh sharma", "review_id": "R1GYK05NN6747O,R1J21BZ29NGQF9,R16JCHEILBYOMW,R2WVVS88M7SH18,R2MQ3VB8ZTUS48,RBJPTKHYQ7G7U,R37PKO5FUPJW35,R38R2YC2J2BMWR", "review_title": "Good product ; Average Finishing,Save it purpose well without any issue. I am satisfied,No issues,NO NEED TO PUT AUX CABLE FOR CONNECTING AUDIO FROM SECONDARY MONITOR,Good product,Not so Bad,Good,Worked will for only 3-4 months.", "review_content": "This connector has provided as a boon for my old Samsung LCD monitor and I am proactively using that monitor as the 2nd screen just if the finishing of the product can be improved then it would be a better purchase option.,Save it purpose well without any issue. I am satisfied,Working fine,GO FOR IT,It’s works properly good product but poor quality,I buy this product after so many reviews. this product is not so much clear. But it get the job done. you can buy to get display only. not so much clear. but still price is very good compare to other products.,Good,It worked really well for 3-4 months but now it started showing its \"cheap chinese\" side. Display keeps disconnecting randomly and will come back. It's a headache to read/work on external monitor now since it keeps disconnecting the external monitor and then reconnects it.", "img_link": "https://m.media-amazon.com/images/I/31MIyzg8uzL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Adapter-Projector-Computer-Laptop-Projectors/dp/B085194JFL/ref=sr_1_149?qid=1672903002&s=computers&sr=1-149"}
{"product_id": "B09F6S8BT6", "product_name": "Samsung 80 cm (32 Inches) Wondertainment Series HD Ready LED Smart TV UA32T4340BKXXL (Glossy Black)", "category": "Electronics|HomeTheater,TV&Video|Televisions|SmartTelevisions", "discounted_price": "₹13,490", "actual_price": "₹22,900", "discount_percentage": "41%", "rating": "4.3", "rating_count": "16,299", "about_product": "Resolution: HD Ready (1366x768) | Refresh Rate: 60 hertz|Connectivity: 2 HDMI ports to connect set top box, Blu Ray players, gaming console | 1 USB ports to connect hard drives and other USB devices|Sound : 20 Watts Output | Dolby Digital Plus|Smart TV Features : Personal Computer | Screen Share | Music System | Content Guide | Connect Share Movie|Display : LED Panel | Mega Contrast | PurColor | HD Picture Quality | Slim & Stylish Design|Warranty Information: 1 year comprehensive warranty plus additional 1 years on panel by brand from date of invoice|Installation: TV Table stand is not included in the box with this model. customer may ask for Table Top Stand or Wall Mount which will be provided to the customer at the time of installation, please directly call Samsung support on [1800407267864 / 180057267864] and provide product's model name as well as seller's details mentioned on the invoice|Easy Returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description", "user_id": "AHEVO4Q5NM4YXMG2HDDXC5XMBGRQ,AFZPH7ZAWX5VDY3HOBNYRDGIDBVA,AFURD6VVHRG4HZ36KXGXYUTVUDLA,AHJF5BZJNDLXJXSW74ZPLHGO7GUA,AFUS52CHEA75E2YGQ6SYGP3PKBGA,AGS3YC22FW2PCSH3I7ODDXETZ6BA,AGGI2H2AGOIX6IBDJRWULYUP5DPQ,AG4TU4LCQXF2XTLMMGMFTNWL3OOA", "user_name": "Rahman Ali,MARIYA DASS,Md Aftab,roshan s.,Mohan,Devendu Sawant,Shek hussain,Prathap Pathaneni", "review_id": "R1SN0D4DFBKAZI,R1SX5L77L2CD6V,R1NAZ6M4QBUJMK,R25I5FXOJA76KS,R32V7DQLDSKJ99,R8QWY8HXI120P,R2OZPGGMUCLSC1,R1G4SA1P865EIS", "review_title": "Good,Sound is very low another brand comparing in better,Service provider not meet my home refuse, tv i am not using bad service,Good product,Ok super,Floor stand does not come with it ...,Good,A budget friendly TV with a clumsy UI and Remote", "review_content": "Overall good.,TV picture ok smart betterSound very low another brand,Service provider refuse install my TV, bad service and samsung, I am calling 3 times service provider. Not meet my home address.why ? Bad bad,They product did not come with the support stand or wall hanging hook to install the Tv,Picture quality is very poor in cables,Floor stand does not come with it ... You have to buy it seperately. Request Amazon to cleary mention it in the add . You will have to pay seperate charges for the installation guy to buy the floor mount .,Good,", "img_link": "https://m.media-amazon.com/images/I/51q3+E64azL._SX300_SY300_.jpg", "product_link": "https://www.amazon.in/Samsung-Inches-Wondertainment-UA32T4340BKXXL-Glossy/dp/B09F6S8BT6/ref=sr_1_150?qid=1672903002&s=computers&sr=1-150"}
{"product_id": "B003L62T7W", "product_name": "Logitech B100 Wired USB Mouse, 3 yr Warranty, 800 DPI Optical Tracking, Ambidextrous PC/Mac/Laptop - Black", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹279", "actual_price": "₹375", "discount_percentage": "26%", "rating": "4.3", "rating_count": "31,534", "about_product": "A comfortable, ambidextrous shape feels good in either hand, so you feel more comfortable as you work-even at the end of the day.|With 800 dpi sensitivity, you'll get precise cursor control so you can edit documents and navigate the Web more efficiently.|Side-to-side scrolling plus zoom lets you instantly zoom in or out and scroll horizontally and vertically. Perfect for working with spreadsheets and presentations.|Zero setup with flexible connectivity means you just plug it into your USB or PS/2 port-it works right out of the box.|This mouse is built by Logitech-the mouse experts. It comes with the quality and design we've built into more than a billion mice, more than any other manufacturer.", "user_id": "AE6DY6YWTSSE3XNHDXZDGQM2JL2Q,AES3UPSNCD37JZLHZ3OIILRLLLCA,AESL7YEFFKTIZRBEDUCMD56K6VQA,AHEV734TKPP6CEJPWIMMHA65SL2A,AGBLMQ2TLWRDFQ32LGRIVVPYOQVQ,AHKUSAJGBXVQQSDC4RCKHF6PFODQ,AEPEJSIYSFPXKOXPS2QHZ7P5VCIA,AEU44FW4XJBDB33N4LYZMVLOUYOA", "user_name": "Uday Joglekar,Simi Singh,Hi,chirag bansal,Swarnavo Dutta,H Rt khuma,Adarsh,Dixit", "review_id": "R3U9FRV2Q625DO,R3EJZ83W9OHW3D,RSH53O0JL66NL,R3BMZS3M7NRJ6H,R1KGMYE82EPYDO,RG1M1ENVZBFAP,R1WFXJNNGSCEPV,R1NAE9JMVSXVA1", "review_title": "Handy Mouse,Good quality mouse,Good one.,Good,Good cheap reliable,Gud quality mouse,Very comfortable,Quality + Less Price Makes it Best to buy.", "review_content": "Liked this Product,https://m.media-amazon.com/images/I/710C5jPDcrL._SY88.jpg,Purchased for a laptop. Perfectly working,Good,Very good mouse for a budget setup.,usefull . ... gud quality,The good thing about this mouse is that u can remove the scrolling clip attached inside the scrolling wheel and the wheel becomes very smooth to scroll,The Best of this mouse is its quality as per description, its totally worth it, best for professional usage, if searching for gaming also suitable but dont have dpi options, so for advance gaming you can search something else may be logitech g102 best mouse (with dpi options), else  go with this.", "img_link": "https://m.media-amazon.com/images/I/31iFF1KbkpL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Logitech-B100-Optical-Mouse-Black/dp/B003L62T7W/ref=sr_1_151?qid=1672903002&s=computers&sr=1-151"}
{"product_id": "B09P18XVW6", "product_name": "Noise Pulse Buzz 1.69\" Bluetooth Calling Smart Watch with Call Function, 150 Watch Faces, 60 Sports Modes, Spo2 & Heart Rate Monitoring, Calling Smart Watch for Men & Women - Jet Black", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹2,499", "actual_price": "₹4,999", "discount_percentage": "50%", "rating": "3.9", "rating_count": "7,571", "about_product": "Bluetooth calling: Stay connected to the world, answer calls, store favourite contacts and dial from recent call logs, do it all with your smartwatch. Charging Time : Up to 2 hours|1.69” TFT LCD: Keep an eye on your day with a large and vivid display of our smartwatch.; 60 sports modes: Make fitness your priority and track your progress. Take your pick from a wide variety of sports modes and make your move.|150 cloud-based and customisable watch faces: Experiment with your fit. Choose from a plethora of watch faces and complete your look for the day.|Noise Health Suite: Keep a track of your well-being and health, right from your wrist with Noise Health Suite featuring a variety of health features.|Connectivity Technology: Usb; Included Components: ‎Smartwatch, Magnetic Charger, User Manual, Warranty Card; Compatible Devices: Smartphone", "user_id": "AFO7LXSMPQDD7JG6I5QARG5I4N6A,AFWFOKIGSV22T2HT62VTTV6LUN3Q,AHF32Q6YAAQ7QNHEROCDCCWFUOPQ,AECXZYGASHXD24MRMRWAS4JAHENA,AF2GDZL7TSXL4TIODN72IU3MWGMQ,AFDOG7VEXVBQAS7QZY7S4S37GKAQ,AFZUN3PXHMWKAANEXOL22647UYBQ,AGQQ5YMVO337YAMQZFRARULONQ5Q", "user_name": "Kindle Customer,Arun Kalkunte,Amit Kumar,Dhanush,Shiva sai,Moumita Bhanja,Nagaraj S H,Maneesh Mathew", "review_id": "R1VSKOXXZVR2QQ,RTHHAHQ848PU8,R1RNS2YZ7FXVD1,RMYPWXFB5Y3MQ,R2ZCXVKC7DFULV,R1MBN704BJGOUR,R357MDXJPLIJ9E,R38J3H1JQN20BI", "review_title": "Best for this price,Nice starter smartwatch,Work,Very light weight watch,Smart watch,Good looking,Super,Good", "review_content": "The watch is good, the app is very bad, no Google fit integration or anything, watch face is barely customisable, I don't know why they used the new noise fit prime app with it, the app is very glitchy.If you want this watch for calling, go for it, otherwise don't, I hope they make this watch compatible with actual noise app.Also, wrist awake does not work properly.On the plus side, it is good for calling.,It is great for the price range. I bought it for my son and he is very happy. Can pair with a phone and make and receive calls. Nice UI, great watch faces, step count looks to be fairly accurate. All in all a good buy.,Just work like a smart watch..,Its very light weight with all the added features. Battery life is Max 1.5 day.It drains your phone charge rapidly,Nice,Like very much,Nice,Comfort and nice to see", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/317lVfwVu8L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Noise-ColorFit-Bluetooth-Monitoring-SmartWatch/dp/B09P18XVW6/ref=sr_1_152?qid=1672903002&s=computers&sr=1-152"}
{"product_id": "B00LZLPYHW", "product_name": "Classmate 2100117 Soft Cover 6 Subject Spiral Binding Notebook, Single Line, 300 Pages", "category": "OfficeProducts|OfficePaperProducts|Paper|Stationery|Notebooks,WritingPads&Diaries|WireboundNotebooks", "discounted_price": "₹137", "actual_price": "₹160", "discount_percentage": "14%", "rating": "4.4", "rating_count": "6,537", "about_product": "The cover design of the notebook is subject to change, it depends on stock availability|6 subject notebook-single line, 300 pages, spiral binding, soft cover, 267mm*203mm|Six subjects one notebook only the best from classmate|Classmate uses eco friendly and elemental chlorine free paper|This notebook consists of papers", "user_id": "AGQBRQKHB6V2GKNP5NQCBG3TZFPQ,AGXXROFSXQ7UYFJ4SM2KRSY5GNUQ,AE4OJDGKLBRC3SKJV2S3AHVXBWBA,AEUDSXTROWKKBDOIXDIPXVUR5GAA,AGB2VOIFUR7OVK5G6TMSPV52XHFA,AF6LSVYUDV7WMLIBPHXHBDSVFDTA,AHPXWAFSPVEID3MIG3SFU4XFOSLA,AF7QEOPISA5J33YVAQWX2EGDEPUQ", "user_name": "Hamsavarthini,Samir Shukla,Shahbaz,Shar,Akshay,armaan,Alok Kumar Dixit,Alok pandey", "review_id": "R2GUYHS0CU32OU,R3TKVWL3ZLGJ2L,R1EC5MKPYJIUG3,R3MLY4J9APFPSY,R1Q2LLFMPBKRC5,R10RLPU4M73CP6,R34MKCOD6O491E,R3R6D9TUIP8SNV", "review_title": "Good,Boss of premium note books 🏆,Didn't expected single binding!,Good purchase,Good Quality but paper could be thicker...,Worth the Money!,Good quality,Nice products", "review_content": "Paper quality is good. Worth buying...,Delivery was on time, perfect packaging,evry thing was perfect,but the price could have been little lesser of it would have cost around 100-110, it would be the perfect note book , but yeah it's ok price but whatever the premium ness is on the top or I would say more than top🤗,I ordered it for my physics note..... everything thing is good but didn't expected single metal binding......I ordered it for more aesthetic study but it works for me,Very good quality,Paper is somewhat thin compared to other notebooks but everything else is great..,,Quality of classmate's product is always undisputed.Just check for discount and then purchase.,सभी  अच्छा है।", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51owoY2Xq7L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Classmate-Premium-Subject-Notebook-Single/dp/B00LZLPYHW/ref=sr_1_153?qid=1672903002&s=computers&sr=1-153"}
{"product_id": "B09NHVCHS9", "product_name": "Flix Micro Usb Cable For Smartphone (Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹59", "actual_price": "₹199", "discount_percentage": "70%", "rating": "4.0", "rating_count": "9,377", "about_product": "Micro usb cable is 1 meter in length, optimized for easy use for your comfort at home or office, helps you to overcome distance restrictions|Durable pvc outer exterior: Pvc cables are versatile, high in tensile strength, flexible, and good conductors|Charge & sync, this usb cable can charge and data sync simultaneously at 480mbps speed, compatible with all devices with a micro usb port. Core : Tinned copper|Micro usb charging cable for android phones and any other device with micro usb port|Contact us on 1800-102-2700 or write us on support@flixaccessories.com", "user_id": "AHIKJUDTVJ4T6DV6IUGFYZ5LXMPA,AE55KTFVNXYFD5FPYWP2OUPEYNPQ,AEBWA5I4QFCA3P3OBEPMELBGN4GQ,AHMGAC6QM62UXNEOCZIHLHSXPP2Q,AFHROSCGIXUPV3FYQ7H5QOD46Q7Q,AEAMIR3CMSA32IDEINSJKHRNANTA,AF355FTXYAKFH5NYPRTE7SL3WO3Q,AG5DWPD54QGSLWJ6QUFERLPNAX4Q", "user_name": "$@|\\|TO$|-|,Sethu madhav,Akash Thakur,Burger Planet,Justice ⚖️,indrajyoti d.,Aditya Kumar,E.C.GEORGE", "review_id": "R3F4T5TRYPTMIG,R3DQIEC603E7AY,R1O4Z15FD40PV5,RDVX50PD4CTFE,R3H6WKG0TA5CGU,R3Q3L1KP5QWPV3,RU0LU2PAIIME,R20FTANBPFA653", "review_title": "Worked on iPhone 7 and didn’t work on XR,Good one,Dull Physical Looks,Just Buy it,Go for it,About the product,Get charging cable at the price,Working well.", "review_content": "Worked on iPhone 7 and didn’t work on iPhone XR,https://m.media-amazon.com/images/I/71qFFAlV9ZL._SY88.jpg,Look-wise, I didn’t like it. Still, I use it for my work.,Product is quite good and is fast charging.Loved it.,I like it . Looks last long.,The sturdiness will depend on the manner of its use. But its speed of charging is great. Very good product for the average income group.,It's great for charging devices with various types of ports. But works best when charging one device at a time.,Good item.", "img_link": "https://m.media-amazon.com/images/I/31qGpf8uzuL._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Flix-Micro-Cable-Smartphone-Black/dp/B09NHVCHS9/ref=sr_1_154?qid=1672903002&s=computers&sr=1-154"}
{"product_id": "B00NNQMYNE", "product_name": "AirCase Rugged Hard Drive Case for 2.5-inch Western Digital, Seagate, Toshiba, Portable Storage Shell for Gadget Hard Disk USB Cable Power Bank Mobile Charger Earphone, Waterproof (Black)", "category": "Computers&Accessories|Accessories&Peripherals|HardDiskBags", "discounted_price": "₹299", "actual_price": "₹499", "discount_percentage": "40%", "rating": "4.5", "rating_count": "21,010", "about_product": "Made of Thick, Tough, Ballistic Nylon hard shell material that provides extra strength & shock protection. Compatible with all 2.5”/ 6.35 cm Hard Drive Disks.|This Rugged Shell case comes with an elastic band to securely fasten the HDD & Separate mesh pocket for USB cables, flash drives, chargers, Pen Drives etc.|Strong Zippered closure that allows quick and convenient access and usage. Soft felt lining keeps your HDD dust free. Water and shock-resistant design.|Slim line design allows the case to easily fit into any Backpack/ Briefcase/ Messenger Bag|The High-Hardness case with Anti-Press feature keeps the original shape even under high-strength force.", "user_id": "AGK3NNXG44TLWHYTJ2OAY4JMD3VA,AGKSHSI672DMOJKNVYC33PPKNISQ,AGTC43ZF53CWD5YIEPDMGMDP22TQ,AGHCWVVH53TQGWLKJOGWOYCLLU6A,AGWXGUALH6VESAYTZGWBZBUDTWFA,AESGEGKMDBH4NA6TM7NJILHKW3WQ,AEMDPZ5BX65L4P5KNIF3MZTZ6PEQ,AGRH5LRSEB7REHEO2KY6RSZYERTA", "user_name": "Souradip,Narendran D,Mandar Barve,P Nagar,Amazon Customer,Ravindra Chauhan,Karishma binraj,Jithin", "review_id": "R3CX62IV0TSF01,R2K650XLDC67WC,RIL3X4K17UXMZ,RSOVJCRH662YN,R20C8843BM8Z3U,R2WQI4JZU8FHJA,R47YX2LMQDMCL,R2Y2GMH611HDB2", "review_title": "Super,Excellent structural rigidity,Durable and classy,Sturdy. Good quality,Good quality and durable.,Best,Good,Tough built quality and smooth movement of zip", "review_content": "Still using,Dealing with Amazon was a pleasant experience; the goods were delivered on time and in proper condition. Both the packing and the goods were excellent. It seems sturdy and has enough room for any standard-sized hard disc or external SSD. It is ideal for all types of portable storage devices.,Perfectly fits my HDD and it's wires. Had ample of spce to keep Pen drives and other petite stuff.It's very sturdy and the material is also pretty good.,Case is overall good in terms of quality. Looks smart to carry,Good quality spacious. Actually it hold two of my disk and it’s wire,Value for money, go for it without any confusion. I will update my review after some uses,Good one,Looks good. Quality is also good.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51E0xvwRCpL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AirCase-External-Drive-2-5-Inch-Black/dp/B00NNQMYNE/ref=sr_1_155?qid=1672903002&s=computers&sr=1-155"}
{"product_id": "B0B217Z5VK", "product_name": "Noise Buds VS402 Truly Wireless in Ear Earbuds, 35-Hours of Playtime, Instacharge, Quad Mic with ENC, Hyper Sync, Low Latency, 10mm Driver, Bluetooth v5.3 and Breathing LED Lights (Neon Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹1,799", "actual_price": "₹3,999", "discount_percentage": "55%", "rating": "3.9", "rating_count": "3,517", "about_product": "Up to 35-hour playtime: The 35-hour playtime will keep you company throughout.|Instacharge: A quick 10-minute charge will keep you going for 120 minutes straight.|Environmental Noise Cancellation (ENC): Take your calls in the busiest of environments with ease and get your voice heard clearly with the quad mic.|Low latency: Stream any content or play your favourite game without any lag, all thanks to the low latency.|Breathing LED lights: The stunning LED lights on the buds and case keep you looking flawlessly stylish.|10mm driver speaker: Groove to the powerful sound via the 10mm speaker driver.|Hyper Sync: Experience instant connection right out of the case.", "user_id": "AH2QFGBZYKJDYPAKHEEXUKLZDYTQ,AG2RP4LU7VSU67OTVBAC6LSKI3PQ,AGC6NVLEXXVXAOMXP46RL2622EBA,AEQHT4NCWZ6DDFMOV3QW3W7N5HDQ,AGPYAZNUEWYCAGM4A4WWQNUXD25Q,AEEH35CH4JAERU44DZYQVKQVXGHA,AF67OFMRED2DAQUDHR32ZPSIZEAQ,AHFCRBRVKYQJW75E4DQHUOXK7IVA", "user_name": "RAHUL GOUD,Nitesh,Lokesh K V,KESHAV Kohli,Ozair Ahmad GLS,vishal mandal,Vicky Kumar,Mohamed A.", "review_id": "R1H4NEOQ6UEAUO,R1EXCFKOXU8V4G,R26ZOQR926DPVQ,R29VVCLZZLXMKP,R1EQ6Z6IDFUDQU,R2OOANZHYPNGCF,R22ZFYL3I9O4CV,R3SHUZZHWO2W3P", "review_title": "Clear voice,Nice,Good and recomended,It was a nice product,It's good.,Vishal Mandal,Value of Money,Bass quality was good", "review_content": "I have better sound quality my experience this best mid range budsBass quality goodNoise cancelation also good,Product is very nice. Sound quality is very gud but in calls little bit problem,Good sound quality and bass, great charge backup can play for 6hrs or moreNot recommended for calls and noise cancellationGreat product recommended for buying,Stands both for quality and economy,I like this product was really nice,Material used could be improved and bcz of slide opening buds are getting scratches.,The build quality and sound is good.Nice product with godd sound clarity.,Sound Good,Quality seems to be good. But an issue has been post 4 months from the purchase that one side of the buds is not working. Please look into it.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31ylgpMYDwL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Noise-Wireless-Instacharge-Bluetooth-Breathing/dp/B0B217Z5VK/ref=sr_1_157?qid=1672903002&s=computers&sr=1-157"}
{"product_id": "B07B88KQZ8", "product_name": "JBL Go 2, Wireless Portable Bluetooth Speaker with Mic, JBL Signature Sound, Vibrant Color Options with IPX7 Waterproof & AUX (Blue)", "category": "Electronics|HomeAudio|Speakers|BluetoothSpeakers", "discounted_price": "₹1,999", "actual_price": "₹2,999", "discount_percentage": "33%", "rating": "4.3", "rating_count": "63,899", "about_product": "5 Hours of Playtime under optimum audio settings|Wireless Bluetooth Streaming|IPX7 Waterproof design, Battery Type Lithium-ion polymer (3.7V, 730mAh), Charging time (hrs) 2.5|Built-in Noise-cancelling Speakerphone|Audio cable input|What’s in the box: 1 x JBL GO 2, 1 x Micro USB cable for charging, 1 x Safety Sheet, 1 x Quick Start Guide, 1 x Warranty Card", "user_id": "AEWM6BXJQ76ZA3JH3TEG3ORMEDCA,AFWCCY4OETWIYGV47TLKUZG3NAZA,AG2SGIEE46YOK5J5WFS52KHY4PYA,AHTWRETINVEPSRPIOUQTVART3IBQ,AFRSGOLOZ6Q45OOHXXHDH25XYHCQ,AEO6PDZZEPLEYE6MLIQMEEOEVJEQ,AELS6LXTPB4C5JNSXZVLDQDAZ42Q,AFV3TYH4ZUHBEHG57TJOZ6XAQICA", "user_name": "Murali am,Mithul R.,Ritesh kumar,Debia Pipa,sarang,gopal,MSK Purushothaman,Divyanshu Saraph", "review_id": "R1HX6VQS2UYU8R,R3A39U8MP8LIWS,R2Y7Y17C8YALB,RSQG0AYJ4V2D8,R2WV6HSBBEWM30,R1AHXLKGDRQUYJ,R1BTJA3264JTT5,R1CIASP6T84E5I", "review_title": "Don't believe the other reviews,Awesome sound and clarity for like name JBL,Bass is ❤️,Quality,Excellent sound quality and bass,, gud battery life Best speaker for single room use,Sound is not protect,Good audio.,Not a significant upgrade from JBL Go", "review_content": "The other reviews say that the volume is too low but it is not at all like that it is pretty good ,For such a small speaker the quality and the volume is very good. It is very easy to carry around . The people who bought JBL go 1 this is an hands down upgradetion would highly recommend .The price is too high but i got it in an offer that is the only -point . The Bluetooth connectivity is fast and very reliable and is completely water proof. Comming to the end it is  pretty much a good speaker but for people with a budget pls try other brands,I love JBL audio products and used many like earphone and headphones but that all products were brought from official website but this time I tried Amazon and it still worth and geniune seller and thanks for him and awesome sound more than expected and clarity and bass andvoice is very punch and not disturb your hear but i noticed that it have very very lite humms wen it turns on the speaker without pairing but not noticable,Bass is ❤️Portable also connectivity is fastCharged is late,JBL Go2 is actually good 👍..but sound quality is not much better, according to price..over all ,good... delivery aur packaging bhi bhot acha hai.💟,Battery level indicator not available,,Good audio but the mic feature is not that good.,Good bluetooth speakers by themselves but bit overpriced. They're not a significant upgrade from the original JBL Go. I have both of them and the sound quality is fairly similar - rather the older speakers sometimes sound better!", "img_link": "https://m.media-amazon.com/images/I/51RTfgkScMS._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/JBL-Portable-Waterproof-Bluetooth-Speaker/dp/B07B88KQZ8/ref=sr_1_158?qid=1672903002&s=computers&sr=1-158"}
{"product_id": "B01M4GGIVU", "product_name": "Tizum High Speed HDMI Cable with Ethernet | Supports 3D 4K | for All HDMI Devices Laptop Computer Gaming Console TV Set Top Box (1.5 Meter/ 5 Feet)", "category": "Electronics|HomeTheater,TV&Video|Accessories|Cables|HDMICables", "discounted_price": "₹199", "actual_price": "₹699", "discount_percentage": "72%", "rating": "4.2", "rating_count": "12,153", "about_product": "Latest Standard HDMI A Male to A Male Cable: Supports Ethernet, 3D, 4K video and Audio Return Channel (ARC)|Connects Blu-ray players, Fire TV, Apple TV, PS4, PS3, Xbox One, Xbox 360, Computers, DVD Players, Set Top Box, Dish TV Box, and other HDMI-enabLED devices to TVs, displays, A/V receivers and more.Suitable For Mp3, Gaming Device, Mobile, Tablet, Laptop|Cable allows you to share an Internet connection among multiple devices without the need for a separate Ethernet cable|Meets HDMI 1.4 Standards (4K Video at 24 Hz, 2160p, 48 bit/px color depth) that supports bandwidth up to 10.2Gbps and backwards compatible with earlier versions|✔ Gold Plate HDMI Cable of Length: 5 Feet/ 1.8 Meters", "user_id": "AGVUE2NFN2MQEOQ4PR525B2ZI5PQ,AFO4M4BQ2WS7A3LPKJY45B5C7DYQ,AG6CREU25N6P2H7RCHNIU6GGJ5BA,AHFITGJEF76CXALJZLYP6OIC4EOA,AG54MN24SX3EMMON4AMBUNL74K3Q,AF3GETWWBGMLASY2KKNNBS2VO6DQ,AHEIPXMFMVWHNPLGUXUIV5XNP2SA,AFWQRBBVJWYTYUFQHUJE63S6VXJQ", "user_name": "Yashpreet Singh,Abiram,Aakaash Ramchandani,Amit katoch,Avijit Basak,Anirban B.,Dass,Gopalakrishnan", "review_id": "R2DIHMHOPYEASB,R24RHE9B30YXWQ,R3DYXQZQA6PPHM,R2458DMQ9C2Z4F,R36C67830VNHAA,R2GE3ZI47UVVO,R1XMBPKJ1QP1Q9,R1L6PX82T6UT6P", "review_title": "Cheap product and same is the performance but does the job,Good,No Box!!!,Good,Value for money,A very good quality cable with rubust built, and it does the work.,Value money,Good product.", "review_content": "The signal is too unstable once connect you need a bit of adjustment by unplugging or moving the wire to get a proper signal. But does the job. Go for this if you want to experiment with HDMI as I wasn't sure it would work for me or not. Otherwise go for a good quality breaded cable.,Good product,The cable did not come in a box. There is no box. If this was to be shipped without any packaging or branding, same should have been mentioned. When we pay for hi quality products, we expect a certain quality! I still have no idea if this is a hi speed 4k cable or not.,Good,Bought to connect my CP monitor (CCTV) to MI android TV.. .. OK quality at this price,I give it a 5 on 5, reasons as below..1. Amazon delivery - Super fast, same day delivery within 4-5 Hours.2. The delivery person was good.3.  Robust Built Quality, looks & feels premium.4. It is working excellent, I'm using for lapptop to big screen TV connectivity, and could see the undistorted picture and sound, nicely doing its work.A few words of cons..1. Feels a little hard to adjust and bend as per requirement, less flexible. But this may not be a serious concern.Overall a nice experience so far.,Good job,Like.", "img_link": "https://m.media-amazon.com/images/I/41da4tk7N+L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/TIZUM-Slim-1-5m-HDMI-Cable/dp/B01M4GGIVU/ref=sr_1_159?qid=1672903002&s=computers&sr=1-159"}
{"product_id": "B07Z3K96FR", "product_name": "Robustrion Tempered Glass Screen Protector for iPad 10.2 inch 9th Gen Generation 2021 8th Gen 2020 7th Gen 2019", "category": "Computers&Accessories|Accessories&Peripherals|TabletAccessories|ScreenProtectors", "discounted_price": "₹399", "actual_price": "₹1,499", "discount_percentage": "73%", "rating": "4.1", "rating_count": "5,730", "about_product": "COMPATIBILITY: Specifically Designed Tempered Glass Screen Protector Guard for iPad 10.2 inch 7th 8th 9th Generation. It will not fit any other model.|HIGH CLARITY AND TRANSPARENCY: Features ultra clarity with 99.9% transparency to allow an optimal, natural viewing experience on your iPad 10.2 inch 7th 8th 9th Generation|FINGERPRINT FREE: Has Hydrophobic Oleophobic Coating, which is smudge-resistant and oil-resistant and can effectively reduce fingerprint marks and also making it easier to clean|9H surface hardness ! that is highly durable & scratch resistant protects your iPad 10.2 inch 7th 8th 9th Generation|Easy Hassle-free & bubble-free installation ! Long lasting protection for your iPad 10.2 inch 7th 8th 9th Generation", "user_id": "AFUWVHBC2SCTJ7VEAWEIEYW5V4KA,AFYBMZW3AZJKJJTALIIXD7ZGEHKA,AFUFHMKHZZMFJX554XNEXXTJXWEQ,AHXXQS4GRLX7EK5BE6LFT6OKTWZA,AGUPGGFPP73O6INTDQ4RCOGZA2HQ,AGNZRKED7ZOR5CWLAVUPIYAYAOGA,AET5GWBU6F666XIYM4PJ6EY5WCKQ,AHQ4S2IRIVYCHMRQ2JX27C6KY3IQ", "user_name": "Dakshvir Singh,Palash Kapuri,Abhijit Gupta,Buyer,Anmol Saxena,Irfaan,Hon,dr sanjay kore (some kore)", "review_id": "R207L99B0HON4H,REU6EKQK98RBL,RM596L5QWH41H,R3S583DFLJ72KS,R2RV6Q4UAGYKUY,R3O59TXWPHOPEO,RMVC7IIYGMZJ8,R2V8YZ8X1YQY5C", "review_title": "Gud for the price, but adhesion quality is not very good,Nothing unique……,Attracts too much finger impressions,Perfect Fit (Almost),Easy to install,They provide tissues and wipes,Work well and easy to install,Gud product in budget", "review_content": "The edges may start gapping out, but overall quality (including touch sensitivity) is good, as for the price tag.,The packaging was very nice. There was a microfibre cloth in the box, though it was basic ,I liked it. Now the main product, it was just perfect in size. Installation process was quite simple. But tempered glass is very fingerprint catchy. In harsh lighting the fingerprints could be noticed easily.,Product is otherwise good, but attracts too much visible finger impressions during routine use with a clean hand.,,Quite easy to install,Very easy even for beginners,,Installation was smooth After installing it screen is responsive n does what it is for", "img_link": "https://m.media-amazon.com/images/I/41cOH84GhGL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Robustrion-Anti-Scratch-iPad-10-2-inch/dp/B07Z3K96FR/ref=sr_1_160?qid=1672903002&s=computers&sr=1-160"}
{"product_id": "B0756CLQWL", "product_name": "Redgear Pro Wireless Gamepad with 2.4GHz Wireless Technology, Integrated Dual Intensity Motor, Illuminated Keys for PC(Compatible with Windows 7/8/8.1/10 only)", "category": "Computers&Accessories|Accessories&Peripherals|PCGamingPeripherals|Gamepads", "discounted_price": "₹1,699", "actual_price": "₹3,999", "discount_percentage": "58%", "rating": "4.2", "rating_count": "25,488", "about_product": "Gamepad comes equipped with2.4GHz wireless technology and supports up to 10 metres range, an ideal choice for those looking to enjoy your favourite games without the hassle of cables and wires.|The built-in lithium-ion battery in the gamepad can provide uninterrupted gameplay for up to 2 hours in a single charge for upto 30-minute|Integrated dual intensity motor which allows a realistic gaming experience.|Integrated force feedback. Reset : When an exception occurs, such as Keys disorder, or crash, unable to connect. Remove the USB connection from the gamepad and device and reconnect.|The gamepad comes with illuminated keys on the back which light up and allow visibility even in low light conditions.|1 year warranty from the date of purchase", "user_id": "AFR7NDA6QYOPSCNJIDXRDRHJIYXA,AHHCHJMZSYKSIE6TTZMRNSBE7WTQ,AFSPQFXDIKOSTXLMOGOBF4WR4SPA,AGHBP6BZR4HZMOMFJ7O2A22EAEWA,AHIPJJAVOME7HM7PQCZAEOJRLLSQ,AFYOIOJCLIUTH3O47WX3UURCJZ2A,AFHSGENEII3KZX2B4PUT7PN4E2AQ,AHAMQ4BF5OY7VBA7DZTCFBRK7QPA", "user_name": "Shafeer Pn,Sudhanshu S.,S U P E R M A N,Radhika V.,Amazon User.,rushikesh,Amazon Customer,Hrutik", "review_id": "R1CKJXFP143T9U,R31WPX3OC28CK7,R1S0S55YJ1UNXW,R1VQUWXWHW7F39,R2YJT6N81TWW2J,R3TY53243YFG8E,RFMQXL2EJSMQ9,R1ZD2CRP65AO8B", "review_title": "Value for money,Very good.,Overall good but very fragile! KEYS STOPPED WORKING AFTER 3 MONTHS,Got what I wanted,good,Recommended I used wired version,slightly overpriced but worth it.,Product", "review_content": "good gamepad, could've been better in ergonomics cos after a while, the grip starts aching. also comes with Haptic vibration feedback which is great for the price,Gamepad is very good and it's working also good. Worth to buy.,In terms of bulid quality it's plastic and you know it beforehand, there's a silicon grip patch which is nice but the grip-feel will be worn off after use and you'll be left with a shiny and slippery patch.Feels sturdy in-hand but personally I used it to play many games, mostly FIFA and the keys stopped working after certain time due to the silicon layer under keys.Even though I wasn't using it aggressively then too it didn't last 3 MONTHS.I was hoping for better performance but sadly that wasn't the case, the Joystick (gear) itself was precise but R2 L2 triggers was not working as they should be after 1.5 months even after many failed attempts to calibrate.,This gamepad is working good with pc, tv and mobiles too if you have an OTG. One of the best and affordable gamepad. Go for it,liked it,Posting review after more than 100 hrs used.First of all I buy this gamepad to check experience, it is amazing vibrations lights are good, Build quality is awesome its better than I expect, we can adjust vibration intensity depending on games best for Racing and sport kind games, but honestly if you are more into fps or shooting kind of games Our Keyboard and mouse are best to feel in game.The reason I used Wired is it comes with very good length and that is enough to enjoy the game, that why I din't waste extra money for just remove wire.,nice console.,Good product", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41n2MqMIH5L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Redgear-Pro-Wireless-Gamepad-Black/dp/B0756CLQWL/ref=sr_1_162?qid=1672903002&s=computers&sr=1-162"}
{"product_id": "B004IO5BMQ", "product_name": "Logitech M235 Wireless Mouse, 1000 DPI Optical Tracking, 12 Month Life Battery, Compatible with Windows, Mac, Chromebook/PC/Laptop", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹699", "actual_price": "₹995", "discount_percentage": "30%", "rating": "4.5", "rating_count": "54,405", "about_product": "You can surf the Web with more comfort and ease—thanks to the contoured design with soft rubber grips. And your mouse is easy to slip into a bag when you want to take it with you.|You’ll enjoy smooth cursor control, precise tracking and easy text selection on the surfaces where you use your computer most.|The tiny Unifying receiver connects up to six Unifying-compatible devices with a powerful, reliable wireless connection (up to 25 meters).|You can go a full year without battery hassles. The On/Off switch helps conserve power, smart sleep mode extends battery life and an indicator light eliminates surprises.|You get a mouse you can count on with the high quality and reliability that have made Logitech the global leader for mice—plus a three-year limited hardware warranty.", "user_id": "AGIOL4B6EPMZ63RZQFWZWI33O2EA,AG33OJYQIXPPS7CONXFHC5GEYEQQ,AEGA5UJCOTFHN4JW6PDCIHQGYTEA,AFQM22ZZXTGUTLGC7WE4BVLEZW7A,AHNW7DHVU2D3PR2CDGHWALCLXWPQ,AFEVDY2YG3NENBI47RFAXQ7ZEEBA,AGMFAVIBZTCLSNBIEME5SBNPIQ4A,AEWIIDMBKGRGGXGMHUDHSJRSYABQ", "user_name": "Chandrashekar SK,Mohammed Ashfaque,Arif Hussain,wiki,A B singh,dr.parimal ranajan de,Harsh Mistry,Naresh", "review_id": "R28ZB0YUM6FKKB,RNB44LXBJIPTL,RVSWATRY0CJIV,R3IJ7R6T1XNRDW,RDC2ZTQAO2XXC,R1RFN16MM6BMUM,R2O8DIRX6ME9HQ,R50QNWM2SDL2V", "review_title": "Good silent mouse,Too small to hold!,Reviewing after 8 months of with battery backup review,Its very small  do take note of that,** Nice product,Good product,Good Buy for normal use in office,Stylish mouse", "review_content": "It's little small for big hands. But best available in the market.,Good product, but too smaller than the regular one!,Hello everyone,I bought this Mouse in April 2022, so after 8 months of use, I'm writing this review.Battery (the most important one): 10/10 - It came with a single AA-sized battery (Clock battery) that worked from 1st April -  10th December which is more than 8 months.  Even though my usage was heavy (6 hours average per day) in a corporate job day of 9 hours.Look 7/10-  Amazing with beautiful curves. Though battery closing pane could have been better.USB transmitter: 9/10 - It's normal and can be carried inside the battery cavity.Switch: 5/10 - On/OFF switch is not handy, you need a long nail to switch it ON/off but is strong enough to resist a hard stroke when you force it to off with your nailless fingers.Precision and laser: 10/10: Precision is just what most mouses have which is accurate and the Laser is invisible (No annoying light in the bottom).Buttons: 7/10 - Buttons produce a slight noise on click and after a long usage the Left button is shaking slightly.Overall ratings: 9/10The main reason for you to buy this: Its battery efficiency, it will cost you only 12 INR  for 8 months.,Its very small and it trouble for my hand which is considerably smaller than other people it do fit nicely in 10 year old nephew but now mine but no complains works great from far distance  so its good there its should be sold for 400/ only its slighly over priced,Nice mouse.Easy to holdWorking very smooth and fast, response time is very good.,Good durable product,Its a great mouse under this price for normal office use, it would have been much better if it had silent clicks!!!!!,Working well so far.", "img_link": "https://m.media-amazon.com/images/I/31CtVvtFt+L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Logitech-M235-Wireless-Mouse-Grey/dp/B004IO5BMQ/ref=sr_1_163?qid=1672903002&s=computers&sr=1-163"}
{"product_id": "B09Z6WH2N1", "product_name": "STRIFF 12 Pieces Highly Flexible Silicone Micro USB Protector, Mouse Cable Protector, Suit for All Cell Phones, Computers and Chargers (White)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Décor", "discounted_price": "₹95", "actual_price": "₹499", "discount_percentage": "81%", "rating": "4.2", "rating_count": "1,949", "about_product": "Protect cables: the cable protectors are designed with highly flexible silicone, can be applied as phone charger saver and charger protector to completely protect cables for all devices, including cell phones, computers, laptops, mouse cable, etc.|Protection effect: protect wires and power cords from dirt, frays, tangles and knots; Reduce the risk of fraying and breaking|Touch comfortable: the wire protectors feels nice and is fun to install on any wires end, can be applied to protect your headphone cords and charger cables; You can also relieve your stress when you touch it; Relax yourself, even better, the cable protector looks cool|Prolong life of cables: the charger cable saver will help to prolong the life of your cable even the cable has been damaged|Simple to install: a detailed usage is provided; With no worries to wrap the cable protector onto your preferred cable", "user_id": "AG2V3QSA4MVD6RPA5UGUMYMH3PXQ,AGHIZULBQOJPXZ2EUBOVSCRTBI4A,AEFNEVSP4WMJVLBSRPH3YKKRSDWA,AFW6KM45ORMBEVYBQ4QMSGG2ODOQ,AGB2EEPBUR5MIG35HYFKQFWBDHNQ,AHXTIJOG7AQRG6AAFQC6P74S5WYQ,AHSOOVRJXP7QJTQUF6JLK3WGI3AQ,AHK2ZYSXEGSQYPDXT53GDNFSEWXA", "user_name": "Santosh Kumar,Prateek Jain,shubham,Ahsan Shaikh,Munish waran,Lalitaroat060682@gmail.co,Nancy Arulraj,Nevil Gandhi", "review_id": "R1EZC4VZXSJG4L,R1R39X4XI4GF5N,R2NR5VY4ULMZGZ,R1FGNEOQQOF3QC,R7BTN0BZCR0JG,R1IGYOAGJ9FW5U,R3B1Y0WDM2QS0U,R2KNU5Q3FUL54C", "review_title": "Very useful,Very useful item to make your phone cables long lasting,Price can be reduced as this product is not worth for 80 rs,Value for money,It is useful,Good product,Good quality,Its good item in this money", "review_content": "A 10bucks piece can save cable worth hundreds. Totally recommend,I just received it and applied on my iphone related cables and connectors. Specially, apple accessories are not that sturdy and doesn’t last long due to breakage at the end points due to wear and tear.This seems to be a very good and low cost investment to protect all of such cables to break due to usage and wear&tear. Have applied in earphones also. Will be watching over the period if time if it indeed increases the cables life.Till now, feeling good about this useful product.,Price is high,You can go for this.,It is useful. After using it, the durability of the cable is good.,Very good product it definitely protect your cable,It doesn't really protect your cable if the cable is starting to wear out. You need to use this before the cable starts wearing out. It works only if the cable is thick enough. But overall good quality.,Good", "img_link": "https://m.media-amazon.com/images/I/31SKRsp7Y1L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/STRIFF-Flexible-Silicone-Protector-Computers/dp/B09Z6WH2N1/ref=sr_1_164?qid=1672903002&s=computers&sr=1-164"}
{"product_id": "B01HGCLUH6", "product_name": "TP-link N300 WiFi Wireless Router TL-WR845N | 300Mbps Wi-Fi Speed | Three 5dBi high gain Antennas | IPv6 Compatible | AP/RE/WISP Mode | Parental Control | Guest Network", "category": "Computers&Accessories|NetworkingDevices|Routers", "discounted_price": "₹1,149", "actual_price": "₹1,699", "discount_percentage": "32%", "rating": "4.2", "rating_count": "1,22,478", "about_product": "300Mbps Wireless Speed — 300Mbps wireless speed ideal for interruption sensitive applications like HD video streaming. Power: 9 V ⎓ 0.6 A;Antenna — Three antennas greatly increase the wireless robustness and stability|Encryption — Easy wireless security encryption at a push of WPS button;Bandwidth Control — IP based bandwidth control allows administrators to determine how much bandwidth is allotted to each PC;IPv6 Compatible — Compatible with IPv6 -the more recent Internet Protocol version;Working Modes — Router Mode/ Access Point Mode/ Range Extender Mode/WISP Mode|Easy Management — TP-LINK Tether App allows quick installation and easy management using any mobile device. WiFi Range: 2 Bedroom Houses3× Fixed Antennas Multiple antennas form a signal-boosting array to cover more directions and large areas|In an unlikely case of product quality related issue, we may ask you to reach out to brand’s customer service support and seek resolution. We will require brand proof of issue to process replacement request.;Security Protocol: 64/128/152-Bit Wep / Wpa / Wpa2,Wpa-Psk / Wpa2-Psk|Operating System: Windows", "user_id": "AF5YAAI52AMX6HOPQF2J3SOJESLA,AEU76NMTP5BLAI4YLE37G5UXRMMA,AF5SLHZEFIV3ISEOW2STG3EWYNQQ,AE45TP5ZURNMWK6GGPJ3F75P4ZZA,AHEA3K6ANMNJUJMNXADMGWWCQ7SQ,AFIRCW3B6RJPGLBHGXSYUWY27DNA,AHNBZ3WPTLGJBSD4DMHKPHJ7XDHQ,AHCEOI6ITIDUNPWUJ4UXVSLL4YGQ", "user_name": "Vaishnavi Khedekar,Sandeep Shriyan,Kislay Kishore,Vijay,Amazon Customer,jatinrohilla,Ashwin,Ashwini", "review_id": "RYVGISVDMR782,R2SUYAKH1B3Y9A,R2A98UDM7A9PQZ,R24J0BEZA2THE5,R1PUJMNHTMHNWS,RWIBZAS0R8OND,R1042SYVJXWW5H,R1MPZFZKGIYFRW", "review_title": "Received defective item update: better now,Good product,Good connectivity,Good 👍,Go 4 it.....,Easy to Install,Nice product.,Works good", "review_content": "The router won't turn on, requested for replacement.Update: the replacement router is working fine. Judging by the condition of the boxes, I probably had received a refurbished item the first time around.,Good product for home use,After 2 months, it is working nice and fine.,Good 👍,Very compact,This router is super easy to install and you can hang it on the wall as well. It comes with 3 years of warranty and the size of the router is very small and despite of that it gives good signal to the adjacent room.,Go for it, It is Good Product.,Working good", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/314QZXF1dHL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/TP-Link-TL-WR845N-300Mbps-Wireless-N-Router/dp/B01HGCLUH6/ref=sr_1_165?qid=1672903002&s=computers&sr=1-165"}
{"product_id": "B01N4EV2TL", "product_name": "Logitech MK240 Nano Wireless USB Keyboard and Mouse Set, 12 Function Keys 2.4GHz Wireless, 1000DPI, Spill-Resistant Design, PC/Mac, Black/Chartreuse Yellow", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Keyboard&MouseSets", "discounted_price": "₹1,495", "actual_price": "₹1,995", "discount_percentage": "25%", "rating": "4.3", "rating_count": "7,241", "about_product": "Spill-resistant design keeps your investment safe.*** ***Tested under limited conditions (maximum of 60 ml liquid spillage).|Plug-and-play wireless. Connect your keyboard and mouse to a single tiny receiver for plug-and-play connectivity up to 10 metres away.* *Wireless range may vary due to environmental and computing conditions.|Logitech Advanced 2.4 GHz Wireless ensures fast data transmission, no delays or dropouts, and wireless encryption (between keyboard and receiver).|36-month keyboard and 12-month mouse battery life, plus auto-sleep and on/off switch.** **Battery life may vary based on your use.|Make a bold statement on your desk with this space-saving colourful keyboard and comfortable, contoured mouse.", "user_id": "AH6SGND2YZGJPEXEPAT6XTKVRWLQ,AHUKUGMWTTVQ5MYELQCPYTG2PYPQ,AFDHR2G2FNUFDTSWHO4LCLMB6ZYA,AGAPQRGQHJFMTSOOUP4ASESAQ74Q,AGHDPSPN25DVVA7HJ2AH25FTKQFA,AHGT6UU5RQGF6YSGFMDIXANEX5RA,AG6L76MYOFGJ2MUPN3XH2RN6KXHA,AHI55SSF7NUY4BMJHZVXTUAI4Q7A", "user_name": "Abhishek,Kindle Customer,Raghu s.,Shashi Shekhar,stephen,Sayan,Shiva,Yadu", "review_id": "R1RUKN8RB2RKOV,R2DBKFMLI7ZC68,R2935VQS8956B4,R2HNYWLYAUUF0,RPZX6OUAQAC2Q,R2M2E3K9WCOT8C,R3I4DTEZHG51AT,R3HSC8JRXPXLN5", "review_title": "Good for typing, compact,Good product but bad packing,liked it,No caps lock light,All good, except the tiny dongle which has high chances of loosing.,Amazing product incredibly bad packaging,GOOD 👍,Mouse light is not working but it’s working", "review_content": "The keyboard and mouse are good for typing and normal use. Cannot comment about battery life since I've used it only for a month. Sometimes mouse did not respond when laptop got hot while gaming . Hence not using the set for gaming.,Product is very good but I have issues with the packing.The outer plastic bag was fine but the Amazon packing box(brown) was broken.The product box and the product was fine. Mouse battery lid is little bit loose otherwise good.,Product is Good. i have got defective product first and i have option for replacement and the same day my product was replaced. overall the product is smooth and easy to use,No caps lock light  button. It must be there for entering passwords.,All good except tiny dongle which we loose many times.,The keyboard is really good, the travel is incredible (especially when you’re coming from an ultrabook keyboard).Packaging: No cover. Nothing. Just the box, which was literally torn with visible brown cardboard insides. Yikes!,Good,", "img_link": "https://m.media-amazon.com/images/I/41tLaG2nSpL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Logitech-MK240-NANO-Mouse-Keyboard/dp/B01N4EV2TL/ref=sr_1_166?qid=1672903002&s=computers&sr=1-166"}
{"product_id": "B08MZQBFLN", "product_name": "Callas Multipurpose Foldable Laptop Table with Cup Holder | Drawer | Mac Holder | Table Holder Study Table, Breakfast Table, Foldable and Portable/Ergonomic & Rounded Edges/Non-Slip Legs (WA-27-Black)", "category": "Computers&Accessories|Accessories&Peripherals|LaptopAccessories|Lapdesks", "discounted_price": "₹849", "actual_price": "₹4,999", "discount_percentage": "83%", "rating": "4.0", "rating_count": "20,457", "about_product": "【WATCH, PLAY, STUDY - WITHOUT LEAVING THE BED! 】- Are you an avid lover of comfy bed? or now you're recovering from a past surgery,what you need most is here! It perfectly fits a small size laptop,or tablet & phone, also read or do arts and crafts while sitting on the sofa or having breakfast in bed.|【MUTI-FUNCTIONAL DESK】 – Callas Bed Table Built-in iPad stand groove for holding ipad or kindle.And desk comes with a table cup holder to store cups well. The Anti-Slip Sponge can keep your laptop safe while tilted, and provide you comfort and stability while using.|【PORTABLE AND CONVENIENT】 – The metal legs are foldable, easily fold flat for convenient storage when you don't need it.There are handles on the table, you can easily take the table to any place you want to use it.It is very lightweight, easy to carry and play.Go out camping is also an ideal choice.|【ERGONOMIC DESIGN】–Curved desktop edge, scientific design, protective layer around the desktop, so you can feel comfortable when using. The W-legs are stable and flexible, which are anti-slip and can be folded to save space.|【LARGE SIZE】 - 23.64(L) x 15.72(W) x 10.4Inch(H). Callas Lap Desk perfectly fits nearly all size laptop,or tablet & phone, also can put a mouse and books.And there is ample space to work, study, eat breakfast or dessert on the bed table. Package Contain : 1 Laptop Table.", "user_id": "AHB4AEOCLEVH2JSTXPU737KTXS4Q,AHXC62FGJRYSCJEBZEZVALOML3GA,AGZPAEOZFLFBCYQLIKZGSERRSPIA,AE3T6AOS4TGSVXSZ7QPC4ANCQ3TQ,AG5Y7T4IINHLVZVMTSVQVFGJEITQ,AEYZIV7VQ5N4JLPNJBE2H5R4FX4A,AHZSWCFTWESY2N2RK4BVWBMM4TZQ,AGMSYOF7SPTTR7ZTP3VWPKWTZFVQ", "user_name": "Jasmeen,Santam paul,Deepak,Perabathula Srinivasarao,Gokul Agrawal,Suman Gurung,Kishan,Pooja sony", "review_id": "R1GJXMBEY4O49A,R2RJ4QKYQ0VWIL,R2C6XBMID12B8B,R3MT7MII7720H4,RRGGJ6YHE8TBS,RU9GH76MXDYL8,R30MQSL9GAYO5P,R1IO6YQ3NZVJIK", "review_title": "Nice but price should be reduced,WORTH FOR MONEY,Good meterial,Table is good,VALUE FOR MONEY,Good product,Please sell spare parts also,Good", "review_content": "Price is high,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71ZRGtYWBAL._SY88.jpg,Nice,Stand is given in curved  shape bench unable to stand sturdy it is falling be careful while using laptop,Value For Money,Easy folding. Convenient to user. Working place is little bit congested and the stability is horrible. Though user friendly. Like this product.,It is good but please sell spare parts also like stand  lock and all the things,I like it", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41YjSD1XPoS._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Callas-Multipurpose-Breakfast-Ergonomic-WA-27-Black/dp/B08MZQBFLN/ref=sr_1_167?qid=1672903002&s=computers&sr=1-167"}
{"product_id": "B0752LL57V", "product_name": "Casio MJ-12D 150 Steps Check and Correct Desktop Calculator", "category": "OfficeProducts|OfficeElectronics|Calculators|Basic", "discounted_price": "₹440", "actual_price": "₹440", "discount_percentage": "0%", "rating": "4.5", "rating_count": "8,610", "about_product": "Regular keys like %, square root and Memory|Dedicated +/- and Backspace Key. Plastic keys|Indian Comma Marker for easy reading of numbers in Lakh & Crore. Can be set to show numbers in Million & Billion also.|Operation symbol on display (+, -. x, ÷) indicates the status of operation you are currently performing|Key Rollover: Key operations are stored in a buffer, so nothing is lost even during high-speed input|Dual Powered - Solar & Battery Solar powered when light is sufficient, battery powered when light is insufficient.|Product Dimension: 30.1(H) x 123(W) x 140(D)", "user_id": "AFCKVOFM46DHVEVU7M4ABUCXDLLQ,AH6ROKDEOWF5LFGRK4GWLYNSO6YQ,AGWSJPW7AT2OTWNRZGKCMRT4TPYA,AFX3S2XJA42O4HP6JF2F2MM5XGFA,AHZJIQSIZULMCKUVKKUV7WG5PEKA,AGSOOGPVVNTJXHSJK7FBA7ZJHIHQ,AE5BCR4FI23IPEGD3ZSDWOGO4ALQ,AGJ64A22CHS6NGAE6LD7G7PHCYKQ", "user_name": "Dipu,Kayumuddin,Ankit salunke AS,Ramachandran Ravi,Nekitha V,Sumit G.,Netaji,Raymol", "review_id": "R3S29FN21O2CMZ,R11MO8HH0GUD1M,R3TQJKN7EJKGXO,R1TC8NPQAQ5J3C,R1PFTUO42S9ALO,R3GFV68WKN08V3,R2Y75UNA9CGD8E,RV7AO8FJ14RY7", "review_title": "Very easy to use,Easy to use .,Best calculator for CA students,good performanace,Nice,Best,Very nice and steardy,Good product", "review_content": "Very good,Nice product,https://m.media-amazon.com/images/I/71M+sT3c-iL._SY88.jpg,simple and handy for travel purposes and use at office.,Nice,Good calculator but i think price is high as compared to market,Writing review after one month usage. Very good quality and worth the money. No issue till date. Go for it,It is working fine.I like it.", "img_link": "https://m.media-amazon.com/images/I/41cRLg+wdIL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Casio-MJ-12D-Desktop-Calculator-Grey/dp/B0752LL57V/ref=sr_1_168?qid=1672903002&s=computers&sr=1-168"}
{"product_id": "B08K4PSZ3V", "product_name": "Tukzer Capacitive Stylus Pen for Touch Screens Devices, Fine Point, Lightweight Metal Body with Magnetism Cover Cap for Smartphones/Tablets/iPad/iPad Pro/iPhone (Grey)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|StylusPens", "discounted_price": "₹349", "actual_price": "₹999", "discount_percentage": "65%", "rating": "3.8", "rating_count": "16,557", "about_product": "MAGNETIC DESIGN- Tukzer magnetic capacitive touch screen stylus pen not only you can unscrew the small cap in the tail end of the pen to store a spare disc tip for an emergency situation when the disc is broken or lost but also both the head end and the tail end of the stylus pen are lined with a magnet, so the cap will be absorbed by the magnetic when you just put the cap close to either end|PRECISION - The stylus pen for iPad transparent disc allows you to see exactly where your mark is pointing and gives you supreme accuracy. You will be able to use your device in a way that is just not possible with a regular stylus|CONVENIENCE - Special hidden disc tips design. The replacement disc tip is hidden inside the pen cap. It can make sure you can use the pen for emergency situations when the disc is broken or lost, Tip Material Rubber|WIDELY COMPATIBLE - Disc Stylus is widely compatible with all touch enabled Devices – 7mm Plastic Tip with Conductive material compatible with iPhones, iPad, Android Phones, Android Tabs, Microsoft Surface etc|DIMENSIONS - 168mm Length. Comes with 6 Months Warranty", "user_id": "AG2WVO7W7ODQCKIFZ4EEIQSC5Y7A,AFDCDOCRT7PK5OZCUBZJ3WGXQC5A,AGY5MU7BF5S7NZ7H6FDZC7BM7PAA,AHVGSKRUJAMOKHD3LI46BE322UDQ,AG4OAYEMGQAZIBMSV7SJPYDXICXA,AH22BJULNDXPJPJ5NZEBHQRAUS7A,AHF3ANMCWYYADVLTRUTKK43XXLPQ,AFH7NASUMH66QSOAFC3OEXCF5LNQ", "user_name": "Sneha Suyal,Maheswaran,Vamsi Mohan,CK,arya,Nisha,CSK_OFFICIAL,hiba", "review_id": "R2FRXL54AFATWQ,ROBDUAJXECNYM,R6GD9MATBBC0,RGKPT6A78DSX2,R7UCUG9Q2AOY9,RWC4G90JFDFX5,RCDQUPWVIM6NN,R25MFNHA3G4KVK", "review_title": "Only affordable Stylus that works with Apple,Product is good, but Spare disk is missing for me.,Best deal for this price,Good but improvement needed,Average, better option are available,very fast and smooth work,Precision & speedy,Amazing", "review_content": "This was a saviour for me as I didn’t want to buy expensive stylus and max dont work with Iphones. It’s not too precise but it gets the job done. I love it,Unexpectedly this product works very well. But When I buy this, the spare disk was missing.,This item is simple awesome for this price. It is doing good without any glitches and worth buying for the price amazon is offering.,Though it is good but the tip of the stylus pen should be umbrella free....no handle grips too.,There is a delay between writing and also I get wrong color i ordered bluse and I get gray,this is a good digital pen for digital art work and very smooth working techniques using so easily,Works perfectly on Samsung S22 Plus. I often use it for video editing too. But I think it's overpriced. I got it for Rs. 389 including delivery charges. It should cost max upto 250. 2 stars have been cut for overpricing.,It is definitely worth the money tho it does give some scratches it's not that see tho so it's fine for it's price light weight", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31bKIZtFGWL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Tukzer-Capacitive-Lightweight-Magnetism-Smartphones/dp/B08K4PSZ3V/ref=sr_1_169?qid=1672903004&s=computers&sr=1-169"}
{"product_id": "B09Z28BQZT", "product_name": "Amazon Basics Multipurpose Foldable Laptop Table with Cup Holder, Brown", "category": "Computers&Accessories|Accessories&Peripherals|LaptopAccessories|Lapdesks", "discounted_price": "₹599", "actual_price": "₹3,999", "discount_percentage": "85%", "rating": "3.9", "rating_count": "1,087", "about_product": "You can use the table as a study table, breakfast table, reading table, and more.|Comes with built-in grooves to hold iPad and Kindle and holders for MacBooks and Tablets.|Anti-slip sponge keeps the laptop secure when the table is tilted.|Foldable metal legs allow you to store the table anywhere in the house.|The curved desktop edges not only form a protective layer around the laptop but prevent accidental scratches and injuries too.|Dimensions: L X W X H: 59.5 X 39.5 X 26.5 cm.|Package contents: 1 laptop table.", "user_id": "AFJXIJRSFMMNTYMOGJK7EE5XNRAA,AHPNKUIAW65N46LJ65KLE62O2ELQ,AEY3K25JLSHVO6HLN6ADH62FJXMQ,AGX4D4PROUQBRLWAC6L2I7UQSC4A,AGI5GQ6NFKL5BOZABRAH3KIS5C7A,AGTBOVMYG7TUOXA2KTDKPHKVOUIQ,AF7NUNBNBZ2WXQ5QGBAVERSVWZYA,AGH73AG4ROQHA5BYSSFPWXK5NXVA", "user_name": "Arun J,Sebonti Banerjee,srikar,Mayu,Neeraj joshi,Vinay Singh Kharayat,GP,Paromita", "review_id": "R1IF6OX5EMCHRA,R11D9Q1R128JAS,RYHX3VX289G1,R19FHZ8XC2J59F,R30VMLL7S21LYI,R2SB7CBS0DFSTW,RQWYUTNJ2RA2L,R1TM8DUKLOEWBV", "review_title": "Good product but little costly,Very sturdy and easy to handle and carry,Ok,Good one but not exactly like shown pictures,Good,good quality,Good quality product,Very strong but not stable at all", "review_content": "If you are using a seperate mouse go without cup holder it'll give you some space otherwise it's fine for even 15 inch laptop. It's strong and sturdy but it should be 350 to 400 not 599.,Everything is perfect - the sturdiness, the color, the finishing, the height, the weight. The only con is that it can be a little shaky if you use it on the bed.,The table is lightweight and less durable but it serves it's purpose.it's a good product for its price don't expect too much.,Product is good but  price (569 rs) is little more higher than over all quality of product and also there is no logo of amezon basics,It's good,I think the mobile/tablet holder is useless,Material is of good quality and product is worth for money. It would be nice to have a lock mechanism so that stands doesn't tend to close once placed in surfaces like bed.,The table is very strong. Will not break easily.But its legs are not stable at all. If you keep laptop on it and is not supported, then the whole table will fall sideways. It happened twice to me.", "img_link": "https://m.media-amazon.com/images/I/315g5ipEPAL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Amazon-Basics-Multipurpose-Foldable-Laptop/dp/B09Z28BQZT/ref=sr_1_170?qid=1672903004&s=computers&sr=1-170"}
{"product_id": "B094DQWV9B", "product_name": "Kanget [2 Pack] Type C Female to USB A Male Charger | Charging Cable Adapter Converter compatible for iPhone 14, 13, 12,11 Pro Max/Mini/XR/XS/X/SE, Samsung S20 ultra/S21/S10/S8/S9/MacBook Pro iPad (Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Adapters|USBtoUSBAdapters", "discounted_price": "₹149", "actual_price": "₹399", "discount_percentage": "63%", "rating": "4.0", "rating_count": "1,540", "about_product": "👍【USB C TO USB ADAPTER】-This is a USB C FEMALE to USB MALE adapter, used to turn all you USB-A ports of laptops, chargers or other devices into a USB-C port. Gives you the ability to connect USB-C peripherals to devices with USB-A ports.|👍【HIGH-SPEED-TRANSMISSION 】 Supports Single-side USB 3.0 (USB 3.1 Gen 1) 5GB/s superspeed data transfer. Please note that this USB to USB C Adapter only supports single-sided 5Gbps high-speed transmission. The Type-C female port allows you to switch between USB 3.1 speed and USB 2.0 speed with a simple flip of the Type C plug. Now you can enjoy unparalleled transmission quality from your devices!|👍【DATA SYNC AND CHARGING】USB 3.0 (USB 3.1 Gen 1)port, up to 3A, enables up to sync and display movies or music in real time thanks to a 5Gbps transfer speed, approx 10x than USB 2.0; Also, you can edit video in camera directly via port instead of downloading files|👍【SUPERRIOR DURABILITY】Made of Premium aluminum alloy housing with specular precision process, enables plug in/out again and again. Tested and inspected meet USB Standards, fit for USB 3.0 / USB 2.0 devices, built-in 56KΩ pull-up resistor protects your devices from damage. Internal PCMA adopts EMI proof process, more stable performance.|👍【 EASY OPERATION AND PORTABILITY】-Easy to use,just PLUG and PLAY, no driver required. This USB C TO USB 3.0 adapter has the advantages of SIMPLE STRUCTURE ultra COMPACT,LIGHTWEIGHT and PORTABILITY, small enough to leave it in the USB port or anywhere in your package, take it anywhere you want!", "user_id": "AFA6YM4NTFRGHHKYN5U7HUYEVSUA,AEB3EVUTQCHIE3PGITWK72Q6EKTA,AENDMMCGUEYDYJTVD5GZ7VWYOALQ,AGYTNS7EN2WZ2WQGLKN74NA75PNA,AFXQSIUT7B2DVWYGONQGEGVMGFTA,AGBSRQCSUBTYN644BB4FVJBC6RCA,AGK2AGWUMBCU5TCFIZSFDJORZH5A,AG6DLOLZYH4E5ZATU7HOAK4REHSA", "user_name": "Abhi_K,Amazon Customer,Swap,shivam,Abhinav Singh,Pulkit Bhardwaj,Minoy C Mathews,ADITYA SINGH", "review_id": "R1QIWMR6C3F3U0,R1MSGOZTOMZE4B,R20OZCEE82GU0W,RMKY6FED1DV2L,R3BYJ1ULP499GK,R3G93XCNRW5ZRM,R2AKI7N239TKC6,R1QCWFZKUGG13I", "review_title": "Good and does it’s work,Nice product working absolutely fine,Good,Good product,Value for Money,Okay overall,Value for money..,Good product for i phone users", "review_content": "Using it to connect my type C Plantronic headphones to Dell laptop and it’s working fine.,We like this product it is just amazing,support good charging speed.,Nice,Small yet very good accessory for the car. It is very small in size and becomes a part of the car interior.There is no lag in supplying the power and gives an ease to connect phone with USB C type on a USB A port.If you are looking for a good converter then this is it.,Annoying advertisement of asking you to give 5 star rating is in the packaging box of this product.,It is very helpful in charging phones in old cars.  I am using an old car and it only has USB -B Ports. And I am using it for some power banks also...,I had an unused cable c to lightning port but was not being used. I ordered this product and it turn out to be miracle for me now i can use my unused cable with this product. GOOD PRODUCT 👍👍", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51JIngdPfEL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Kanget-Female-Adapter-Standard-Interface/dp/B094DQWV9B/ref=sr_1_171?qid=1672903004&s=computers&sr=1-171"}
{"product_id": "B0BBMPH39N", "product_name": "Amazon Basics Magic Slate 8.5-inch LCD Writing Tablet with Stylus Pen, for Drawing, Playing, Noting by Kids & Adults, Black", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|GraphicTablets", "discounted_price": "₹289", "actual_price": "₹999", "discount_percentage": "71%", "rating": "4.1", "rating_count": "401", "about_product": "LCD screen without glare, radiation, and blue light for easy viewing and eye protection|Pressure-sensitive technology provides a paper-like experience|8.5-inch ultra-thin, portable, lightweight, easy-to-carry tablet|Comes with a stylus for smooth writing, a key for clearance, and one to lock the screen|Eco-friendly product as it doesn't require paper or ink|Multi-purpose use as a fridge whiteboard, memo pad, writing pad, notice board, etc.|Built-in coin-cell battery consumes low power and functions smoothly up to 1 year making the tablet convenient to use|Package Contents: 1 Magic Slate Digital Writing Tablet with Stylus", "user_id": "AEREPHGDEP7EUMBCNLBQ67GNJQMA,AHLOJPA3DIPNKLDZVAW5XBTCSA5Q,AEAEGYFLA2BDHDKFUFJYT535NYGA,AFAC52GQISXYJ5DL4YVQHXGSE4MA,AFHE2TI3W6OLWLYJHVQNAT3C5BUQ,AF3T7GA6HBAC7MHVNY3RBAHOEXJQ,AEOHQRCRMKHNGRQRBVRQJUV3UB3A,AHRD7JPBFXQ2S3VWIQRTIKHYK66Q", "user_name": "Amazon Customer,Prince kumar,SK,Nishikanta Sahoo,Shivam,Amazon Customer,Piyush,Rafiya", "review_id": "R37B1CGX8LWLNS,RUFFDMZAXAV0E,R1FUPYVQBR42LV,R283XBLNQ2SZ1E,REJ2BDZ46X1UX,R1I8OS16C2AHO1,R3JWC2LKUMZBD3,R1F3K6BW2IEZBJ", "review_title": "I like to draw on it,Best  writing pad,Great for Noting or Doodling,Good to go,The pen is too flowy and the strokes are coming out a bit thick,Magic Slate 15-inch LCD Writing Tablet,The quality and build seems good so far.,Very useful product", "review_content": "I use it for writing messages or drawing.. the only con is it reflects light and brightness is less.. so nothing is visible when lights are out... But its very smooth and easy to use.... I like it,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71S0PtuMUUL._SY88.jpg,For the price it’s great. A erase and different ink. Poor functions would have completed the package.,,It might be the result of adding additional materials for durability or longetivity - who knows but the pen-strokes you'll see be a little 'leaky' and thicker.,Disadvantage:Build Quality is very poor - light weight Plastic finishing.If Children handles the product more carefully.Brightness very poor.Skin or finger touch also writing the LCDAdvantage:Price is valuableLock button is useful One,You can always trust Amazon basics. Got it yesterday and the quality and feel is good.,Useful one for kindergarten students", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31GrCGz9drL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Amazon-Basics-8-5-inch-Writing-Drawing/dp/B0BBMPH39N/ref=sr_1_173?qid=1672903004&s=computers&sr=1-173"}
{"product_id": "B097JQ1J5G", "product_name": "Zebronics ZEB-90HB USB Hub, 4 Ports, Pocket Sized, Plug & Play, for Laptop & Computers", "category": "Computers&Accessories|Accessories&Peripherals|USBHubs", "discounted_price": "₹179", "actual_price": "₹499", "discount_percentage": "64%", "rating": "3.4", "rating_count": "9,385", "about_product": "4-Port USB 2.0 Hub. Cable length 50 cm|Useful for Laptops, PC & Computers, Mac book|Pocket Sized, Easy to Carry|Plug & Play", "user_id": "AGDY4LIW3A477KFMINSUKYRMSK7Q,AHX6FDK45XLTIXMOCTEJLIVTHJDQ,AH7QP5VH5777BLVSP5M6KE2IEOWA,AG3B6VHXNSP3NV4QKN6S2UYW3IHA,AGK67PKY5YNSHMUNIPVHWPQKPBLA,AH75SNR4HB6LTEAQRARKQV4PGRJQ,AGCF4OSJR3ZAIS426KF77KR7N52Q,AESIFL6Q25WEMARTHLWMLOCS7ALQ", "user_name": "Dilip Kumar,Aakash Purohit,ÂRUN MOHAN,Charan Kumar Shetty,zaineb,Nalin,Priyanka,Amazon Customer", "review_id": "R2OTWTVJ7UBDIL,R3I2UK18RSKIIX,R3F9R8G9YHTF6,R2KV2L7KD9GGXJ,R3HJSJJMUWOH8Y,ROTCPLKO6UKDA,R3QONJCF8NKEWD,R1FEIDBQF2KF9N", "review_title": "Average usb hub,Inferior quality goods,its CHEAP,Built in quality is low,Ok,Finish is not very good,Recieved damage piece,Packaging was damaged and is not new piece", "review_content": "Quality of the material is not that good. If it falls then it will break in parts easily but overall it is easy to use and speed of the ports is fast.,Manufacturing quality is quite poor. Even a small movement can cause the second device to get unplugged from the USB port, which is not at all strong.,Its  cheap on multiple levels, first ad foremost money wise and then most importantly quality wise. Used it for 2 weeks and the casing came off and i cant seem to click it back into place, it works(for the time being) so im just waiting for it to die now. but for 180 rupees what else can we expect.,Built in quality is not so good, it's very sensitive,,It is not tiny, but small enough not to clutter my desk. Cord length of about 1.25 to1.5 ft is nice. USB ports work well. The only negative point that is glaring is the poor finish. However, for the price, a good buy,https://m.media-amazon.com/images/I/719wdleO76L._SY88.jpg,Packaging was damaged, seems to be a some one has used and returned this item.", "img_link": "https://m.media-amazon.com/images/I/31oMWLNvoVS._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zebronics-ZEB-90HB-Pocket-Laptop-Computers/dp/B097JQ1J5G/ref=sr_1_174?qid=1672903004&s=computers&sr=1-174"}
{"product_id": "B07YY1BY5B", "product_name": "Noise ColorFit Pro 2 Full Touch Control Smart Watch with 35g Weight & Upgraded LCD Display,IP68 Waterproof,Heart Rate Monitor,Sleep & Step Tracker,Call & Message Alerts & Long Battery Life (Jet Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,499", "actual_price": "₹4,999", "discount_percentage": "70%", "rating": "4.0", "rating_count": "92,588", "about_product": "The brilliant 1.3\" colour display is now full capacitive touch, supporting taps and swipes, so it is easy to read and operate.|The strong polycarbonate case makes the ColorFit Pro 2 featherlight on your wrist and is available in 4 beautiful colours with matching swappable straps.|24x7 heart rate monitoring with the built in optical HR monitor that measures your heart rate every five minutes. With up to ten day battery life, ColorFit Pro 2 can go for more than a week without needing to be charged via the included magnetic charger.|9 sports modes to cover all your activities, whether you walk, run, hike, bike, treadmill, work-out, climb, spin, of perform yoga.|You can sweat as much as you like and even wear the ColorFit Pro 2 in the rain, thanks to its IP68 waterproof rating.", "user_id": "AE3XH7AL52IBMYH77L5KO4DGTCDA,AHZHIHTLOMIHI5DFCYLT2ZIBMUCA,AEFZB452E6G2IGBYI3RXU7C5QGTA,AE56M2JBQC5JI3MSRAM3VTYP36HA,AEEVA2YRT3OJQTU2U7EWDW7EKPPQ,AHDGC4HI43BOPM4AH4NOT4SJNL2Q,AHQLC5YA473NA4RJFGR33PYO5GGQ,AHRP5SYVMJGYNSHAWBCS6AKC5VEQ", "user_name": "Vishal shah,Sameer,Joshilla P.,Sunil Govind Jawale,Pawan kumar,C.Rajeshkannan,Manisha tyagi,Wizzy", "review_id": "R2IUZKZ2BFCQPB,RS3FCMS4SCQ6V,R1DKS4CX2ELE9L,R2O8KBZUC4EB8A,RNT0QZ6SRDN5V,R3H9YQ6S3H3GLL,R3W56W4AW11KW1,RPJ5DDRIN3STD", "review_title": "nice product,Great watch,Ok ok,Nice 👍,Thik thak,Avarage,Smart watch,They can improve more", "review_content": "I really like this product. Gifted to my sister, and she likes it,Great ⌚,Good product,Nice 👍,Thik hai,In this price range it's ok product,Color so nice..I loved it,Need some more features:(", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41UD9vNsIjS._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Noise-Colorfit-Pro-Touch-Control/dp/B07YY1BY5B/ref=sr_1_175?qid=1672903004&s=computers&sr=1-175"}
{"product_id": "B08VRMK55F", "product_name": "Zebronics Zeb Buds C2 in Ear Type C Wired Earphones with Mic, Braided 1.2 Metre Cable, Metallic Design, 10mm Drivers, in Line Mic & Volume Controller (Blue)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹399", "actual_price": "₹699", "discount_percentage": "43%", "rating": "3.4", "rating_count": "3,454", "about_product": "Metallic Design, Sturdy Built|Comfortable Fit|Extra Ear tips|Compatible with Phone, Tablet, Audio Devices with Type C Input Port", "user_id": "AFSM3ANFFBHN7NCB3JYF4RZ7YQAQ,AE67ZNU72JW5PJQHCXBG7SZX63SQ,AEWHCRZOB4UBLIBAN2HJSXDEGPBQ,AEQNCSQJK3ZBHTJ7M2ID6FLUA2CA,AEFDI2YRIMBNCPVHEGTCZ3EEJJBQ,AGS3WLGMF7WWDCLGJSVULWUNPLFQ,AEF4AQOCIUBZ2YYY25OWVB42GTKQ,AFDU4WS7SYXWPP3Y7OSPKXRJUB4A", "user_name": "aravind,AbdulKhader Mohammed,Mehul Pandya,Siva G,Arvind kumar,hariharan,Rhea,aveem ashfaq", "review_id": "R14UKNZTUGMLYJ,R1W6GXERH9XYVJ,R2XFIAZAPHYP3B,R2NKYQY8W7X4HQ,R1JJLPIVVGYYVD,R34HN1WQOVXABP,R1CFS1H3NYJT22,R2LARKDVN5VEA6", "review_title": "Dissapointed in the microphone,Overall Good product in budget,don't buy for calling purpose..,Gets the job done,Good,Value for money,One side stopped working in 2 months,Very average sounding earphones", "review_content": "Dissapointed in the microphone,4/5,don't buy for calling purpose.. voice not delivered properly to hearing other side.. you should by best earphone in local market.,I've been looking for a good pair of earphones with type C as my phone now comes without a 3.5 mm jack sadly. (Pixel 6a).Unfortunately Indian markets doesn't have much of budget USB C earphones as it's extremely limited in availability so my search gotten narrowed down to this one.Pros:+ Works okayish for the price.+ Sound quality: Average+ Call quality: fairly good. I didn't had much complaints from the other side during phone calls. Tested when riding bike also, there were some wind noises reportedly. But still does the job.+ Buttons: works well. Haven't noticed any niggles thus far.Cons:- definitely not recommended for audiophiles as there's no distinction between highs, mids and lows. Sound quality gets muffled if volume raised above 70%.- bass is not that good. It's there, you can feel it but it's not adequate and gets muddles out if the volume raised. Pls make use of your Eq app (Poweramp Equaliser app, in my case) to tweak up the settings to get noticed on its bass.- Very mediocre performance of mids and highs too. (Gets slightly better if tweaked with an eq app).- causes pain in ears if used continuosly.//If you are looking out for a decent budget USB c earphones mainly for calling, then go with this one. Works well for the voice calls//,It's goodMic is not proper,I think this is the best c type headphone for this price segment. Sound quality, bass, meterial quality all are little above average so for RS.549 (blue) we can definitely buy without second thought.,Worked well for first two months. Now only one side is working.,I bought it to use with my Samsung S7 Plus which does not have any headphone jack. The bluetooth earphones work but when I'm in bed on my side, they have \"accidental touch\" with the pillow or somewhere. So, I bought these USB-C wired headphones. They work with my tab, which is good news. But the audio quality is average. It sounds tinny just like a 100rs headphones. Maybe that is to be expected because these earphones are cheap. So, I ended up not using them very often.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/313nBNJrT6L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zeb-Buds-C2-Controller-Blue/dp/B08VRMK55F/ref=sr_1_176?qid=1672903004&s=computers&sr=1-176"}
{"product_id": "B08CHZ3ZQ7", "product_name": "Redgear A-15 Wired Gaming Mouse with Upto 6400 DPI, RGB & Driver Customization for PC(Black)", "category": "Computers&Accessories|Accessories&Peripherals|PCGamingPeripherals|GamingMice", "discounted_price": "₹599", "actual_price": "₹799", "discount_percentage": "25%", "rating": "4.3", "rating_count": "15,790", "about_product": "Compatibility: Redgear A15 is compatible with PCs, laptops, notebooks and other devices with a similar input.|Multi Programmable Buttons: The Redgear A15 is designed with multi programmable buttons and also has durable and semi honeycomb design for a better grip.|Upto 6400 DPI: With Redgear A15 you can experience a DPI change of upto 6400|RGB Lighting: A15 comes equipped with customizable RGB mode|Other Features: It comes with a gaming grade sensor for quick movements and reflexes. It also has extra durable switches and enhanced build quality to increase the durability of the mouse.", "user_id": "AFXRH6SHIJIG475VOAVT4QPDJHIQ,AFSUZQF66HKTKPWRUOGXQKZ6VAKQ,AFZVACGHIEIUWBF2UAWI2MU67LCA,AGFNZ473LGYCCHTA6CZKSUAYVN7Q,AFHK3ZGJ2YCZLGNZTHLEN6MVGCAA,AFF4CH4SPZXHDKB5BB25KUX22SBA,AH3NRXRMQGG7MFMMJK6V4WQJYO5Q,AFW7SE27ST3TM7KFAGQEORGOCQJQ", "user_name": "Suraj Singh,Shashi p.,Anmol,Toseef Iqbal,Anjay mandal,Aniket,dadaso s.,anuragnaidu", "review_id": "RU005HHB0U3FV,R2OH909YAN0NWP,R2QUS4TP2AQD7Y,R11IIB56J49ZMK,R27X20M16J5I2V,R3LJECTJJCPCMA,R1VLU5EP1LPYG5,R3N7Q2Z3RUDS01", "review_title": "Very good mouse Under 500,pretty good gaming mouse,very good in this budget,Really comfortable,good mouse just plug and play,Good enough,Best budget gaming mouse,Too big too hold, but you will get around it.", "review_content": "I have been using this mouse for like 2 months and this is the best mouse under 500.the mouse has the basic gaming stuff like extra buttons dpi settings, but the main thing is the software like you can customize so much on this mouse the RGB is fully customizable, you can set many macros you can revamp the keys and also change the dpi values. these features usually come in expensive gamming mouses, but this is very good for this cheap.the design is also very good and one thing you should note before buying is that this mouse is big like it is big as my hand so if you got small hands, you should think twice, but it doesn't affect that much i got the hang of it in like a week.it doesn't come with any warranty so thats a con. but a part of it, everything is so good.Really would recommend,this mouse is very good for gaming, the high dpi sensor on this mouse is very good. their is no drifting. the rgb is very goodi have used this mouse for about 3 months and its still intact, no problem with scroll wheel or side button,the software provided by redgear is also very great and has lots of features.i mostly used this mouse for fps games like (csgo, valorant, overwatch)but the side buttons also help in building in fortniteonly issue is the build quality, some party feel kinda lose,its my first gaming mouse but damn its so good. the grip is perfect and dpi is also good at this range you shoud go for it if you get it under rupees 500.,No words. Just excellent. Accuracy top notch. Feeling while in hande is awesome. Feels very big in hand. Very comfortable to hold for long time. Design is very good.,nice mouse love it... decent mouse with ecent price..,If you are buying this mouse exclusively for gaming, don't cause the polling rate is no different than lets say a cheap dell mouse you see at work (exact polling rate of this mouse is 125hz which is very low if you want precise aiming in competitive). But the redeeming feature might be the looks. The rgb looks cool (but you cant use just one single color). It feels great in hand but my thumb has to pull back a lot to press the lower side button but that can be attributed to my long thumb. The cables braided too so there's that!Verdict: Great value is you can get it for around Rs. 400 considering its looks and other subtle features.,,A fine mouse for what it's worth.", "img_link": "https://m.media-amazon.com/images/I/31luFfya0kL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Redgear-Gaming-Semi-Honeycomb-Windows-Gamers/dp/B08CHZ3ZQ7/ref=sr_1_177?qid=1672903004&s=computers&sr=1-177"}
{"product_id": "B08SCCG9D4", "product_name": "JBL Commercial CSLM20B Auxiliary Omnidirectional Lavalier Microphone with Battery for Content Creation, Voiceover/Dubbing, Recording (Black,Small)", "category": "Computers&Accessories|Accessories&Peripherals|Audio&VideoAccessories|PCMicrophones", "discounted_price": "₹949", "actual_price": "₹2,000", "discount_percentage": "53%", "rating": "3.9", "rating_count": "14,969", "about_product": "Omnidirectional pickup pattern|3.5mm TRRS jack compatible with smartphones & most DSLR cameras|Can be used with mixer amplifiers with 1/4\" (6.3mm) adapter|Powered by LR44 type battery to connect to DSLR cameras, Ideal for : Content Creation, Conference Calls, Voiceover/Dubbing, Voiceover/Dubbing|Cable Length: 6 Meters|Application: Content Creation, Voice over/Dubbing, Recording|Tie-clip, windshield, 1/4\" (6.3mm) adapter, LR44 battery, carry pouch included", "user_id": "AFROXVCIF6PZXFXLS7DLTPT2CGCQ,AHA4ODJMDNBNUVEUSICIV66LIJDA,AECLUTC5AZMCISU3ZNO6J5POEQQQ,AFN6GFJ6JSQR5IEIT4Y34BNEZAYA,AEBPHDTDFUCW7HI35KWQYFX46I6A,AELTGGPWKKSTSM7K75CTYV6PIM5Q,AEB5GI6B4ZNBZUJQPXNXKQ5M776A,AHUPT5QRQ2NHQTMF6RUCZW6WBXXQ", "user_name": "Ansh KaTariA,Saqlain Shaikh,Sardar V.,Rushikesh P.,Biman,Kumar ravi,Avinash kr pandey,pankaj kamble", "review_id": "R20M6JOASW88SS,RPM4RV2MQNNN0,R19KRP5SDTN2NL,R1HQBX8OVYYO7W,RQ9RWJZB21GNX,R26WA9NHSG09V,R1R02S6NW8I5BS,R3SFPV2D6N2S9Q", "review_title": "It's just good !,Good for WFH,Works according to needs,Great product for beginners,Good for beginners,Very nice product,Ambiance sound capture,JBL mic is best for Biginaers", "review_content": "It just good for beginners you can start your work using this one, noise cancellation issue you can face while using this and some time connectivity problem also can face coz of it's 3.5 mm jack it's not working well sometime ....overall it's okay at this price.,,Good quality sound.. better than phone microphone. It has a deep tone to it rather than compressed sounding audio from smartphone mic. Works with my nikon z50.,Great product for beginners,Like the product, works good at this price,Nice one,Sound good but capture ambiance Sound not deduct ambiance sound,I am very impressed this product.Best Mic.", "img_link": "https://m.media-amazon.com/images/I/41U9-x0JGPL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/JBL-Commercial-Omnidirectional-Microphone-Recording/dp/B08SCCG9D4/ref=sr_1_179?qid=1672903004&s=computers&sr=1-179"}
{"product_id": "B0972BQ2RS", "product_name": "Fire-Boltt India's No 1 Smartwatch Brand Ring Bluetooth Calling with SpO2 & 1.7” Metal Body with Blood Oxygen Monitoring, Continuous Heart Rate, Full Touch & Multiple Watch Faces", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹2,499", "actual_price": "₹9,999", "discount_percentage": "75%", "rating": "4.1", "rating_count": "42,139", "about_product": "Fire-Boltt is India' No 1 Wearable Watch Brand Q122 by IDC Worldwide quarterly wearable device tracker Q122.【Bluetooth Calling Watch】- Fire-Boltt Ring bluetooth calling smart watch enables you to make and receive calls directly from your watch via the built-in speaker and microphone. This smartwatch features a dial pad, option to access recent calls & sync your phone’s contacts.;|【SPo2 & Heart Rate Tracking】 - The Smart watch tracks your real time Blood Oxygen Spo2 and has 24*7 Heart Rate Tracking. It also has Sleep and Fitness Tracking.; 【1.7 inch HD Full Touch】 - Industry Best Display of 1.7 Inches Size 【Full Metal Body with Changeable Strap】 - Sleek & Fashionable Metal Body best smart watch. The one-click control mode and honey comb menu helps you quickly navigate 【 Battery Life】- The watch can work for 24 Hours with Bluetooth Calling ( Normal Usage )*, 8 Days without Bluetooth Calling. System requirements: Bluetooth version 5.0 and above. IOS 7.0 and above, Android version 4.4 and above.|【Music Experience On The Go】 - Equipped with an inbuilt speaker, this smartwatch lets you play your favourite tracks on the Watch without having to take out your phone.|【Multiple Watch Faces & Smart Controls】 - The Smartwatch with call function has multiple Watch Faces. It has Smart controls like Weather Forecast, Alarm, Remote Control Camera. Get a 1-year assured warranty from FIRE-BOLTT|Clasp Type: Tang Buckle; Case Material Type: Stainless Steel; Included Components: 1u Smartwatch, 1u Charging Cable, 1u Manual; Compatible Devices: Smartphonetablet; Human Interface Input: Touch Screenbuttons; Band Material Type: Silicone|【How to activate Bluetooth Calling】- To enable Bluetooth Calling Function, first connect it to the compatible app. Once connected, manually go to the phone's Bluetooth settings and pair this smartwatch (Bluetooth Name: BSW005). Upon pairing, you will get a notification: Connected for calls and audio..Water resistance depth:1 meters", "user_id": "AFUGDQG5WBWBZJE2NX2OICO3UFWA,AHFRVHCEDFHQ4PRJLJHZKNRN34KQ,AHZDDRQIN5ABLJXSOK7EZI2GZHYA,AHCN532M27HWIMZYEX5JVUYXR5EQ,AF6LU7CXBGSR5KKHAJVN2PSESNDA,AG2MRGYFBXUEYGEMBLUJC3F74LJQ,AFF5WUW7WRVIFAPDQNHER4FCQFAA,AERZ4XMT3P4TPSFNUYQ4AKUC6S6A", "user_name": "Rajesh Panchanathan,Ravikumar_Mani_INDIA,SATYAM STORES,Deepak Vincent,Ranjith,Surya,chetan J,Nisarg R.", "review_id": "R2WBBSKN8SRWUM,R1OG8IBJAU5BIT,R1QPUP4Q0343RD,RO0RSJKPHXH1A,R1B9XZHVQ5HH89,R329DLXLSGR4NS,R18BCRG4WYODGG,R3U7XXGC3DE0IB", "review_title": "Overall Watch Review,Descent  looking, perfect working smart watch,There is a bit of snag in wake up mode,Battery is not good only one day it will come,Beginner friendly apple clone watch,elegant look,You can go for it!!,Nice product but the touchscreen and app could have been better", "review_content": "Great watch, good features. Easy and simple to use. Watch face is nice. Battery life is decent. Last for 4 days. Sensors work well. Smooth controls and display is bright. Only issue is that, after the watch came into contact with water it started malfunctioning. Power button not working, Bluetooth calling doesn't work and battery gets quickly drained despite having Bluetooth off.,I have recently bought this product and i was not so happy and not worried. As advertised, this smart watch meets its purpose. Descent size and medium weight to wear always.Few of my suggestion to become a better watch:touch response can be improved, touch accuracy is less.resolution can be still more betterNeed to click on the button to see time or to awake. Instead of pressing button, should have give touch to awake.can have provide some more option like finding phone and finding smart watch ...,Product is good worth the money..there is a bit snag in wakeup mode while moving hands..it takes time to on the screen automatically .Overall good performance,Battery backup not good worst watch only 1 day it will come if you charge 100%....,Bought it 3 months back working fine call quality is good don’t expect great touch sensitivity,Found good and product finishing and features are super,The product is good with good battery life,Nice product but the touchscreen and app could have been better", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41P+nvE9FYL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Fire-Boltt-Smartwatch-Monitoring-Continuous-BSW005/dp/B0972BQ2RS/ref=sr_1_180?qid=1672903004&s=computers&sr=1-180"}