{"product_id": "B077BTLQ67", "product_name": "Orient Electric Aura Neo Instant 3L Water Heater (Geyser), 5-level Safety Shield, Stainless Steel Tank (White & Turquoise)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹2,790", "actual_price": "₹4,890", "discount_percentage": "43%", "rating": "3.9", "rating_count": "588", "about_product": "LONGER TANK LIFESPAN: High-grade stainless steel tank and heavy copper heating element with a nickel coating that protects the instant geyser against corrosion;|SUITABLE FOR MID AND LOW-RISE BUILDINGS with 6.5 bar pressure rating;|NEON POWER & HEATING INDICATOR that indicates power & heating;|LONGER HEAT RETENTION enabled by Glass Wool Insulation;|ADVANCED SAFETY FEATURES include a pressure release valve, anti-siphon hole, and a high-strength polymer body that makes sure this 3L instant geyser is shockproof and water-proof;", "user_id": "AFFEE53W5EYO6PULAOG7PB3ROPMQ,AFVAN57JZSJMCSHMVU3E5NFDIFJQ,AEI25R6V7XEXAAD455IWKZ3KE7TQ,AHKRRFR42OZYJKV7C2IR5OCPBMYA,AHFWCOO3S3BKNSCQPHSFFOA2RGSQ,AEZ35PT3M6ROXRMLILOSFP375TLA,AHPEEMPWH4HHB3T5FECTBZYUZ6PA,AHD2XZWAMMQH5MHZD3ULZVEVVJCA", "user_name": "srikanthmk,Prashant,Aashish M.,Pramesh,PrashantM777,Vajrapu lakshmy taruwn,Kish,Kusha Sahoo", "review_id": "R3MTH1DRIEXJ4M,R29A6Q7HZ6EA5U,R3TD9LHIZPOJZZ,R2PFDWJXL0R5KK,R1FKF3ZE0DND0Q,R3KUJV3XYVM4Z6,RD8XDFHPQTF6M,R2JZWY45ZK4FS3", "review_title": "Overall its good product,Heater is Slow,Small but useful !,Average product quality,Working Good,just missing temprature  Controller.,Nice quality,Good looking and tests patience,Good product with affodable price", "review_content": "Good product and superb fast heating.As it was small tank if u need to get bucket water1. On geyser and wait till water gets heated (2-3mins) ON TAP and fill bucket with hot water.2. OFF TAP and wait for another round of water heating then again fill bucket and leave the tap ON untill bucket filled with warm water.3. If u need more hot water repeat steps 1 &2.Cons:-1. One need to purchase inlet & outlet pipes which costs around 400 as this was not provided by orient.Writing review after 20+ days usuage.,Heater is so slow as compare to Bajaj heater ... currently i purchased this 1 but it's not good,I have ordered two of them . Installed in bathroom as well . There is a trick to use it in bathroom. Either turn tap really slowly or by turning on tap at full sppeed. Whenever the the water get cold again switch of the tap , after 3 to 5 minutes again on and fill. Just this compromise you have to make in place of storage geysers.,Product body fitting is average. Be prepared to spend another 600-700 R's. on installation pipes, 16A plug and installation charges. No installation plate with geyser. To be mounted on screws. No safety valve supplied with geyser. Overall average product. Better go for Havells which comes with all accessories.,Easy to install.Temprature controller is not available with this product..Till date working good.,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51IzGNDZ7eL._SY88.jpg,Ordered on 7th feb 2021. Received as per delivery date. On opening found that the unit is wrapped with plastic and found water droplets. Maybe they tested the product before delivery. Coming to the product, it heats water to boiling temp in 3-4 minutes and you can expect 4 jugs of hot water only.Delivery:5/5Packing:1/5 — since no bubble wrap or anything to protect the product.Product:3/5— you should not design a product with such low capacity, now I am struck after buyingLooks:5/5Will update more later...,First of all this is not a storage geyser. this is instant water heater. So better to understand the feature before using it. Just switch it on and wait for 1-2 min. it will start supplying hot water . As i told this is not a Storage geyser like 5-25 Ltr.  It comes with 3lts capacity only with 3KVA. So once the set temperature reach . Then Open the Hot water TAP in normal/Slow running speed .So that it will continue supplying Hot water/ warm water. If the Hot water Tap will be fully opened with full speed then this instant water water will not get sufficient time to warm the water. Hope this review will be helpful.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/21vWJo4CXKL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Orient-Electric-Aura-Neo-IWAN03WSM3/dp/B077BTLQ67/ref=sr_1_374?qid=1672923611&s=kitchen&sr=1-374"}
{"product_id": "B07YSJ7FF1", "product_name": "Crompton Brio 1000-Watts Dry Iron with Weilburger Coating (Sky Blue and White)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹645", "actual_price": "₹1,100", "discount_percentage": "41%", "rating": "4", "rating_count": "3,271", "about_product": "PRODUCT: Crompton's dry iron with Weilburger Non Stick Coating;TECHNICAL SPECIFICATIONS: Wattage 1 W; Voltage 23V; Dimensions 262 X 11 X 128 (L X W X H) mm|SAFETY: Auto cut-off feature switchess off an unattended iron ensuring safety of garments;CONVENIENT AND EASY TO USE: 36⁰ swivel cord for easy cord movement and 6 pre-set fabric settings with variable temperature control|DESIGN: Ergonomic design for a better and stronger grip that allows the iron to easily glide over the clothes;PACKAGE CONTENTS: 1 Unit of Crompton Iron, Instructions Manual and Warranty Card|WARRANTY: 2 years; Provided by Crompton from date of purchase.|Material Type: Plastic; Size Name: 1000 Watts", "user_id": "AF2JJYV2AX7CVSWYMLNZGFVHPLZA,AF4ZKPEZDK4MBC74G6DZYE4YPXNA,AFQRDDZDX24M6MLI75ZZBFLDSTSQ,AHL56ROKLAVDGP3ZRN45JIXXQ2GQ,AEJBNCW6FFRYFFVPDZU6AYD2LRBQ,AH7AIYFOHJAKH6SM4KNT6GNCHWNQ,AEWUBQURRQIYWSK5SBEOLZJRAP6Q,AHIRJYCO7S265XRVOHKEQJV6BPIQ", "user_name": "Lakshmi d.,vishal more,Vasanth Kumar,naveen,Golu verma,Abdul Arshad A H,sundar T,Mahesha", "review_id": "R29AV9WKFL78NP,RWFBNIYQTMW4A,R11CTFK86N4XV0,R2KD2NV6SEZGHN,R3DPGVFQ8PV47O,RBQ1DML3XWOLI,R1JRJHAW9JYVQ5,R3Q5M78JBLPTF5", "review_title": "Good,Easy to handling ..satisfied,Good,Good,Quality product,Good Product,Nice,Hanske taka product", "review_content": "Good,https://m.media-amazon.com/images/I/41D5G0vX76L._SY88.jpg,Worth for the price,Compact and lightweight,Nice,Nice product easy to use, price also good,Nice,Chenagidye", "img_link": "https://m.media-amazon.com/images/I/41Yb7bZL3nL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Crompton-BRIO-1000-Years-Warranty/dp/B07YSJ7FF1/ref=sr_1_375?qid=1672923611&s=kitchen&sr=1-375"}
{"product_id": "B07TXCY3YK", "product_name": "Butterfly Hero Mixer Grinder, 500W, 3 Jars (Grey)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MixerGrinders", "discounted_price": "₹2,237.81", "actual_price": "₹3,899", "discount_percentage": "43%", "rating": "3.9", "rating_count": "11,004", "about_product": "Wattage: 500 W; Voltage: 220-240V, 50-60Hz ; Revolution: 17000|No of Jars: 3; Jar Size: 0.4,0.75,1 in Ltr; Jar Material: Stainless Steel; Body Material: ABS body; Cord Material: 180 CM; Blade Material: Stainless Steel; Speed Control: 3 Speed Control|Do not worry if you experience some burning smell when you run your mixer grinder for the 1st time.This is due to the motor varnish getting heated for the 1st timeThe problem should not recur in subsequent uses. If it does, please contact Brand Service Centre|Read Manual Before Use|High performance motor, with motor overload protector; Aesthetically designed, Locking System - No|Special rubber shoes for extra firm grip; Easy to handle and clean|Includes: 1 No. of Main Unit, 3 Jars, 1 No. of Spatula, 1 No. of User Manual with Warranty Card", "user_id": "AFDMLUXC5LS5RXDJSJJRHNBURIVQ,AHFY5XAN2X4N5GXOJRN5Y7HNC57Q,AEQQZI7NFOSSSCFA2FOZKUDXP5QQ,AEM63GK5JFDGEBFKA42W5EPWBOHQ,AGQFO7HUNP4TATRLGLKZWTGSRZ5A,AFPADOOHAUZPXOLGIRLUVWJD62VQ,AEU72RQQFVEX4RRIWB3FIK4IOYMQ,AFUIVFZ4RBLB4N57ACNNJUDOXJJQ", "user_name": "E.GURUBARAN,Hemanth Kumar,rangaraj sanjeevi,Kamala,Sivaranjani,Sundharan.A,Abhishek,rangababu", "review_id": "R1OW9TWGTIS29M,R2X2WOP22DNGDV,R2M132CK318U3F,R3SCT96D2225LJ,R368748X71CS6N,R2986V8U04JEIG,R167KSSEHI9SV,R2UI7KAL0FX21X", "review_title": "Good quality,Super 👌,Worth for the money but the knob is slippery,Good product,Good quality,Nothing,Worthy product,Good", "review_content": "Good quality,Super 👌,Worth for the money but the knob is slippery,Good product,Nice,Ok,Little bit of noice,Good", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41buv8eJQtL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Butterfly-Hero-500-Mixer-Grinder/dp/B07TXCY3YK/ref=sr_1_379?qid=1672923611&s=kitchen&sr=1-379"}
{"product_id": "B07TC9F7PN", "product_name": "Racold Eterno Pro 25L Vertical 5 Star Storage Water Heater (Geyser) with free Standard Installation and free Installation Pipes", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|StorageWaterHeaters", "discounted_price": "₹8,699", "actual_price": "₹16,899", "discount_percentage": "49%", "rating": "4.2", "rating_count": "3,195", "about_product": "Titanium Plus Technology: Eterno Pro water heater has superior durability and withstanding capacity. It has a specially designed titanium steel tank with titanium enamel coating and heating element which helps to resist pressure and water impurities|Smart Bath Logic: Your water heater has a special function which can save up to 30% electricity with intelligent functions that give you an option to choose from like bucket bath, shower bath etc|Smart Guard: Eterno pro water heater has a special anode which performs an electrolytic process which protects the heating element from corrosion, thus greatly enhancing its life|Smart Mix: The special deflector causes slow mixing of cold and hot water in the tank,keeping the water hot for a longer duration and reducing the need for frequent restarts,this helps in saving up to 40% electricity and gives you up to 10% more hot water|Safety Plus: Three levels of safety against high temperature and pressure, provided by a hightech adjustable thermostat, cut-out and multi function safety valve according to international standards|High Pressure Resistance: Your water heater has high pressure withstanding capacity, which makes it suitable for high-rise buildings and high pressure pump applications|Superbrand and BEE Awards: Racold is once again, recognized as Superbrand in the Water Heating Category in 2021 and also, the 10thtime BEE Award Winner as most energy efficient appliance in storage water heater in 2020", "user_id": "AEZB53KJUQPIRSWWZ2SUY6RRAQBQ,AGSBS2YJLL456NQVC5B5QZPUJTJQ,AEWY6T2UJKGOH2ANGNTSBT6RIE6Q,AHBQJUMIK5PCBS5BOXXXXZXPWSJA,AFUV6OAP3USNBV34JGI4IVNUVYSA,AHANTM5UMDC5BAOCVLTX47H4HXLA,AHUM7GQ3FUS2UTPCF3JPGU2PZGUQ,AEVKHWUPE7W4ZIG5RFWKJ2XX3UMQ", "user_name": "Ritu,sudhir ranjan,Rashmi kashyap,Arunabha Mukherjee,ronnycrasto,Nani,Amazon Customer,SWARUP DAS", "review_id": "RMAC0LO0EDHO9,R1UZCDEE5WMPNY,R35RTKDU6GUF5G,R1WHY9P0NTWTUZ,R2Z12TXTO619EK,R38I9UZZJQWPZL,R1S5FKLP0IY3KE,R32Q73104YVTTE", "review_title": "Worth money,Average,Morden geyser , very nice, value for money,Value for money,Voltage issue after geyser installation,Model looks nice but charged for connection pipes.,Very good Geyser. Worth every penny.,Quick service", "review_content": "Im really satisfied with this geyser im using this geyser for all my home purpose,I give to it average rating.Not bad but Good.,Energy efficient,value for money,Product is good and experience has been good.,After installation of geyser for 15ltrs. We are facing the voltage issue which occurred couple of times and was repaired instantly. Can anyone help me to fix this issue permanently regarding voltage issue due to Geyser,Technician has charged for connection pipes. He told  - connection pipes won't come with this 10L model,Energy efficient and easy to install. Attains max temp in about 25 mins from room temp. Value for money.Post purchase service is very good.Electrician from the Company installed it very next day upon delivery.,Installation very fast.", "img_link": "https://m.media-amazon.com/images/I/31Ex4oSr8RL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Racold-Eterno-Pro-Vertical-Metallic/dp/B07TC9F7PN/ref=sr_1_380?qid=1672923611&s=kitchen&sr=1-380"}
{"product_id": "B09NS5TKPN", "product_name": "LG 1.5 Ton 5 Star AI DUAL Inverter Split AC (Copper, Super Convertible 6-in-1 Cooling, HD Filter with Anti-Virus Protection, 2022 Model, PS-Q19YNZE, White)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|AirConditioners|Split-SystemAirConditioners", "discounted_price": "₹42,990", "actual_price": "₹75,990", "discount_percentage": "43%", "rating": "4.3", "rating_count": "3,231", "about_product": "Split AC with inverter compressor: variable speed compressor which adjusts power depending on heat load. It is most energy efficient and has lowest-noise operation;Capacity: 1.5 Ton Suitable for medium sized rooms (111 to 150 sq ft.)|Energy Rating: 5 Star - Best in class efficiency | Annual Energy Consumption: 818.81 Units per year | ISEER Value: 4.73 (Please Refer Energy Label On Product Page Or Contact Brand For More Details) . The star rating is as per BEE guidelines on or before 30th June 2022.|Manufacturer Warranty: 1 Year on Product, 5 Years on PCB and 10 Years on Compressor with gas charging|Copper With ocean black protection: Prevents from rust & corrosion;Increase durability;Uninterrupted cooling|Power Source Type: Corded Electric;Controller Type: Remote Control;Control Method: Remote;Warranty Type: Limited", "user_id": "AGBYWFEGGX6QM6XB3ZPQADKKXAHA,AGU6LHFOEHAFE34ACLWETZLYPI6Q,AGSBWPW6GDRHH4Q5IAVAJPG3IRQA,AHRDCFOC5D7KERULZ4B6PVMKSNTA,AHJAW2YYU56TKMET3QKEKKCDZHVA,AFSHOA4IT5RS6KDJEVYLZQEBPR7Q,AHWQOW3VMVOLL2ICO6S6E5K73HEQ,AF3KZ34MBMMSO6QXOKYPGYB7H3NA", "user_name": "ABHISHEK KUMAR,Nageswar,Denzil,krushna,Brijesh Chauhan,Amazon Customer,Kumar,V. T.", "review_id": "R2GZHWNGVMBJFG,R3L27H7N1WH5BG,R200QONLM29B4B,RSGSF2Y8TNWD0,R2WCFFUYEJ2QLS,RNJ6P4996W6TH,R21MEVVJ4JZS79,R9RZUDWJS5AWT", "review_title": "Very nice,Efficient but little costly.,Good product but disappointing after sales service,After 30 days review ⭐⭐⭐⭐⭐,Good Product, Expensive Installation,Good,Adequately quiet, cooling is good, features are more than sufficient.,Nice and quick cooling .", "review_content": "Very nice,Efficiency is good , cost is little more compared to it's competitors.,Product quality is good but after sales support from LG local services center are grossly disappointing, don't misread into the installation charges. You will be in for a surprise with discrepancies on installation charges. Please ensure you check with LG installation service team before hand.,,Product is good and no issues with Cooling or any other functionality.The installation was expensive, Amazon installation says 1199 + Tax, but the total installation cost is 1199 + Tax + Stand Cost +  others = 2651.Also, the copper wire was missing and the LG installation person told that I need to contact Amazon and they will reimburse, I called Amazon customer care and they said they will reimburse upto 3000, the wire costed me some 3300.Amazon reimbursement is in form of Amazon Pay balance, so I actually ended up paying CASH as below to the LG installationInstallation Cost - 2651Wire Cost - 3300Total - 5951Amazon should look into why copper wires are missing from packages, it seems  to be a regular issue as installation guys were aware of it even before opening the package, it is un-necessary issue and headache for customer buying from amazon.,Good,Noisy at full speed fan mode, but quiet enough at medium to low fan speed.Cooling is good and features are more than enough for normal use. Room temperature display is useful. Remote is good enough.Overall, no complains.,Everything is good and fine. I love it.", "img_link": "https://m.media-amazon.com/images/I/21ywp-zfTjL._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/LG-Convertible-Anti-Virus-Protection-PS-Q19YNZE/dp/B09NS5TKPN/ref=sr_1_381?qid=1672923611&s=kitchen&sr=1-381"}
{"product_id": "B00LP9RFSU", "product_name": "Eureka Forbes Aquasure Amrit Twin Cartridge (Pack of 2), White", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterPurifierAccessories", "discounted_price": "₹825", "actual_price": "₹825", "discount_percentage": "0%", "rating": "4", "rating_count": "3,246", "about_product": "Color: White|Specially designed for AquaSure storage water purifiers|Removes suspended impurities as well as organic chemicals|Destroys diseases causing bacteria and virus, thus giving your family protection from harmful water borne diseases|The life of this cartridges is 750 liters|Includes: 2 Amrit cartridges", "user_id": "AHFGOH4GBUXQQ45BNRBY7MHPN4NQ,AHY6F4BLYRDJCSKQSQEWDPXAXKSA,AE4J6N4OTZMC3NVLJPGFTR5P7NIA,AEBI27B54C4N5R3O45S2AWCPPNPA,AETABFSDFJT4L2NJYWAECEX2QL3Q,AH67BHLOMDZFQHLSOIVQND2BCDMQ,AEALKKVOIADNBRZB3EOH2VJHP27A,AFF7ZQGFBRXWPEJTK7JZDDT2KFJQ", "user_name": "dr. sunil,Fayaz Ahmed,Rajesh A. Dhok,Sham s.,Shridhar,Prajwal Jagannath Shetty,Jayanth,Amazon Customer", "review_id": "R2UVKVQN13D4BP,ROIDOHU6ZPBY6,RVYETD2GBOPL1,R35DGGWKAGGN7H,R2NH2WT3ZLS63K,R29HIGIR59F1T6,R2G5PWMPUJRZK5,R3LMAD40N5XICA", "review_title": "Pack of two but only one compatible,Using the product regularly,Price  is very high.,Very poor quality,Good,Good product but durability has come down over the period of time.,Great quick delivery. New product, and very reasonable cost,Good product from eureka forbes ... Worst external packing from Amazon delivery", "review_content": "Though I bought a pack of two, after seeing the pictures and checking model, I received only one compatible with my Aquasure, the other is different and not compatible with my unit. So essentially my money for the other is wasted because the return window was over.,Using product regularly,Easy to install.,Poor quality, doesn't stay more than 1 month, it's kinda duplicate.it is available in 300 rs in CSD but, it's not available there. That's why we choose to buy it online.but, it's duplicate and very expensive. Hence,Not satisfied.give the address where we can buy it offline/online also what's the warranty of this product (mention it).,Good,It's easy to use.,Installation is difficult if you don't or can't understand the fitting procedure, but once you do, A-Okay, and super easy.IMPORTANT :  Lasts me well over 3 months, but i recommend changing it after you think the flow of water has slowed down a lot, OR you think the water tastes funny.For the last few days of its life, the water will not be completely pure, and it won't completely stop.This filter has a good water flow rate, for a family of four, it disperses enough water, fast, within 30 minutes you'll have several liters of water to drink.Also, the main thing about this is it is CHEMICAL FREE! - it also filters out VIRUSES! (take a look at WHO recommendation. If you fold a cloth ten times over, and pour water over it, it can filter out cholera virus)I would recommend this to all home owners. Since i got this cartridge delivery, i didn't need to run to the store.,Really liked the product..... But amazon packing is really made me disappointed... Really broken a trust on Amazon..... Filter kits were completely separated from the box cause the external box was too small and made the filter kits squeeze completely... I just pulled the filter kits to get it's normal size.... Please amazon don't do this kind of weird packing.. Atleast pack in a approximate box not this kind of flat huge box...... Thank you", "img_link": "https://m.media-amazon.com/images/I/41WfA7FDnzL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Eureka-Forbes-Amrit-Twin-Cartridge/dp/B00LP9RFSU/ref=sr_1_382?qid=1672923611&s=kitchen&sr=1-382"}
{"product_id": "B0B7L86YCB", "product_name": "Green Tales Heat Seal Mini Food Sealer-Impulse Machine for Sealing Plastic Bags Packaging", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|VacuumSealers", "discounted_price": "₹161", "actual_price": "₹300", "discount_percentage": "46%", "rating": "2.6", "rating_count": "24", "about_product": "Sealing Machine use for snack food saver storage and creates airtight containers, make food fresh.|Heat Sealer will easily reseal original plastic bags so food will stop being exposed to dust.|Magnetic bottom, it easily attaches to refrigerators or any stationary metal surface so you will keep it handy in your kitchen, outdoor, cabinet or anywhere you need it.|Safe & Convenient Sealer: High quality ABS material, resistance to high and low temperature.|Airtight seal Create airtight seal and prevent your food from tasting bland and stale and lock in freshness and flavor.", "user_id": "AG2BB3Q2AQB7SBFBURGYSMFHDAOA,AGFXIO346VXYI35ANHRTU7FE7ZGA,AEZIOFC5L34FZZOMGKEHXHLG6KQA,AFDS7H2OSIL3I4CZBN7C7NS4XOXA,AEBSIJDEVFVOC7PQYB3W36OLAHNA,AGHY5MD6U2E57UWJTNGFKKQ5KROA,AF23NVMNXHKORCJCQPGAW6PSXMPA,AHSOUBG4CYVABTQRPHI64FAU4NLQ", "user_name": "Navin thawani,Amazon Customer,Jemiba Lawrence,Aditya,Kunal Kapur,Merugamala Suresh,Juhi sharma,tajis", "review_id": "R3M6NH8U0C7JBM,R32DO8SLNF2JSA,R3U0NCD7XO2KX4,R3A34J0QMEWYPJ,R3P9E303DFLLWO,R18Z15U25MM9WZ,R1A9K53T8ZSX14,R1TS0MH0S4ZXZP", "review_title": "It is broken,Could have been a bit better,The first one was not working and the replacement was sent without box with a used piece,Super cool,Great,Product does not work,Product was not too good it only seal normal thin polybag,Good. Works", "review_content": "It is broken and it is not useful. Please change this product,product is so so... the plastic quality is not so good as per the price.it claims that it can be stuck in the metallic areas like fridge but the magnet is not working.,The first one was not working and the replacement was sent without box with a used piece. The battery had water while I received it and even the delivery person was shocked,This is marvellous product to use . Such a small product but does wonders . And that too given 2 batteries,Great product and lovely packaging,I don't like it the product it not working,Not satisfied,", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/411NB1EXJNL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Green-Tales-Sealer-Impulse-Machine-Packaging/dp/B0B7L86YCB/ref=sr_1_383?qid=1672923611&s=kitchen&sr=1-383"}
{"product_id": "B09VPH38JS", "product_name": "SaleOn Instant Coal Heater 500W Charcoal Burner Electric Stove Hot Plate - Mix Colors - Pack of 1 - Only Charcoal Heater", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|InductionCooktop", "discounted_price": "₹697", "actual_price": "₹1,499", "discount_percentage": "54%", "rating": "3.8", "rating_count": "144", "about_product": "Size: 15*15*5.5cm Material: Stainless steel Color: Mix colors , Package content: 1*Electric cooker 4*Rubber feet 1*English user manual 1*box|Brand new and high quality Charcoal ready in just 3-5 minutes|Electric-heating charcoal starter Optional on/off switch|High quality, excellent polishing indicates quality of life Thermal fuse for safe use Non-slip feet Plug|The light on the front of the shell goes out when the Heater reaches highest temperature. It will restart automatically again and again.", "user_id": "AHASL3JOKSWSNG6FWBDKBPBMMSKQ,AFJ4DAIVDLVCW24FWODAT5O5OHNA,AGQ6FH5HUONZXKRXVRE7YX7ZUPLA,AG3ED5BPXEBU5ZAGYEEECUEK42NA,AGIVSHBG4BBKKXBGKVEXQB6VKDPA,AHWEGITKZOSJIXJOMPY75CWMU4EA,AH2MFWXOR2Q2JBMEVYN5DI2VIOJA,AHSA2XYYOJJGPCMHTPC4KOVI54EA", "user_name": "Sheila Araujo,Rajeev. R,atul deshmukh,Atul Dhanorkar,Bhanu,Vishal,Tilak Upadhyaya,Himanshu Bhattacharjee", "review_id": "R8P1LH1QES7X5,R3P0F39HVQX1F2,R1F4WX53SB8ZKQ,RU9DOPO6AYDMQ,R8GI3QXXT6HDE,R14LR72Y74A8AE,R146T7C5DJS2HC,RAZSYIJNF6OTY", "review_title": "Works well enough,Overall good,Performance,Good For Tea , Coffee and Hot water Only...,Yes it's only coal heater,Na,Very good item..,Good buy", "review_content": "Small and compact. Literally the size of your hand.Heated up two cups of water to 75c (hot coffee temperature) in a few minutes.Great for the avid backpacker,Not the best but ok with price. It is small so it only takes less space. Looks good.,It takes repeated auto swich of and on sessions to cook Maggie.,Actually I purchased it for travelling purpose at least I can get warm water and I can make black coffee at any place at any time...This purpose getting solve  ... But It is not usable to boil Eggs and other purpose like Cooker rice etc.,U cannot cook r boil current consumption will be high,Good one product,बहुत ही अच्छा है। मैं तीन टाइम खाना बनाता हूं। सब कुछ अच्छी तरीके से बनता है।,Top stand should be included in the item", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51kEztAe73L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SaleOn-Charcoal-Electric-Appliances-Mix-colors/dp/B09VPH38JS/ref=sr_1_384?qid=1672923611&s=kitchen&sr=1-384"}
{"product_id": "B01MUAUOCX", "product_name": "Sujata Chutney Steel Jar, 400 ml, (White), Stainless Steel", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|SmallApplianceParts&Accessories", "discounted_price": "₹688", "actual_price": "₹747", "discount_percentage": "8%", "rating": "4.5", "rating_count": "2,280", "about_product": "Warranty: No Warranty|Includes: 1 jar only|Perfectly fit to sujata's motor|Totally shock-proof and safe|Low maintenance, trouble free running", "user_id": "AEKI4KLUAOWCEBHQHFGVBZTGMPYQ,AFCLNH2ZECKMY5LXIR6WTDUJ6BKQ,AECFK7X5H4ZKSE2P4WI4SGN52XVA,AGK5OL7ZCDPBSM3GFB57JEDTMVGA,AERYRV3NSECCWSOGSJRBJDGJP4XQ,AHEYCWAGWOWMQL6IWZB4UBCM7N2A,AGQMPE5Y62H4ALYMCMPV5J25BOGA,AHYJWLKBVY2CFWRJH3MNID4CRRBA", "user_name": "Amazon Customer,Neeraj Gola,Ignorant Nalayak,Siddamsetty Srinitha,naveen,vishakh,uday vir,Kirti Yadav", "review_id": "R4YUH7EZ5DB9C,R1CIOU739KNQAX,R2KCDNY1S0C382,RCMGM5B1EHGHZ,R2IIIEMH4MYPA3,RM0CKWZYGTO62,R27N3CJ0NTDZZ2,RBNBAX3RV9RPS", "review_title": "Hope it will last long,Superb product,This is new version, with safety locks.,Original and Good,One of the Best you can expect,Sujata chutney jar,Quality,Original Product at reasonable price", "review_content": "The one I got with the mixer grinder lasted only for 8-9 months, hence I had to buy a new one.Grinds well though.,Quality is very good, i must recommend it for sujata mixer grinder. Go for it if you want chutney jar, as its a best one.,Worked seamlessly with our Sujata mixex (Powermatic, and Dynamix). Note, all these have same Sujata machine, but different combination of attachments.Our original dynamix jar was without safety locks.This one has better design. Taller, and locks, so prevents spilling.A very good buy, indeed, for us.,Original and Good,It’s super product in every aspect 👍,Its a genuine product you can ho for it 👍🏻,Outstanding product,Original Sujata jar.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/315uFBgWK3L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SUJATA-Chutney-Jar-Small-8x8x8cm/dp/B01MUAUOCX/ref=sr_1_386?qid=1672923611&s=kitchen&sr=1-386"}
{"product_id": "B09MB3DKG1", "product_name": "KHAITAN AVAANTE KA-2013 1200 Watt 3-Rod Halogen Heater (1200 Watts, Grey)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|HalogenHeaters", "discounted_price": "₹2,199", "actual_price": "₹3,999", "discount_percentage": "45%", "rating": "3.5", "rating_count": "340", "about_product": "3 Rod Halogen tube element|Instant heating|Cool touch body|Frost grill for safety|Safety tip over protection|Halogen heater|Best heater", "user_id": "AHR5L5KIBZTDOOO4PR5ZHTTVTZGA,AGYBZE2DXTNOFDZSSKEMY5J3IWIA,AFRGFFGDKA4QQDI7KUNCOT3GHPLQ,AHHRJ2ARM7AEB4HWSZKQ4WDAMUCQ,AHL67UMLEYNKVUALRMYJSWUYJGAQ,AGZ76IWC3MJLV3HOEA5SWYXOO4CQ,AH4YG2VYP4IRM3YTUVLMI7XN5T4Q,AHONA3KJZILUFDDJONLT6IEANU4Q", "user_name": "Amazon Customer,sunil,pankaj kumar gupta,Air Commodore DK Bhatt.,KF,SUNDEEP KUMAR SHARMA,Mukesh Arora,Abhi Jain", "review_id": "R1DID47Y3SOM8N,RDR64CJXIU14Q,R35FYRYXQJUQKR,R2ICWHHEJJKM14,R27C6A2VQ1DCPT,R3IUDCLTBUPUIQ,R3VFX06LEJWEGM,R3KYBU80FW4GW4", "review_title": "Broken product,working related issue,Satisfactory,The product needs to be checked for defects  before despatch to customer,Value for Money,Value for Money & effective,Item broken after some time .,Quality is good,", "review_content": ",after 15 days uts 2 tubes not working...waste of money,Fuse early,The item is nice, light weight and good to use. The only issue is crude finish. The grill is coming off from sides. The reflector surface is bulging out and appears that it may break with heat. I requested for replacement but e mail sent to me says you will refund me the money after receiving the item . This was not the arrangement. Kindly replace the item with one which is free of defects. In cold conditions of hills in Uttarakhand I would like to use this item. Kindly give your views on my point so that I am prepared to receive defect free item from you and I return this one.,Sleek body and the Colour and only product of three rods with two year Warranty Light weight too and beautiful stand and can be rotated,Very good option in this range . Working efficiently and giving good temperature to  my room . One of my friend using this product for last 5 years without any problem. Good point is that it does not gives any smell as other blower gives.one suggestion - increase power cord length  by  9 inches so that we can use any where.,Item broken after some time  .. customer care not picking the phone even a single call,Was very useful in the record breaking winters this year.You have up to 3 levels of heating this is the best part. The only thing is that the light gets too bright so as to hurt your eyes but this is the issue with all such heater.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41UBtJFuwEL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/KHAITAN-AVAANTE-KA-2013-Halogen-Heater/dp/B09MB3DKG1/ref=sr_1_387?qid=1672923611&s=kitchen&sr=1-387"}
{"product_id": "B08QHLXWV3", "product_name": "Kenstar 2400 Watts 9 Fins Oil Filled Radiator with PTC Fan Heater (BLACK GOLD)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|FanHeaters", "discounted_price": "₹6,850", "actual_price": "₹11,990", "discount_percentage": "43%", "rating": "3.9", "rating_count": "144", "about_product": "Quick heating with PTC fan and Over heat protection|3 Heat setting 1000/1500/2500 Watt with additional 400 Watt (Heater+Fan)|High grade oil for long lasting and better heating efficiency|Large surface wave fin for Faster Heating; Castor Wheels for easy mobility and Rear Safety cover|Material Type: Plastic; Size Name: 48x25x63(Lwh)", "user_id": "AEGJT6ZZJCVJKSQZPBCCMRTQ4HLA,AFPXZY5YV6BY5MLHSOEIAOM2S2LQ,AF65USMMUWSGFKVXQA3ECFGFPC2A,AF2LFKOEV2AUJ6QNTNCZBGNSPFXA,AGQ4UHMMPGWZR5BVBVJPAKTKBEGQ,AHCQTOXOF3LBIK6IRYPKYQEK6DAQ,AEEZ33SWLBQZEQUUK7AM3EICB23Q,AGLQFTKRKRRYQ6JHVY6DZNSNKF7Q", "user_name": "Svblue,Tushar Srivastava,SHREESH MOHAN,Ashutosh,Harish,Kamal Kant Gupta,Shubhpreet Ubbi,chandrasekhar", "review_id": "ROG35PUVPRISM,RHMZ3T3WZDDMY,R1XMM783W6HJM9,R16YT7DTQMBX3D,R3S2TJNZAZMVLI,R385Q4NWD7KZ02,R15GMMIQGLF7KU,R2ITKFEBWVWQGC", "review_title": "Enough only for 10* 10 room as the outlet is small,The product is good,Looks like a used product which is refurbished and the wheels provided with the the heater are old.,Helpful,Not radiating much heat even though it is working.,Good quality,Excellent product to have,No use", "review_content": "Thought it would be enough to warm 2 room and passage but it's heating fan is so small even 10*10 room heating took 3 hours to warm. They have BTC but it doesn't help to warm quickly,,It is a good product and this month I bought 3 pieces. The last one looked like a used and refurbished heater. The wheels provided with the heater are old and worn out. They do not rotate smoothly and there is difficulty in moving the heater.,A quality product which will keep you warm :),Not heating well. It works but radiation of heat is very low. I have other radiator heaters like Havells, Venus which hear comparatively much more for same power consumption. Will not recommend purchasing this. Surprised from this brand as kenstar is usually a good brand.,Used for 1 season. Good quality. The only issue was humidity in room on long usage >4-5 hours continued power on.,Liked, very good in operating, easy to use,Not getting heat,kept 1hr but no luck, waste this..", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41g0U0-t1RL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Kenstar-Watts-Filled-Radiator-Heater/dp/B08QHLXWV3/ref=sr_1_388?qid=1672923611&s=kitchen&sr=1-388"}
{"product_id": "B07G147SZD", "product_name": "NEXOMS Instant Heating Water Tap Wall Mounted with 3 Pin Indian Plug (16Amp)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹2,699", "actual_price": "₹3,799", "discount_percentage": "29%", "rating": "4", "rating_count": "727", "about_product": "Suitable for your Home & Offices, gives 'New' dimension to styling of your Bathrooms and Kitchens|Innovative and Cost Effective solution|Easy to Install, does not need space like other Geysers|3-5 Seconds Instant Hot Water. This is 2 in 1 tap, can be used for hot and normal water.|Please Note: When you receive the tap, do not test it in your hands. You need install it first and then test, else it will be dangerous. Please operate it according to the instructions written in User Manual.", "user_id": "AECLI7T73FK3PR4D3GESJ6QUGW6A,AF2EZXMEBWRQJLUWM24ANJCE37UQ,AHAL6ROBXTH3IRCBZKOLPCLEXTLA,AGB5RPS3YTHLDOLTXGMHP6TSMGFQ,AFZUYJEJPM23P4IBOOAHFINA2TAQ,AEJI74MP3FNPF4LD575KNKIIEF3A,AEHVAFNMQZ2ED7EH35D3BV23ZQRQ,AHT77DD5D5XKYWHYSMDHYMEZ5JXQ", "user_name": "Asha Saraswat,Gopal Bumtariya,Amazon Customer,Priyank,Soumyaprada Bishoyi,Devinder singh,Ronald Stephen,nabaroon", "review_id": "R2ON03LZDME2KG,R3GEWALK7AZ64O,R277DIP6RNNLR7,RH39YOGKX760V,R2W2Q565AZ4296,RFY606NHN2Z3N,R1KL1PIXVKYROE,R37KB1BSN1FO5Q", "review_title": "A must buy product for every house specially in North India.,Good,Amazing product, it's worth buying,Temperature of heating,Either HOT or COLD, not mixed water.,Worthless item,Great product,Purpose is not fully served", "review_content": "I installed it myself in my kitchen and it is very useful.,Good,,Heating of water good. But water become so hot u can't put your hand in it , if it mixes the cold or running water with the hot water it will be good. Or water temperature can be adjusted it will be great.,The product is very good. Easy to install and easy to use. The water spray jet is also good with movebale outlet.Water comes out, either hot (60 degree centigrade) or cold (same like your water tank temperature).I thought, I will getting mixed water, as there is no provision of controlling the temperature , always the water is more hot that you even cannot put your hand, and if you bring the knob towards cold, it immediately cools down, so it is either hot or cold, not both.Even if you slightly move the knob towards the hot side, within 3 sec the temperature rises to 60degree centigrade from 30degree centigrade.Was expecting a reostat to control the temperature.Not able to use for the required purpose for kitchen.,Pls do not purchase this items. water does not get hot at all. you reduce or increase water pressure. It's biggest weakness that there is no option to increase the temperature Or last one its price totally worth less.,Wonderful product in this segment and value added product for home during winter,The water gets extremely hot when given in hot mode and quickly gets cold when cold water option is switched.Ideal should be: like geyser, it should have the option for both hot and cold water running parallelly so that a nice warm water flows and things get done.One cannot wash dishes with hand when water is very hot or very cold", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41A6EmdtN8L._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/NEXOMS-Instant-Heating-Mounted-Stainless/dp/B07G147SZD/ref=sr_1_389?qid=1672923611&s=kitchen&sr=1-389"}
{"product_id": "B09LH32678", "product_name": "JIALTO Mini Waffle Maker 4 Inch- 350 Watts: Stainless Steel Non-Stick Electric Iron Machine for Individual Belgian Waffles, Pan Cakes, Paninis or Other Snacks - Aqua blue", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|WaffleMakers&Irons", "discounted_price": "₹899", "actual_price": "₹1,999", "discount_percentage": "55%", "rating": "4", "rating_count": "832", "about_product": "Why To Buy : To enjoy thick restaurant like quality waffles you must buy this waffle iron maker, this is very energy efficient waffle irons only uses 350 watt energy.|Easy To Use : This waffles machine can we used by anyone, no special learning needed to use this waffel toster machine.|Durable and Energy Efficient : BONIRY brand is known for high quality material, we never compromise with quality and assure you great quality waffles maker.|Non Stick Thick Waffle Maker Pan : You can experience non stick cooking wit this waffle maker gas, This waffle making machine offers rich thick Belgian baffles.|Care for you : We value our customers and provide 24 hours service. You can call us any time we will resolve your quiary within 12 hours.", "user_id": "AF23N54DJK4PDU75O4EWJD5GHV7A,AGAC4PQRPELTJSFKK4GVXBT5Y6TA,AFKUSVMWBALVVCQCORIG2IZBAPLA,AG3CB7GLADRTGQEELLO5J46H5XUQ,AFESIGKCPYHAG4HNKQGNS5ZFZVPQ,AGY65CCPYYWCF2YOPK5S66JDT7MQ,AGINWV2CSFV3NMNC7GOBQGNEYT2A,AEGUR22KUMKPSYANRJUB4Q42DFKA", "user_name": "Aftab mulani,Chirag Panchal,Richa Jethani,N S,Dr Munmun Basu,shikha abrao,Amazon Customer,Ritesh Kumar", "review_id": "R1DVAMEM902WBM,R1R4DU6U8Z5A9C,R3R2TJZ3XDR2N9,RFCKXSEJOQX6W,R1Q6MS7EA3RQY5,R3JZS3OD2HDHCY,R29RVFGNYHN850,RO3Q0361RMHT8", "review_title": "It’s amazing but I think waffle should be more crisp but it’s Ok.,Value for Money,Good product,Go for it!!,Takes a while to cook,Not giving it 5 stars as there was no measuring cup as promised.,Value for money,very good however size is small", "review_content": "It’s easy to use and amazing product by amazonThank you !,Waffles came out nice & crisp. The product did a great job. Rather than spending high bucks on Branded ones like Borosil or Prestige, I would recommend this Waffle machine. It's value for money. For Single Waffle Maker, this is Best.,The product is worth buying if you like making waffles in the breakfast or give a new texture to the sandwiches you make.,It's become a daily part of our kitchen, it's cute, easy to use and clean. Can make a range of waffles, sweet or savoury. I like to cook each waffle twice till it's more crispy. Absolutely go for it. Makes a great gift too!,Convenient,Not giving it 5 stars as there was no measuring cup as promised. Otherwise I successfully made a very cute  yummy  waffle.,Been on my bucket list for a long time. After seeing Shivesh video, kinda promotion actually. I decided to buy for my daughter on her b'day. Very easy to use n to clean as well. But takes time to bake but maybe that's how it is with any waffle maker. I don't know. But for beginners, it's a good buy.,very good however size is small", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41Ps3i9b4HL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/BONIRY-Waffle-Maker-Inch-Watts/dp/B09LH32678/ref=sr_1_390?qid=1672923611&s=kitchen&sr=1-390"}
{"product_id": "B09R1YFL6S", "product_name": "Candes BlowHot All in One Silent Blower Fan Room Heater (ABS Body, White, Brown) 2000 Watts", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|FanHeaters", "discounted_price": "₹1,090", "actual_price": "₹2,999", "discount_percentage": "64%", "rating": "3.5", "rating_count": "57", "about_product": "Efficient Warmth: Ideal for use in small and medium rooms, this noiseless 1000/2000 Watts heater provides instant heating during winters. Effective Cord Length (in meters) 1.5|Personalized Comfort: Customize to your heating needs with two heat settings (1000W / 2000W)|Peace of Mind: Featuring dual safety device|Warranty: 1 years warranty provided by Candes from date of purchase, covers on manufacturing defects kindly read the user manual for more details|Dual Safety Assurance: Safety knob to safeguard against improper installation", "user_id": "AHAXZDBQKLBWPQN5BFPSURNHWECA,AEGH2WM5MITQZBEZM5JC4XMD2DNA,AFT26OJLNGYQISACMZ53VFZPU7IA,AEPNVP5ICQGB2SDHNNEED45KH2WA,AFND3MO34GH3GBFVZRJEKYHX5QGA,AFSY2GZNTGXHQUXWYLUPH4PH2H2A,AF6KLDZHZNKJLRD7BKJB65NA57SQ", "user_name": "Akash Yadav,Philip Chacko,Sudheer Kumar Maurya,Jeenu naresh,rahul pandey,debabrata bhowmick,Sanskar  yadav", "review_id": "RNDYBQHMT47QL,R279Z47TD2BTW0,R1KIQPBI7LXLZY,R18R9LYERVQDHJ,R1ESPXIP4APAI5,R1O99FX1SFVXWL,R2WZLXK8360X7Y", "review_title": "Best performance, Best in such that cost..,Nice,Not good,Nise product best use into winter ❄️❄️,Deamig,Durability,The air blow output is good", "review_content": "Best performance, I buy it twice...Really best for medium room...,Without power plug deliveredNever expected.,It's small and body is also poor quality,,Damig,durability,The product is durable and value of Money.It's very good product in this range.The quality is good and the air blow output is best.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41C90o+3GOL._SX300_SY300_.jpg", "product_link": "https://www.amazon.in/Candes-BlowHot-Silent-Blower-Heater/dp/B09R1YFL6S/ref=sr_1_388?qid=1672923612&s=kitchen&sr=1-388"}
{"product_id": "B07Q4NJQC5", "product_name": "Ionix Jewellery Scale | Weight Scale | Digital Weight Machine | weight machine for gold | Electronic weighing machines for Jewellery 0.01G to 200G Small Weight Machine for Shop - Silver", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|DigitalKitchenScales", "discounted_price": "₹295", "actual_price": "₹599", "discount_percentage": "51%", "rating": "4", "rating_count": "1,644", "about_product": "Electronic Pocket Scale|Capacity : 200 gm, Div 0.1 gm|Easy-to-read, backlit LCD display; intuitive, flip-open lid protects the smooth, stainless-steel weighing surface|Durable and compact digital pocket scale for easy portability. Weighs items up to 200g in 0.1g increments|Powered by 2 AAA batteries(included).", "user_id": "AGMYSLV6NNOAYES25JDTJPCZY47A,AG3Z5IUUFOD24P2S22VMAWPT7TSQ,AHJNMSXBXPENCCR5EVJ63LGMQG2A,AFGN7L5DTGD5IJJ5VQ4IY7G2J35A,AGH7NWRR5Q37GMEIR26FKOLJADBA,AH4B45HPRXTJ5B5FX3WZKJ7K4FSA,AFDPHEAIYTD7MJ4LF7OK6ODJZ5KA,AETMASW5U6WCMX7VZA6DVRGR3WTA", "user_name": "Vikas kabra,Joel Joseph,Amazon,Sàñkêth,Md Tanwir Hassan,saurabh gupta,shobhit gupta,NAVIN JAIN", "review_id": "R34GKFJOAIA0ZM,R21T7HG6Q62LKN,R2UXMZPMNM3JGP,R3FRIGI0KXGVOD,R1ZNM3HOV64QED,R21SPI0C2CAAWN,R1HSU2YSMNNHKF,RYX7V566YA4IQ", "review_title": "Good product 👍,Perfect for all the stoners out there.,Good product,Nice,This is a nice and helpful product. .,Easy to use,Good,Easy to use machine", "review_content": "I like it,It's a good investment to always be accurate about the grams in your purchase. But it's comparative small in size, so it's not good for ambitious individuals.,Good accuracy, but if someone wants more higher accuracy eg. 5,6,10,15 grams, this product might not work for them,Nice,Ek bharosemand aur nice product. ..,Good,Nice,Easy useLight weightComes up with battery", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41iZgQu0WLL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Ionix-Digital-Kitchen-Jewellery-Weighing/dp/B07Q4NJQC5/ref=sr_1_389?qid=1672923612&s=kitchen&sr=1-389"}
{"product_id": "B097RN7BBK", "product_name": "Kitchen Kit Electric Kettle, 1.8L Stainless Steel Tea Kettle, Fast Boil Water Warmer with Auto Shut Off and Boil Dry Protection Tech", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Kettles&HotWaterDispensers|Kettle&ToasterSets", "discounted_price": "₹479", "actual_price": "₹1,999", "discount_percentage": "76%", "rating": "3.4", "rating_count": "1,066", "about_product": ". The tough pure metal stainless-steel build makes it very sturdy and the inside part is only made from premium food grade stainless steel that keep your water out of the contamination from plastic materials and chemicals", "user_id": "AGSSGQZGH7RKLPAP2JFZ44PHAWDA,AG4M42TGS64SVYRRH7JRNHMB7CCA,AHYXTDSENFWKRKDQ5KOMQ6IJLGXA,AGECXPAM7BHAHXRREUXEBVRADSZA,AF3SATPW2CO22VDANST5ZFMQ2I3Q,AFFQUA4I35H3PGSIRL5BL3GW2ENQ,AGND33SYSSFRKYSNBGB5CQOODQCA,AEXWB6LUEUJLRUE35I3A7PQFO3AA", "user_name": "Vijay sharma,Jaidwal,akshay ahire,Bhuvana Shanmukhi,Sanjay A.,m pushpa kumar,Prospero,syed masroor ahmed", "review_id": "RR0XZNLNGQQUU,ROZ7GLYC4255J,R39BNXWIK6E894,RO5MNH2EETV7Y,RQESDHNQG4JEE,R1ARLE60GL6DTT,R39SJDQ1BMFLRZ,R74664PDS2LKO", "review_title": "Ok,Very good product,Broken item riceved,Everything is good but the wire length is too small,ok,Nice,So far so good,Average used", "review_content": "Thik hai,Recommend for you,Riturn my product it is broken,I like the product but the wire is too small,Metal used is too thin in thickness as it was dented while delivered and same was rectified with bare hands.Cord was also smaller in length. But overall in this price range not much expected.,Very nice,So far so good. It gets a bit overheated I hope the base does not melt or get over heated. Have only used it once when the performance was extremely satisfying. Will have to wait and see,,Product was good, and value for money", "img_link": "https://m.media-amazon.com/images/I/31B-f4QcESS._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Kitchen-Kit-Electric-Stainless-Protection/dp/B097RN7BBK/ref=sr_1_390?qid=1672923612&s=kitchen&sr=1-390"}
{"product_id": "B097MKZHNV", "product_name": "Racold Pronto Pro 3Litres 3KW Vertical Instant Water Heater (Geyser)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹2,949", "actual_price": "₹4,849", "discount_percentage": "39%", "rating": "4.2", "rating_count": "7,968", "about_product": "PUF Insulation: The high density and thick PUF in your water heater ensures retention of internal heat and temperature and resulting in better energy efficiency and reduced electricity bills|Faster Heating: The high power heating element ensures you get hot water in no time|High Pressure Resistance: High pressure withstanding capacity makes it suitable for high rise buildings and high pressure pump applications|Safety Plus: Pronto Pro provides three levels of safety against high temperature and pressure, provided by a high tech adjustable thermostat, cutout and multifunction safety valve conforming to international standards|Auto Cut off: Stem-type thermostat and cutout ensures automatic temperature control and extra safety for your water heater|No Back Flow of Water: The anti-syphoning system prevents the back flow of water from the container, thus avoiding dry heating|Elegant Italian design with a rare combination of technology and style;Capacity: 3 litre; Mount Type: Vertical;Warranty: 2 years on product, 2 years on heating element and 5 years on tank;Power: 3000 Watts", "user_id": "AGAJXGDRTICIRCARGVACQLPWIFMA,AHAKYUK7XTHBF4GTP2BGSXCFIE2A,AHFGDVDHTJKY6CD6ALJ7QYIXHRLQ,AGPSJBF6CTEE4MJG3X5Z3DMJEJZA,AFAOU74I45ATGV4STWGKFXBRHODA,AFO7RG5625GORMOYYYTBYXYCUDHA,AF3776HZNNRKUL4UWNIVU4Z6ZVZQ,AH2XARVUUCZGIBNTL4MQQWNRYABA", "user_name": "Dr Yashaswi Dalal,Aktharindia 20,najib khanche,Vipul Vora,Pranav Nirhali,VARGHESE MS,Amazon Customer,satyawan", "review_id": "RG9KNQN3E5K2O,R3QKEI2SGY9HHY,R2R5MGEDVA55JE,R2AU8713HTPVYG,RJ05T5WBN8SDA,RQELQR0TU48E,RDXWINVIMDE9W,R3PFU7N4OQCZ68", "review_title": "Good to go for small family. Indicater and installation issues.,Very nice product,Worth buying,Best gyser,Good,Goodwill,Bit costlier than other products in the market of its kind but quality is also very good.,Working is fine", "review_content": "It's been 15 days of using this product. Heating is quick. Though it caters only half of the bucket ( that's expected in 3 L) . Quick delivery. I read the reviews earlier. So i opted for local electrician to install. I had the accessories of previous geyser, saved my money.Only issue I am facing is indicator. There are two lights, red light is not glowing since the purchase. What is with that, I am confused. Apart from that it's good to go for a family of 3-4 even in winters.,It's very useful for Getting the Hot water instantly it's very comfortable,Water becomes  hot in no time.,Perfect best gyser, don't know about energy saving  bec.install just now but performance wise best.,Good one for regular use. Energy consumption found little more . Good option among instant geyser.,Liked,Product and performance is very good,Working fine from last 1 month, flow pressure is low so not able to use shower, i need to install pressure motor for shower using. Within 30 second hot water come.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/314qO8dyvRL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Racold-Pronto-3Litres-Vertical-Instant/dp/B097MKZHNV/ref=sr_1_391?qid=1672923612&s=kitchen&sr=1-391"}
{"product_id": "B07LG96SDB", "product_name": "ESN 999 Supreme Quality 1500W Immersion Water Heater Rod (Black)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|ImmersionRods", "discounted_price": "₹335", "actual_price": "₹510", "discount_percentage": "34%", "rating": "3.8", "rating_count": "3,195", "about_product": "Specially designed heating element for quick heating|1500W Power|Anti-corrosive Material|Hairpin tubular elements ; 3 Pin Plug|NOTE: Black/busted melted pipes does not come under warranty is due to dry heating or not maintaining water level.", "user_id": "AHIDFZK6JPIY7FCTPZQJR6MSWV7Q,AGWW4VSBX2UUCMM5VFMMRKV6I34A,AHCLIYZDVIIFV3V4X4VPUFCRPP2A,AG7O2DWNCAQIAMWYENDUQG3P5FPA,AFKZM7TNSX7OVVQP26GUA2NULWFA,AEOWAV5QL6F5QH5VGY4XNKWX7ABA,AHPNZU4TQSKOFPXCED37ADH7NSYQ,AHFF2NUJXGN5BFX76OICF6XVEBOQ", "user_name": "Amazon Customer,kapil kumar sharma,Shilpi,Santosh Kumar Saini,Husna khan,Gadde.Raghavender,Ajay Kumar,Annaram vijith", "review_id": "R205BUIEOZSB27,R3KAOEMO5MHN5A,R1DD7V7FUTYL3H,R5IQN4CBEDBAH,R1H10C8T2140MN,R1GE3ZFKDOX0KC,R3VTBRIS9BCUR4,R3EH023Z1ERZZB", "review_title": "Poor product,Not working Properly,Average,Nice items,Cord is not enough long,Good,Goog,Everything is fine except cord length", "review_content": "This product of yours company is heating 5 liters of water in 15-20 minutes, it's wastage both electricity and money.,Very Bad Quality of wire, and Rod.,The product is just ok, but the quality is a bit low, but you can't expect a premium at this cost.,Very faster,Gud,Nice,Nice,Cord length is too small", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41d2SJq5sxL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/ESN-999-Quality-Immersion-Heater/dp/B07LG96SDB/ref=sr_1_392?qid=1672923612&s=kitchen&sr=1-392"}
{"product_id": "B08KS2KQTK", "product_name": "Pajaka® South Indian Filter Coffee Maker 200 ML 2-4 Cup / Mugs / Glass | Madras Kaapi/ Kappi Drip Decoction Maker / Makers / Brewer / Pot or Drip / Dripper Made of Stainless Steel | Non-Electric Machine / Appliances / Utensils Medium Size for Home and Kitchen, Office, Cefe Traditional Item / Product | Used for making Country /Desi Style French Press Espresso Nespresso Expresso Cappuccino Instant Black Coffee | Best flavoured with Grounded Arabica Roasted Crushed Grind Coffee Beans", "category": "Home&Kitchen|Kitchen&HomeAppliances|Coffee,Tea&Espresso|DripCoffeeMachines", "discounted_price": "₹293", "actual_price": "₹499", "discount_percentage": "41%", "rating": "4.1", "rating_count": "1,456", "about_product": "Strength: The Coffee Filter is strong durable, sufficient in weight and thickness. It is resistant to Rust, Corrosion and Non-absorbent.|Quality: Food Grade Quality Material that does not allow the migration of hazardous substances or impart colors, odors, stains or tastes to food.|Physical Characteristics: Finished to have a smooth, zero sharp edge surface for Easy to use and clean in a dishwasher. It is an Inexpensive, portable, reusable and environmentally friendly Phin filter.|Taste is a personal subject but for Vibrant and Rich Aromatic cup of coffee we recommend to use Grounded Coffee, Coffee Granules, Coffee Beans or Filter Coffee Powder.|Also known as: Kumbakonam Coffee Filter, Mylapore Coffee Filter, Mysore Coffee Filter, Degree Coffee Maker.", "user_id": "AFS7B5AZ62CAX22H7LCYNQXVCQAQ,AGLMS3QIE4S7KPWOXGHTANI7764A,AGBA7KYAPLBYCCWKRBEAIWCBFBLA,AG7ZZIXCIBRUJ57VCGVUKDTGVIFA,AHNJSC2JCU5WZS36B2ICX24355IQ,AEMO7DWHWH5OGU427HN45WBERE3A,AGKTT2MYU4G25XFWMD5S6DETTTGA,AG64ADZBDOLMMQKFPD6JFZDTHVHA", "user_name": "Rajnish Sood,Amazon Customer,archie,7709220353,Customer,Mom Om Wom,sukant,Santhoshvaricola", "review_id": "R1TTVJ336C14LC,R327QF3X1RB0MK,R2HRVWXBERG050,R30OSVBH5LSPGK,RLX900TDISJGG,RG1W93HZ0LNQX,R86A6O666WPGN,R1DHC6KSI9M5AM", "review_title": "Okay Okay kind of product,Good quality though bit expensive,Easy to use,Quality is good,Good quality product,Just Okay,Very thin steel.,Super", "review_content": "1. The steel quality could have been better, but it is adequate.2. The second major problem is that neither the upper nor lower container has a handle, and so when you try to open them after 15 minutes, they are still hot, making it difficult for children to operate it.3. The flavour depends on the coffee you use. We use genuine South Indian chennai-made coffee bean powder, so the aroma is fantastic, but that has nothing to do with this particular product because any authentic filter coffee will have the best aroma.4. I can return the product very easily, but for such small cost product that doing so would put the supplier in loss due to the cost of the return courier, so even though it would be difficult to use without a handle, I won't & rather buy some better one.,Good quality. Easy to use and wash. 369/- is bit expensive for 250ml capacity. 290-325 rs. Available with same graded steel. Very good & detailed literature with the product. Tx.,My husband used it, he can cook much well, it was easy for him,Good product,Good product to buy if you are far from Southern states.Quality seems to be good till now.No unusual stains or withering of enamel.Filtering action is consistent with design.,I got rusted piece. Material quality is just upto the mark. Worth it if the price is under Rs.200. Size is enough for 1 or 2 cups of coffee.,Very thin steel has been used to make this.,Excellent", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31+EgPqYa6L._SX300_SY300_.jpg", "product_link": "https://www.amazon.in/n1-Retail-Stainless-Indian-Coffee/dp/B08KS2KQTK/ref=sr_1_393?qid=1672923612&s=kitchen&sr=1-393"}
{"product_id": "B095K14P86", "product_name": "Saiyam Stainless Steel Espresso Maker Stovetop Coffee Percolator Italian Coffee Maker Moka Pot (4 Cup - 200 ml, Silver)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Coffee,Tea&Espresso|StovetopEspressoPots", "discounted_price": "₹599", "actual_price": "₹1,299", "discount_percentage": "54%", "rating": "4.2", "rating_count": "590", "about_product": "Safe Material - made of high quality food grade stainless steel , sanitary, and durable. with curved black heat resistant and ergonomic handle is comfortable for finger grip and easy handling|APPLICABLE TO INDUCTION COOKER: espresso maker is made of 430 food grade safe stainless steel, applicable to a variety of stoves including induction cooker, electric furnace, ceramic furnace, alcohol furnace and gas stove. Because of its excellent corrosion and rust resistance, it can also be cleaned with a dishwasher.|Simple Steps - The Coffee Maker Espresso Machine, is easy to use: Fill the lower part of the three-part espresso maker with water, put the ground coffee into the basket, put the top on and place the stainless steel espresso pot on the cooker to boil.|COMFORTABLE HANDLE: The advanced sanded handle has excellent thermal insulation effect, and the curve of the handle is ergonomic. The moment of use will bring you to the Roman restaurant in the morning.|APPEALING DESIGN: Elegant espresso maker body through polishing design, three ring precision thread and imported safety valve to make your use process more secure.", "user_id": "AEM2OFBD5ABDZGYUPPUYMCBFDEXA,AHWRUBKKFE6ZTAPAAR5RCSTAPQUA,AGCJW7IHJTEFPCN67EP75IOGIF4Q,AEX2AWDGQSN3Z3FHJPJMDTDHUJFA,AFNBXMGWYJWB56G33U6RTR7AI2PA,AHT7YN7PRTQQW4OPDLXHGJXEGJOA,AGOPYV5RQIH4BBSVXQVFBZLDVHVQ,AHNE3KUK352LFDTMI6GHAZ5DEL7Q", "user_name": "Sudhirw,seshu P,Sunil Sharma,Sara,Amazon Customer,Sidhant,Harika Mudhiraj,Ramesh Sivaraman", "review_id": "R1BLYOBTCRQS4K,R1VVLMK1TC1KVO,R1FU65T3QMAHXJ,R2CXQLO9ZQRV83,R39X6B5DPGVQLW,R1TXSJNPJK3GGM,R2NOAG9D9PY1MD,R10D7UXTTY2ZIC", "review_title": "Excellent coffee maker,Sturdy quality product!,Good product,Just go for it!,Mokapot's upward filteration is messy,i felt its more of a joy to prepare concoction in this espresso maker,Good product,Espresso quality", "review_content": "The quality of coffee maker is excellent a DM very ease on making coffee and getting served hot.,The silver color is much better compared to stainless steel finish. Lov my coffee made in this! This should be advertised as suited for 4 cups not 6.,Does the job well and even after placing directly on the stove there is no discolouration. Steel quality is upto mark.,I have been using this product for a while and have no complaints. Makes amazing filter coffee.,Looks and quality are at par with other brands in its price bracket. In function, this kind of a mokapot design is flawed at the cleaning aspect, including this particular model, in my observation. In it, the pressured boiling water pushes through the coffee powder in bulk together, thus rendering the flavour inferior to what is brewed otherwise when the water percolates little by little. Secondly, the portafilter type coffee powder container, positioned just above the boiler chamber, sends some dissolved coffee back to the boiler water through the upward pressure pipe, rendering the entire remainder water mixed with coffee go waste. Thirdly, the coffee powder container's gasketted mesh is sedimented too while filtering the forced brew upward. So, when a person like me thinks of preparing a brew in a mokapot like mechanism, the very thought of the predicament of dismantling the the tiered chambers, separating the gasket, and then wash the pot thoroughly, because coffee is lurking everywhere therein to cause unhygienic residues, dampens my desire to go for it. I am no debater if the idea is to leave the pot just rinsed and washed and not rid it of the residues. All this is not the case with the downward filteration method of the other types of coffee machines that are absolutely unmessy. No offense meant for any system, this is my personal opinion.,I like the convenience of making coffee for 2-3 people in one go.Its very easy to clean it up after every use. Its rust free and looks beautiful while kept on kitchen counter even idly,Like and good product,Ordered this for my stay in India.  it worked the way it should be, it has silicone washers, easy cleaning.  Product quality can be improved.  OK product.  not WOW!", "img_link": "https://m.media-amazon.com/images/I/414gUKUBHML._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Saiyam-Stainless-Espresso-Maker-Percolator/dp/B095K14P86/ref=sr_1_394?qid=1672923612&s=kitchen&sr=1-394"}
{"product_id": "B08K36NZSV", "product_name": "KONVIO NEER 10 Inch Spun Filter (PP SPUN) Cartridge Compatible for 10 Inch Pre-Filter Housing of Water Purifier | Pack of 4 Spun", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterPurifierAccessories", "discounted_price": "₹499", "actual_price": "₹999", "discount_percentage": "50%", "rating": "4.3", "rating_count": "1,436", "about_product": "RO 10 Inch, 5 Micron PP Spun Filter Cartridge/Candle used in RO Water Filter-Pre/Outer Filter Bowl.|Can be used in any pre filter that supports 10 inch pre filter|Removes Sand, Slit, Dirt & Rust particles|Replacement of Spun Filter every 3 to 4 month can save bigger expenses. - Regular replacement of Spun Filter protects RO Membrane and choking of other filters|RO filter is normally used in first stage of multi stage water filter system. Replacement of Spun/sediment Filter every month can save bigger expenses. Frequently replacing of Spun/Sediment Filter protects RO Membrane and choking of other water filters. Impurities and sediment removal water filters. These are pre filters commonly used to remove dirt, impurities, sediment, rust, slime, sand, grass and grit etc", "user_id": "AGKZK3N7KYOTCRFGWGDF2EJIQISA,AEROHELQUZSGEWF2SUDCANCFNRCQ,AGPTBR4QWMDZZ3XAF4EV2UMFQQEQ,AEN4W53IK6DVODM4J72SQNAYMX4Q,AEX4AU2AULOQZB35OUHUQ73Q5VIA,AEK2MRB35PXPW27B5NT7O637IMDQ,AHPUIT2YTPFHVHVWQPFEZXZZ5M7A,AE2X3X56PWZY32QSRKVU4VOIKDIA", "user_name": "Himasrivastava,Pawan Dalal,Yeshwant singh,Amar D.,Tincy Thomas,krishna kishore,Vinay,Sachin Yadav", "review_id": "R1IW3BMCWR5WKN,R21W2URYUFT12Q,R24L6D938JXIVA,R3W2R17WXI3T8,R2P109ABFQR9L1,R18GKO5TQO1PXL,R79MJI0BFQHB3,R2YBSTEQSU2URL", "review_title": "👍,Good product,nice product,Satisfied,Value of money,Good filter,Excellent product,Overall this is a good product.", "review_content": "👍,Good quality. Easy to use.,nice,Value for money,Value of money,Good filter, I'm using for Kent RO,It's an excellent product at this price. I used to call the RO service guy for changing the SF. RO guys charged ne 250/- for candle and 250/- for service charge. So in total i was paying 500/- for changing the SF. This Konvio SF i got at 125/- per piece and i got SF changing tool from local market. Now in 1/4 th of price, I am abke to change the filter by myself and most importantly the outcome is same. The quality of water is same as before so no downgrade of water quality. I really recommend this product.,Product quality is good, and easy to install", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/410GwzE+TrL._SX342_SY445_.jpg", "product_link": "https://www.amazon.in/KONVIO-NEER-Cartridge-Compatible-Pre-Filter/dp/B08K36NZSV/ref=sr_1_395?qid=1672923612&s=kitchen&sr=1-395"}
{"product_id": "B07LDPLSZC", "product_name": "Havells Glydo 1000 watt Dry Iron With American Heritage Non Stick Sole Plate, Aerodynamic Design, Easy Grip Temperature Knob & 2 years Warranty. (Charcoal Blue)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹849", "actual_price": "₹1,190", "discount_percentage": "29%", "rating": "4.2", "rating_count": "4,184", "about_product": "360 degree swivel cord for effortless manoeuvring|Registered American heritage golden ptfe coated side plate|Dual color led indicator on handle|Full length button groove for maximum reech|Easy grip temperature control dial for selection of different fabrics|Warranty: 2 Year|Power: 1000 watts; Operating Voltage: 230 - 230 volts|Includes: 1 N Dry Iron & 1 N Manual", "user_id": "AFUXDVUZ2STL3ALSLWBDEAJBR7BA,AF7GFM2ILS43R3R7ZWHYAUCPAVAQ,AHWLGCCR7N4HTELCLTXAVQM3KJHA,AGY42TVO76MSDK66XDORRO3X3OMA,AEIHE3RYSQSHEDWWK75BDB37K3DA,AFIW2ET2FNOABPCJHIJORAYTPUIA,AHEC755ZTLVUV2OGFJQFWRMB2KNQ,AG6CCP43BJUOX7RZVWBHLG7WGNOA", "user_name": "Swati Chaudhari,Anil kumar,Dinesh Verma,Arvind Chaturvedi,Annapurna metta Sarjare,Ramya,Indu Kumari,Irfan khan", "review_id": "R2MQ8OBLUYQBDI,R2RLW3M6VML3F7,R1JVBADF2L2AG5,R2YP2T8VIP3UG2,R14ZZJQPCODG9I,R1K7B181E6KQQ3,R21KENPQN42DEW,R1OKF4SQ0N13U2", "review_title": "Nice iron . Heating earlist,Value for money,Nice product,सुपर,Good,Superb,Excellent product by Havells,Good", "review_content": "Nice iorn in this price every one should take this,The product is good as usual. But it can helps to iron the lite fabrics. If you increase the heat the fabric is getting damaged easily. It is used to iron the shirts, jeans, cotton sarees,cotton pants.,Product is good and easy to use,सुपर,Good,Awesome product everyone must buy highly recommend...I loved it ....,Excellent product by Havells.,Good", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41JWKjRa+PL._SX300_SY300_.jpg", "product_link": "https://www.amazon.in/Havells-Glydo-1000-Watt-Iron-Charcoal/dp/B07LDPLSZC/ref=sr_1_396?qid=1672923612&s=kitchen&sr=1-396"}
{"product_id": "B07F1T31ZZ", "product_name": "Raffles Premium Stainless Steel South Indian Coffee Filter/Drip Coffee Maker, 2-3 Cups, 150 ml", "category": "Home&Kitchen|Kitchen&HomeAppliances|Coffee,Tea&Espresso|DripCoffeeMachines", "discounted_price": "₹249", "actual_price": "₹400", "discount_percentage": "38%", "rating": "4.1", "rating_count": "693", "about_product": "Crafted from Stainless Steel; Rust-proof|Ideal for making authentic South Indian filter coffee|Capacity: 150 ml; Size: Diameter - 5.5 cms; Height - 13.5 cms|Package Content: 1-Pc. Coffee Filter|Size Name: 2 Cups; Human Interface Input: Unknown", "user_id": "AGOHEKMCFFEVVEYK75KRR6JUN5LA,AHM5VPEM324X4ZSA2GQCBCD423PA,AEK4FIY6OYHQUATRL3QUSWUSQLZQ,AGPK7LBOP4LXMHGVL246WLA53D4A,AFZDTYSBA3OFABW3ISFCOOKQK76A,AEYYA6E4ING5KL43ZEGPYXKBDSBQ,AH7YJB6PZG5KP4GCWMQCHRIO3I4Q,AGXITCDLYCTWJZOTV5ZF7ZR7O3MQ", "user_name": "Gautam B.,Kabir Debbarma,MS,Amazon Customer,P,Sourav Basu,Vikhyat G.,Viren Dhamaskar", "review_id": "R1HD4L4O8FYBVJ,R1DSP7AK9O1EG0,R3F6O9LJWF9UGP,R1WGQ33LIJEOSH,R3NQC64D2P7Q16,R1H44VOQWJQYKK,RVLTVX5PB83WB,R372RHOH38PJ9W", "review_title": "Meets expectation,Good product,High quality product,Worth the spend!,Great product,A decent filter coffee maker.,Good product for an average user.,High quality", "review_content": "An easy-to-use coffee filter at a reasonable price.,Value for money, fit and finish is good,Good for 3 glasses of filter coffee.,I am relishing the original filter coffee taste in North India.,I give it 5 stars as it is the same as shown and good and easy to use.,I mostly have instant coffee but this time I bought some filter coffee from Araku Valley during my visit. I was not aware of the process that you can't have it like the normal coffee so I tried it like normal one and it failed miserably because the coffee seeds won't get dissolved there is no coffee smell in it. Then I went online to understand the process where I came to know about this coffee maker. I bought it for 2cup coffee which cost me 299/-. You can get bigger one also for 4 or 6 cup. You can go through the process of how to make south Indian filter coffee online. To me it does job very efficiently and finally I am able to have a good cup of filter coffee. Now about the product it's not premium quality steel but it's a decent one and it's very easy to use. You fill the filter in morning and you can have the raw extract till night. So to me it's a value for money if you want to try filter coffee.,The press doesn't work perfectly but does the job. Size is small, you can only make one cup.,The steel quality is world class. Gives a proper filteration", "img_link": "https://m.media-amazon.com/images/I/41UGgTLOD4L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Raffles-Premium-Stainless-Indian-Coffee/dp/B07F1T31ZZ/ref=sr_1_397?qid=1672923612&s=kitchen&sr=1-397"}
{"product_id": "B0BNDRK886", "product_name": "IONIX Activated Carbon Faucet Water Filters Universal Interface Home Kitchen Faucet Tap Water | Tap filter Multilayer | Clean Purifier Filter Cartridge Five Layer Water Filter-Pack of 1", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterPurifierAccessories", "discounted_price": "₹185", "actual_price": "₹599", "discount_percentage": "69%", "rating": "3.9", "rating_count": "1,306", "about_product": "Faucet Water Filter: Built-in layered filter can separate coconut activated carbon, zeolite, PVA non-woven?fabrics, calcium sulfite and rubber, which applys to purify hard water and well water.|Healthy Lifestyle: Remove the water in the chlorine, heavy metals, other impurities,water more sweet, more secure.|Easy to Clean : A must item for home & office use.High temperature resistance, not easy to deform.To clean, simply remove the strainer and rinse it off under the water.|Water-saving :Made of soft rubber material can prevent water leak which can save water for your each time using.; Package List:1 * Faucet Filter|Included Components: 1 X Five Layer Faucet", "user_id": "AEXIMD2ECDFFF6J2U7TZ5IXA2GSQ,AG27ECFAKUL5MDR4P7O33R52MEMQ,AFTWSUMWZSYW6GG3YXVDAXHVIWFA,AE7DUUZF744LA3EMVCLI3UJDCIDA,AFY63CMR45TQ44JBPYWHGUBOQUEA,AEPIMEBYBSIKSJF7NFEQPCLPDF7Q,AHKQBTJ7JR3SO57H22GOC7SIWG6A,AEDPJXQWX34LSNG4ZOIRO2DMYZBQ", "user_name": "Buyer (Name protected),Saurav Kumar Saha,Aditya Kumar,Priyanka,vinod reddy,Vijender Singh,MOHAMMAD AZHAR,Deepak Samson", "review_id": "RPVB28C2TPEDX,R2K5ME2J0C1A30,R15G6PDX7J8A9A,R2Q84ODLPM7DG9,R4UWGPOL1PSZZ,R2U04XI700Y4ST,R2EMG0GIWX7GP5,R1W5S1B40S9QFL", "review_title": "Compatible with pureit classic g2,Very good product,Best item in best price.,Good,Good one,Nyce product,Good Item With Perfect Accuracy VFM !,One star for bad delivery options", "review_content": "Original part costs 4 times more as per service guy. Worked without issues on pureit classic g2. The snap pin connectors need to be manually pried open (use a safety pin and YouTube) I used the AC power cord sis as-is because the pureit part had a resistor fuse or something placed before adaper and i wasn't sure how this part would work with it. Connected directly to plug and joined the  24v connector,With the money... Gives clean water.,TDS calculation is perfect.I checked overall water which I use in my daily life.Like tap water,hot water, cold water, aquarium water.1 day old water,gyser water and aquaguard Ro,uv,uf,water.,https://m.media-amazon.com/images/I/61dPCs7qmBL._SY88.jpg,Working good,Product is gud and value for money,I have found it on a very cheap price first i thought may be item is very so will not work but I was wrong, when it arrives i checked water tds at many places and it works awesome with accuracy, so I just love it and thank you to the seller for providing such a good item.,The product is okay but there delivery options are not , agent was rude and refuse to provide door step delivery, not fulfilled by Amazon agent.", "img_link": "https://m.media-amazon.com/images/I/41asnfU59KL._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/IONIX-Tap-filter-Multilayer-Filter-Pack/dp/B0BNDRK886/ref=sr_1_399?qid=1672923612&s=kitchen&sr=1-399"}
{"product_id": "B09ZVJXN5L", "product_name": "KNYUC MART Mini Electric Handy Room Heater Compact Plug-in, The Wall Outlet 400 Watts, Handy Air Warmer Blower Adjustable Timer Digital Display", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|FanHeaters", "discounted_price": "₹778", "actual_price": "₹999", "discount_percentage": "22%", "rating": "3.3", "rating_count": "8", "about_product": "Function: Portable handy heater provides functionalities like Adjustable Thermostat, Overheat Protection.|Personal heating: This Electric heater gives you personal heating anywhere you go.|Portable heater: Electric Handy Heater is potable. You can use it in rooms, bathroom and take it to outside of your house.|Easy to use: This fan heater is simple to utilize. Just find a plug, plug it and set the temperature.|Package Contains: 1 Handy Heater , 1 User Manual & Free 1 US Converter Plug", "user_id": "AFUH5D4EYPVUKL6RIODLMEAZDVEA,AG75QN74MJP35SGZVQCK7S24TBPQ,AFR3PNU34Q3NU4MZDAQTEVQGYJNA,AFEGTYZ3KEHM3T6Q47CE2F3QDTZA,AFJE6BAJEFG4B2OMCFXYFXBSWR5Q", "user_name": "Karthikeyan J,Nitin Kshirsagar,N Adu N.,Manish jain,Hitesh Mori", "review_id": "R2NR09K7JPREX9,R1BVHMQAEEK6Q0,R3JLTEYMK907F2,RXAU989TJMDX6,R2OBL8DBUTV157", "review_title": "Quality Product,The Packing is very poor so theswitch has gone inside the heater I cannot use iy,Very good 😊,Easy to use, comfortable, value for money, temperature control,Effective And creative product", "review_content": "1) Best product2) Room gets warm within few mins3) Quality is nice4) Timer option is very useful5) Portable,,,Like it,By continuing use it work fine. Small but effective product. No more space required to store and use. In a short time my room temperature got increased. Feels gool", "img_link": "https://m.media-amazon.com/images/I/41EFR4bxzeL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/KNYUC-MART-Electric-Compact-Adjustable/dp/B09ZVJXN5L/ref=sr_1_403?qid=1672923612&s=kitchen&sr=1-403"}
{"product_id": "B08JKPVDKL", "product_name": "INKULTURE Stainless_Steel Measuring Cups & Spoon Combo for Dry or Liquid/Kitchen Gadgets for Cooking & Baking Cakes/Measuring Cup Set Combo with Handles (Set of 4 Cups & 4 Spoons)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Coffee,Tea&Espresso|CoffeeMakerAccessories|MeasuringSpoons", "discounted_price": "₹279", "actual_price": "₹699", "discount_percentage": "60%", "rating": "4.3", "rating_count": "2,326", "about_product": "COMPLETE‬ 4 PCS CUPSET of supreme quality and sturdy stainless steel measuring cups, including 60ML (1/4Cup), 80ML (1/3Cup), 125ML (1/2Cup) and 250ML (1Cup) and COMPLETE‬ 4 PCS Measuring Spoon Set of high quality and sturdy stainless steel measuring spoons with ring , includes: 1/4 TSP(1.25 ml), 1/2 TSP(2.5 ml.) , 1 (5 ml.) teaspoon, and 1 (15 ml.) tablespoon.|FOOD SAFE measuring cups & spoons made with food grade stainless steel that will never rust, peel or chip off to contaminate your food.|DISHWASHER‬ SAFE and super easy to clean, thus ensuring complete hygiene with each use, whether you measure dry of liquid ingredients.|DURABLE‬ CONSTRUCTION with robust materials and a compact design that features flat handles bearing engraved measurements to assure you of lifetime measuring cups.‎|‎ECO‬-FRIENDLY stainless steel measuring cups last a lifetime, a great alternative to flimsy plastic cups that easily break and end up polluting the environment.", "user_id": "AG72HBSOIRQFGJN2NY3GPAEEHZTA,AGXAO67Z7IZENINTB4FWJ53Y3V3Q,AHGR7SEDTEDIYX573IXYTQL3OWUA,AHYDO3OKLMDU6UJQ6YTMQWNUITPA,AGSZKOHJZVCRZGZDDCDPNSHZLOOQ,AE4PB3GAZFWQPTCFXFFJMMZOSU5A,AH7GI2ERU3IXB3L3UMCM7UFQT6XQ,AEJDGQU75PMFGJILLZKBUARMLQOQ", "user_name": "Naina,SuperSandy,Ranjini k,Lalatendu,Deepak T.,Amazon Customer,Renju Mathew,Dhruv u patel", "review_id": "R2UVZEGX2NS1NM,R2V19QOE8UAL56,R3KPGU547U3K7Q,R3B3CTTI0JEW3W,R2H3P9OSLWFRSE,R3CEV91R65AZLH,RO567V8MWM1JK,R11UZ87O5WB63U", "review_title": "Go for it,Good quality and price,good quality,Good to have instead of plastic one.,Looks good better to use than plastic,Good but can be better,Value for money,Good quality product", "review_content": "It’s easy to clean and better than plastic so it’s a win win,at this price it’s great deal,Serves the purpose . Nice quality. If you are a baker you should have measuring spoons.,good quality,Good One.,Not been long time so don't know it it lasts but looks good.,Good for the price. There spoons have measures on them but the cups don't have the measures, hence 1 star off. Quality is decent.,Using it daily for measuring both liquids and solids for kitchen purposes. Value for money,Sturdy, beautiful,A1 quality product👍", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41kr7l+z1FL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/INKULTURE-Stainless-Measuring-Kitchen-Gadgets/dp/B08JKPVDKL/ref=sr_1_404?qid=1672923612&s=kitchen&sr=1-404"}
{"product_id": "B09JFR8H3Q", "product_name": "Macmillan Aquafresh 5 Micron PS-05 10\" in PP Spun Filter Candle Set for All Type RO Water Purifier 10 inch (4)", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterPurifierAccessories", "discounted_price": "₹215", "actual_price": "₹1,499", "discount_percentage": "86%", "rating": "3.9", "rating_count": "1,004", "about_product": "This water filter candle Suitable for 10 'Pre-filter housing having Plain cut inside its cap. Easy to install,self installation could be done.|Purification Capacity: Micron filter spun filter 10 inch cartridges will typically last between 6 months to 1 year depending on level of turbidity in your Raw Water.|Must be used before the main RO Machine to protect & inhance the life of inline filters & Membrane use inside the Main machine. & obviously reduces the cost of maintenance.|Sediment ro filter is normally used in first stage of multi stage water filter system. Frequently replacing of spun/sediment ro filter water purifier protects ro membrane and choking of other water filters. Impurities and sediment removal water filters. These are pre filters commonly used to remove dirt, impurities, sediment, rust, slime, sand, grass and grit|RO Spanner-Wrench Suitable for RO Water Purifier -10\" Pre Filter Housing Bowl..Suited for common RO water filter Purifiers available in India, Compatible with many RO Brands and Models-Can be used in multiple water purifier Models-Counter Top, Desk Top, Stand Mounted, Wall Hanging, Under Sink, most of the RO Model cabinets.", "user_id": "AECTTIBADJRR6PNCGQM3KLJT65XQ,AHH5S3NZXPTNEMV5ACI2OUFQPESQ,AGX67OWD4YQDA7GEIGCMB5DYUJZQ,AHVN4Q73CBYLXS6PD7JYBNQJOXSQ,AHDJXSEX24G3F2AMLX7H4VFW6Q4A,AEF46GENYIQSETB5QV7U3BFPRLWQ,AHU2YNBLYGUZR45OTIEIAG76NCTQ,AGFPDBO7Q4GQBCWMY3OPORD74ROA", "user_name": "Sudhakar Samuel,Sandeep Shampur,Amazon Customer,Yakaiah Kadem,Jaspal Singh,Karthik Palani,SS,Kautuk G. Tare", "review_id": "R2FG5ZQ7455JA9,R3E79I7H5JT248,R27NGUPGDT5O90,R2GIXW3HN4LKA4,R12ESRILVR6D2C,R1TJWF170RZB5I,R3K70V1SGG8WZ6,RA1RQZLLULLS", "review_title": "RO filter candle,Good product and fit perfectly,Thermacol product,Excellent product,Quality is good, I always buy this,Not suitable for Pureit Advance,Good,Nice", "review_content": "Value for money,This fits perfectly with the filter I have. It is worth the purchase.,Not so good,Very usefull product for reasonable price.. ❤.,The filter Quality is good, I order this once in every 4 months. I change filter my self.,I ordered and returned. Not suitable for Pureit Advance RO + MF,Good,Value for money", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41UoZi45q9L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Macmillan-Aquafresh-Micron-Filter-Purifier/dp/B09JFR8H3Q/ref=sr_1_405?qid=1672923612&s=kitchen&sr=1-405"}
{"product_id": "B07LDN9Q2P", "product_name": "Havells D'zire 1000 watt Dry Iron With American Heritage Sole Plate, Aerodynamic Design, Easy Grip Temperature Knob & 2 years Warranty. (Mint)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹889", "actual_price": "₹1,295", "discount_percentage": "31%", "rating": "4.3", "rating_count": "6,400", "about_product": "American heritage original imported golden nonstick coating on sole plate|Easy to see pilot light|Easy grip fabric selector knob|360 degree cord swivel|Warranty: 2 year on product|Includes: 1 Dry iron and Instruction Manual|Cotton and silk braided; Temperature control dial for various fabrics", "user_id": "AF4B327ZIB5IJWIFEVY6BWMB75VA,AGDV7VQGI42G6HVOGW2OSWKHBPWA,AGPK4QIB6E5RFJAYZCNS7XRT5OVQ,AHN2VCYDPYHUDXSLFOLGIN5J46XQ,AFYLAHK2PMQOEZJNIM4V7N7ZETYA,AHZBOE4W3PUVBX7VYDBE57VDPMBA,AFQDUFM2UWWPT2WM2ETLFVSEAVUA,AHVI4UXZR4TUQT7MQLVDZXKWTOOA", "user_name": "Sumit,Paresh Narola,Azharuddin,Jasmail Singh,Suresh Prajapati,Alam Naushad,DILIP RATHORE,SRINAATH K", "review_id": "R127S7ET7LEPPH,RDFTXU0U50TS,R1DU2WDA81XR8N,RBS3MOLNUR0IS,R2GAKVFK8VGD8L,R2G24JXNCEDY5G,R15Y41S549H84B,R1GY383SEEC577", "review_title": "Nice product,Nice iron,Wonderful product,Best product 👍,Good electric iron,As expected,Acch iron hai ap order kar sakte hai,GOOD", "review_content": "Nice,Good iron, performance, look and shape is very good,I like this product,Yes,Working well now.,Nice product,Acch hai,GOOD", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41lYqkaeadL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Havells-Dzire-1000-Watt-Iron-Mint/dp/B07LDN9Q2P/ref=sr_1_406?qid=1672923612&s=kitchen&sr=1-406"}
{"product_id": "B08T8KWNQ9", "product_name": "TE™ Instant Electric Heating Hot and Cold Water Geyser Tap Water with Digital Display (White)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹1,449", "actual_price": "₹4,999", "discount_percentage": "71%", "rating": "3.6", "rating_count": "63", "about_product": "Easy to Install, does not need space like other Geysers.|3-5 Seconds Instant Hot Water.|Heating tube: high-purity copper liner heating element Rated voltage: 220V/50HZ Rated Power: 3000W|The display will real-time display the current temperature.|A must kitchen accessory for housewives: your hands won't feel cold when washing dishes", "user_id": "AHCSFNVYY5Z4MC3YQWCKQXN43UKA,AGRXFT44MBP4EAAKW4AUMJ43HASA,AHCJ4SBFDS4JQ3KM3TB6JPV7LCWQ,AEMRVATZMCTFHHWR4RGUBJ6EIY6Q,AEJTHOGZUGNSJ4U35D4JDA254VNA,AEBRKCEYVLKRYEX4DVFRH3UUWPVA,AEULXBJRVQTUU7LYUNJK4VQD2LLA,AEGU57M3ITWK676QUCVQYF4ZMM3Q", "user_name": "Amit,vedantika,gurpreet kaur,Md Zafir Ahmad,Latika S.,Rahis Khan,Tanvi seth,Samala Dayaker", "review_id": "RPF6BQZ9ZGOD7,RAQPY2NRM7G4U,R22USVU70E2UD0,RLKRRQI8IIBB2,R1BTMJ9YWSTHY5,R19OH78FQO2VN0,R2N1VHAAGIDIMT,R1J0541W0XS1ER", "review_title": "ok product,It's a good product.,Simply awsome,Nice tap hot water,It is good for short time use. Needs continuous of temp and water flow to keep it under control.,Easy to install. Highly recommended,Excellent quality,Very frauding", "review_content": "3Kw huge consumption.rest is ok.and control is only by flow of water so you cannot set temprature and wastage of water is little more,I have been using it since February 2022.Here are some points where it failed my expectations.1. The temperature doesn't remains constant not we can set it at a particular temp.2. The water flow is very restricted and takes more than 30 mins to fill the bucket of 15L completelyWhere as the geyser we used earlier ( bought from a local shop) could be set at a particular temp as we can adjust in stove. And the water flow was also comparatively more faster than this.,This instant electric water tap is awesome. This tap working properly by this seller. Packaging is awame and complete with user manual also. I liked it. Must purchase the product from this seller.,Very good product as expected,Lack of mannual temp control.,,Loved it. Fine quality,", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51fYpZRmZ2L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Tvara-Enterprise-Instant-Electric-Heating/dp/B08T8KWNQ9/ref=sr_1_407?qid=1672923612&s=kitchen&sr=1-407"}
{"product_id": "B07Y1RCCW5", "product_name": "ZIGMA WinoteK WinoteK Sun Instant Water Geyser, Water Heater, Portable Water Heater, Geysers Made of First Class ABS Plastic, automatic Reset Model, AE10-3 W (Yellow)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹1,190", "actual_price": "₹2,550", "discount_percentage": "53%", "rating": "3.8", "rating_count": "1,181", "about_product": "NOTE- In this order you will receive10 geysers. If Not received please return or replace immediately", "user_id": "AGLUPY33OM375F64CHDCQW3KF64Q,AHL6DKFWYVLNGVHHQMGWVVZY5D4Q,AEV7DR7CDJFYPKCDK2Y5WGUR6BDQ,AFTAR6G52NZQDC6ITEORXUZHXURA,AHFKFHJR6Q3FYXQH42N6O2RHLAYA,AFSIHCK5KXPIX5PVODLGUIIHVWIQ,AGX4KI4YQ2MBM4CMZEFHPLQBGPTA,AGMLCKCSUIFBF3A67WZ7OLGFYRYA", "user_name": "Aashishnautiyal,Telangana venkatesh,Abbas Tirupur,Jacobasha Mysore,NAVNEET,Atul choudhary,MD Azhar,Prabu doss", "review_id": "R1O343U978W7T3,RTT7TYSICUSK7,RNJ28HCJAVS7P,R65UG8VBWZ9FO,R1NYFIH8430TSL,R2XETJ09ENS8YK,RZ2ITHHJJCWZS,R9L25UA45NALQ", "review_title": "Water heating not good as per standard,నాకు ప్రొడక్ట్ ప్లగ్ డామేజ్ అయింది ఇప్పుడు రెండు నెలలు అయింది నాకు ప్రొడక్ట్ ప్లగ్ ఇప్పించగలరు,Good Product for Heating purpose,Good product,Easy , compact and quick solution,Ok product,Not worthy,Useful", "review_content": "Na,గ్యారంటీ,Good use for getting instant heat water.I have used it for last 9 months it was still good and no issues.,Very bad product don't bye used product i received,If you don't have hot water line installation in kitchen. This is the best solution. It took 30 min max in installation. Best for winter use. Not for bathroom use. It only provide lukewarm water which is good enough for washing dishes.Pro: one hot water pipe is provided Cons: no pipe clamps provided.You need 1/2 inch pipe for cold water line. Length depends on distance.2 pipe clamps is neededReview: you can buy it , it is working satisfactory. But other similar products are selling it with pipe, clamps etc. So please check first. I like build quality.,Easy to use but voltage consumption 3 kw it's. Too much,Average,Good product", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31C71rcp+1L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/WinoteK-Instant-Portable-Geysers-automatic/dp/B07Y1RCCW5/ref=sr_1_409?qid=1672923612&s=kitchen&sr=1-409"}
{"product_id": "B0762HXMTF", "product_name": "KENT 11054 Alkaline Water Filter Pitcher 3.5 L | Chemical-Free Water with Balanced pH Levels 8.0 to 9.5 | Solves Acidity Issue | Equipped with Carbon and Sediment Filter - Grey", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterFilters&Purifiers", "discounted_price": "₹1,799", "actual_price": "₹1,950", "discount_percentage": "8%", "rating": "3.9", "rating_count": "1,888", "about_product": "KENT Alkaline Water Filter Pitcher converts drinking water to alkaline water and increases its pH level up to 9.5 for a healthy body and healthy mind;Alkaline water helps in reducing acidity, regulating your body’s pH levels, boosting immunity and fortifying your health|It reduces the oxygen reduction potential (ORP) and makes antioxidant alkaline water that tastes fresh and clean;Doesn’t use electricity or chemicals for enhancing pH levels|Improves anti oxidation ability;Country of Origin-India; Color: Grey;3.5 liters capacity|Warranty: 1 year warranty. Terms and Conditions apply;Includes: Alkaline Water Filter Pitcher, Cartridge assembly and Instruction manual|Warranty Description: 1 Year Manufacturer Warranty", "user_id": "AFZBWPKSEOJ3ZXAVS7IA5QMLX6SQ,AH4H673QHNMNQEBK6XKODER4TXBA,AFF3RSHZGO4BAR2KYIOVYD3VGZVQ,AFEVGT6SALVKATPAPCZQCUOZFA4Q,AH7MEOSIJPT7Z2WMJI4ROMY3I2QA,AGLKS2YBV32Q5F36ESVSZKN7YZVA,AF3DKAW7MUAW6MB7HC4YEPY6IN3Q,AGVNDZ4Y2VJXWYSIDOP4GXJYF5DQ", "user_name": "Nikhilesh T.,Vishal Sharma,milind moon,Amandeep thakur,smsn,Manwinder Singh,Kindle Customer,Chakraborty A.-7001953481", "review_id": "RN4RJMHA6Z17Z,R27O0FPVNG63DK,R1O1OR760KAMN2,R1KHM1E2FS5LHX,R2EDFZCXSNQL9Q,RWOZF184HDN45,R2S27KPO0VKWWA,R6NCDUG0BJSA9", "review_title": "Excellent product timely delivered,It's good,Sleek useful but after some time filling water takes time,Good product,PH not certain,Awesome,Excercise Caution before buying,Almost ok", "review_content": "Excellent and useful product, easy to use. Water quality is superb. Only issue being, how will we know if the cartridge needs to be replaced. Where from can we get these? Presently ordering 1 more filter!,# Easy to use.# Buid quality could be improved.# Water helped whole family to get rid of gas and acidity issues. Eventually weight loss.# No difference in taste.# Worth trying.# Frequent change of filter is on down side, eventually it helps as all water filter does.,Water spills when filling glass. Like taste of water,Must have extra filter cartridge ,must include ph value indicator,top lids securing is not good,must be close more firmly to avoid leakage,container jar material needs improvement as it got scratches very easily while cleaning inside, but overall it is a good product as per use and design,hope kent will improve on the above points,PH level that defines alkaline in water is not up tu mark . Need to be m verified as company claims it turn water into alkaline anything above PH 7 but in reality it’s hardly good as any RO water 💦.,Must buy product…Portable..sturdy & a very useful tool to have…it raises pH level of water actually…..I have experienced wonderful results in my stomach related issues….Must buy….!!,,Useful. Water is alkaline definitely. But after installation,  6 to 8 washes are needed before drinking", "img_link": "https://m.media-amazon.com/images/I/41EI+3OYGaL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Kent-Alkaline-Filter-Pitcher-3-5-litres/dp/B0762HXMTF/ref=sr_1_410?qid=1672923612&s=kitchen&sr=1-410"}
{"product_id": "B00K57MR22", "product_name": "Sujata Dynamix DX Mixer Grinder, 900W, 3 Jars (White)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MixerGrinders", "discounted_price": "₹6,120", "actual_price": "₹8,478", "discount_percentage": "28%", "rating": "4.6", "rating_count": "6,550", "about_product": "Warranty: 2 year warranty provided by the manufacturer from date of purchase|Includes: 1 unit Motor, 1 Wet Grinder jar, 1 Chutney jar, 1 Dry Grinder jar|Most powerful 9 watts motor with double ball bearings for efficiency, low maintenance and trouble free running for years|Dome jar for wet grinding, 2 separate stainless steel jars for dry grinding and chutney grinding|22 rpm operation- retains flavor and aroma of juices and food|9 mins. continuous running- suitable for longer usage|Totally shock-proof and safe|Low maintenance, trouble free running", "user_id": "AHNCY56JLPCF2AHRH3SO2RIKHYFA,AEBZKKPXROE4RBTBFJ6E5F5BGALA,AHMGJ3N5TJ5YYHGONQ4YANYH6EFA,AFLOWV4SAZ4GJHBZZJLRC3UYJPPA,AHJERQSJBOQHOWKP4BHQUZNAK32A,AF53E744SCKUPF4AKF4LL3VPKRDQ,AF4R7KKPJVNKJC5D3CWKKX2JZAHQ,AFJQMCVVZBRSBACG5CHFJ653CXVA", "user_name": "Amazon Customer,Sai,Azim,john prabhakar,RAJA SAMANTA,RAVI,Radhe,Ram Kumar Mishra", "review_id": "R2IMGTYKPMXP4N,R2LP7PV1I0Z1V0,R33UGZXCUN1PDT,RH2ODFAELL6ID,R1LSVKDGASJ3ZX,R14FNF4GQL91JN,R2YT02USWR83PT,R81KUPKOTEI6J", "review_title": "Best mixer,Best value for money,सबसे जरूरी बात ये है के इसमे सब पिस्ता है चाहे पत्थर भी दाल दो।😂। https://youtu.be/WBPca3j306k,Noice is high compared to others,Five star product,BEST MIXI,Best in the market best in segment,Good but not best", "review_content": "Best mixer as compared to flimsy  350w,750w. We use daily since last 4 yrs grinding coconut, dosa batter, dry chutney etc. Go for it, tried many branded but this product is wonderful,Best value for money. My mom is pleased with the grinder's performance. If you got the budget go for it.,मे इस से चावल का आटा बनाता हु,ओर मिर्ची का पाउडर बनाता हु,ओर धनिया का पावडर बनाता हु,ओर नारियल का चटनी बनाता हु,ओर जान ने के लिए इस पे क्लिक करोhttps://youtu.be/WBPca3j306k dekho isko☺️,Very nice performance with powerful motor, good looking strong built up, but noice is high and disturbing compared to other mixer grinders.,Five star product,Only drawback is it doesn't have Auto cut-off function. Otherwise mixi works REALLY GREAT.,Best in segment best in the market,Noise level to much high", "img_link": "https://m.media-amazon.com/images/I/41cZE9HcRUL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Sujata-DynaMix-DX-900-Watt-Grinder/dp/B00K57MR22/ref=sr_1_411?qid=1672923612&s=kitchen&sr=1-411"}
{"product_id": "B07TTSS5MP", "product_name": "Lifelong LLMG74 750 Watt Mixer Grinder with 3 Jars (White and Grey)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MixerGrinders", "discounted_price": "₹1,799", "actual_price": "₹3,299", "discount_percentage": "45%", "rating": "3.8", "rating_count": "1,846", "about_product": "Warranty: 1 Year", "user_id": "AG7YXM3CTKIWDRFUWCMM5KGHAP3Q,AHAB4O4T3BB2LJCQJ2IULLRC2ELA,AFY3BGO4YZABQCIIIVYMRYDQ3QWQ,AGQHA7FMMURNYMQ2SM2LJV372TTQ,AFFD52Y7MQO7ET2RYGACLHCZTRTA,AGPWQPY5N7CBNPKJ3RLDSLUWKOOQ,AH6WHKS34WZIDXRKN3YKSRQCBLEQ,AFXIU2GNQU5FDRWNQR2RKY5NBG6A", "user_name": "mirza f.,P Naresh Kumar,Saurabh Kaushik,Siva Subramaniam,Nirmal,Asanka Wijesinghe,MOHAMMAD KHUBEB,Naveen sahal", "review_id": "R2PFNGIRCB6KB1,R3HOQIZQ2Y2P1E,RSMINHFUL02QE,RECSJ6GYWXJWE,R2M39R5NO51DBK,R1IKAF2X8JVXQS,R3D1X15POHDHKU,R1OKIDKNCYKZFS", "review_title": "Good product 👍,Value for money,Does the job which is intended from it,Nice product..,कीमत के अनुसार अच्छा उत्पाद है।,Not satisfied as expected. 😔,Awsme product,Good in this price", "review_content": "Good product,Noise levels are high. But overall product is value for money,Bought this product for a second time in 3 days after testing it's utility. Used it to grind 3 different hard spices and achieved the desired result. The heating issue is expected due to friction of hard spices. Overall great product with 750 W motor which was our requirement.,Handling very easy and good.. Noise level is high.. Budget friendly product.,Noise levels are high. Build quality is also good. overall product is value for money.,A lid of small jar is not tighten properly. Unhappy with the product. 😔,Its a very good product.....low noise with powerful motor ....grind items very smoothly,Good in this price range..but noise level can be improved", "img_link": "https://m.media-amazon.com/images/I/31Sh9NZmX-L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Lifelong-LLMG74-Mixer-Grinder-White/dp/B07TTSS5MP/ref=sr_1_412?qid=1672923612&s=kitchen&sr=1-412"}
{"product_id": "B09ZDVL7L8", "product_name": "TTK Prestige Limited Orion Mixer Grinder 500 Watts, 3 Jars (1200ml, 1000ml, 500ml) (Red)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MixerGrinders", "discounted_price": "₹2,199", "actual_price": "₹3,895", "discount_percentage": "44%", "rating": "3.9", "rating_count": "1,085", "about_product": "Ergonomic Design|Strong 500 W Motor|Superior Quality Body|3 Super-effcient Blades|Sturdy Handles, 3 Stainless Steel Jars", "user_id": "AER7IMDKY6Y2NLWEIAOEOEMWPTQA,AHBJI32NFYYFJRSI2NZ3RGNYYNLA,AFGIZWFPMU77SMMBFMVKCNRBXPOQ,AEHV36BG2B5DD6MRSRAJMEFNF2GQ,AEDONSL33XUU6IK7HCDLQEPV7GGA,AFIXIYJE5BEMYL2TLUYPGAPYPC6A,AGT2K7XLOKTPWOWG32DBORMMK4AQ,AEPSOFO2EJJOVKNXXBISGJWVHCWA", "user_name": "Amazon Customer,Amazon Customer,Niranjan Niru,vinay,Mini,kapil Raibole,Kiran HG,Mohithsai", "review_id": "R1KN9SD017A7RE,R3CEOM0J1JBDOT,R1AEDQ9CAI6XXW,R2XIO0KMHIEO1F,RFVSFZCU692EX,R3A5RFPX4FKUDV,R3M6T8MOF5GD27,R19Y9YVBF318KF", "review_title": "Good product, Value of money,Basic and Good,Good product for the price range,Best for family of 3,Value for money,Nice,Best,Nice", "review_content": "Good product,I bought this as a gift. The person using this product has not complained. So, there is just that much I can attest.,Very good for this price rangeEasy to use and good product 🙂🙂🙂,Looks nice ...need to use it and get back,I used the product 4- 5 times in last 1 month and it is meeting the expectations.Value for money.,Good product,Verry Good,Nice", "img_link": "https://m.media-amazon.com/images/I/41+oy999w7L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/TTK-Prestige-Limited-Grinder-1200ml/dp/B09ZDVL7L8/ref=sr_1_413?qid=1672923612&s=kitchen&sr=1-413"}
{"product_id": "B09XHXXCFH", "product_name": "AGARO Regal Electric Rice Cooker, 3L Ceramic Inner Bowl, Cooks Up to 600 Gms Raw Rice, SS Steamer, Preset Cooking Functions, Preset Timer, Keep Warm Function, LED Display, Black", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Rice&PastaCookers", "discounted_price": "₹3,685", "actual_price": "₹5,495", "discount_percentage": "33%", "rating": "4.1", "rating_count": "290", "about_product": "Multi functional use- Steamed veggies and rice, various recipes you can accomplish it all with your rice cooker|Cooks up to 600 gms of raw rice or up to 5.5 cups of raw rice|Multi cooking functions-White rice, brown rice with low carb, short grain, porridge, steam, slow cook|ADVANCED FUZZY LOGIC RICE COOKER TECHNOLOGY - auto adjust temperature and timings for optimal rice cooking combined with tailored useful add on options including steam, porridge, slow cook settings Including 24 hour pre-set timer and keep warm features|Comes with 3 Litres 5-layer thick ceramic coated inner bowl with rice level lines|Smart touch button with 3D surround heating|Includes inner bowl, stainless steel steaming basket, rice measuring cup, rice spatula and soup ladle|1 Year Warranty", "user_id": "AHD7UBRNLFOB46RIRLFXKJY6N53Q,AETPMOGJUEKAM3X4BMFBSHTDQ3BA,AEUUSCC65BXKCGFTNKBRKYCWIZYQ,AHFSOIYBAXZ3WLROODW5ATRX2XKA,AEKIANKK2HHKU6TJ2U2ERPAMQKKQ,AGGBFQHKXHD3VWPDNLO423V4TCPA,AHSMRFFHYS3UI6RA4KJSF7VDC4MA,AEBEEXG4EBJXPW7PBL4FL62NOGXA", "user_name": "Pratik garg,Amazon Customer,olivia dutta,Raviteja Richard,AKR,sandeep,Amazon Customer,Manisha", "review_id": "R1FV12XCLPA07M,RR4FYBIUQQF0S,R3IGJPGKZS06NZ,R33OLTLASD1YIK,R27G7C06S1UGAV,R10P8JU3ISASFZ,R3QOZ26RJV3Y3Q,RVAOC66XONJBJ", "review_title": "It is a great product can be used to make dishes and curry too.,Nice and satisfied.,Good Product. Easy to use. Worth buying.,It works well.,Nice product,Its a beautiful product but very small.,Impressive product,Stylish", "review_content": "I used it to make pulao and curry. It is eqsy to clean and easy to use. A temperature regulator would have been more useful  for certain cases.,Nice and satisfactory product.,It's vary handy and kitchen friendly. The price is also reasonable.,It is value for money. Suitable for 2-3 members.,Beautiful design, functionality, appearance, rice pot and accessories - value for money.I use the same for rice cooking.,A great utility product, but very small,To make biriyani,https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/710JbPDG48L._SY88.jpg", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/417Fqdo6KJL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AGARO-Regal-Electric-Ceramic-functions/dp/B09XHXXCFH/ref=sr_1_412?qid=1672923613&s=kitchen&sr=1-412"}
{"product_id": "B0BL3R4RGS", "product_name": "VAPJA® Portable Mini Juicer Cup Blender USB Rechargeable with 4 Blades for Shakes and Smoothies Fruits Vegetables Juice Maker Grinder Mixer Strong Cutting Bottle Sports Travel Outdoors Gym (BOTTLE)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|JuicerMixerGrinders", "discounted_price": "₹649", "actual_price": "₹999", "discount_percentage": "35%", "rating": "3.6", "rating_count": "4", "about_product": "【USB Rechargeable & Great Portability】 The personal blender has a built-in 1800mAh USB rechargeable battery which can be easily charged by power bank, computer or other USB power source. The blender can be fully charged within 3 hours and serve up to 15 cups of drinks. The on the go blender, comes with 400ml capacity and only 250g product weight, can fit in any kinds of bags. It's easy to carry around in any circumstances such as working, travelling, and chilling at home.|【Advanced Tips on Blending】 (a)Fully charge the blender after receive it and always recharge it after using. (b)Before blending: Make sure not adding overloaded ingredient (up to 3/4 of the cup) then add some wate or other berverage (1/3) to the blender cup (c)While blending: Turn the blender up side down before starting it. After the blades start to rotate, flip the blender back as well as shaking the bottle. The correct operation can prevent blade stuck and provide a better blending result.|【Powerful & Effective】 The juicer cup is equipped with 4 PCS 304 stainless steel blades with 30W rated power motor and 3.7 rated voltage. With a higher level of rotation frequency about 21,000 times per minutes, it only takes 40 seconds to bring you fresh smoothie, protein/milk shakes, fresh juices, baby food etc. Please cut fruits/veggies into small pieces for a better blending result. The mini blender will not work on large ice cube.|【One-button Operation & Cleaning】 PRESS DOWN THE BUTTON for 2 seconds to turn on the blender. If you see the button is blinking while blender not turning on, checkout if the bottle and the base are tightened and make sure the blade is not stuck. The mini blender is easy to clean by adding water and long press the power button to start the self-cleaning mode. DO NOT soak the whole blender into water for safety concern.|【Unique Appearance & User-Friendly Design】Beautiful and elegant private mold design, Small size, Wireless, USB rechargeable, and portable design make it a personal travel mixer. The charging port at the bottom and the silicone plug make it water-proof.", "user_id": "AH7CVQ6755UNVDKSBS2CKWMHOCZQ,AFMAYVBVIPFZYBTDGWSRCTASMZ2Q", "user_name": "Dinesh,Anshika", "review_id": "R27XB7WNFY9NJ3,R24HCMD10NT57S", "review_title": "As smooth as it can and as fast as possible,Wrost product", "review_content": "Tried for two days good experience and great product with excellent quality with fast and powerful blades,Please don't buy this product as it is not all useful it got broken while washing totally money wastage please don't buy", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/411S8WHOsXL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Portable-Rechargeable-Smoothies-Vegetables-BOTTLE/dp/B0BL3R4RGS/ref=sr_1_415?qid=1672923613&s=kitchen&sr=1-415"}
{"product_id": "B07P1BR7L8", "product_name": "Philips HD6975/00 25 Litre Digital Oven Toaster Grill, Grey, 25 liter", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|OvenToasterGrills", "discounted_price": "₹8,599", "actual_price": "₹8,995", "discount_percentage": "4%", "rating": "4.4", "rating_count": "9,734", "about_product": "Capacity: 25 litres, s for 4-5 people;Cooking capability: baking, grilling, toasting|Powerful 1500W, Ready signal;Opti temp technology(Even Browning); One touch 10 preset menu;One-touch Preheat functionality|Includes Oven toaster grill,Baking Tray, Grill Rack, Tong, Crumb Tray and Skewer Rods;90 Minutes auto cut-off|Capacity: 25 liters;Warranty: 2 year warranty on product|Size Name: 25-Litre", "user_id": "AHEZ2YIPI6Z3RJH22BSRYMSPEWOA,AEHUTTWMDAOEZMG66NSX74CVMGQA,AH7T3ST2K7B725YJN7TRBAV7WTXQ,AGM4CQWT4HY2YVGKXBPKH3FFSL7A,AEXAE6XNUYOTIWU4SAWYRHN3TVZA,AFSTYN76L3OSI4XWVZFQ2YIBIL6Q,AFO6ORYOBVJCCFQJXDFUDDVWPNAA,AF5CFHHUVY7M2WGITP23UH6SJ5UQ", "user_name": "Imran Ahmed K,Himanshu Kumar Sinha,Faizan-ul Islam Salafi,Amazon Customer,Your Bro,Deepika Wilson,Abhishek Mathur,Arti", "review_id": "R2QOX3VCM8T6PV,RPYQIR3334L89,R2IRKJDUONHPDR,R1R7YLZ1PZNMYX,R2KZ1KIWHCSP7U,R5ZTYD2K563IC,R327DMIJNSD3TN,R3EQVJIFUGXWDC", "review_title": "Love it,Very good product quality,Awesome product,Phillips OTG,it has the maximum temperature of 230 last .,Looks Good, Easy and smart working,Good product,Good quality", "review_content": "Bought this product after going through lots of reviews on Amazon and other websites. I can say that the product is worth it. The first dish we tried on for new year was Tangdi kabab. It was perfectly cooked. Awesome product for a family of 4-5 members.,It's worth the money,Everything is okGo for itEasy to use,This OTG is a sturdy product and very easy to operate. Bakes and cooks in much less time.,the product is average for grilling . it tooks too much time .,Superb purchase as we were thinking to buy OTG and this is a perfect one,Good product,Nice product", "img_link": "https://m.media-amazon.com/images/I/417VKyMXuYL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Philips-HD6975-00-25-Litre-Digital/dp/B07P1BR7L8/ref=sr_1_417?qid=1672923613&s=kitchen&sr=1-417"}
{"product_id": "B078WB1VWJ", "product_name": "Usha EI 3710 Heavy Weight 1000-Watt Dry Iron with Golden American Heritage Soleplate, 1.75 Kg(White)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹1,110", "actual_price": "₹1,599", "discount_percentage": "31%", "rating": "4.3", "rating_count": "4,022", "about_product": "1.75kg heavy weight iron for better ironing;5 fabric settings|360 degree swivel cord for easy movement;Golden American heritage soleplate|1000watt-effective performance;Shock proof plastic handle and body|Easy grip fabric selector;Warranty: 2 years", "user_id": "AG4KXXU3X2W7U5GHPFTQUH7B74QQ,AGVNR5BV6PXJKH2OXB6HYQN5VJCQ,AGPKKHWDHRBTTI6H2PMDX32QHSSA,AEBE2BCPPVJ4IPBU2J5EPU44WQJA,AELG7IFYME5AQB2B576XLNQDAKBA,AFGKUIIJE6RZVXZ3ZZ4SNSTXE4BA,AFT3A5EEJX2ZDXDFARRX2HR5I6BA,AG5W4UZE7KIEFTWZQAPHOOCNBHGA", "user_name": "Gyani baba,Sunil,Sakethram,Nagarajunuti,Nitin,Himanshu G.,jayachandran nair,Sam Rajiev A", "review_id": "R13VHF78WR3N1Z,R342QNGEZ7OI7F,R2ZL6XILY5JIM6,R19THHR4XUW2L5,R2Q8B6C09UY2KT,RS9KLTRCAL9W0,R1Z1D54NCQ2XXA,R3OGYQ4D7SLX6", "review_title": "It doesn't heat up,Value fir money,Ok,satisfied,Nice pic,Best iron so far,look,Ironbox stopped working after 4 months  of purchase", "review_content": "If y want to use it for light clothes line silk and chiffon it's great, but for heavy clothes like cotton and linen it doesn't heatup that much you have to press harder and it takes lot of time ,i feel i doesn't have that much heating capacity. Otherwise it's good,Value fir money,Out look not so good,good value for money,Value for money,Its a must buy if you are looking for a good iron which is heavy (1.8kg) so that a proper crease is maintened in clothes. Extremely good product.,very good looking,easy to iron,not very heavy,1000 watt reliable cord  what else needed,Our ironbox stopped working after 4 months of purchase. Have raised a complaint. However the product is not like earlier", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31gRT7Gvw7L._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Usha-Electric-EI3710-1000W-Golden/dp/B078WB1VWJ/ref=sr_1_418?qid=1672923613&s=kitchen&sr=1-418"}
{"product_id": "B0BP89YBC1", "product_name": "Campfire Spring Chef Prolix Instant Portable Water Heater Geyser 1Ltr. for Use Home Stainless Steel Baking Rack | Restaurant | Office | Labs | Clinics | Saloon | with Installation Kit (With MCB)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹1,499", "actual_price": "₹3,500", "discount_percentage": "57%", "rating": "4.7", "rating_count": "2,591", "about_product": "Prolix Auto cut off feature: It is available when the user forget to switch off it will going to automatically cut it off. (Manual reset models are only going to Standby Mode, Other Auto reset models are going to restart automatically after 10 minutes If this is not noticed, the same process keeps repeating it will increase your electricity and geyser life time also decrease.|Prolix Specifications: ABS (Acrylonitrile butadiene styrene) Shock proof and Heat resistant, Copper Heating Element Tubular type(3Kw.) ISI marked, Indicators Neon Green and Red light, Thermostat Copper ISI marked, 1.5 square mm 3Core cable ISI marked 1.15Mtrs, 16Amp. Plug Pin-top ISI marked, coming with Guaranty card and user manual, with 2 No s Connecting nipple, 1 No Royal union, 1.5 m connecting hose and 2 No s Screw with wall sleeve and excellent packing|Prolix Instant water heater: Now comes with unbreakable First Class ABS (Acrylonitrile butadiene styrene) body and comes with water inlet and outlet Thread type. It is more convenient for usage and it will avoid water leakages. Our geyser is portable, instant, and compact, less power consumption Up to 20% saves electricity compare to other storage geyser|Compact size: It provides Non-stop (247) hot water from 10 seconds onwards, just put it in the water tap and get hot water continuously it does not required additional plumbing. Ideal to use in Houses, Beauty salons, Hotels, Schools, bathroom, Kitchen, Wash area, Hospitals, Mansion and factories where there is an instant need of Warm/Hot water supply. (Strictly we are not recommended for drinking purpose)|Warranty: Manufacturer 1 Year Warranty", "user_id": "AEVX4JV3C4QR3Y3V3RJXQ2WZAR4Q,AHR5JZBK66QYZSEJ37GM3K2DXDIQ,AEAOSBMIGWQY5HFXDMBRQUE3L52A,AGUEJAHXS2LL652SUQTCM52FOZHQ,AGRMA5YXQJV53ZJHIRAIZTBPJ6DQ,AEVLNW7OEHU23QZWBPF2ZLYHTBHQ,AGD6G2GDZX44OOJJCN4TLROEP7OA", "user_name": "Srujan kumar,Sadhu s.,parveen sharma,Patel kaushikbhai. S,Vinoth,Ankita Gupta,Jignesh lathiya", "review_id": "RBPM3YRVWMMMK,RVY7BZCJPHJZU,R3KXHKIGWPT7IS,R1K28XXUFE3XNT,R23K3XEJA3V8XG,RTILNKKZAV4WT,R2Z92RDSJM71FU", "review_title": "Felt very useful 👌 but cable is short,Good in portable series of Geyser,Awesome product,Good quality,Product okay but no bill receive,Wrong Reviews uploaded for this product.,Good Product", "review_content": "I like instant heating, I didn't get warranty card, I am using the product in bathroom for bathing purpose. Null from where the hot water comes should be lengthened,quality is good,I like this small or instant geyser. Awesome product.,Best sellers,Product ok no bill receive no extra screw not receive light red and green same time working suddenly heat working okay very well,The product is Portable Instant Heater and all of the 25000+ reviews are of Magnetic Spoon. Amazon team should check for this issue.,Best one usefulin weather season value of money 💰 💰 💰 💰 💰 💰 💰 💰 💰 💰 💰", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41hoHTbN5rL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Spring-Chef-Stainless-Restaurant-Installation/dp/B0BP89YBC1/ref=sr_1_419?qid=1672923613&s=kitchen&sr=1-419"}
{"product_id": "B09W9V2PXG", "product_name": "Themisto TH-WS20 Digital Kitchen Weighing Scale Stainless Steel (5Kg)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|DigitalKitchenScales", "discounted_price": "₹759", "actual_price": "₹1,999", "discount_percentage": "62%", "rating": "4.3", "rating_count": "532", "about_product": "High Precision Core Technology：Kitchen Scale Equipped with sensitive sensors, it can provide you precision graduation 0.1oz/1g, capacity 11lb/5kg. This digital scale with 2 models of gram and lb:oz to switch between imperial and metric measuring units.|Stainless Steel Food Scale Set：Digital Kitchen Scale is made with food-grade 202 stainless steel. Sturdy and not easy to damage.|Liquid Weighing Capacity：Themsito kitchen scale is a multifunctional scale with unique features. Besides weighing solid unit lb: oz and g, you can easily measure your recipe ingredients in fluid ounces (fl'oz), and milliliters by water volume or milk volume.|Easy Tare Function：The taring and auto-zero function of Kitchen Scale allow you to subtract the weight of the bowl, dish, or container from the weight of the food. To ensure food safety, you can use multiple-sized bowls to weigh various types of food separately.|Clear LCD Display：This Kitchen scale comes with 2.5\" Large LCD with white backlight can display the reading more clearly, even cooking in a dim place. 2 x AAA batteries included.", "user_id": "AGTISTATRBDCRY35BAIENJ3YZLXQ,AEV77VMKNNCQ5VIEWG3WOSCCVIBQ,AG23ZRBLDYWQAUQHZH5QYDKSFTPA,AFGW5PT3R6ZAVQR4Y5MWVAKBZAYA,AETYH4YVGJXWRIRQJQUZ7OR5JPNA,AFRYPUMXJ7GTS5G4YBN5B6A6UZIA,AH2AVOZLB7HONYWXE36LNSSH3W5Q,AG6XZKNID4KTQYM4ZI4EYKUIMPCQ", "user_name": "Pierre Francis,Amazon Customer,Ginger,Rajib,Hardik Tank,Sishir S.,Dhanish,PRODIP KUMAR GHOSH", "review_id": "R27B01SC9QAZKK,R1PCNR9B02HU9B,R2VVVYOKKK8OZA,R334FKVINA14QI,R3B8A6JCBLRUGC,R3GI30K6SI7HQR,R26WYNQ8661K6,R36HQ7DOFZO43R", "review_title": "Weight without the wait,Good,Good Product,Nice cute scale,Best weight machine,Must have for every kitchen,Value for money,Digital Luggage Scale with Target Value Setting", "review_content": "This neat, lightweight device responds without delay. No waiting with the button pressed and counting seconds before a figure is displayed! A single tap is all it takes to change measurements, start up, or switch off. This sleek beauty can weigh something as light as 2gm, provided the substance is placed directly on the plate. Great, if accuracy and speed are what you need.,Good product,Good one , got on a affordable price . Quality is good , definitely would help for planning luggages for overseas travel.,Nice cute scale ...looks good in kitchen . Does it's job perfectly,Amazing product with perfect and accurate weights.,I had seen an Amazon brand kitchen weighing scale and every time I was about to order, it was out of stock and now that I found this I did no hesitate and ordered it for 749/-. I am sure if I had waited for some sale period I wud have got it for 500/- but didn’t want to take a chance.As I’ve checked the scale the following things are good1. Accuracy2. Tare function3. Light weight4. Ease to use5. Large backlit display6. Stainless steel baseWhat cud have been better1. A hook or a hole to hang it on the wall2. The weighing platform is slightly elevated from the base and possibly debris / rubble can stay in between where it’s slightly difficult to clean with cloth ( will have to use some kind of small brush).Overall my recommendation is to blindly go for it and is really worth the price. Durability is yet to proven which only time / aging can prove.Thanks Amazon and Seller,Dont go for 300 or 400rs product., If u gonna use it for long run (more than 6month)., This is the best product to buy.,It works fine., Light weight., And accurate.,300rs product might show you incorrect reading like +/-10gm and doesnt last more than 1-2month.,,IT IS WORKING WELL. GOOD PRODUCT.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41HoeX-PcDL._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Themisto-TH-WS20-Digital-Weighing-Stainless/dp/B09W9V2PXG/ref=sr_1_420?qid=1672923613&s=kitchen&sr=1-420"}
{"product_id": "B09XTQFFCG", "product_name": "FYA Handheld Vacuum Cleaner Cordless, Wireless Hand Vacuum&Air Blower 2-in-1, Mini Portable Car Vacuum Cleaner with Powerful Suction, USB Rechargeable Vacuum for Pet Hair, Home and Car", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Vacuums&FloorCare|Vacuums|HandheldVacuums", "discounted_price": "₹2,669", "actual_price": "₹3,199", "discount_percentage": "17%", "rating": "3.9", "rating_count": "260", "about_product": "【High Power Suction】 This hand held vacuuming cordless uses a built-in cyclone design, which makes this compact handheld vacuum cleaner can still provide 5200pa continuous strong suction; not only can it effectively clean dust, paper scraps, hair and other small garbage, but also small rubble; after many tests, it has been shown that the fully charged portable cordless vacuum cleaner can last for 20 to 25 minutes.|【Suction & Blowing Dual Function】The cordless handheld vacuum has a smart design, which not only has a enough cyclone suction and could be used on small areas like car interior, keyboard, workstation area, kitchen cabinets, but also could be used as a dust blower. One end of the machine is connected to the suction nozzle for vacuuming, the other end is connected to the nozzle for blowing dust.|【Multifunctional Accessories & Storage Bag】 Our portable hand-held vacuum comes with 3 functional accessories and 1 storage bag, will meet all your cleaning needs. The crevice nozzle can clean deep slits and corners. The long soft hose nozzle can reach anywhere flexibly. The brush can easily remove the stubborn dust and pet hair. The lightweight storage bag is convenient for you to carry or store your pet hair vacuum and accessories.|【Portable & Family Gift】 This handheld vacuum weighs only 950 Grams, the ultra-light design allows you to use it for a long time without getting tired,and you can easily clean the room even if you hold a baby. Ideal cleaning GIFT for your family or friends, solve their cleaning troubles! NOTICE: Fully charge before using for the first time.|【Vacuum Cleaner Set include】the Vacuum Cleaner incudes 1* Handheld Vacuum Cleaner, 1*Brush, 1*Nozzle, 1*Retracable Nozzle, 1*Blowing Nozzle, 1*USB cable, 1* carry-bag.If you have any questions during use, please feel free to contact us, we will try our best.|We offer a 12-month guarantee to prove that we take quality seriously. If you have any questions about your cordless handheld vacuum cleaner, please do not hesitate to contact us directly via email and we will get back to you within 24 hours and give you the best solution!", "user_id": "AGGOQNG25MN3SQK67LCMYO2ANTNA,AGFGMHAZIHB4LSRP3ICDFTVOEYRQ,AGNDEWYGSKM75CIOKTG7OQ2JLMBA,AFHXOJYSPDBZUBOUC44SVFGLXFYA,AGRACQ6KUYCYWALI5HNKD5QLJ25A,AGQFBYYNUJXJSAWYO5LHEQDFEHKQ,AECNIS47DOPIKSIDCNYXX7B7PIKQ,AGXCVMSWE3C7GSLFIZZQAIPXK23A", "user_name": "Samsakthi2008,Hussain B.,Surendrasinh,Mitali Bhargava,Amazon Customer,Amarnath.S,Rajasekaran M.,Nupur Sharma", "review_id": "RV24IG0ESY0QQ,RT6Q1RSJWHH0A,RI1QYUZU94RKT,R16FKQNXTMPBRV,R1RBGFBH1U37L,RJGJ2HUWX9GSC,R3PY9TXJSQ085F,R3N0OO6FHZAE2I", "review_title": "Value for money,Good mini handheld vacuum, I use it to clean my electronics,Best in market,Quite handy and efficient,Small and powerful,Nice product,Blower leaks air,Really good portable vacuum cleaner", "review_content": "The blower functionality is good. the brush nozzle is not good, it breaks on sharp corners. overall its worth buying for small cleaning.,A very premium look and feel product. works well, I use it to clean my laptops and other electronics.,I really like this portable wireless vaccum cleaner. I'm using it for cleaning my car. It comes with charging cable, user manual and multiple cleaning brushes. Charging capacity is awesome. Suction power is very good. Easily catch dust particles inside car. It is best value for money. Thank you Amazon.,This is probably the most portable and useful vacuum cleaner that I have come across. Compact and portable, it’s cordless and hassle free. Great suction power and it is so convenient to use. It’s vacuum and blower both. Its is easy to clean so it requires no maintenance.,It is exactly what I needed, a sturdy, simple, small, and smart vacuum machine. It has great suction power. Wish it had little bit bigger storage box.,,Blower leaks air and if it to be used efficiently,vacuum cleaning: averagethey should have designed it like a tunnel.Use it as vacuum cleaner, remove the filter and accessories to be used a blower in reverse.,I really like our portable cordless vacuum clener. It's handy, lightweight, and easy to use. It's great for quick clean-ups and does a good job on our cars, floors etc. I had it for a few weeks now and it's still going strong.", "img_link": "https://m.media-amazon.com/images/I/41R4IgGsMaL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/FYA-Handheld-Cordless-Wireless-Rechargeable/dp/B09XTQFFCG/ref=sr_1_421?qid=1672923613&s=kitchen&sr=1-421"}
{"product_id": "B08LVVTGZK", "product_name": "Lifelong LLSM120G Sandwich Griller , Classic Pro 750 W Sandwich Maker with 4 Slice Non-Stick Fixed Plates for Sandwiches at Home with 1 Year Warranty (Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|SandwichMakers", "discounted_price": "₹929", "actual_price": "₹1,300", "discount_percentage": "29%", "rating": "3.9", "rating_count": "1,672", "about_product": "Elegant black finish body; Non-stick plates provide a healthy low fat sandwich|Safety: Cool touch outer body and heat resistant housing;|Plate Size : 20 cm x 7 cm; it comes with 1 year warranty|Grill Sandwich: Hinged lock for well grilled sandwiches|Includes: 1N Sandwich maker, 1N User Manual, 1N Warranty Card|Made in India", "user_id": "AGLUHXCJJDHZGCCQWBKUF7NAKL3A,AEE4VC52GEZBJ62O6SCO43EWMT6A,AFOQTS7SC5AGY5QHWAOGODRYPSYQ,AEDWSW43DK26XB4AM4TRHLPEJ3HQ,AEUFRVIZEZ32IEDWOE3KGCZXPRKQ,AGXY2N4QLW5M2KWTEAYKQSRBLOIQ,AFCWPBRLAMVOA6L27EPNMTLS3IYQ,AEJEWDZIQ3OTE47W62ZJ2HFOLRZQ", "user_name": "vijay patel,Gopal pawar,Anish negi,Amazon Customer,Dinakaran N.,Abhilasha,Amazon Customer,Seeker Seeking", "review_id": "R1BJTSW0Q3XBG2,R3LXL9MYPDNLQU,R1EMA2HNG6WLD0,RTH4IIS0NEMZB,R1PBGQY0ZXI2DD,RSK7Z8ESBQEUX,R3DV0SKGPJHAU2,R3NZXJDYJSIGBU", "review_title": "Budget friendly best product in class,Good product,Quality,Lifelong Grill Sandwich maker,We can make anything sandwich to grill.,A very good product, go for it,Comact nice design,the facility of big sandwich maker in small size.", "review_content": "* Easy and quick heating* Price 1099 is best in class* 1 year + 6 month additional warranty on.  registered device is very good in class* best product for those who uses occasionally (10-15 times in year ) because it will last for years if use is limitedOverall very good product,Is better automatic but heating temparature is not good manual is good,Product works best and quick just its quite light weight,Overall the sandwich maker is good. The length of the power cord is not sufficient.,Easy to prepare sandwiches of any thick.,It is a very good product. Decent cord length. The grill marks on my sandwiches and panini come out excellent. Value for money is good, considering I bought this for INR 999, it's totally worth the spent. You can make one sandwich / panini at a time, but I only cook for myself so, I don't find any issue with that. But again, it depends on the size of the sandwich. Go for it.,Very Nice product, ideal for small kitchen needs.. Very Light weight.. 1000w power capacity get heated very quickly... I say only one drawback powercord length is really very small, it should be longer atleast 1.5 metre to 2 metre would be ideal... Otherwise its a great product...,the best thing I like about this is the facility of big sandwich maker in a small size. There is no other company offering this design in this size. very good. thanx", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41mcGL9ei0L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Lifelong-Sandwich-Griller-Non-Stick-Plates/dp/B08LVVTGZK/ref=sr_1_422?qid=1672923613&s=kitchen&sr=1-422"}
{"product_id": "B07J2BQZD6", "product_name": "Kuber Industries Nylon Mesh Laundry Basket|Sturdy Material & Durable Handles|Netted Lightweight Laundry Bag, Size 36 x 36 x 58, Capicity 30 Ltr (Pink)", "category": "Home&Kitchen|HomeStorage&Organization|LaundryOrganization|LaundryBaskets", "discounted_price": "₹199", "actual_price": "₹399", "discount_percentage": "50%", "rating": "3.7", "rating_count": "7,945", "about_product": "PACKAGE CONTAINS: 1 Piece Laundry Basket|MATERIAL: Nylon Mesh|PRODUCT DIMENSION: 36 x 36 x 58 CM|Segregate your dirty clothes instead of every member of your family leaving their dirty clothes lying around haphazardly, you can place a laundry bag in the bathroom for them to use.|Made of a nylon mesh, this laundry bag is breathable. This nylon mesh laundry bag is also easy to wash and keep clean,", "user_id": "AFZOUV6DSSLIWTHCEQED5RR6HGHQ,AFL4I5P7WCRS6SYIW4ZNKWADKV2Q,AGFKMDMUPNFM5JWT6BBY2SEVMHMQ,AFKUC4MUHKKVBKYKGLJ3W52G6SVQ,AHBS5ADSTPJ6C5GUYBPG3VBTVX2A,AHUM2M2XXYNDAMBYGMNREX3XIYBQ,AFCQXQUIMMCKM6Y743IKFKIMAYWA,AHSBMJGIRPF66VB6VR76KHJAB3SA", "user_name": "MM,Tony Augustine,Pradeep,Priyanka.s,Amazon Customer,Pragadhe,Gaikwad pramodkumar popat,Pratik Panchal", "review_id": "RYPL17AT0RDI1,RQOF3LTV1XO6K,R169DI8KX4KIS0,R1T86QSHNGWS2,R3Q7KHGMYL8KPE,R22FND348KV4I0,R1IQL0D1Z5I492,R3PEJ703N4DY56", "review_title": "Unsatisfied,Too small for home use.,Nic,Nice item,.,Good,Material is not good.,Overall product is good, but one of it is damaged", "review_content": "Very small it is, hardly for less than 6 heavy clothes.Very good for single person but not for family .,Too small for home use good for travel,Value for money,I like the product.value for money,Nice product..,I'm happy with the product as it's highly portable due to its folding ability into its pouch and its sturdy enough to stand on its own but size is smaller than i expected.,Material is not good, for these price you can buy any bag...,One of the bag is damaged, but overall product is good.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51Ule90yh0L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Kuber-Industries-Laundry-Basket-CTKTC1475/dp/B07J2BQZD6/ref=sr_1_427?qid=1672923613&s=kitchen&sr=1-427"}
{"product_id": "B07HK53XM4", "product_name": "Bulfyss Plastic Sticky Lint Roller Hair Remover Cleaner Set of 5 Rolls 150 Sheets, 30 Sheets Each roll Lint Roller Remover for Clothes, Furniture, Carpet, Dog Fur, Sweater, Dust & Dirt", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|LintShavers", "discounted_price": "₹279", "actual_price": "₹599", "discount_percentage": "53%", "rating": "3.5", "rating_count": "1,367", "about_product": "Package Contents: 1 Lint Roller with 5 Adhesive Rolls (5 x 30 sheets)|Dimensions (L x W x H): 17 cm x 5 cm x 5 cm|Material: Plastic, Lint Roller with 150 sheets|SAFE TO USE: The lint remover uses the special adhesive paper material for effective lint removal without risk of damaging surfaces.|MULTIPLE USAGE: It can quickly remove all kinds of lint on Clothes, Coats, Sweaters, Dresses, Suits, Formal wear, thin hair, Sofa, Blankets, Pet hair and more.|PORTABLE This lint roller perfect for travel and common everyday use small enough to fit in a purse or pocket for use on the go with minimal space taken and maximum convenience", "user_id": "AE556ASSODHNECNYDEABP6Q7Z75Q,AESPTUXAQMTJ64NCR4QI5N6WL6HA,AEOVKYUJ6EB3K2D3CALSVWOITV6Q,AEAUQLBFFDELPJFM3F6JAIX4VWKA,AFEQDV6CWBY2Y4WS6ALF2BXU7VAQ,AHRRDBQR6IU4V4XBBLSJRRML3GQA,AH5BI7KKCSC6IZ2AS4XJZSQ7QO3A,AH2OKG3SYK3EHZWPVLNDVBVJCTSQ", "user_name": "Rahul Todur,MG,geeta,Nawang,Saff,philomon kani,rub,Manish P.", "review_id": "R2T39I2ZEKM9PL,R1ZBMWBRCRX6M1,R14ROZ9SPSVA1C,R1DM63YLI499R0,R35NUHSRXCQ4I6,R1Q3L7BERE4C6,R1334GMRXCJFLO,R1ZN9HBT8L7C6Z", "review_title": "This is a good product,Not upto the expectation,Not recommended for buying.,Very delicate product,Worth a buy,Good product,Just fine buy,Good stickiness but bad handle", "review_content": "The only issue is that the built quality is very poor. It broke on 2nd use. Rest the adhesion is good.,The product is not sturdy, the handle broke after a weekThe adhesive is working, but it is too diffuct to peel the tape,Product is okay but the stick is very delicate so it broke, now it very difficult to use the product.,The handle of the product broke when I used it second time so it's very poor quality would not recommend.,Its value for money,Easy to use,Product of good use. Wish the Handle of the roller was easy  to use,We have a beagle dog so we have extensive use of lint rollers in the household. Have been using the 3M, but its very expensive if you consume 4to 5 rollers every month. So thought of trying this one as i though how bad can a lint roller be. The stickiness of the glue paper was good enough to remove the dog hair, but the quality of the handle is really bad. It did not even last 2 days. So ended up using a wooden stick or long pencils for the job. If the makers had spent some more on making a good handle even if the cost would have been Rs 25 higher, then it could have been a great product especially for those households which have pets as they need it more frequently. So i might go back to buying the 3M product of look for something in between.", "img_link": "https://m.media-amazon.com/images/I/41Fo2P8-4ZL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Bulfyss-Plastic-Remover-Cleaner-Remover/dp/B07HK53XM4/ref=sr_1_428?qid=1672923613&s=kitchen&sr=1-428"}
{"product_id": "B08RDWBYCQ", "product_name": "T TOPLINE 180 W Electric Hand Mixer,Hand Blender , Egg Beater, Cake maker , Beater Cream Mix, Food Blender, Beater for Whipping Cream Beater for Cake With 7 -Speed with spatula and oil brush", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|HandBlenders", "discounted_price": "₹549", "actual_price": "₹999", "discount_percentage": "45%", "rating": "4", "rating_count": "1,313", "about_product": "★7 Speed hand mixer, please see the image or read instruction manual for speed guide|★Attachments: Tackle a number of kitchen tasks with two professional-style wire beaters for eggs and ream and two hooks for mixing dough. All are dishwasher-safe|★Motor 180-watt - this powerful motor has 7 speeds, so you can start slow and finish fast|2 Stainless Steel Hooks For Mixing and Kneading.", "user_id": "AEZUK5C5IY67OZ35JX7BP2WBG6JA,AEEVM3YPIPIVWHVUE4HARBANNZHQ,AH634NGKAQR32XMOCSUF6LZB3RWA,AEIVSZGOPMZLJCLU5F6NNB7AXZLA,AGSG3TQTQT32FRNXOONXQ4YWXM3A,AG5B4QNGCUV5VYRNLLOPULVJ5N7Q,AEPZI55CSYXEU74X4FXNAOIP4COA,AEP2DVN55BAR3JCNCHH4VDNORE7Q", "user_name": "sudesh h.,Debabrata p.,Zeba basheer,Pk,Sunil,Saurabh Jha,ZAFAR AHMAD FAROOQUI,Mb", "review_id": "R17R471IR13JMO,R13T7I5DKQIXSA,R9YYIK65OU16I,R1FB9GYR8LJQBN,R2W5WP4N12ADZW,R12UGEM1FH0OC6,R171KJ25LHOUKY,R22VVPUG7BPY0Z", "review_title": "बढिया है।वजन कम होने की वजह से जादा देर तक चला सकते है।,Nice product and easy to use,Heating issues,Bakwas,Nice,Good product,Good product,Good product", "review_content": "हम संतुष्ट है हम जादा से जादा श्रीखंड बनाने काम आता है कभी कभी केक, आईस्क्रीम बनाते है।,Nice product and easy to use 👍,Sometimes gets heated when used for longer,Bakwas,Like this product,Good product , value for money,Good product on this price,Good Product", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41F-EWC+v+L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/TOPLINE-Egg-Beater-Stainless-Attachments/dp/B08RDWBYCQ/ref=sr_1_429?qid=1672923613&s=kitchen&sr=1-429"}
{"product_id": "B09FHHTL8L", "product_name": "Empty Mist Trigger Plastic Spray Bottle for Multi use 200ml Pack of 2", "category": "Home&Kitchen|HomeStorage&Organization|LaundryOrganization|IroningAccessories|SprayBottles", "discounted_price": "₹85", "actual_price": "₹199", "discount_percentage": "57%", "rating": "4.1", "rating_count": "212", "about_product": "Easy To Press Spray Pump Delivers Ultra-Fine Mist Spray. Transparent empty Bottle. lock On Top Prevents The Spray Pump From Spraying Liquids Accidentally.|Made From BPA-Free, Food-Safe Plastic. Odorless and Keeps the Liquids Fresh for Long.|Transfer Toners, Rose Waters, Perfumes, Oils, Hand Sanitizers, etc. in this Cute Spray Bottle and Keep it in Your Purse or Travel Bag.", "user_id": "AGV2QERVROHQ3E44IHQIUKCEEO3Q,AE7GOXE6DZEYGOHGHKUAODAOWECQ,AHNY4SVAISG2VQGF2Q4ADDFZIU3A,AHGCRVLMGOBN45HUKZJJX5WK2TMA,AGDLVWA7M4G3IWDMTUODZ2BQEBOQ,AGZNR56VGSBVUSPZ7ACSMX3FFFPA,AHDRIG7FTS342HRYFJSA2PVXEOTA,AF64JDHZPT4WFDN6FBVNFGIAQXQQ", "user_name": "Aadhityaa,Arif H.,Rajesh,priyanka chauhan,Sudhendu,Dr. Ngemu,Saranya,Customer", "review_id": "RI4YLH4V4IERV,R2THKSNJBC1AYW,R17K7CV4XKY9NU,RZHKJKK72JDBZ,R3GR6V9CYLXCTA,R2GO7U6SPLE8AJ,R2DJXMAU9UMPGI,R2FIRLO44T48YT", "review_title": "Not satisfied,Nice,Low quality,Amazing product,Best in its category,Very good sprayer,Good,Not sturdy", "review_content": "Only one pump works and the other one stopped working. Waste of money!,Good 👍,Not value for money, material is very weak. For same cost you will get 4 bottles in the local stores,Product is good, worth for money and easy to use,Does not give a fine mist but a stream of small droplets. I believe it's good if you want something in this range,Good quality. Fine mist spray.,Good, little pricey...,The spray function is good, but bottles are not quality product. Very thin will break very quickly", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41Qu+vkjbcL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Empty-Trigger-Plastic-Spray-Bottle/dp/B09FHHTL8L/ref=sr_1_430_mod_primary_new?qid=1672923613&s=kitchen&sbo=RZvfv%2F%2FHxDF%2BO5021pAnSA%3D%3D&sr=1-430"}
{"product_id": "B0BHNHMR3H", "product_name": "LONAXA Mini Travel Rechargeable Fruit Juicer - USB Electric Fruit & Vegetable Juice Blender/Grinder for Home and Office Use (Multicolor)…", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|JuicerMixerGrinders", "discounted_price": "₹499", "actual_price": "₹1,299", "discount_percentage": "62%", "rating": "3.9", "rating_count": "65", "about_product": "The USB personal portable blender is equipped with a built-in 2000mAh rechargeable battery, which is universally compatible with all USB ports, including mobile power supplies, computers, laptops, and other USB devices. The capacity is 380 ml. It is suitable for indoor and outdoor activities, exercise, travel, work, and carry it with you!", "user_id": "AHJX6GE7IGMLFM75SMKATV5ZRZ2A,AGTYFIQ3EIVLCEU4GJXBMWRBWDTQ,AHOP3ZSYI4ZWF4GAU6Y7U33ZLTFQ,AGAMVFFHI7EL23RQYBA4JTXR6GLA,AHCBSXZTXE7A6XUG2V4664YZHESQ,AGEXNA5HHXTVUSHJNWFCDPCJOOYA,AGOARXYHOENO6YEI7N64HK5CDQCQ,AGKFFX6PBTWUNBMN53YLUH45U6VQ", "user_name": "Bindu,Rajat Biswas,Mulleti o.,KAUSHAL kumar,Chithra Suresh,Rathlavath Vani,Khamarunneesa,Ahmadullah", "review_id": "R1C2TSG7V4E6OO,R1EMLFPYSZQRV0,R2013OLVZQH22B,R2EG8VXH3ETPXA,R3ETNI6781FL2R,R2IN91D1WT43AK,R38K3MLJGM9L27,R2LI9FD8CQQOMA", "review_title": "Nice product as expected...,Very good quality 😊 love it,Its leaking product as small gap,Product is so amazing,The colour was dull.,Pretty good.,User friendly,I buy a product but in using of twice the product is not working iam totally unsatisfied of this", "review_content": "Easy to make milkshakes and diet smoothies..Useful.,Very good quality 😌,,This product is very helpfull amd backup is good,The mixer was split throughout the blender.,Easy to clean, portable, easy to carry and easy to use or traveling..,Good for travelling,", "img_link": "https://m.media-amazon.com/images/I/51V0CstI47L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/LONAXA-Travel-Rechargeable-Fruit-Juicer/dp/B0BHNHMR3H/ref=sr_1_431?qid=1672923613&s=kitchen&sr=1-431"}
{"product_id": "B07D8VBYB4", "product_name": "SUJATA Powermatic Plus, Juicer Mixer Grinder, 900 Watts, 2 Jars (White)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|JuicerMixerGrinders", "discounted_price": "₹5,865", "actual_price": "₹7,776", "discount_percentage": "25%", "rating": "4.4", "rating_count": "2,737", "about_product": "Warranty: 1 year warranty provided by the manufacturer from date of purchase|Includes: 1 unit Motor, 1 Jucier attachment, 1 Blender jar, 1 Grinder jar|Most powerful 9 watts motor with double ball bearings for efficiency, low maintenance and trouble free running for years|Juicer with unique honeycomb filter mesh for finer juice with higher yield|22 rpm operation- retains flavor and aroma of juices and food|9 mins. continuous running- suitable for longer usage|Totally shock-proof and safe|Item shape: Square", "user_id": "AFGVIUCA3RTCKMTDTO3XGNTHYFWQ,AE3AF67Y5YK6UG7I6HIVMWU4NWVA,AHPYT77JL5UZQ6QHBEZMYGK6WPRA,AFSXOLLBT7WLD5M6GMY4BKJP3RHQ,AHORF7KU5KCVPIXFW5LRQKGTKVFQ,AEKXXDCFC7X7LKTIFHISM4LZGYXA,AEEWUDXSGNJ3CNRK3PKT5NPCLNJQ,AHGOIGUEHWNGMJV3KAMYFP2CBJPQ", "user_name": "Rajeev Lochan Brahman,ALOK,GAURI SHANKER SHARMA,Mukesh,DEEPAK KUMAR PATEL,Ashish,JOHN,Deepak sarathy", "review_id": "R1B2ONGGAFTI9D,R1R2O42N4O1S1A,R13I84OJ7E8OJA,RA9R916JUUZ4K,R16HBPHELGF3G,R3C70FWNMP46X2,R2UM0LYKW0KF6N,R1N337GWNU3IOM", "review_title": "Good,Power and performance,Very useful and powerful juicer,Best quality,WORLD CLASS JUCER MIXER GRINDER,Industrial grade,A better product,Good Juicer", "review_content": "Good,Don't wait to juice your fruits from Sujata. This variant is powerful and effortless. Just that it is delicate to calibrate the juicer to the motor,Sumit juicer mixer grinder is a very powerful and useful machine for my daily use.,Best quality,I LIKED SO MUCH,Actually very tough machine. Made life much easier.Cleaning the juicer sieve is little tough but then that's true with all machines.,A good purchase for entire home purpose. But juicer assembly is not much easy I thought.,The juicer is good for every day use.Only thing, the noise of the juicer is too high...", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41pb+fODkVL._SX300_SY300_.jpg", "product_link": "https://www.amazon.in/Powermatic-Plus-CH-900-Watt-Grinder/dp/B07D8VBYB4/ref=sr_1_432?qid=1672923613&s=kitchen&sr=1-432"}
{"product_id": "B0B3TBY2YX", "product_name": "AGARO Royal Double Layered Kettle, 1.5 Litres, Double Layered Cool Touch , Dry Boiling Protection, Black", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Kettles&HotWaterDispensers|ElectricKettles", "discounted_price": "₹1,260", "actual_price": "₹2,299", "discount_percentage": "45%", "rating": "4.3", "rating_count": "55", "about_product": "1.5 L Capacity|Double Layered Food Grade 304 Stainless Steel Body inside and plastic outside with Cool Touch Handle|Advanced thermostat with Boil-Dry Protection & Auto Shut Off|Big Mouth Design for Easy Cleaning|1.2 meters power cord, 1500 Watts, 220V-240 V AC, 50 Hz|2 Years Warranty", "user_id": "AFBU5FXWPA2YVMWWIMGYMA2AG34A,AGS4PLUFYAXTS4Y7Y4Q6ZT37BYHA,AECLI5ARPX2YOZANEVKSRVV36QJA,AGTOUKATNU32FIJPOWKQKZKPPJ7Q,AFM5HEUWEZMBGCZ3GGAXKAUZASGQ,AHSZV233OGYLM4RVHF7F6YJZM5NQ,AHYBTPEMPO3DK4PDH62ZYMP3LG7Q,AHUECKMZOFXYUTC6M3LUATLL6X7Q", "user_name": "rhymerium,Samarjeet kaur,Amazon Customer,K Koshy.,Shraddha Sarwade,messssi,Vijay Ravindranath Sen,Amazon Customer", "review_id": "R2HY811H3E3G6S,R1CCZJGV16UVNI,R3FO0KZP6V25Z0,R1DPAVSP4Y3AGN,RK6FONHRBSSFI,RH6J3MDX33HMA,RPGDFO3VRQZ0S,R3RMJEG2M36L3R", "review_title": "Beautiful and functional, but could be improved (improvements written in review),Agaro kettle,Satisfied with the product,A royal black beauty.,Value for money.,Agaro kettle review,Review,Good looking  elegant, easy to use", "review_content": "🔸Everything is nice,including design & function,works as intended and mostly as description.🔹But here are things that couldimproved.🔹the upper lid should be able to open up a bit more to the back if we want to wash it more thoroughly since having lid not open in a way that it goes  a bit back enough for the lid to not feel a bit in the way its not as comfortable as it could be (this shouldnt become a point which should make ppl avoid buying it though since many other models seem to open up till the same angle as this one does unless you found one that opens up more than this one, if you already bought it or still want to buy it you can use a big bottle brush to scrub it even tho your hand can go in but you ll feel like you have to be more careful while Washing to not accidentally hit the lid (you can see from my image/product image)🔹rest of the body seems sturdy but the handle feels a bit lighter than the body so it makes me wonder if handle would fall off due to daily strain when i pick up the kettle by handle alone (may be it wont break/come off but i hold the kettle with both hands on both ends just in case to be safe) : these are two things i d like to be improved if agaro makes any changes in the model features in future.I didnt return it though because chances are other models are the same or similar and apart from all that it works well.. So yeah.,Very good kettle and big in size,Cord length is good,It is very robust in temperature control. That is to say on and off manual and automatic off. Regarding cord, it is 1500 watts kettle which is on the top of ordinary Indian domestic non power 6A plug. They have given one meter quality wire  with 6A plug.  This means if your home wiring can stand 1500 watts on ordinary non power plug you can use it in any socket anywhere. (The switch in the kettle is bit wobbly, not sure whether it is purposely designed so: initially I was not pleased, now love it because of majestic performance),Product looks good. Value for money.,seems good until now... hope will last long... good purchase 👌,Kettle is nice 👍 and cord length is also good but package 📦 is not good,at the time of delivery it was opened,", "img_link": "https://m.media-amazon.com/images/I/310R9iLp3mL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AGARO-Double-Layered-Boiling-Protection/dp/B0B3TBY2YX/ref=sr_1_433_mod_primary_new?qid=1672923613&s=kitchen&sbo=RZvfv%2F%2FHxDF%2BO5021pAnSA%3D%3D&sr=1-433"}
{"product_id": "B088WCFPQF", "product_name": "Cafe JEI French Press Coffee and Tea Maker 600ml with 4 Level Filtration System, Heat Resistant Borosilicate Glass (Black, 600ml)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Coffee,Tea&Espresso|CoffeePresses", "discounted_price": "₹1,099", "actual_price": "₹1,500", "discount_percentage": "27%", "rating": "4.5", "rating_count": "1,065", "about_product": "4 LEVEL FILTRATION SYSTEM - We use double stainless steel screen filters on a plunger supported by a spring loaded base plate to seal the edges, followed by a final top lid strainer to give you a pure brew with no grounds unlike other cheap presses. Perfect to make fresh coffee, tea, espresso, cold brew or even latte. Use the French press coffee machine to froth milk, the double screen filters make perfect milk froth for your latte.|ONLY THE FINEST QUALITY MATERIALS - Every single metal piece is high-grade stainless steel giving the french press a resilient shine protecting it from rust. The large carafe is made of thick borosilicate glass that can withstand boiling water! The handle is sturdy and is made of high-grade heat-resistant material, making it easy to hold. All individual materials surpass food/drink grade quality—BPA-free plastic lid strainer.|MAXIMUM FLAVOUR - Pressed Coffee extracts the perfect amount of essentials oils and acids from the Coffee bean for maximum flavor; the preferred method for brewing for Coffee enthusiasts everywhere.|PERFECT GIFT FOR COFFEE AND TEA LOVERS - Our french press coffee plunger makes an ideal gift for coffee and tea lovers. Give those coffee and tea lovers a gift that they will remember forever.|INCLUDED - 2 Bonus Stainless Steel Screen filters & 0.20 oz coffee measuring spoon, and a Cleaning tool in the package.|Pinnacle Of Richness Of Nutrients & Taste Pressed coffee extracts the perfect amount of essential oils and acids from the coffee bean for maximum flavor while allowing you to savor the deep-roasted flavor, full-body, and subtle notes of your favorite beans from your very first cup.", "user_id": "AFRB32NPLQW24ZGJTXRYK6OUI2HA,AG2PGVWTVLRVZRJCJH3YOWP5FNQA,AGWINPX6IU25IAPSX2FK5NO44NBA,AEORIJHEIQAZQL6IQ2R4IMSB457A,AHLGTVWW4EB3Z3HM6JEPVMFXUB5Q,AH57EC5U62WSRLNIPBXDLBCJQ65Q,AFWSPLLT7BYEGPY2VJGQEMRIW3BA,AFMJDR7VSOX3M5WH2WTORPQ37V4Q", "user_name": "Deepak,Garuda,Shikha,Rajesh Manoharan,Gaurav,Chaitanya Konher,Seetha Lakshmi Rajeev,Haard Dave", "review_id": "R3EFB0EG66OLOX,RIND9MF93GBO0,R38ISD2RSB4M70,R3BS8IFOXK1DNW,R30SI7ZT69PI47,R3FQSJP7H5PAIP,R2ZPNHBNB2GKBC,R25DZIBJHUFV07", "review_title": "Absolutely loving it!,Excellent product,Very nice,Compact way to make coffee,Good one for a Black coffee lover,Excellent purchase,Great Product!,Perfect French Press! I have got two of em!", "review_content": "I gifted it to my mother last month; it was like love at first sip! easy to use, easy to clean, easy to flex, a blessing for any Indian adult! Still new to french press coffee, so I used South Indian filter coffee for the past few weeks and could instantly feel the difference between a cup of freshly pressed coffee and one of instant coffee, although I have been advised to try grinding my own beans for optimum enjoyment. I seep my grounds for around 3-4 minutes after heating the press for around a minute or so with hot water and am amazed at how heat-resistant the glass is, I would however still advise taking precautions. The markings inside also provide a great measurement of how many cups I would end up making. Not only have i used it for making coffee, but also to froth milk and to make tea. Attaching photos of a coffee i made using this french press with a layer of frothed milk. Ngl, one of the favorite purchases my family made, am thoroughly pleased and highly recommend it to anyone.,Time saving coffee/filter.,Been using this for many months now and it's great. Love that it has line measurements. Only thing is I wish the top surface had an arrow-type bump on the plastic to point where the holes are you so you don't have to look down but you can just tell by touch.,Delivery: Amazon delivery is always reliable and it didn’t fail me this time too..Packaging: Both outer packing and the product packaging were intact. Product packing had the right information and was very usefulProduct: Very compact. We used several coffee makers in the market, but all required electricity to run. We wanted to have a non electric one which we can easily carry for outdoor and this one fits aptly to our requirements. Just add the coffee powder and hot water. After a while when we press the central pipe, coffee comes out. The nozzle makes it convenient to pour it a cup.For this price in great India sale, I think it’s worth. I am inclined to give 5 star, but reserving 1 star now. Will use it for a month and come back here to change my rating if it still satisfies me.,Good one for a Black coffee lover,Very very happy with Cafe JEI's French Press. It has become an important part of my daily ritual now in past 10 days. Easy to use and maintain and would recommend buying without hesitation.,Instruction manual could have been a hard copy..too much steps to get the ebook,Got this French Press last year and another one few days back! One for Coffee & another for Green / Black Tea.Totally value for money. The built is solid and filtration is on point!Super happy!!", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31YEW0-SNcL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Cafe-JEI-Filtration-Resistant-Borosilicate/dp/B088WCFPQF/ref=sr_1_436?qid=1672923613&s=kitchen&sr=1-436"}