{"product_id": "B07Q7561HD", "product_name": "Eveready 1015 Carbon Zinc AA Battery - 10 Pieces", "category": "Electronics|GeneralPurposeBatteries&BatteryChargers|DisposableBatteries", "discounted_price": "₹149", "actual_price": "₹180", "discount_percentage": "17%", "rating": "4.4", "rating_count": "644", "about_product": "Eveready’s Zinc Carbon Battery are considered one of the best battery for remote controls, clocks, small toys, torches, etc.|Highly durable & reliable technology|Available in wide range of sizes - AAA, AA, D, C and 9V sizes", "user_id": "AH5QYAVG2DRXF32LUKZIPG7KZLDQ,AEHIU6L7VK72RINFPDTI7XSIMD7A,AF6SWZOHDVA3F74K6ATT4UMM7LAQ,AFFHIOWLVWJ4A22EGJX4ME7KQLSQ,AEM4NOAI65UBAADJVTQH7AQUAMRA,AFGXHN54PS4545UIGIHTMWU7OI6Q,AEV5KJYTEDJCSN5KFGKY4DHGZOPQ,AE47RN5UXX2ON7VIYMVW6NBT7PJA", "user_name": "Manish,Tanveer Sayed,Sadhan kumar,Prateek jain,Arun Teja Ganji,Selvaram,Bharat Bhat,Kc m.", "review_id": "R25BZYL3L6NDM3,R390YP32C9VB5V,REO2V9YOS1V6L,R11V9HX6ULC67,R2EY9BADLVG0NC,RTC6ZQC3MKS61,R3W19RHKGXE1OV,R2G6M5QQR22IYA", "review_title": "Value for Money,As usual,Good,Best deal,Very reasonable,Great n cheap,Awesome,Not for camera", "review_content": "Use Remote Car... Wall Watches... and Other...,Batteries are as usual nice,Good,Mrp 180Got it for 112/-Best deal,Good,Got it on high discounts n works really well compared to other batteries.,Value for money,Dislike", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51MA5PwP6xL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Eveready-1015-Carbon-Zinc-Battery/dp/B07Q7561HD/ref=sr_1_70?qid=1672902997&s=computers&sr=1-70"}
{"product_id": "B0819HZPXL", "product_name": "Zebronics Zeb-Transformer-M Optical USB Gaming Mouse with LED Effect(Black)", "category": "Computers&Accessories|Accessories&Peripherals|PCGamingPeripherals|GamingMice", "discounted_price": "₹399", "actual_price": "₹549", "discount_percentage": "27%", "rating": "4.4", "rating_count": "18,139", "about_product": "Gaming mouse: ZEB-Transformer-M premium gaming mouse is designed for gamers who want the perfect fusion of high DPI, precision gaming along with LED lights.|Breathing LED- Your gaming is going to get LIT as the gaming mouse comes with 7 colors breathing LED that will charm the gamer in you.|Ergonomic design:The ZEB-Transformer-M gaming mouse comes in an ergonomic design that provides comfort for long hours.|Works on most surfaces: The mouse is designed to work on all surfaces and comes with a plug and play installation where no additional softwares is required.|High Precision: The gaming mouse comes with six buttons with a high precision DPI gaming sensor with 3200 DPI.|Dedicated DPI Switch: The gaming mouse has a dedicated DPI switch that can toggle between 1000/1600/ 2400/ 3200 DPI.|Dedicated forward & backward buttons: The gaming mouse comes with dedicated forward and backward buttons making it convenient for gamers to toggle.", "user_id": "AE6QIRYYQXWBXRANCBNV7UQU3C3Q,AFR73WEZI4S76UC6WTRTOM27ENZQ,AFCBKJAWH4J2UWEUQEGSVYNFT2YA,AFDKMC6DZFM4M7BKRFA4APKCYZHQ,AECLFSQIEBC26S2ZU7FRYDI66W2A,AFTZLBOMSZSCBJ7CK5VXRSA6FGMQ,AH3HKWLRRJWVLWWNSNRI67WU77ZQ,AHMPP4TKEPMV7DE5QB5NSFTTXUPQ", "user_name": "Dhiraj Bansal,Shaikh Mahammad Ali,SHREYASH PATIL,Customer,Gagan BV,Unboxing video by Abananeez,Anshuman,Uday", "review_id": "R3IPDT2UXX2O63,R2U6GKRX21HLG9,R2AK0419W9GNNL,RBFTHSBIUQTM1,R2SNW6BCRZK0AW,R3HVYAAF9REYEZ,R17Z4RNBHFK18Q,R20B3Q5JIZ96QC", "review_title": "Nad performance and no customer support. This model is not registered on zeb official web site,Good,Nice ✅,very good product in this price range. Look is beautiful, it's like a small pet.,A Good mouse to have while Playing Doom Eternal.,Over all good mouse for this price,Good,A good mouse", "review_content": "Very bad performance even for normal work. Even this model is not mentioned under their official website.Tried many times to contact customer care no response.,Good product but Pekeging not good,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/4170T3S5xWL._SY88.jpg,I am not reviewing this as per gaming experience but per daily heavy use.I find it very helpful for me who use mouse whole day with a lot of left and right clicks, drag and drops, scrolls and scroll clicks. I didn't find any glitches so far. Works perfectly for me.About looks, It looks beautiful almost like a small pet who can change colour. But it can be a little disturbing if you are using it in dark. otherwise the best thing is, it doesn't need any installation headaches.Only reason I deducted one star is because this mouse is a little oversized for my hand. So, people with little hands will struggle at first but eventually, with time and use, you will feel like it shrank.I like zebronics because I trust their products.If you are thinking of buying it, go for it.👍,A good mouse. Not the best but good enough.,Good,Its good but idk if its only with me but the mouse sometimes becomes unresponsive. Not for long tho just 2 3 seconds. Overall would recommend.,Good mouse little heavyweight", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41I-azRJBLL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zebronics-Zeb-Transformer-M-Optical-Gaming-Effect/dp/B0819HZPXL/ref=sr_1_71?qid=1672902997&s=computers&sr=1-71"}
{"product_id": "B00LXTFMRS", "product_name": "PIDILITE Fevicryl Acrylic Colours Sunflower Kit (10 Colors x 15 ml) DIY Paint, Rich Pigment, Non-Craking Paint for Canvas, Wood, Leather, Earthenware, Metal, Diwali Gifts for Diwali", "category": "Home&Kitchen|CraftMaterials|PaintingMaterials|Paints", "discounted_price": "₹191", "actual_price": "₹225", "discount_percentage": "15%", "rating": "4.4", "rating_count": "7,203", "about_product": "Vibrant Colours - Make paintings pop out using the 10 vibrant shades. The Sunflower Acrylic Kit has acrylic colours for creating art and tones that bring out the artistic mood. It lets artists give depth and dimension to their creations|Multisurface Use - The Fevicryl Acrylic Sunflower Kit comprises of vibrant painting colours and refined shades that work across a wide variety of mediums. Apply these paints to various surfaces like wood, canvas, leather, terracotta and even fabrics.|Non-Toxic and Safe -The colouring kit is safe for use by young artists. The paints are made using non-toxic substances and pose no health risk. The cleanup is also very easy after you're done creating art projects.|Very Beginner-Friendly - No need to be an expert artist to use this. Grab a piece of cloth or paper, set up your colouring palette and get ready to have a fun time.", "user_id": "AGARJN3VAP4E6PQYIF74CDF3W6GA,AEC4ZK2E7SL6RXURSFAQILIAIYHQ,AHP75752OD4FMWOWITYVDF4EJ57Q,AEGZNHJ5ZCSPMTVBUTJZPDEJEGRA,AF2OFWJDSCJNZ4QFIX7VUUCHPURA,AEYL5JRPDTHDBIPN3ZSYS3ZLEK2Q,AECSR4RFQGV6P2PCOA7XPNGGBZQQ,AH7EAYMQGZAZ24G65FHVBLVAJL7Q", "user_name": "Safiya,Archana,S. Yates,Shwetha Shenoy,Sayma Sheikh,Prathiba,Shweta R.,Lisa", "review_id": "R3FQZ41R2YXT87,R2G63AMNXO48U6,RD1855R8RRSKW,R22BXITISJ2V98,R1ZGPABQCCVHXY,R216MY341QMRQE,R1OKN1Z9UGIGNG,R1E6XVW96KXGKP", "review_title": "It's worth it,Very very nice product at this price.,Very good product,Good,Affordable,shouldnt keep it open for more than 15 minutes,Nice 👍 product...,Good quality", "review_content": "Its worth it,At this price the product is very nice. And easy to use for beginners also. Kids love and enjoy while working these wonderful acrylic colors,I ordered these to use for painting wooden ornaments with my 11-year old niece and her friend. I was pleasantly surprised because the price was good for what I received. These are glass jars and full to the top :). We were able to pour out little drops onto paper plate “palettes” and there is a lot of paint left.  The paint mixed well to make custom colors. This paint would also work well for lots of craft projects including painting art pictures on paper, on rocks, or t-shirts too.,Good product,It's quality is very high and very good for kids,also it's really cheap ☺️,I Used it on a canvas, i liked how the colors are vibrant and unique,Love 💓 the colours... Easy to use and are waterproof,The quality is good. Good deal at this price", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/4136eo-yWlL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Fevicryl-Acrylic-colors-Sunflower-Shades/dp/B00LXTFMRS/ref=sr_1_72?qid=1672902997&s=computers&sr=1-72"}
{"product_id": "B0B9LDCX89", "product_name": "STRIFF Mpad Mouse Mat 230X190X3mm Gaming Mouse Pad, Non-Slip Rubber Base, Waterproof Surface, Premium-Textured, Compatible with Laser and Optical Mice(Universe Black)", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Keyboard&MiceAccessories|MousePads", "discounted_price": "₹129", "actual_price": "₹999", "discount_percentage": "87%", "rating": "4.2", "rating_count": "491", "about_product": "9.4 Inches X 7.9 Inches) 240mm x 200mm x 2mm Size: This mouse pad is ideal for Gamers, Graphic Designers, Students, or anyone using mouse for long sessions. This helps to improve the gaming experience for gamers or the work efficiency in the office.", "user_id": "AGASWLGAJEYSNHPWSR74GSDXU5JQ,AGFT22PQSW5ZDJLFLBQLNNFO6I6A,AFBRDCFTMGH6OFKCC7GQQKXBCXKQ,AGQE66MG2AEU3OO5WWLBODZ3DRCQ,AEKU5BEAVUA6QMUPL34NLEFTPXSA,AFWH2VR4TUJFCVLGMLDKY6QHFPSA,AHLVULA55BHT25TPEJKZCCTPM7CA,AGIRX4TLOCUGC4XPUAFPCQ5TLLKA", "user_name": "muhamad s.,Aruna V,Ankush Jindal,SJ,Ronak,Devesh Bhargava,lokesh kashyap,Suraj Rajpoot", "review_id": "R3ET8JTEIDTNU0,R1FAH4M3BSL55F,R3I8GGSZJCEUGV,R2GKER5LJ744AO,R3OF9WES5OOK6,R2QSNY4PHB2LDU,R24EFZ4RGA54HI,R2XNIDW8U1KWC1", "review_title": "Decent quality,Good for the price,Value buy,It's good value,Ok ok quality,It have enough thickness. Good quality,Easy and smooth,Fine", "review_content": "Mousepad is sturdy enough doesn't move around a lot. The print is a bit rough. Expect this much smoothness at this price point. Overall decent product Will get your job done,In hand texture is good. May not be good for gaming as it feels little brisk after using it directly on table not sure it will be like that itself or it's my experience.,Corners should be stitched, but overall its the best quality in this price. Value buy,I like it,,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71dj1uPfkmL._SY88.jpg,Its smooth and cool and the bottom is made up of rubber which prevents it from moving while the mouse moves. Its great value for money. Easy and smooth,I want to return my order", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41FMV7m5bZL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/STRIFF-230X190X3mm-Waterproof-Premium-Textured-Compatible/dp/B0B9LDCX89/ref=sr_1_73?qid=1672902998&s=computers&sr=1-73"}
{"product_id": "B0765B3TH7", "product_name": "Gizga Essentials Hard Drive Case Shell, 6.35cm/2.5-inch, Portable Storage Organizer Bag for Earphone USB Cable Power Bank Mobile Charger Digital Gadget Hard Disk, Water Resistance Material, Black", "category": "Computers&Accessories|Accessories&Peripherals|HardDiskBags", "discounted_price": "₹199", "actual_price": "₹599", "discount_percentage": "67%", "rating": "4.5", "rating_count": "13,568", "about_product": "Compatible: Wd, Seagate, Sony, Transcend, ADATA, Hitachi, Toshiba, Dell, Lenovo, HP and other 2.5 inch hard drive disk. Water Proof:Yes|An elastic band to securely fasten the had and separate mesh pocket for usb cables and flash drives|Material which protects your portable hard drive disk from shock, scratches, dirt, bump and drop test upto 11 feet|Can be used without pulling it out from pouch|Slim line case protects your device on its own or in your favourite bag|Country of Origin: China", "user_id": "AE3GJ4N2G2K4Q6JXYPIQSH4344CQ,AFJMCZWWZZF4HZYT5QLSXG4AKOTQ,AGGORGEJT3XXWXUJNZJNW2L6UZAQ,AENODPH3RWTEZMADDI7ZXXD5UBLQ,AEJQ7NWZITDPI44AMIPQPK7DQLCQ,AGJRVDXBXRIIRR3G7HCF5CR6XDSA,AGU4IMQTKDZTL6IFTDNG3D5CQO6A,AGKXGJ5QRZFNVZ3MKY7PHAOMT5LA", "user_name": "Dhirendar,Chris Fernandes,DHRITIMAN ROY,Atesham,biswaboka,Amazon Customer,Amazon Customer,Amazon Customer", "review_id": "RZZWEYTD4NC3T,R1MMO2YNT4C36L,R10NGDU2C04L0B,RXIDPVAI088YL,R22KTF9KDGLEK5,R12PC58VMY3MZY,R2HYUYSA0VS4ZY,RIWQ3QB0V2RCQ", "review_title": "Good.No Problem,Good Product,value for money purchase,Nice product,good product,Good,Ok ok product.,Go for it", "review_content": "Case is hard and spacious.hard disc and  other pandrive, cables etc you can put easily .it is good to safety and storage.,Fit product for palm size hard drives,value for money purchase,Quality  is good . Looking is nice .light in weight,good product in this price segment,Best for this price,Ok ok product but with comparison to price good product.I recommend you to buy.,It is amazing that we are not manufacturing such a thing in india.", "img_link": "https://m.media-amazon.com/images/I/31KpmfiYmeL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/GIZGA-inch-Hard-Drive-Black/dp/B0765B3TH7/ref=sr_1_74?qid=1672902998&s=computers&sr=1-74"}
{"product_id": "B0B1F6GQPS", "product_name": "Boult Audio FXCharge with ENC, 32H Playtime, 5min=7H Type C Fast Charging, Zen ENC, 14.2 mm BoomX Rich Bass, IPX5, Bluetooth Wireless in Ear Earphones Neckband with mic (Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹999", "actual_price": "₹4,499", "discount_percentage": "78%", "rating": "3.8", "rating_count": "3,390", "about_product": "Environmental Noise Cancellation: Equipped with Dual Mics, experience a crystal clear calling experience, as ambient noises get filtered out.|Long Battery Life & Fast Charging: 32 hour Playback time & 5 Mins charge = 7 Hours Playback.|Soft Silicon Band with In-line controls: The light yet sturdy neck band provides supreme comfort for all-day use.|IPX5 Water Resistant: Use without any worries whether you are outdoors or at the gym.|Fast Pairing: Designed with latest Bluetooth 5.2 technology, the neckband pairs super-fast with your devices and transmits higher quality audio.", "user_id": "AGCWHOWHOTWSN4J2TFAXUEZZUBXQ,AF7COMJXY3YJUCEUEC67ZFJ5H4XQ,AGLEJTZLEMONKAC3DV6ZVJKNFQQA,AGXSNJ34NKC5WUWNLAPAUMTDOI2A,AFVHJSKGY45HGBLZAUIWDMNEXFPQ,AEH5PKQJMHETBOTMVZZU77XAOPHQ,AFPFHOITRATHZVILCGAOACZDXBGQ,AGJVNXCQNOHPS72LI4265DJ6TQQA", "user_name": "V.W.,Nitin desai,Amazon Customer,Kaushallya Devi,ANIKET HAGAWANE,Monu,Vaibhav Pathak,abhishek paderiya", "review_id": "R2888CE3TDHQMW,R5OOQZ5ILIG7E,R3CCDJLE61ON18,R1YKND3U30I2MF,R25NCFO26L4LDR,R25Y3SKCCN76RT,R1IVPB2D1II1QZ,R2VTSB2I55FIV8", "review_title": "Noise cancellation is just a hype,Okay,Sound,good quality of sound and battery backup is also good.,Ok,Good product on this prize range,Boult Audio,Ok", "review_content": "Good :Sound quality - surprising at this price, in built acoustic/3d sound (nice), bass is not overpowering (good on ears), instrumental details, dialogues and background music/chatter is also clearNot harsh at all (thumbs up)Looks are okay, battery backup good do farBad :Noise cancellation is just a hype, used for in-house calls - couldn’t block outside car noise/horns, even light switch on-off noise, kitchen noises-cooking/dish cleaning were audible on the other endMild ear pain after using for couple of hoursBluetooth connection range is very low, it starts to drop the audio beyond 10 feetMissing :No battery status notification, no auto offOverall :Good for movies, series, music but not for office meetings/phone calls,Everything is good but build quality is okay okay.,Only thing I liked is good battery and bass,Soundquality aand base quality is good.,Good quality voice,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71KU7iGuaiL._SY88.jpg,Good bass, ok tremble,Very good", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31bX1-ypLSL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Boult-Audio-Environmental-Cancellation-Bluetooth/dp/B0B1F6GQPS/ref=sr_1_75?qid=1672902998&s=computers&sr=1-75"}
{"product_id": "B07LG59NPV", "product_name": "Boult Audio Probass Curve Bluetooth Wireless in Ear Earphones with Mic with Ipx5 Water Resistant, 12H Battery Life & Extra Bass (Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹899", "actual_price": "₹4,499", "discount_percentage": "80%", "rating": "3.8", "rating_count": "1,03,052", "about_product": "Long Battery Life - Curve is a powerhouse,Offers playback time of up to 12-15 hours for every charge. Takes 1-1.5 to get fully charged and it has 1-2 days of standby. 20m Transmission Distance. Wireless range: 10 m|Off-Axis magnetic technology - Oval-shaped earbud with nozzle angled at 60 degree tunnels the sound directly into the ear canal|Durable Flexi-band- The light yet sturdy, neck band can drape comfortably across the neck with supreme comfort and in-line controls.|Noise Isolating Aerospace Grade AL Drivers - Curve comes with Built-in micro-woofers that produce a deep bass, isolating noise in any environment.|IPX5 water resistant- earbuds and charging case inner Nano-coating makes it possible to waterproof for 1 meters deep for 30 minutes.Ideal for sweating it out at the gym. Even Wash the earbuds and base|Designed with latest Bluetooth 5.0, the wireless earbuds own fast and stable transmission without tangling. Improved high quality mic for both earbuds bring a better call performance", "user_id": "AH3XZBFRJ3T2YATYJK2CNTCARCCQ,AF2NVFDYXGX2BT7EPAUN7WYN3TDQ,AEVRTZ6HVKKV5CVX5XBW4QQLY3NA,AH3I5Z4W5KIRTITFSOBDBDSA23SQ,AG2DKHTMNEVMFCTBVNTH6NRRKTMA,AFDJVKMG73WAOX2CNN3VTFIT76UA,AHFPVRVDCUBDIONDU5U2DAT4CVJA,AHVSH7O4J2LW4S3YH4M76PPPVLSA", "user_name": "Mukesh Maurya,Gyan Dixit,SUNIL C,Ddp,Swapnil G.,Adriel Shony Rappai,LOKESH kumar,Vikas Goyal", "review_id": "R25T0UEZY5MCOJ,RGH8GEFOI9GPP,RDZQYOXIANHNQ,R3VWD0BGB1RXGB,R1PZZYC3LAWBDJ,RDBIPNQ4FXGZR,RMSTOC1WCLL3X,RD7IUGN9EM77P", "review_title": "Superb headphone one of the best,!!!Amazing product!!!,Quality is so so good,No battery🔋 backup and no flexible to use,Very good,A good low budget earphone,Obsem product but sound quality is not best,IT IS GOOD PRODUCT", "review_content": "I have just received my BoultCurve. Its really Totally unexpected good quality..Just keep going no two thoughts about purchasing the headphones! only thing I'm waiting is to know it's durability through days to go!. Out of 5, I will give you 5.Packing :The packing is perfect with earphones placed securely.the packing itself looks premium.Box contents :Boult audio earphones,a small USB cable to charge,user manual, warranty card(1year warry) and 2 pairs of extra ear tips(small and large).Buttons :The brick on the right side has the buttons.We get 1 multifunctional button (the middle one)which can be used to power on and power off.you can also attend the calls and end the calls by single pressing them.while playing music you can pause/play by single press.You can adjust the volume by the the 2 buttons which is either side of the multi functional button by single pressing.long press changes the tracks when music is being played.TopDetails Compare Questions ReviewsFrom the manufacturerCURVEIn-ear wirelessCurves where it has toIn-ear wireless12 Hrs Battery Life, 50 Hrs Stand-byOnyx GreyOnyx GreyCrimson RedAzure BlueKEY FEATURESBluetooth 5.0Enjoy lifestreaming and music without interruption.1 Bluetooth 5.02 In-line Control3 Voice Command4 In-built mic5 IPX5 WaterproofTHE PERFECT IN-EAR WIRELESSThis wireless earphone is designed perfectly to give you all-day comfort with a flexible neckband, comfortable silicon earbuds, and impeccable sound is geared to be your everyday companion.ENRICHED AUDIO, LOADED WITH EXTRA BASSNoise IsolationCancel out the background disturbance for crisp experience during calls, with Boult Audio Curve.1 Noise Isolation2 3D acoustics3 High Fidelity Audio4 Extra BassPRODUCT COMPARISONCurveCurve ProBusterCurveCurve ProBuster CompareABOUT BOULT AUDIONeckbandDesigned in the USA,Neckband4+Rating by more Lac customersNeckbandTranscending AestheticsNeckbandTrusted by Millions Customers.Features & detailsLong Battery Life - Curve is a powerhouse,Offers playback time of up to 12-15 hours for every charge. Takes 1-1.5 to get fully charged and it has 1-2 days of standby. 20m Transmission DistanceOff-Axis magnetic technology - Oval-shaped earbud with nozzle angled at 60 degree tunnels the sound directly into the ear canal, also providing noise isolationDurable Flexi-band- The light yet sturdy, neck band can drape comfortably across the neck with supreme comfort and in-line controls.SEE MOREProduct guides and documentsUser Manual [PDF ]Frequently bought together Boult Audio ProBass Curve Bluetooth Neckband, in-Ear Wireless Earphones with 12 Hour Battery Life, Fast Charging & in…  Boult Audio BassBuds X1 in-Ear Wired Earphones with 10mm Extra Bass Driver and HD Sound with mic(Black)  Boult Audio BassBuds Loop in-Ear Wired Earphones with 12mm Powerful Driver for Extra Bass with Customizable Ear Loop…Buy all three:₹ 1,945.00Product Image GalleryProduct Image GalleryBoult Audio ProBass Curve Bluetooth Neckband, in-Ear Wireless Earphones with 12 Hour Battery Life, Fast Charging & in-Built Mic, IPX5 Sweatproof Headphones (Blue)Compare with similar itemsThis item Boult Audio ProBass Curve Blue... Boult Audio ProBass X1-WL in-E... Boult Audio ProBass Buster Wir... OnePlus Bullets Wireless Z Bas...RATING 3.8 out of 5 stars51081 reviews  4.1 out of 5 stars18272 reviews  3.7 out of 5 stars2531 reviews  4.2 out of 5 stars72844 reviewsPRICE ₹ 1,198.00 ₹ 899.00 ₹ 1,199.00 ₹ 1,999.00SHIPPING Fulfilled FREE Delivery Fulfilled FREE Delivery Fulfilled FREE Delivery Fulfilled FREE DeliverySOLD BY Appario Retail Private Ltd Appario Retail Private Ltd Appario Retail Private Ltd Appario Retail Private LtdSee more detailsMore to consider from our brandsThis shopping feature will continue to load items when the Enter key is pressed. In order to navigate out of this carousel please use your heading shortcut key to navigate to the next or previous heading.SponsoredCustomer QuestionsCustomer Questions Have a question? Search for answersHave a question? Search for answersQ: There is any warranty or notA: I have buyed the headphones on July 28 the headphones are not one side is not working is …arunsankineni| 1 year agoQ: Boat rockerz 255 or boult curve ..which one is better ?A: Boat Rockerz 255 if you are going for music/sound. Boult if you are going for battery.Jay Trivedi| 2 years agoQ: dual connectivityA: YaaaManoj kumar yadav| 2 years agoQ: What is the driver size luA: Dnt knwUIC| 5 months agoSee all 1000+ answered questionsYou might also likeSponsoredCustomer reviews3.8 out of 53.8 out of 551,081 global ratingsBy featureBattery life4.24.2Sound quality3.93.9Bluetooth connectivity3.83.8See more  SEE MORERead reviews that mentionsound quality battery life value for money boult audio price range stopped working quality is good bass quality light weight also good neckband bluetooth connectivity boult curve probass curve worth for money audio probass must buy good battery built quality overall a goodSee moreTop reviews from India  William Jackson5.0 out of 5 starsVerified PurchaseThe best !!!Reviewed in India on 4 January 2019Colour: BlackStyle name: CurveActually this product is myntra exclusive.The price in myntra was around 1800(including tax).Packing :The packing is perfect with earphones placed securely.the packing itself looks premium.Box contents :Boult audio earphones,a small USB cable to charge,user manual, warranty card(1year warry) and 2 pairs of extra ear tips(small and large).First impression :The earphones look very good and elegant.feels very light in hands.the neck band is made of some soft kind of plastic which is very comfortable to wear.the ear piece is made of metal and looks good and hard.the ear pieces can be attached together by the magnets.the magnet is good enough to hold them tight.the color of earpiece looks good and gives kinda premium look.Buttons :The brick on the right side has the buttons.We get 1 multifunctional button (the middle one)which can be used to power on and power off.you can also attend the calls and end the calls by single pressing them.while playing music you can pause/play by single press.You can adjust the volume by the the 2 buttons which is either side of the multi functional button by single pressing.long press changes the tracks when music is being played.Connectivity :Pairing your boult with your mobile is very easy...just press and hold the power button on the boult untill you feel the vibration twice.turn on the Bluetooth option on your mobile... search for devices and you'll find 'boult audio' just tap it and you'll be paired.also you can hear an audio that your are being connected.Battery:The company has not specified anything about the capacity of the battery.it states that it has 12 hours of playback.yes,the battery backup is good on this.we can easily get 12hours of play time through this earphones.Additional features :These earphones come with built in vibration.whenever you receive a call the earphones will start vibrating. I have to tell you,the vibration os really strong and can easily be Know even if you are in busy (like traveling in bike,or a busy street)But remember if you're getting calls continuously it'll less the battery backup.Sound quality :Sound quality in these earphones are amazing.The mids are crisp and clear, the vocals are good the bass is also heavy but it's that not punchy.but don't you can adjust the equalizer and have that punchy base.The call quality is also good because of the condenser microphone .These earphones have noise cancellation which works good.the volume level on these earphones are really high.i cannot go beyond 80%,Alright. So I have been using Boult ProBass Curve for over a month and would like to summarize my feedback in bullet-points to make it easy for the prospective buyers. I was thinking to buy a quality Bluetooth headset with a great performance at an affordable price for quite long and this is where my search ended. I was quite fed up of using cheap wired headsets as they used to go out of function or get snapped every now and then. Moreover, I found them getting entangled every other second making it really inconvenient to handle especially while travelling. Its that time I started feeling the need of a wireless headset and began my search. I took good time (months) to look for a good product. And, this is when I decided to purchase this item. Before purchase I devoted time to read the user's reviews (that I always do before making any purchase-small or big) and found myself convinced. Finally, I decided to go for it. Ok. So, no more essay writing :) Let me get straight to the key points:1. I bought this for 999 under Sale so saved INR 499. (it's a good saving. As Warrent Buffet says \"every penny saved is every penny earned\")2. This has great sound quality. I could not compare it against any other product because I don't have any other bluetooth headset with me :) But this will surely not let you down. It is very loud even at 80% volume level. You just cannot listen to at that level; forget about full volume. Bass is great but not outstanding to be honest but it does not disappoint either. Good thing is the sound does not distort even if you raise it to 100%. Excellent sound clarity!3. I am not a technocrat so cannot tell what are the characteristics of noise cancellation feature but you will not get to hear any external sound/noise or very very minimal that is not noticeable. So, this stands perfect at this point.4. Performs excellent while taking a call. You will a get a crystal clear voice when you make/take a call using this device. You will feel as if you are making calls directly from the mobile phone. In fact, it's even better at times when the voice from the other side is low. I really love the hands-free calling because I have to take long calls with the clients in my job.5. Battery backup is excellent!!! It can last anywhere from 10 to 11 hours. I have tested it rigorously in both audio and video usage. And, I mean it. I tested it for almost a month with day-wise log capture. Please see the detailed tracking at the end. It gets full charged in 2 hours approx.6. Bluetooth range is good. It covers a distance of 10 to 15 feet easily. It's quite enough if not good enough. My figures may be wrong. Beware! It's just my rough estimate. Haven't tested is rigorously.7. Design looks good and is very convenient to wear. The wires are adjustable as per need. This is a nice thing. Looks cool when you wear it around your neck. I chose Red color.8. Last but not the least. It comes with 1 year replacement warranty so you can sleep peacefully while enjoying your favorite music :)Judgement: Just go for it if you have a limited budget or don't want to spend a fortune on bluetooth headset. I was hesitant to spend anything beyond 1000 bucks on a bluetooth headset. It was my personal limitation.PS: Battery backup log:16 May 1 hour 15 minutes approx in the evening video play17 May 1 hour 15 minutes approx in the morning song play + WebEx call with Suneel17 May 1 hour 30 minutes approx in the afternoon song play17 May 1 hour approx in the evening video play17 May 1 hour 20 minutes approx at night video play20 May 1 hour 30 minutes approx in the morning song play20 May 1 hour 30 minutes approx in the evening video play21 May 1 hour 30 minutes approx in the morning song play21 May start 22 minutes approx video play in the eveningBattery deadTotal battery time 11 hour 12 minutes*****************************************************22 May 1 hour 35 minutes approx in the morning song play22 May 1 hour approx in the evening video play23 May 1 hour 35 minutes approx in the morning song play23 May 1 hour approx in the evening video play24 May 1 hour 30 minutes approx in the morning song play24 May 1 hour 10 minutes approx in the evening video play26 May 27 minutes approx in the evening video play27 May 1 hour 29 minutes approx in the morning song play27 May 1 hour 27 minutes approx in the evening video playTotal time 11 hr 13 minutes*******************************************************28 May 1 hour 46 minutes approx in the morning song play28 May 1 hour 17 minutes approx in the evening video play29 May 1 hour 57 minutes approx in the morning song play29 May 1 hour in the evening video play30 May 1 hour 48 minutes approx in the morning song play30 May 55 minutes approx in the evening video play31 May 1 hour 24 minutes approx in the morning song play10 hour 07 minutesBattery discharged***************************************************31 May 1 hour 12 minutes approx in the evening video play03 June 1 hour 38 minutes approx song play in the morning03 June 1 hour 17 minutes approx video play in the evening04 June 1 hour 28 minutes approx song play in the morning04 June 1 hour 11 minutes approx video play in the evening05 June 23 minutes approx video play at night06 June 1 hour 47 minutes approx song play in the morning06 June 50 minutes approx video play in the eveningTotal time 9 hour 46 minutesBattery discharged******************************************************07 June 8.34 am start song play 10.06 end 1 hour 32 minutes approx07 June 6.47 pm start video play 7.53 pm end 1 hour 10 minutes approx08 June 11.38am start song play 12.37 59 minutes approx end 2.16pm start song play 4.04 pm 1 hour 48 minutes approx end10 June 8.37 am start song play 10.14 am end 1 hour 37 minutes approx10 June 6.27 pm start video play 7.46pm end 1 hour 19 minutes approx11 June 9.10am start song play 10.51am end 1 hour 41 minutes approx11 June 6.55 pm video play 7.46pm end 51 minutes approxBatter dischargedTotal time 10 hour 57 minutes approx,You have to purchase a headphone I recommend for this one. Under 1000 rupees best one..,No battery🔋 backup and no flexible to use, they don't satisfied with provided features,I am writing this review after used of 30 days the product is really very good, sound quality, durability, battery performance is also very good,Overall its a fair product...Rs. 899...with all the features...Its perfect for daily commute since it has a very good battery life, it will last for 3 to 4 days easily.When it comes to the sound quality, i feel its not delivering as advertised which is obvious. It would be wrong to expect great sound from an overall product. You cant have everything at once. This is my personal opinion, since i am a music enthusiast and have experienced music from great headphones and ear phones.Other than that its worth trying, totally recommend this product if you daily travel for work and you are looking for a budget wireless earphone,Sound quality is not best,I LIKED THIS PRODUCT. ALREADY USING SINCE FEW DAYS. BATTERY BACK IS ALSO VERY GOOD.", "img_link": "https://m.media-amazon.com/images/I/31nI3BzOXwL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Boult-Audio-Curve-Sweatproof-Headphones/dp/B07LG59NPV/ref=sr_1_76?qid=1672902998&s=computers&sr=1-76"}
{"product_id": "B07RD611Z8", "product_name": "Ambrane 20000mAh Power Bank with 20W Fast Charging, Triple Output, Power Delivery, Type C Input, Made in India, Multi-Layer Protection, Li-Polymer + Type C Cable (Stylo-20k, Black)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|PowerBanks", "discounted_price": "₹1,799", "actual_price": "₹2,499", "discount_percentage": "28%", "rating": "4.1", "rating_count": "18,678", "about_product": "Massive 20000mAh Lithium Polymer capacity allows you to charge your devices multiple times. It can charge iPhone 12 – 4.6 times, Samsung M11 – 2.6 times, iPad – 1.4 times|20W Fast charging output– Powerful 20 Watts PD and QC output for exhilarating charging speed, do you a great favour in an emergency. For instance, it can bring your new iPhone or android device back to 50% in as quickly as 30 minutes.|Can Charge iPhone 8 upto 50% in 30 minutes or Redmi Note 9 up to 30% in 30 minutes|20W Fast Charging Input – The powerbank itself can get charged in 7 to 8 hours as it has Power Delivery Technology that supports 20W fast charging input via Type C port.|Charge 3 devices – With 2 USB ports and 1 Type C port for output, it can charge 3 devices at the same time & It comes with a 6 months warranty against manufacturing defects.", "user_id": "AFAKEZV7KMVT2SGF4KYWXGQRIW4A,AE33MAZWYRVAAICGNACZAIWACK7Q,AGBITVO2DOMNZU6DB4QF2WXXELLA,AFNFUGSKHFEN7D2XJICFYQIK62VQ,AH3HGPTMWGF4FTGDEKIODKTU5RCA,AEMKH7NSGFU5YGYOC54RHG54WHXQ,AGUTBT3QDFUJECX3SI4FAX647CZA,AGZJITIDEQNYDGVCPZDNXLBYDYYA", "user_name": "Vikrant,Ganesh Gholap,⚡ Pushpendra Singh Patel ⚡,Gaurav,sumegh,Jigar,Dhruba Jyoti Das,Anjeela", "review_id": "R3C219XKJW9GI2,R7KGIU29C0TLL,R3S0UMZSM6FNWM,R3MODCWX8MEIFI,RGLPAU9M85OBG,RBOERVXC2919N,R1EYK2W81FR1YN,R2QUFMWF2JX8KR", "review_title": "Decent Product at about right price.,Seems good.,Good Quality & Durable Powerbank in 1k range | Review,This is the second power bank from Ambrane India, i am happy,It’s heavy but good,Good product,Good power bank,The power is bulkier", "review_content": "I bought this power-bank to use during my vacation with family. It is sturdy BUT a bit on HEAVIER side. Can charge three phones at a time if you use the two USB and third Type C port as well for charging. The speed of charging is alright and appropriate. The ONE and only drawback I experienced is the weight of the Power-Bank itself, without this limitation it could be really amazing product to buy.,Bit heavy but does it’s job. Takes tooooooo much time to charge. Whatever mention in the description is not correct at all with regards to the powerbank charging.,I needed an extra power bank with a larger capacity. So this time I thought to give Ambrane a try, as i already have Honor & MI power banks (10000mAh ones). Though it was not a perfect match for MI or Honor ones, iit did live up to my expectations for the 1k range.•••••••••••••••••••🎁 INSIDE BOX•••••••••••••••••••→ Powerbank→ MicroUSB cable→ Carry pouch (depends on which package you received, more below)→ User manual/Warranty card→ General leaflet→ Feedback leaflet••••••••••••••••••••••••📝 SOME DETAILS••••••••••••••••••••••••→ Mfg: October 2019→ Charging time: 9 Hrs 50 Min (via 10W charger, low battery indication to full charge)→ Backup: Was able to charge (5-100%) Redmi Note 5 pro's 4000Mah battery ~3.5 times with regular usage in between.••••••••••••➕ PROS••••••••••••1. High capacity power bank with dual input (micro USB or USB C).2. Dual output via 2 USB ports.3. Not a fast charge/quick charge device but has an output of 5V/2.4A (12W) which is good enough.4. Touch button for power checks or switch it on for charging device.5. It comes with a carry pouch. (more below on this part).6. Compact form factor & sturdy design with ABS body.•••••••••••••➖ CONS•••••••••••••1. It does not auto-start charging when the device is connected.2. Since it has a touch button instead of push-button, it activates accidentally switching it on every time during handling.3. There is a lot of conversion loss & backup is slightly less for a 20000mAh power bank.▶ Cons are significant enough to reduce 1 star. There is scope for improvement (points 1 & 2) in this product in the same range. So ★★★★ device.••••••••••••••••••••💡 LED STATUS••••••••••••••••••••→ 1st/2nd/3rd/4th LED blinking (while charging power bank): Status of charge in terms of no of LEDs blinking→ 1/2/3/4 LEDs solid white (while charging other devices): Status of remaining battery in terms of no of LEDs→ One blinking (while charging other devices): Low battery→ All 4 LED solid glow: Battery fully charged•••••••••••••••••••••••••••••••••••🔊 AMBRANE BOX DEBATE•••••••••••••••••••••••••••••••••••1. When i first received this power bank it came in a small box (approx 12x9x3cm, Mfg: Aug 2019) with everything forced in congested space. The issue i had in this one was that it came with open seal & no poly wrap around product box as if it was a used product or was tampered in between. So was skeptical about the authenticity of the product and ordered a replacement right away.→ This one had USB C cable but no carry pouch.2. When replacement came, it came in a poly-wrapped bigger box (22x10x4 cm, Mfg: Oct 2019) with an outer sleeve and main box inside with a hologram seal. Maybe Ambrane changed the packaging. The hologram seal here was intact but was also not applied properly to secure the opening. Looked like it was applied with an open box. So its presence was useless.→ This one came with Micro USB cable and a carry pouch.••••••••••••••••••••••••👜 CARRY POUCH••••••••••••••••••••••••→ As per my analysis carry pouch comes with the latest October lot which comes in a bigger box and was unavailable in earlier lot with a small box.→ Carry pouch size was appropriate for power bank and i had no trouble inserting power bank in it. (Some users reported it having a smaller opening but i had no trouble with it and found it to be a proper fit. Neither loose nor tight.→ Its soft nylon meshed pouch and is a nice addon.••••••••••••••••🏆 VERDICT••••••••••••••••▶ At the price point its not a bad deal. Its a midway path b/w low quality and high-quality ones. You can very well go for Ambrane, as it makes good quality & durable power banks. Rest, nothing is perfect in this world. For this thing only, 10 days replacement policy from Amazon and 1-year warranty from Ambrame is available.▶ If one can extend the budget by a few hundred, MI power bank will be a better option with a metallic body & better quality overall. I have MI, Honor & Ambrane power bank and their overall rating will be (from low to high) Ambrane → Honor → MI,I am putting up this review after 1 day of usage. This is the second power bank i have bought from Ambrane India overall third power bank for my family. Before to this i have bought their PP-30 30000 mah model and also has MI 2i 20000 mah power bank both were really good, here i am putting together all the pros and cons which i am able to find after 1 day of usage and also a little bit of comparison. My dad uses Redmi note 7, my mom has MI A1 and i am using Redmi note 3Pros:-- Dual Input Type C and Micro USB this is the foremost and primary reason of choosing this power bank over MI or other brands as you don't need to carry two cables if your phone has type c input which in my family 2 out of 3 has  the same- Easy to carry and hold as it is very compact is size i must say in comparison to MI or Ambrane PP-30- Solid and sturdy built- 20000 mah capacity with same lithium polymer batteries these are safer then lithium ion batteries, this i came to know while buying this product-  ₹200 cheaper price than MI- Touch button at the top to know the power status (this is something unique)-  It took less than 1 hour to charge my redmi note 3 from 13% to 100% at 2 cell battery indicator, which is pretty good and almost equivalent to my wall charger best part same time and charging speed in Delhi Metro- I don't know either it is pro or con, both of my other power banks supports Qualcomm Quick Charge 3.0 Technology while this power bank supports only fast charging at 2.4 Amp, but i feel this has charged my phone better and faster than MI power bank itself. I know a phone must also supports quick charge technology for fast charging but when i use quick charge on my dad's Redmi note 7 (which supports QC 4.0) either from MI power bank or Ambrane PP-30 power bank it kind of heats up the phone, also it fluctuates the power and automatically switches between Quick Charge and fast charging which affects your battery life, so it is safer to charge the phone at optimum current at 2.4 ampCons:-- Very stuffy packaging, it looks like the power bank has been forced fully stuffed inside the box- It has some adhesive tape at the top i don't know why ? which, when you remove it, puts scratches on the top, be careful while removing the same- No torch light, their PP-30 have it- only micro cable inside the box,Definitely heavy but I knew this. I will recommend this, as it has 2 slots so we can charge two phones.,Nice product,Power backup is good.. but the USB cable provided is very bad. It stopped working after few months of usage,Everything is good but the battery don’t last that long when use for charging two device.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31RktQKvhoL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Ambrane-20000mAh-Lithium-Polymer-Stylo-20K/dp/B07RD611Z8/ref=sr_1_77?qid=1672902998&s=computers&sr=1-77"}
{"product_id": "B08WRWPM22", "product_name": "boAt Micro USB 55 Tangle-free, Sturdy Micro USB Cable with 3A Fast Charging & 480mbps Data Transmission (Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹176.63", "actual_price": "₹499", "discount_percentage": "65%", "rating": "4.1", "rating_count": "15,189", "about_product": "It Ensures High Speed Transmission And Charging By Offering 3A Fast Charging And Data Transmissions With Rapid Sync At 480 Mbps|The Braided Skin Makes It Durable And Invincible Against External Damage So You Can Have An Absolute Hassle-Free & Tangle Free Experience|Its Durable Pvc Housing And The Flexible Design Makes It Last 6 Times Longer Than Other Cables|Usb Cable Offers A Perfect 1.5 Meters In Length For Smooth & Hassle-Free User Experience For Superior Charging & Data Transfer Tasks|The Compact And Smooth Aluminium Connector Fits Most Cases Seamlessly And Resists Corrosion For Signal Purity|Micro Usb 55 Cable Offers Universal Compatibility As It Is Compatible With Most Android Smartphones, Tablets, Pc Peripherals, Bluetooth Speakers, Power Banks, Game Consoles & All Micro-Usb Enabled Devices|2 years warranty from the date of purchase", "user_id": "AG7C6DAADCTRQJG2BRS3RIKDT52Q,AFU7BOMPVJ7Q3TTA4G67RASTGYIQ,AER5ZGIXXVYG3AWZTRZT7M2BYCEA,AHE76XQSOLGOP5ZEKTIW6KUPDWBQ,AGXTMB2XHZBEWZ2UIX7ODZ4XTU6Q,AHNM2XVU745EDPNGUOAG74PTSNRA,AH5RWQ4S72IVLZD6O75OPCFIVDXQ,AG322TYKVPLPBDXE7ABEUK5QTALQ", "user_name": "Vivek kumar,Amazon Customer,SARTHAK,Chiranjeevi,V V GIRI KUMAR,Rajnandini,Akshay Talla,sudhanshu chaubey", "review_id": "R8E73K2KWJRDS,RSD0JTIIWQQL8,R64CRSTE9SLW1,R2FRTNIIUFJE1F,RWGNX3W7UOJ7W,R32TYHHODHTF5D,RQL9ZMQUTY7P2,R280XJ5VZUBOXV", "review_title": "Long durable.,good,Does not charge Lenovo m8 tab,Best charging cable,good,Boat,Product was good,1.5 m का केबल मेरे लिए बहुत ही लाभदायक है ।", "review_content": "Build quality is good and it is comes with 2 year warranty.,Good Product,Bought it for charging my mobile & tab but it doesn't work for Lenovo m8 tab,Guys this cable is is best compare of everyone over heat protection, quickly charging, but chance to shock circuit,good,Nice,Good quality,1.5एम का डाटा केबल मेरे लिए बहुत ही लाभदायक है ।  मैं इस केबल को लाइन में चार्ज करते समय फोन बहुत आराम से उपयोग  कर पा रहा हु । आप इस केबल से 15watt का  चार्जर उसे कर सकते है (इससे जड़ा नही) । लोकल बाजार में इसका दाम 150 है ,  अमेजन पे ये केबल मुझे 67 में मिला । गर्व से कहो हम हिंदू है , जय हिंद जय भारत ,", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41jlwEZpa5L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/boAt-Micro-USB-Tangle-Free-Transmission/dp/B08WRWPM22/ref=sr_1_78?qid=1672902998&s=computers&sr=1-78"}
{"product_id": "B00AXHBBXU", "product_name": "Casio FX-82MS 2nd Gen Non-Programmable Scientific Calculator, 240 Functions and 2-line Display, Black", "category": "OfficeProducts|OfficeElectronics|Calculators|Scientific", "discounted_price": "₹522", "actual_price": "₹550", "discount_percentage": "5%", "rating": "4.4", "rating_count": "12,179", "about_product": "2nd edition comes with same features and new sleek design with curved edges which makes it compact and easy to carry|Trigonometrical, Logarithmic, Permutation, Combination and many other mathematical Functions|Colour coded keypad for easy key differentiation|Drop resistant body with water resistant printing on Keys|Works on one AAA Pencil Battery|Comes with slide-on hard case|3 Years All India Manufacturer Warranty", "user_id": "AHDNZMNGM6UT4M2VPRPLZ7EBWCOQ,AFI2AGCYNXV2A3SKAJRTFFX65HFQ,AEPIRPEEOWBOSQVYCEWRUCZJFSAQ,AFVP63GD2YFUXERJWKNLUY3NZSKQ,AGFEBW3IPRHJNCKQUJTJQ2GBB3RQ,AHWNQOAOX5D633L5V54NRQBS6BIQ,AEKO2ZDDNGZ4CMORVWODMHM7LD5A,AHJUIXMUINDDJJDLRFHQSHGLBSTQ", "user_name": "Jojo Dominic,Anshi tiwari,Rickz,Mehbub Alam,Joban,Ambika N,SHT GAMER,Amit Singh", "review_id": "R36XQGHL3TG2S2,R2KHO4ECNAVNOO,RHTRI5KXL3B0G,R1WKGP3JNWFPZA,RIVY9LOY4XDM8,R15QNG3FMT58V5,R27HZ0L7SXVFCU,R2WA1A30690THA", "review_title": "Not bad,Good for engineers.,Good,its great !,Good,200,Good,Superb quality", "review_content": "Good,I use this to solve my numericals and its good.,Excellent tool for kids in learning,A quality product,Good product,Product is amazing and less weight good use of it and u can go for it,Good,https://m.media-amazon.com/images/I/61uctVLMIjL._SY88.jpg", "img_link": "https://m.media-amazon.com/images/I/41LcHKyVl9L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Casio-Non-Programmable-Scientific-Calculator-Functions/dp/B00AXHBBXU/ref=sr_1_79?qid=1672902998&s=computers&sr=1-79"}
{"product_id": "B08MCD9JFY", "product_name": "Tygot 10 Inches Big LED Ring Light for Camera, Phone tiktok YouTube Video Shooting and Makeup, 10\" inch Ring Light with 7 Feet Long Foldable and Lightweight Tripod Stand", "category": "Electronics|Cameras&Photography|Flashes|Macro&RinglightFlashes", "discounted_price": "₹799", "actual_price": "₹1,999", "discount_percentage": "60%", "rating": "3.8", "rating_count": "12,958", "about_product": "RING LIGHT WITH USB - High power 10W Ring LED is suitable for most devices that support USB ports, such as laptops, PCs, mobile power, USB chargers, AC adapters, etc.There are four buttons on the selfie ring light, which can be turned on / off, switch the lighting mode and adjust the brightness level, it is easy to find your favorite option in seconds. Ideal for using lighting in the studio, makeup in the locker room, camping, live streaming, etc.|INTELLIGENT AND QUICK COLOR CHANGE - TYGOT makes it easy to adjust the color temperature from 3400K to 5600K easily without using color filters. Achieve cold white light or warm light to hide blemishes and change skin tones quickly and easily. LED SMD design and 220pcs LED beads on our Ring Light offers more light for your camera photography, live streaming, Facebook Live, beauty makeup, selfies and videos.|DIMMABLE LED RING LIGHT - The LED ring light is equipped with 220 high-quality SMD LEDs and 3 different lighting modes (white light, natural light, and warm light), bright enough to beautify your face. Each lighting mode has 9 adjustable brightness levels to meet all your needs on different occasions. This is the perfect dimmable day lighting to eliminate all unpleasant shadows!|EASY TO INSTALL - Ring LED can be easily installed to any light stand or tripod.|PHONE HOLDER AND 7\"feet tripod - Each TYGOT Ring Light has a rotating (360 degrees) phone holder and a retractable tripod that effortlessly helps you capture different levels of brightness and angles of lighting! The phone holder is suitable for most smartphones.", "user_id": "AH2OGGTXFZ6MSSCZB7IRRZPFOJLA,AFV6NBHT64FRQA3KRITDIU3M7NNA,AHIKT4WX23GNGZCH5KEHHVFYZYMQ,AGQXGHRFNHL3Q7C3YGA7SESRJBRQ,AHHURWLAWRA76F6ZD3SQ2LZ5PYVA,AFI3GFCFBOM4G6QGUKQKOZYO4BGQ,AFF57GWUKTC6BV7TNG2LEFWDVRQA,AGJBCJZIXDHRCB2E2W6LKVZRPKTQ", "user_name": "Avnish Kshirsagar,Vivek kumar,CH.Mahesh Sai Kumar,Sornnaluxmi,Sajith saji,Milan Gelani,Vishwanath Agarwal,Trendzer India", "review_id": "R2UT2VQEDPGN1H,R1IIJGUS2SSR7Q,R3QMEGXUL7BM6J,RJ881YNSQW00R,R2BQHF6K2GYQV2,R3KEPYTBVTTUGK,R38643N4B91P1J,RATIBJBLJ4VZA", "review_title": "Average:/ Works but light is not that attractive.,Photo graphy,Easy to use,Easy to handle,Easily portable,good,Quality and portability,Best Budget Ring Light", "review_content": "Stand is good. But the light is not that bright. In photos it Feels bright but irl not that use of the light.Also setting up the light and stand takes bit of effort.Quality of stand and parts is average .I bought it for Rs 800 but I won’t recommend u guys to pay even a rupee more than Rs 400 for it.,Good product,I liked it as it is easy to use and helpful in clicking better pictures,Easy to handle..worthy..,Great product for beginners,good,Light quality is really good at this price segment,I really liked it's portability as we can take this to another place easily,", "img_link": "https://m.media-amazon.com/images/I/412CjF5u2iL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Tygot-YouTube-Shooting-Foldable-Lightweight/dp/B08MCD9JFY/ref=sr_1_80?qid=1672902998&s=computers&sr=1-80"}
{"product_id": "B083RCTXLL", "product_name": "HP X200 Wireless Mouse with 2.4 GHz Wireless connectivity, Adjustable DPI up to 1600, ambidextrous Design, and 18-Month Long Battery Life. 3-Years Warranty (6VY95AA)", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹681", "actual_price": "₹1,199", "discount_percentage": "43%", "rating": "4.2", "rating_count": "8,258", "about_product": "Stay unbound, stay in control - enjoy lag-free 2.4GHz wireless connectivity on this durable mouse by HP with an 18-month long battery life.|Work at your pace by speeding up or slowing down tracking with adjustable DPI settings up to 1600 (800/1200/1600).;Work on your terms with an ambidextrous, contoured design suitable for both left and right-hand use.|Enjoy great compatibility across devices and on different operating systems - Windows 10, Windows 8, Windows 7, and MacOS 10.1 or higher.|In it for the long run - enjoy 3-years manufacturer warranty on the device from the date of purchase.;Style Name: Wireless Optical Mouse|Power Source Type: Battery Powered", "user_id": "AGQOIAAECVPLYNBEMZOCS6GKZWDA,AHGAVBUAPBB646EUCPJNUADKTLAA,AHG4ON6JILVZZJIB7VNEWDGQSMZA,AEOMSGRZI2GBBBATYNQ2IXWGXWGQ,AGLEATI6IBYVUFPSA2LAFAVI4ERA,AEAEURMVDILS5FIOXHO3U5UK7GCA,AF65ARGLPJKDMEKC4YE6J6TTE3GQ,AEJULQXD34VV2C2AACLTB44MWEXA", "user_name": "Reetu Solanki,Amazon_user,AniS,karun,Chandrajit poria,ViswanthAmazon,Prabhakaran Ramu,Biplab Bose", "review_id": "RMJTIHWOEVJ2S,R2EG04BF78FCDN,R2XS7O4CK0KEE5,RDQ894LVO01UH,RO7RFHI6XIDYE,R3J3S08AQQCGNM,R52K5GWEQ070L,R3LXH31GPSHNYD", "review_title": "Wow,Good,Nice product with some issues with the battery port,Worthy,Good product,Ok but large size,Value for money,3 years warrenty vs 1 year", "review_content": "Nice portable .. liked it..,Reducing one star as packaging was not good.Mouse is big.If you prefer small and travel friendly mice go for someother design.,The mouse looks good, and it is even easy to hold and use due to to it's design. The only issue I found out was with the battery port, the cover for the battery doesn't come off easily and that's the worst part. Also, the battery cover has some opening provided, not sure why.,Ok worthy,Good product,Good deal but big size,Noisy while scrolling,At 1st they send me a used one with missing adapter, than replaced with a new one, previously i was using logi m190 full-size mouse , its wheel stopped working properly within a year ,  thats why i bought this full-size wireless mouse hp x200 @ ₹488 , with 3 years warrenty, clicks are soft on logi also they have increased the price of it from 600 to 1100, but there is no use if it doesn't work properly, let's see ...", "img_link": "https://m.media-amazon.com/images/I/21psCtgM5BL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/HP-Wireless-Mouse-X200-6VY95AA/dp/B083RCTXLL/ref=sr_1_82?qid=1672902998&s=computers&sr=1-82"}
{"product_id": "B08HLZ28QC", "product_name": "Oakter Mini UPS for 12V WiFi Router Broadband Modem | Backup Upto 4 Hours | WiFi Router UPS Power Backup During Power Cuts | UPS for 12V Router Broadband Modem | Current Surge & Deep Discharge Protection", "category": "Computers&Accessories|NetworkingDevices", "discounted_price": "₹1,199", "actual_price": "₹3,490", "discount_percentage": "66%", "rating": "4.1", "rating_count": "11,716", "about_product": "WiFi Router UPS: Oakter Mini UPS for wifi router provides upto 4 hours of power backup (depends on current consumption of wifi Router) to your 12V WiFi router, Broadband Modem. Mini UPS works as an inverter for WiFi router, Broadband modem which ensures uninterrupted power supply in case of power cuts or switch over to generators|Smart UPS for WiFi Router: Mini UPS for WiFi Router having an intelligent battery management system, Mini UPS charges itself when there is electricity. Mini UPS is Online WiFi router UPS thus do not require switching between two paths in case of power failure or switch over to generators. it has inbuilt current, surge and deep discharge protection|Plug-N-Play: Take out the power adapter from WiFi router and insert it in the Mini UPS input female socket, connect the \"OUT\" of Mini UPS to your WiFi router. Note - Use additional connector wherever require. Mini UPS is a consumer grade CE and ROHS certified. It Uses BIS Certified 3 Nos. Lithium-ion Cells (Brand: Sinohan Power Battery, Model: 18650)|Supported WiFi Routers: Mini UPS for WiFi Router supports all type of 12V DC WiFi Routers, Broadband modems, Set-top box and CCTV cameras(12V-0.5A, 12V-1A, 12V-1.5A, 12V-2A, 12V-2.5A, 12V-3A). Supported all major routers like D-Link, TP-Link, Jio Fiber, Cisco, Mi, Tenda, Nokia, Asus, Linksys, airtel, BSNL, ACT, Netgear, and more.. (Before buying please ensure your WiFi router is 12V DC)", "user_id": "AGT57G75IGN5AEBU77WPGOUYZMVA,AHQGD54SLGLEGF2NDJAG3O7QOWJQ,AEUM5B25NOTCU5KDYMVAOBN5Y5FQ,AG6U536CQCCXIUB2KAMNSXV6FDRQ,AHLOOYOSGEO7R4A24UBQVT4UM2JA,AG2Q3W62IHB6PTZ2ZP3W2MI3EN3Q,AFQSUGIEHJ6OAZVRT6AUSLC7DJ2A,AGBEQ2VS3TLOX5JYXV47BERXYWSA", "user_name": "Shraddha,Ravibaskar,Pramod,Amazon Customer,Amazon Customer,Amazon Customer,sumit pant,yashasvi", "review_id": "R3EGID2HUY7LU8,R27APYDW4ZMR7T,R31XXA5MOY1R4E,R3R9A3JWS33ERF,R1EFI61RMD0Z15,R1LRD22T6K2R3B,R2OI7X78Y7QIEA,R2XQJXUXNN0A12", "review_title": "Very useful product - but hardware is not so sturdy,Great Customer Support,Overall a good Indian product.,Really good to help internet running during power cuts,Good product and effective customer support,Value for money,Does Not support 4 hours as per the description,No backup at all", "review_content": "I used this product for about 4 months and really had no issues with it, until I noticed that my internet stopped working. After getting it checked I found out that the issue was in the UPS (maybe wiring cable) which stopped transmission.I contacted the customer care and I was assisted by Mr. Ankit. He was very helpful and asked me to demonstrate the issue in video and tried to ascertain the issue through other checkups too. After ascertaining that the issue is in the product he confirmed to get the default product replaced and started the issue and informed me on tentative timelines for the same. Hoping to receive the replacement soon so that I can continue uninterrupted internet !!,I have been using this product for the past four months, during this tenure I had faced no issues initially but roughly after 3 months the power back up started shrinking extremely and the least duration was under 30 minutes, that’s when I contacted the customer support via whatsapp and I must say the whole experience with the customer support team was simply surprising. They were very polite and helpful throughout the process. It was very easy for me to explain the issue to them then at the end of the first conversation itself they arranged a replacement for the product since it is just 3-4 months old. They took all the responsibility of the issue and sent me a new product which I am currently using, now the back up I am getting is 4+ hours which is based on my usage.So finally I am not sure how often I buy a product from this brand but I will never forget the support I received from this this brand. Cheers!!!,I purchased the product 10 days back and initial product was not working properly. But I received a replacement for that. Thanks for immediate response from the support team. I liked Oakter because it's Indian product and NOT a Chinese. As of now it's working fine and no lag in Wi-Fi connection or speed. Need to test the recharge capacity when the Power goes off. Will keep you updated after a month again by checking the results. Giving 4 Stars as of now.,This is a really good option for those who are primarily concerned about being cut off from online meetings/calls due to frequent short term power cuts, and are not willing to spend more amount buying an inverter. I have been using this product since around 3 months and am pretty happy with its backup.,I have been using the product for more than a year. Later I purchased a second product for my parents home and it was working fine for 6 months. However the backup battery stopped working later and the customer support team were quick to respond and swiftly sent me the replacement product.,Product was delivered very promptly and packaging was good. Using this product just from couple of days and its working as expected. Very easy to plug & use. Reserving 1 star for longevity of this product, will revise my rating after a year or so depending on my experience.,The device doesn't support for 4 hours. It support only for 2 or 2 hours 30 minutes max on full recharge.Product is affordable, light and good. Please don't fool on 4 hours support capacity. Resonate UPS is better as compared  to this.,This product claims to give backup for upto 4hours. But it wont even give backup for 30 mins. I claimed warranty and got the new product as well still the same problem. They reiterate and say upto 4 hours where they shud mention clearly that it will give backup upto 1 hour not more than that.One of the worst customer support services i have seen. The associates keep repeating the same sentence or copy paste the chat and dont provide solutions. Totally disappointed and waste of money. Never recommending anyone to buy their product.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31PfpEPlg-L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Mini-UPS-Router-WiFi-12V/dp/B08HLZ28QC/ref=sr_1_83?qid=1672902998&s=computers&sr=1-83"}
{"product_id": "B07GVR9TG7", "product_name": "TP-Link Archer AC1200 Archer C6 Wi-Fi Speed Up to 867 Mbps/5 GHz + 400 Mbps/2.4 GHz, 5 Gigabit Ports, 4 External Antennas, MU-MIMO, Dual Band, WiFi Coverage with Access Point Mode, Black", "category": "Computers&Accessories|NetworkingDevices|Routers", "discounted_price": "₹2,499", "actual_price": "₹4,999", "discount_percentage": "50%", "rating": "4.4", "rating_count": "35,024", "about_product": "AC1200 Dual-Band Wi-Fi —— 867 Mbps at 5 GHz and 400 Mbps at 2.4 GHz band;MU-MIMO Technology —— Simultaneously transfers data to multiple devices for 2× faster performance|Boosted Coverage —— Four external antennas equipped with Beamforming technology extend and concentrate the Wi-Fi signals|Access Point Mode —— Supports AP Mode to transform your wired connection into the wireless network;Easy Setup —— Set up your Wi-Fi in minutes with TP-Link Tether app|In an unlikely case of product quality related issue, we may ask you to reach out to brand’s customer service support and seek resolution. We will require brand proof of issue to process replacement request;Control Method: Touch;Security Protocol: 64/128-Bit Wep,Wpa / Wpa2,Wpa-Psk/ Wpa2-Psk Encryption|Operating System: Windows 10linuxmac Oswindows", "user_id": "AFZQFX2T6G3DRQ5VN2RLQHKHN7OQ,AEWQ6I7BKVHK5FWMLUNE7WL225TA,AETG7JHK5RW3AFEYCBDANJNOWWGA,AHPF2D5RYZ5QDJZFGDKRPRL36Q5A,AH65VYWK4QUJQPLHAIBZ2PIVQ5WA,AGLMDXIDTQ6JHLKTJF7S2CD3PFJA,AHSCYYDMRKGSS34SATRXSBNFPLSQ,AHYPBUOGDWIPQZHL5OKLHPXJB2SA", "user_name": "Pratyush,Karan G.,Aditya kamble,Akshay M.,Sunanio13,Anupam,Jitendra Rajput,KISHORE THOLANA", "review_id": "R1KQN0FQ8TQUYP,R2LIHYNX33S3JW,R2MSZF0CBI5362,R2RECNPT3U4S0R,R1G9BQDKBF78M7,R2GO75L7U86Z1V,R33PHX4BSNENA9,R301O6LFOU2YZ8", "review_title": "Excellent offering from TP-Link,Signal disconnected,Bad packaging from Amazon,Good product for that money,The WiFi range got increased, compare to my old Router!,Very good router in this price segment,Good Product,Wifi router", "review_content": "My ISP provided modem-router combo is in another location in the house, and I was getting speed drops on 5 Ghz when I was across the house [as was expected]. So, I decided to buy this router to use as an access point. The setup is pretty straightforward, provided you know what you are doing.As is mentioned on the product page, this router comes with two modes -- router mode and access point mode. If you are using it in addition to your ISP provided modem-router, I would suggest using it in the access point mode only.The range and the speeds are working better than I expected for the price -- certainly better than the router that the ISP provides. The router does come with a LAN cable, but the quality of the cable is not very confidence inspiring. The LEDs on the front can be configured via the Tether app to switch off at specific times, which is a neat feature. Apart from that, I have found Tether app to be pretty useless. It doesn't specify the device identity for some reason, just shows the IP and \"unknown\", until you rename the device yourself. Sometimes it doesn't even list all the devices connected. I guess it is better to use the router settings from the browser itself if you want to dig into the settings.I would like to add one more thing in the end. This router looks pretty slick, and I don't think it has gotten enough credits for that. Kept on the table, or even hung from the wall, it looks and feels premium for the price -- and that is in addition to all the amazing features it has.,Router gets sometime auto disconnected even though it is connected to internet,I don't have any issue with router but sure with Amazon packaging method bcz no paper bag or anything were used it was only the box,Good product for that price. Good range,So far everything looks good, wIll update the review after a few months of usage!,Awasome experience, go for it with out any hasitation, assistance also very good.,Highly recommended to purchase, overall a good purchase, you will never regrate after purchasing it.,Signal strength can be improved further.So far good to go.", "img_link": "https://m.media-amazon.com/images/I/41VDUqScJFL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/TP-Link-Archer-C6-Wireless-MU-MIMO/dp/B07GVR9TG7/ref=sr_1_84?qid=1672902998&s=computers&sr=1-84"}
{"product_id": "B0856HY85J", "product_name": "boAt Rockerz 550 Over Ear Bluetooth Headphones with Upto 20 Hours Playback, 50MM Drivers, Soft Padded Ear Cushions and Physical Noise Isolation, Without Mic (Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|Over-Ear", "discounted_price": "₹1,799", "actual_price": "₹4,999", "discount_percentage": "64%", "rating": "4.1", "rating_count": "55,192", "about_product": "Tap into instant wireless connectivity with the latest Bluetooth V5.0|Its 50mm dynamic drivers help pump out immersive audio all day long, Charging Time 2.5 hours|The mighty 500mAh battery capacity offers a superior playback time of up to 20 Hours, Charging Time : 2.5 hours, Standby Time : 180 hours, Frequency Response 20Hz-20KHz|It has been ergonomically designed and structured as an over-ear headphone to provide the best user experience|It comes with physical Noise Isolation feature for pure audio bliss|One can connect to boAt Rockerz 550 via not one but two modes, Bluetooth as well as AUX", "user_id": "AEKZNJLC7X57UF3F4STP3GSIIGJA,AGPESHJAGFFNOORA77CESB7XBDDQ,AFP6VTPJTBO2PC47S433EJWP6MDQ,AFVTXEYL44JFAYLMKFO7RGRQGKNA,AF62IKENODH7IRC3TVNOMP4PN2NQ,AEPPS42KFYOB2D4EZGAE4DDSL2EA,AE2YPAMPW3WE3EY6YUGZTOVDZMEQ,AEAGP3KMHVFRPDKOR7TNLXYAKA6A", "user_name": "Ananthu,Dheeraj Krishnan,Rani D.,Nasim,Anupma Goswami,Relesh Dewangan,Aadarsh,Shubham band", "review_id": "R16XVVFYUNVL5L,R2MGT9GPFEHTPY,R326AAFTL0LMUL,R1XBQN0IY6V5VX,R1LMKF935MRJMW,R3VHEFOX9HOCWT,R1JEOGWKLERZIC,R35KI765XWBP34", "review_title": "Good but check the below mentioned things,Going to buy it again,Decent headphone,Good quality headphones,waste of money,Best product in this prize range. And the colour looks fabulous.,Size,After 1 year of usage", "review_content": "The product was received without damaged and seal intact. Coming on to the product I bought the jazzy blue sunburn edition.Pros:Battery is good, used as opened from the pack it held good for about 10 hours across 4 days and still charge is leftSound- Sensible Bass and good mids as well as lows, not that I can discern between them.Aux available.The ear cups are quite big hence sorta provides passive noise isolation.Cons:Not foldable as well as type b charger (USB micro) typeBeing a limited edition if your ear cups wear off very miniscule chances of replacing it with suitable colorIf a person is of hot body type(emits heat or more warm then normal) there is higher chances of feeling warmth in your ears, as I heard the material just reflects the heat back on to ears. That's just plain uncomfortable to me.Also the build feels very flimsy and plastic-ky.Also a major drawback I felt was that whenever we switch on/off we get the built-in audio!,Bought it for 1499. Now after 2 years 2 months, today it broke. After 6 months of use, the red coating started peeling off. But device showed no problems. Sound is clear, balanced, not very hogh but enough bass, good battery backup, charges faster, aux is available. Disadvantage is you can't fold it. Planning to buy it again, as I think this the best in segment. Now the rate has increased to 1799.,The first thing I want to say is that the headphone is really bulky. I didn't notice the first few days of using but eventually it gives pain on the shoulder if worn for a longer period of time (3-4 hours), sound quality is good. Do not have any bass, ANC is not present in this headphone. It's a decent headphone for casual purposes. If you're a music lover or wear your headset for longer period of time then I think you should invest in other options, which is light weight and have ANC in them.,Everything is great about boat products. Delivered in two days.Noise cancelling is great. Bluetooth connectivity is good. Something it takes time to connect. If you planning to buy then this would be a great choice.,in details it was written that it has physical noise isolation feature in it  but when it came I didn't observe as such feature I bought it for study purpose that the reason why I was looking for such feature but I found it as a waste of money.,Sometimes .. sound doesn't work .. you have to decrease the volume to zero and then increase again to hear the sound. Bu this happens only 1 out of 10 times.,Build quality is good, has physical noice isolation, soft padded, comfortable, but bass could be quite better, otherwise everything is fine,Best for Gym, study, online lectures, entertainment etc.Please Go for it 🥂👍🏻,Good quality headphones in Over the ear category. Good quality sound but has less bass as other says but it's decent. Good mic quality for meetings but doesn't have any noise-cancellation feature. I just feel that after 3-4 hours of constant use these earphones feel weighted to the neck.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41PlZjYsy-L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Boat-Rockerz-550-Headphone-Aesthetics/dp/B0856HY85J/ref=sr_1_85?qid=1672902998&s=computers&sr=1-85"}
{"product_id": "B07CD2BN46", "product_name": "Xiaomi Mi Wired in Ear Earphones with Mic Basic with Ultra Deep Bass & Aluminum Alloy Sound Chamber (Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹429", "actual_price": "₹599", "discount_percentage": "28%", "rating": "4.1", "rating_count": "1,19,466", "about_product": "Ergonomically angled to fit perfectly in your ear canal that provides long lasting comfort for every day usage. Inline Remote : Yes|Features 1.25 meter long cable & L-shaped 3.5mm jack to connect with your phone. Due to the L-shape, the connector will deliver a strong & durable life. Earphones are compatible with Android, iOS & Windows devices with jack.|Powerful 10 mm drivers & aluminum sound chamber for super extra bass and clear sound for the best music & calling experience.|High-quality silicone earbuds, which are gentle on skin without compromising the comfortable fit on the ears.|In-line microphone with a durable multi-function button to play/pause your music, and answer/end your calls, all with just one tap.|Speaker impedance: 32Ω ; Rated power: 5mW|Customer Service: 1800 103 6286, Service is available from 9 a.m. to 9 p.m. local time.", "user_id": "AHMAO37N3VRBQR5QXRATTM75KHAQ,AHQ7LIIQZN6O7YA3EYZ7SV2RIYFQ,AHMX2NZBM45ZRMYJIJGGTCHNYC6Q,AGN7DFBGDAM7NRQN6WGIZDOATS3A,AGGZJWNAT4VKG3N7PB5HVNY2GTHA,AGRESPYD37LHSEATHKCG4ED3A6SQ,AFQABEOYWJJP6XUPWCJNZ6DTPTFQ,AF2EHSXFZWWS2YEN22DV2ZCJDZZA", "user_name": "Kishor Patro,NOORUL RILWAN,Amazon Customer,Surjith k v,Khushbu,Anand Nishad,Sunidhi,Mwnzil brahma", "review_id": "R13Z8MSR50H9UK,RM7JUADWLUK6A,RKJS44FVJ9WDN,R3NMULZYX4HN7N,R1F88W61P4OKYN,RBO17QNYZ6BIP,R3QD7XA5DS8I8K,R18F8VXBV6TZLO", "review_title": "Best buy you will not regret,Fantastic product,Nice,Worth of money,It's working realy well and i am satisfied with the result,Good Earphones base and sound quality is good,Value for money,Very Good Product", "review_content": "The Mi Earphones sound great for the priceThe cable is covered in Kevlar fiberThe Mi Earphones are priced at Rs. 699Xiaomi has garnered a well-deserved reputation for producing high-quality smartphones with powerful specifications at affordable prices. The same applies to the company's diverse range of accessories as well. These are priced quite competitively and usually provide tremendous value for money.Xiaomi recently launched two new pairs of budget earphones in the form of the Mi Earphones Basic and Mi Earphones, and we have the latter for  today. With a three-button inline remote and mic, a Kevlar fiber cable, metal sound chambers, and a right-angled plug, the Mi Earphones seem pretty promising on paper. We have put this pair through our tests to see whether that promise actually translates into real-world performance.Xiaomi Mi Earphones design and comfortAs expected from a pair of earphones in this price range, the Mi Earphones are made entirely out of plastic. That said, the build quality is actually quite impressive, with high-quality TPE surrounds near the 3.5mm plug and earpieces.The box is as basic as it gets. There is no case and no extras to be found inside - just the earphones, a short and sweet user guide, and two extra sets of tips (large and extra-small). The cable though is far from ordinary. It is braided in Kevlar fibre which not only prevents tangling but also looks and feels premium.The box is as basic as it gets. There is no case and no extras to be found inside - just the earphones, a short and sweet user guide, and two extra sets of tips (large and extra-small). The cable though is far from ordinary. It is braided in Kevlar fibre which not only prevents tangling but also looks and feels premium.SearchHOMEAUDIOAUDIO REVIEWSXiaomi Mi Earphones ReviewAdvertisementBy Shobhit Varma | Updated: 25 April 2018 16:12 ISTHIGHLIGHTSThe Mi Earphones sound great for the priceThe cable is covered in Kevlar fiberThe Mi Earphones are priced at Rs. 699Xiaomi Mi Earphones ReviewSubscribeXiaomi has garnered a well-deserved reputation for producing high-quality smartphones with powerful specifications at affordable prices. The same applies to the company's diverse range of accessories as well. These are priced quite competitively and usually provide tremendous value for money.Xiaomi recently launched two new pairs of budget earphones in the form of the Mi Earphones Basic and Mi Earphones, and we have the latter for  today. With a three-button inline remote and mic, a Kevlar fiber cable, metal sound chambers, and a right-angled plug, the Mi Earphones seem pretty promising on paper. We have put this pair through our tests to see whether that promise actually translates into real-world performance.Xiaomi Mi Earphones design and comfortAs expected from a pair of earphones in this price range, the Mi Earphones are made entirely out of plastic. That said, the build quality is actually quite impressive, with high-quality TPE surrounds near the 3.5mm plug and earpieces.by TaboolaSponsored LinksMederma Stretch Marks Therapy Cream 50Gm₹849.15PharmeasyBuy NowThe box is as basic as it gets. There is no case and no extras to be found inside - just the earphones, a short and sweet user guide, and two extra sets of tips (large and extra-small). The cable though is far from ordinary. It is braided in Kevlar fibre which not only prevents tangling but also looks and feels premium.Xiaomi Mi Earphones inline1 Xiaomi Mi Earphones Inline 1While the Mi Earphones look pretty nondescript overall, there are a few design flourishes such as a textured metallic finish at the back of the earphone housings, and the aforementioned Kevlar fibre cable, that stand out.Promoted: In the StoresBestseller OnePlus Nord (12GB RAM, 256GB) - Gray AshOnePlus Nord (12GB RAM, 256GB) - Gray Ash₹ 29,999AmazonBuyXiaomi Mi 2 True Wireless Bluetooth Earphones (White)Xiaomi Mi 2 True Wireless Bluetooth Earphones (White)₹ 2,999 (45% off)AmazonBuyXiaomi Redmi Earbuds S Wireless Bluetooth Earphones (Black)Xiaomi Redmi Earbuds S Wireless Bluetooth Earphones (Black)₹ 1,720 (28% off)AmazonBuyboAt BassHeads 100 Wired Earphones (Taffy Pink)boAt BassHeads 100 Wired Earphones (Taffy Pink)₹ 379 (62% off)AmazonBuyboAt BassHeads 100 Wired Headphone (Black)boAt BassHeads 100 Wired Headphone (Black)₹ 379 (62% off)FlipkartBuyTrending Poco M3 (6GB RAM, 128GB) - Power BlackPoco M3 (6GB RAM, 128GB) - Power Black₹ 11,999 (20% off)FlipkartBuyAt just 14g, the earphones weigh next to nothing and are extremely comfortable. The housings are ergonomically shaped housings and angled at 45 degrees. They do not fall out of the ears easily, even during intense activities. The silicone tips are nothing to write home about, but that is expected considering the price.There is a three-button inline remote with mic located right below the right earpiece, which can be used to answer calls, control music playback, and trigger the voice assistant on your smartphone. The buttons themselves are quite mushy and difficult to distinguish between by touch alone.Xiaomi Mi Earphones performanceXiaomi claim that the Mi Earphones feature a '3rd generation balanced damping system' that creates a transparent sound, and 'metal sound chambers' created via a 20-step process. Marketing fluff aside, how do the earphones really sound? Simply put: surprisingly decent for earphones that cost less than a nice dinner for two.While most earphones in this price range have over-inflated bass that dominates the rest of the frequency range, the bass response on the Mi Earphones is controlled and restrained. It doesn't overwhelm the sound signature or smother the highs. That said, bassheads will be left slightly wanting.It's surprising to hear that highs are present and distinct in the sound mix, although they do get overpowering sometimes. The mids are slightly repressed, which is evident in vocal-heavy genres such as blues. While the clarity on offer is decent for the price, songs with many layers of instrumentation do sound muffled and noisy. This is most evident in complex genres such as rock and metal in which the earphones sound harsh and the mids get buried by the treble and bass.,This earphone set is fantastic. And highly deserving of money. I used it for a while last in 2022, and now I'm buying it once more in 2023. In my perspective, the Mi headset has good music and is easy to use.,good good,Nice product.Gentle bassNo loud soundProduct quality is decentDon't expect heavy music experience,It's sometime uncomfortable but it's fine i can adjust,Seriously if you are a bass lover, then you can go for it.But it's built quality is not good, it will damage automatically after 3-4 months,it is not suitable for rough uses.,Got it for less than 300rs. Not disappointted at all.If you compare it with other brands like Boat, the sound quality isn't as good as the contemporaries. But for the price I paid, I'm not disappointed at all.The bass is solid. Noise cancellation is average and the earphones are a little low on volume, could've been louder.Good value for money product for earphones under 300.,Very Good product as expected", "img_link": "https://m.media-amazon.com/images/I/31Rn5CAJDBL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Mi-Earphones-Basic-Mic-Black/dp/B07CD2BN46/ref=sr_1_87?qid=1672902998&s=computers&sr=1-87"}
{"product_id": "B07PLHTTB4", "product_name": "Zodo 8. 5 inch LCD E-Writer Electronic Writing Pad/Tablet Drawing Board (Paperless Memo Digital Tablet)", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|GraphicTablets", "discounted_price": "₹100", "actual_price": "₹499", "discount_percentage": "80%", "rating": "3.5", "rating_count": "9,638", "about_product": "Size: 8. 5 inch|Good grade", "user_id": "AES4PVTQ4WEANJ2E2HOJNVVBGQNQ,AGU4YJLPDKSSANW5PJMTKRAB4TYQ,AFYMT7DOR34UG7SPECITTIOGLASA,AFOCWD5SWSKUUTLBP667KT6PGKOA,AHSXXQ7JVBY3HIPIGY2EGEL37PKQ,AGZUR76DGC2434JZIPVNBWTDRIKQ,AFOBPWQSTMENPV7ZC2SSKSXWFQ2Q,AE3FF4SDT3KWMHGTK4ENKBTY7M6Q", "user_name": "vasanth,Hemant Ghengat,Gopal,ANUKUMAR S L,Manoj Kumar,Habs,Abdul,Farha", "review_id": "R2MSV2JRVJGRQN,R2N6TQ3N4XSSFR,R3Q36Y6U3YKG6B,R3B62FXQRPYCBF,R3DSCZL1XTGQAX,RQSHBH1TBP4AB,R18HLYU58YH1LI,RSKKY88AN663W", "review_title": "Good,Kids love this,Simply superb,Happy,Good,Nice gift for toddlers..... Good for elders too, to mak notes,Nice,Useful", "review_content": "Goid,Best Education Gadget For Kids,Brightness needs to improved,Nice,Good,Liked by kids, hassle free, dust free.Can improve the screen brightness n font visibility,Good,I ordered black but it came blue , although not a big issue colour doesn't matter tht much but functioning is ok so its good..!!", "img_link": "https://m.media-amazon.com/images/I/51JF5xTgNhL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/ZODO-Writer-Electronic-Writing-Paperless/dp/B07PLHTTB4/ref=sr_1_88_mod_primary_new?qid=1672902998&s=computers&sbo=RZvfv%2F%2FHxDF%2BO5021pAnSA%3D%3D&sr=1-88"}
{"product_id": "B077T3BG5L", "product_name": "Zebronics ZEB-KM2100 Multimedia USB Keyboard Comes with 114 Keys Including 12 Dedicated Multimedia Keys & with Rupee Key", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Keyboards", "discounted_price": "₹329", "actual_price": "₹399", "discount_percentage": "18%", "rating": "3.6", "rating_count": "33,735", "about_product": "Superior Built Quality: The keyboard has a superior Quality and is built to last.|Modular Design: The modular design on the keyboard makes customizations a possibilty.|USB interface: The keyboard comes with an USB interface making it compatible with most of the PCs|UV Printed Keycaps: The keycaps are UV printed helping that inscriptions on the kepscaps to last long|Plug & play: Just connect the USB connector to your PC and you are ready to go. Compatible with Windows XP/Vista/7/8/10|Country of Origin: China", "user_id": "AHJRPRAXBOIRLYMCRQ4HCACPXDVQ,AH5G5ENXXWLJAEJMD2DGGVVWCXKQ,AEZRJAZOI4QT6FMFJMPVMZEEBGIA,AF7HCYB2DO4LPCOGY4TBL6SW5QXA,AFPF5JNNNSYW22R7HPGXZGZCWJOQ,AELR5MHP3LFLHR2IFMRE3FCQIHZQ,AE6APMY2U2SCCZYPIQWLII3GJGDA,AGYT72RKZLBSL7IRSVJXQNKHJOKQ", "user_name": "Sagarjit,balvant ghanekar,rohit,NATESA PILLAI RAJARAMAN,abhilash,Vikas Shukla,Lucifer,chandran", "review_id": "R3I9ZZITI5NO9G,R2AO8Y28HYFSGN,RVJ7OESUFXN6U,R1MDDB3FYXXEVL,R3G7Y5WQT3T0AV,ROCT9PEGTFHBI,R24WVK7TASKNPN,RUOVM34GI6ISW", "review_title": "Keys got hard after 2 months usage.,Temporary buy value for money daily use,Guys please don't buy cheap keyboards online,keys are clustered,Good,Good product,Don't buy these types of keyboards for typing purpose,Nice", "review_content": "The product is very good. Keya are ergonomic. After using it for 2 months, the keys are starting to get hard.. let's see how it performs in the future,For daily use value for money normal typing is good spacebar key is not properly pressed overall good to buy cheap product,I mean it is not a bad keyboard but i can get the same keyboard at local store for cheap price without paying for delivery so please consider this before buying.,After using standard boards like Logitech this seems to be with narrow gap between keys.  I have to adjust myself and careful not pressing two keys.  But it is smooth and without noise.  May be useful for beginners.  very economical,Good keyboard at affordable price,Good product at this budget but not good for gaming, very basic keyboard,for typing purposes its waste of money rather go for a mechanical keyboard,Nice", "img_link": "https://m.media-amazon.com/images/I/41XQP3N-SdL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zebronics-Km2100-Multimedia-USB-Keyboard/dp/B077T3BG5L/ref=sr_1_89?qid=1672902998&s=computers&sr=1-89"}
{"product_id": "B08DDRGWTJ", "product_name": "MI Usb Type-C Cable Smartphone (Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹229", "actual_price": "₹299", "discount_percentage": "23%", "rating": "4.3", "rating_count": "30,411", "about_product": "1m long Type-C USB Cable|Sturdy and Durable. With USB cable you can transfer data with speeds of upto 480 Mbps|Upto 3A output|6months warranty|Sturdy and Durable. With USB cable you can transfer data with speeds of upto 480 Mbps|6months warranty|Up To 3A Output", "user_id": "AHW6E5LQ2BDYOIVLAJGDH45J5V5Q,AF74RSGCHPZITVFSZN76K6GKPICA,AHDD7ZNB47QA2JLYU53HD4ML3VNQ,AHV3ELGDSOWBYUQLXSPDCSHBQRHQ,AEJU4L3ZM2GTILSJZZSNSF6VUOIA,AFVD66VQMSHPDT3A6HBBBGKRXBZA,AELKHQXVSSG6NHXLFJLLNEFRQQUQ,AGYSMAC6V6RFJJOHG2FIRPOZ6CSQ", "user_name": "Pavan A H,Jayesh bagad,Shridhar,rajendran,karuppu k,Akshay wani,Abbimaniu Singh,VISHAL H BADSHE", "review_id": "R2X090D1YHACKR,R32ZCIH9AFNJ60,R3N57EVVG0EHAF,R3QWLE8JHROKC1,R2VTSDOOUTSQ5X,R3E6FZ75Q074KH,R1SYBQLTPFCW20,RYQT96J8HPIXE", "review_title": "Worth for money - suitable for Android auto,Good Product,Length,Nice,Original,Very good quay Cable support fast charging.,Original MI cable for charging upto 33 watt,I am veri happy with this product as it provide turbo charging.", "review_content": "Worth for money - suitable for Android auto... my purpose served in car....got it for Rs.150,Everything is Okay. But packaging is not good feeling like seller gave is used cable.,Good product,Good product but cost is more.,Original cable,I bought this cable at 129. Using this cable for Android auto in my car. Perfectly works without any glitch.,Original MI cable. Will charge upto 33 watts. Got it for Rs 150.  I have 67 watt charger and I want a cable for my car so I went for it. I checked the performance with battery charging app. The charging speed is exactly half of my 67 watt original cable. Go for it.,It provided me turbo charging. I recommend for all Redmi note 10s mobile phones. As it provide turbo charging. I am veri happy with this product.", "img_link": "https://m.media-amazon.com/images/I/31XO-wfGGGL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/MI-MTCY001IN-USB-Type-C-Cable/dp/B08DDRGWTJ/ref=sr_1_90?qid=1672902998&s=computers&sr=1-90"}
{"product_id": "B079Y6JZC8", "product_name": "ZEBRONICS Zeb-Comfort Wired USB Mouse, 3-Button, 1000 DPI Optical Sensor, Plug & Play, for Windows/Mac, Black", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹139", "actual_price": "₹299", "discount_percentage": "54%", "rating": "3.8", "rating_count": "3,044", "about_product": "DESIGN: Zeb Comfort+ is an ergonomically designed USB Optical mouse that has an easy plug-and-play mechanism.|BUTTONS: The mouse comes with 3 buttons including the left-click, right-click, and scroll wheel buttons.|OPTICAL SENSOR: The mouse has an accurate optical sensor for navigation with 1000 DPI.|CABLE LENGTH: 1.2 Metres|Hardware Platform: Pc; Operating System: Windows 7", "user_id": "AFD574B3LT7V3OO5CRMLVYUWVDLQ,AH7GUHDHH6BRJQAKZSWN2SRQGC3A,AG6YFIPWZK7TFOKVJJTYNM25TCUQ,AHLAXX7RIGY6XLKCS5X3RRIMJMHA,AHVG34735ZFEUTFNWTE3CN6DUPOA,AGWB4RQND75EY257QYGB2MPW655Q,AFHTTR3AJAXNL2L2DCMTWPIBZELQ,AGQ7HOUDA7K64AQCEWQCKTRE2X2Q", "user_name": "Saikat Chakravorty,Rajasekar K,Sankar Ganesh,Sivakumar K,Ritu Singh,Subrata,Bishwa paul,amazon user", "review_id": "R2SLVB4IDEDVF4,R2RV27ZD33RI6P,RADJ27GF3JOCA,R3EL9BC8AYLS8M,R3P1N9EPS61ITV,R3IXD6WLRFIN2Y,R3QEKYN8ZHH98T,R3RZ9TPNV34433", "review_title": "Nice,Value for money.,Compact and easy to use,Worth to buy,Clicks are hard but good allover,Good!,Avarage,Hard buttons and harder scroll wheel button", "review_content": "Build quality cheap plastic ka h 🥲,Mouse functions smoothly.  Buttonclicks perfect. Little bit hard.  Should become easier after some time,Overall good value for money, compact and easy to use. Button bit tight to click. Rest is good no issues,Worth to buy,Budget friendly,Good!,Working fine,3month,Mouse works well, but buttons are pretty hard, especially the scroll wheel button is even harder. The rear end of the mouse, the bulgier side is quite higher hence feels a bit pushy on the palm area of my hand. If you have soft hands, you better explore other options, if it is for rough use then is a good buy.", "img_link": "https://m.media-amazon.com/images/I/31vS-1ot-HL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zebronics-Wired-Optical-Mouse-Black/dp/B079Y6JZC8/ref=sr_1_91?qid=1672902998&s=computers&sr=1-91"}
{"product_id": "B0856HNMR7", "product_name": "boAt Rockerz 370 On Ear Bluetooth Headphones with Upto 12 Hours Playtime, Cozy Padded Earcups and Bluetooth v5.0, with Mic (Buoyant Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|On-Ear", "discounted_price": "₹1,199", "actual_price": "₹2,499", "discount_percentage": "52%", "rating": "4.0", "rating_count": "33,584", "about_product": "Battery: Rockerz 370 offers a playback time of up to 12 hours.. Frequency Response 20Hz-20KHz,Sensitivity (dB) 79dB±3DB,Impedance 32Ω. Driver Type:Moving Coil Driver|Bluetooth: It has Bluetooth v5.0 with a range of 10m and is compatible with Android & iOS|ANC: NA. No. of Mic: 1. Other Inclusions: Micro USB Charging Cable, Warranty Card, User Manual|Lightweight Ergonomic Design with Easy Controls|Instant Voice Assistant. Drivers: 40mm Drivers with boAt Signature Sound. Cozy Padded Earcups.|Rockerz 370 come equipped with latest Bluetooth v5.0 for instant wireless connectivity. The powerful 300mAh battery provides up to 8 Hours of audio bliss. 40mm Dynamic Drivers supply immersive High Definition sound|The headset has padded earcups for a comfortable experience. The headphone has been ergonomically and aesthetically designed for a seamless experience. One can connect to Rockerz 370 via dual modes for connectivity in the form of Bluetooth and AUX", "user_id": "AFEDVL6QIKT4RDYRHGMUZAU2JSQQ,AHQQOEE4QQIMIDYPNWVDHOJKSHFQ,AHTMLMISSWFEKD2NMUHWQEZIQYFA,AGMI265U3VU5FUCE4AIUVKPIECJA,AEX4YXQCRJ7VNPCMPBWKL52L37JA,AEYY4VXTPNYVKYAOEBWGAWONPIDA,AGKQDWDU5LWC5OCTKCXLET7EJENQ,AEAQ7J2ZTABMBDMZHCHUBIMR3RHA", "user_name": "Sandeep K.,Prabha Pandey,Atif,Rahul R,Mukesh vaishnav,Adnan,Aniket,Shivam Rajput", "review_id": "R2JKCB5MNWKW9N,R2XZB8KBJN241T,R1R3NYQMODNGM8,R3CICAEO8AI5Q4,R1K987VOWZ2H3F,R2JA4G9JMA2D4O,R1KZ1EN293BV13,R66WLAR3WTRKN", "review_title": "Best quality & value for money,Great sound quality,Atif,Value for money,Good one at this price range,Good Headset,Good for a year use the cousin covering will get torn with time,Good", "review_content": "Sound quality is superb noise cancellation is extremely well but bass quality  needs improve ment.,Overall its great the only thing thats poor is the range its not even half a meter! Rest is good,Good,It's a very Good headphone compared to it's price. Previously I had used Sony headphones and those were bit expensive. But I can surly say that these headphone can give you satisfactory quality.,Good battery backup,Like the color and bass,Build quality is not good enough the cousin cover get torn with use fit gets loose over battery life is decent,Like", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41Beq4WLggL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Rockerz-370-Headphone-Bluetooth-Lightweight/dp/B0856HNMR7/ref=sr_1_92?qid=1672902998&s=computers&sr=1-92"}
{"product_id": "B0B12K5BPM", "product_name": "ZEBRONICS Zeb-Astra 20 Wireless BT v5.0 Portable Speaker with 10W RMS Output, TWS, 10H Backup Approx, Built in Rechargeable Battery FM Radio, AUX, mSD, USB, Call Function and Dual 52mm Drivers Multi", "category": "Electronics|HomeAudio|Speakers|BluetoothSpeakers", "discounted_price": "₹1,049", "actual_price": "₹2,299", "discount_percentage": "54%", "rating": "3.9", "rating_count": "1,779", "about_product": "TWS connection|BT v5.0 / AUX / mSD / USB / Built in FM radio|Call function support with BT connection|Built in rechargeable battery supporting up to 10H* playback|Dual passive radiators for deep bass|10W RMS (5+5) with dual 52mm drivers|Media & volume control with the button interface|Matte finish body with front metallic grill", "user_id": "AHUXD3GCY22BRMQLWN5ZEB3TGGAA,AEPHHPGRU3LZVJ3GOQ6HX5WSLUJQ,AHXQZN3N55YAWSIZRNKHRWEQ5XZA,AGKQIHXOMAM6DN7XIUVFFHL554LQ,AF76YQ4VNWMTEZXSFQDAICDLYFXQ,AHHF6TY4V2LICXXBWSKTTCUWRGAA,AE3Y3RIVJMUAJO2ABMM6V7I5V7QQ,AFGC6EORGDR3Y2COS4G5WRLHLPNQ", "user_name": "Pranav Pacholee,Divakar,ANUDEEP KUMAR SINGH,Lathip,Abhijeet Banerjee,ADINARAYANA,Rishi shukla,Dadu saikia", "review_id": "R2F293IOSSP7QX,R35TMVD8F23NNK,R2RP81I94A906C,RB6PFQQVU7KUM,R37XBQ83OS51H0,R2XMCSACFNMHSM,R3OAPCUWZ6KJ0E,R369ID2WU66LI8", "review_title": "Awesome sound, but FM is not clear,Good Product!,Guarantee Nahin de rahi hai kharabi hai,It's nice worth for rate,Good product,sufficient sound clarity and connectivity,Sound is best bass is best 👍💯,Good 👍", "review_content": "Bluetooth audio sounds really nice, decent bass too, but FM reception is weak. Even after plugging in the usb cable (antenna) the FM reception is not very clear. Its not able to catch all stations and even when it does catch a station, moving the speaker causes problems with the sound clarity. I tried a few other similar speakers from other brands and they all have this problem. Apparently the FM circuit in these soundbar is not good.,Worth for buying this speaker. Sound quality is good and loud. Weightless easy to carry. Good battery backup. It's coming for more than 4hours. Not tested properly but having good battery backup for sure. Don't expect bass. Having little bit but don't expect more. I'm writing this review after 5 days of usage.,Yes,Everything fine,Nice and decent product. sound is good. Bluetooth connectivity is good. you Call microphone is good.,cute and nice sound in medium hall.,https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71PlHv2YN-L._SY88.jpg,Good 👍", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31ZMMGdh5nL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/ZEBRONICS-Zeb-Astra-20-Wireless-Rechargeable/dp/B0B12K5BPM/ref=sr_1_93?qid=1672902998&s=computers&sr=1-93"}
{"product_id": "B08MTCKDYN", "product_name": "Gizga Essentials Spiral Cable Protector Cord Saver for Mac Charger, iPhone Charger, Wire Protector, Lightweight Durable Flexible Wire Winder for Charging Cables, Data Cables, Earphones, Pack of 10", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Décor", "discounted_price": "₹119", "actual_price": "₹299", "discount_percentage": "60%", "rating": "4.1", "rating_count": "5,999", "about_product": "WIDELY USE - SPIRAL TUBE CHARGING CABLE PROTECTOR are designed with highly flexible silicone and can be used as phone charger cord protector and phone charger saver to completely protect cables for all devices including, cell phones, computers, laptops, apple / android watches, lightning cables, pc’s, the list goes on and on.|EASY INSTALL - Besides protecting all Your USB cables / cords, SPIRAL TUBE CHARGING CABLE PROTECTOR feels surprisingly nice and is fun to install on any wires end. Use it as your headphone cord protector or charger cable cover. Simply touching it can relieve your stress too! Yet, even better, the Lightning Cable Protector looks super cool. It doesn’t get any better than this!|DURABLE - Works with virtually all computer and cellphone cables. You can even use it in almost anything like as pet cable protector, chewsafe cord protector, cord protectors from pets, wire protector from pets and as a wire protector tubing for phone and computer cables. These cable protectors can protect wires and power cords from dirt, frays, tangles and knots.|PROTECT CABLES - Spiral Tube charging Cable protector is your permanent fix to all those damaged lightning cables. It perfectly works as a cable strain relief or a critter cord so you won't have to deal with cable repair or iphone cable repair and frayed wire repair. Wrap the cable protector onto Your preferred cable as an iphone charger end piece. SPIRAL TUBE CHARGING CABLE PROTECTOR will wrap around any wire just like a protective sleeve would but with more mobility.", "user_id": "AFLBLMPC4WUEDUWHLHBQVY5AKH2A,AE4ZXGSA2CQOGKH3N7GS7WNS67MQ,AHIQ7HT7HDEW67HOPSLTFF2TH2BA,AFWWWV4JHTQ4PJI5WUC73YTHBQCQ,AHPI2KLLZMZK5CGEZ6ILSIA4FHJQ,AFGQKKARKUCRSUEBE2EETDPNLTEA,AGCD3EP3GKDT4URL7GHQPM4Z7DFA,AEUZZSADD4LNC6NNCPAYMKDKGUKQ", "user_name": "Velir,Dileep Venigalla,chakrapani p,kuldip teli,Shanky,Rama,Saurabh Srivastava,Vineeth G", "review_id": "R10KEMT1N336ZD,RL01KZO95GX4F,R1Q721FI3A7XLK,R34MTIAB8IHAI,R1LG1DNA516T7L,RFH8DR3A2O8BG,RFA922H587JFN,R10BFD806POSOX", "review_title": "Awesome Product,Good product,Good quality,Good but overpriced,Gud quality but expansive,Not bad,Ok,Worth product", "review_content": "It is good for data cables...I liked it,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/81QHClS+4gL._SY88.jpg,Nice,So basically its good product with good quality, but this product is overpriced because same product from different brand are selling at 25% or more less money, still i bought this because of the brand name.,Gud quality and packaging but slightly expensive.,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61W2kONTcaL._SY88.jpg,Ok,Using this for my mobile charging cable it’s useful for not to brake the cable", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/511g3fIVsqL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/GIZGA-Protector-Charging-Protective-G55/dp/B08MTCKDYN/ref=sr_1_94?qid=1672902998&s=computers&sr=1-94"}
{"product_id": "B08CF3D7QR", "product_name": "Portronics Konnect L POR-1081 Fast Charging 3A Type-C Cable 1.2Meter with Charge & Sync Function for All Type-C Devices (Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹154", "actual_price": "₹339", "discount_percentage": "55%", "rating": "4.3", "rating_count": "13,391", "about_product": "[CHARGE & SYNC FUNCTION]- This cable comes with charging & Data sync function for smartphones|[HIGH QUALITY MATERIAL]- TPE + Nylon Material to make sure that the life of the cable is enhanced significantly|[LONG CORD]- The Cable is extra thick 1.2 meter long, optimized for an easy use for your comfort at home or office|[MORE DURABLE]-This cable is unique interms of design and multi-use and is positioned to provide the best comfort and performance while using", "user_id": "AGYLPKPZHVYKKZHOTHCTYVEDAJ4A,AGTTU64JMX722LYCN3SOWLFPKPAQ,AFWD4ZTM7473CDWARHCDQKK73MTA,AEXCQM3FDLX3YL3UJWWUIAIUJT4A,AHUKYUWRUVRTB3IQGISXWTSPAWLQ,AFWW4UEXAJH7EAB5LTMKMSGLUN2Q,AFM5JL37WY7G6MLQUI4WAXUJME7Q,AFECO24WYFOU2KL7C3DMHTEHRU7Q", "user_name": "Tanya,Anu,Akshay,Vishal Sagara Shetty,Swatilekha Sarkar,Jithindas,IBRAHIM S,Sundaram J.", "review_id": "R11MQS7WD9C3I0,R2AKH69XQY8BY4,R8GBOLYUN5UP6,R1AYVO4R25KJTA,R1HT6XM787V7FV,R339XJL1GMKHA3,R175VFSB2A32HG,R35T9LXYBSP09G", "review_title": "Good for fast charge but not for data transfer,Good cable compares to local the brand.,good but doesnt last,Good product,Good Product,Good and worth it,very good material quality charging speed is 15 watt,Not a fast charger", "review_content": "The cable is efficient in fast charging but in quick data transfer. Overall fine.,I like the usb c  L shape. Nylon Shielded core wire it improves the life of the cable.,i think i buy these every 6 months or so. fast charging stops working after a while. probbly something to do with the cable design. the cable gets twisted over time and I suspect that breaks the high capacity wires inside. but i keep buying it because there arent too many options in an L shaped design,Good and durable product. Sometime the charges doesn't work on few adapters. there might be few cut off or something but works fine on apple adapter, Car charger, USB,The product is really good at affordable price.,Good and fast charging, and value for money,பொருள் உடைய கடினத்தன்மையின் நன்றாக உள்ளது சார்ஜ் ஏறும் வேகம் 15wat,Not a fast charger.  Very slow charging with 65w.  L-shape pin is very useful.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31dJ+lXJq3L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Portronics-POR-1081-Charging-1-2Meter-Function/dp/B08CF3D7QR/ref=sr_1_95?qid=1672902998&s=computers&sr=1-95"}
{"product_id": "B00LVMTA2A", "product_name": "Panasonic CR-2032/5BE Lithium Coin Battery - Pack of 5", "category": "Electronics|GeneralPurposeBatteries&BatteryChargers", "discounted_price": "₹225", "actual_price": "₹250", "discount_percentage": "10%", "rating": "4.4", "rating_count": "26,556", "about_product": "Used in CMOS battery|Used in car remotes|Used in calculators|Used in scientific instruments|Used in watch", "user_id": "AH3MVZYHGOVNKO5T5EWVT4HK6M7A,AEDGEVRXRPJZOKCKYHPSRPYFIDZA,AG5ZMUHXVOUVN5BBEDWNN56JLUVA,AF3QHAZ5V36AO5PE6AQGFZZSDCCQ,AFCLK65T5NMGQV7RXN3QJTOYNTNA,AHHZ7KJRSXG4SOCT5CYSHO3DWDMA,AEWZXQYKDB6JJD653R4I3TOIJXHQ,AEWMRL2WQK2553OVVG4CKRWSNYHA", "user_name": "Malik,Anil reddy,Sunil,Swamy,Athish,Vasanth Kumar U,T.Srinivasa rao,Jay Ravasa", "review_id": "R2DRWYU4KRZG8M,R2C4X2752MM324,R2XH62C0OMV1KN,RHNRKZTFXDK89,R4KUI529XXAL5,R2YBU1X775PBO7,R2SP06FB7XB3NM,R3TQ721HDLL0UC", "review_title": "Excellent Product,Good,👍,Meets purpose,Nice battery,Good,Value for money,Works flawlessly", "review_content": "Made in Indonesia, (thankfully not China).,Good for long use of remote,👏,Battery works as replacement,Serves the purpose, Good seller, Good battery life,Good. Worked for my Ertiga Car Key remote,Working good,Works flawlessly. Good Battery Backup:Good packaging.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/5145vqMSaTL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Panasonic-Lithium-CR2032-5BE-Battery/dp/B00LVMTA2A/ref=sr_1_97?qid=1672903000&s=computers&sr=1-97"}
{"product_id": "B07TR5HSR9", "product_name": "MemeHo® Smart Standard Multi-Purpose Laptop Table with Dock Stand/Study Table/Bed Table/Foldable and Portable/Ergonomic & Rounded Edges/Non-Slip Legs/Engineered Wood with Cup Holder (Black)", "category": "Computers&Accessories|Accessories&Peripherals|LaptopAccessories|Lapdesks", "discounted_price": "₹656", "actual_price": "₹1,499", "discount_percentage": "56%", "rating": "4.3", "rating_count": "25,903", "about_product": "PORTABLE AND CONVENIENT - Multipurpose Foldable Laptop Table is very effortless to carry anywhere as the metal legs of the table are foldable. It is easy to move the table around as it has smooth surface without rough edges.|STRONG AND STURDY- The tabletop is made up of Engineered Wood which can easily handle the weight of your heavy laptop. The legs of the table are made up of Aluminum alloy, which makes the table heavy-duty but lightweight. The 12 mm thick high quality engineered wood tabletop gives unmatched durability.|VERSATILE USE - The Multipurpose Foldable Laptop Table can be used as a laptop table, TV dinner tray, serving table for patients or kids, standing desk for office workers, book writing desk for kids, tablet holder table for pregnant women and standing desk|FUNCTIONAL ACCESSORIES - The Multipurpose Foldable Laptop Table has a built-in iPad stand groove for holding an iPad, smartphone or kindle. The desk comes with a table cup holder (in cup holder variant) to protect your devices from those contingent coffee spills.|AN EXQUISITE DESIGN AND FINISH - Easy to assemble and fold up for easy transportation and storage, Lap Desk fits nearly any size laptop or tablet, and it also has a place to put a mouse and books. The dimensions are 59.50 cm x 39.50 cm x 28 cm. Comes in beautiful colours and finishes with painted foldable legs for beautiful appearance.", "user_id": "AGXE6V4HYRRDGH33H3NE7PGF4D4Q,AFDW67WRZ2IJI7LQQP47LWZJHHUA,AFQVWAIJE5R6L6CSOOEAZ4SB4LNA,AEY3BCCYNITGIMQHCNTZIYDPA77Q,AEIYOPETQ6QHPCWMGJIFDTC5FQIA,AFBICVVDSWHTB37XUM72SGTRRL5Q,AFPMPHWQ374TQ7ZCW3RUEVPQLVSA,AGAGJNDYID4G47KUQZVTWOGT55JA", "user_name": "soma sekhar,Shreeg91,Jagadish,Zinal Bhatt,Amazon Customer,Ashutosh,Madhura,Dineshkumar", "review_id": "RF73D5K5ZPBIU,R34D9LRZ543WW0,RXSU1WELHKSJV,RDJYI5PWSD45Y,R1UTEEMGPZ5T12,R3LZFS4QTCAHA8,R1Y8IAT73QZGHC,R19NL3QGC4DMZ7", "review_title": "Good quality but one defect,It fulfill its purpose,The laptop stand is good but could have been better with a grip in four sides!!,Height mentioned is wrong,Worth The Money, Good Quality, but wobbles only on bed,Damage in transportation,Good product.,Durability and easy to use", "review_content": "The Table is good itself and also good grip on floor, one drawback is the edges on board are razor sharp and you might hurt yourself (i hurt myself). could be the best in price point just smoothing (maybe rounding) edges,Great to have for studies and laptop usageFor eating I wouldn't recommendIt slides to one side due to weight of laptopOverall it serves it's purpose ... Good one,Does the job but not stable in the bed because it has a curve design in four sides. If the four sides have a grip to support in surface like floor or bed it would have been a great product. Also the water bottle space was annoying because my laptop was big and i had less space for the mouse.,You have mentioned extra height , more than other brands tables , which is not , it’s the standard size height,Pretty sturdy table, very easy to fold, good rubber grip which holds the table on the floor firmly,What is really interesting is that it has a cup holder and a space for keeping tabs or mobile on the desk, a very handy feature.The only con of this table is that it wobbles if you keep it on your bed, but that is okay.Overall, a great product, worth the money,https://m.media-amazon.com/images/I/71NFBXkdADL._SY88.jpg,It's easy to fold and has a good stability.Overall a good product.,I ordered this for someone and they received the product on time, the product was same as described - go for it if you're on a budget", "img_link": "https://m.media-amazon.com/images/I/51EJirBX6bL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Multi-Purpose-Foldable-Portable-Ergonomic-Non-Slip/dp/B07TR5HSR9/ref=sr_1_98?qid=1672903000&s=computers&sr=1-98"}
{"product_id": "B0819ZZK5K", "product_name": "SanDisk Ultra Dual Drive Go USB Type C Pendrive for Mobile (Black, 128 GB, 5Y - SDDDC3-128G-I35)", "category": "Computers&Accessories|ExternalDevices&DataStorage|PenDrives", "discounted_price": "₹1,109", "actual_price": "₹2,800", "discount_percentage": "60%", "rating": "4.3", "rating_count": "53,464", "about_product": "The 2-in-1 flash drive with a reversible USB Type-C and a traditional Type-A connector.|Seamlessly move content between your USB Type-C smartphone, tablets and Macs and USB Type-A computers.|Free up space on your USB Type-C smartphone so you can take more photos.|Automatically back up photos using the SanDisk Memory Zone app|High-performance USB 3.1 Gen 1 drive with 150MB/s read speeds lets you quickly move your files to your computer.1|Dual-purpose swivel design protects connectors and features a keyring hole to take your drive on the go.", "user_id": "AEZPNXZLF5U7XEX6TOW3J56C3XDA,AGG3ECGCIKNPZJEVJKMFI24VBSCQ,AHJWICC6V4BPVHNSGZ3FCIC4KUBQ,AF3SNGFXLO2ONOHN3SHCJZMEWYFQ,AHTBWFIYIZUPOLJC7KOWKDPK4PGQ,AGNE5T4E7SEMJUDM4COI6JBNJQBQ,AFMW4FWA573DFJ2FLM5SVSJ2RABA,AFMZYKMUK4P6MPASSKTR6OB22Y2A", "user_name": "Amita,Ganesh,zhiv,Sarasij Pal,ज्ञानेंद्र सिंह,Ehsan Ul Haq,Venkatesan,Khimanand", "review_id": "R3PB00C7ZEBAMG,RVUGXND7SHFW8,R9LR8JP82ED2X,R32N5S5Q1W3RHU,R2W4T3SW0RJWWT,ROTKHGUAN5KUR,R2J5Z02Y4QL66Z,R2Z8H0DEYU31U1", "review_title": "Fast, but heats up and throttles...,Its a Useful One.,Good product at this price range,It's looking good and fast,Storage issue,Worth,Good,Very good", "review_content": "The sequential read speeds for a 8gb video file (after reformatting to exfat file system) were 157MBPS constant for a 8.7GB video fileNote- the computer being used for testing has a pcie nvme ssd and a fairly modern and powerful cpu, but machines with a decent cpu and an average SSD ought to perform simillarly with usb 3.0 or aboveThe writes though, were a different story, as in the beginning for about 1.5 gb, the speed was 56MBPS, but then it dropped to 33, and it started throttling because of excessive heating.Difference between the go and the luxe- THIS IS WHERE THE ULTRA DUAL LUXE SINES AS IT DOESNT THROTTLE MUCH, BUT THE NORMAL GO DOES.The throttling occurs due to excessive heat generated, and because of it's plasticky build, it is unable to dissapate that heat, which can harm the NAND flash storage inside it; to prevent this, it reduces its speed and transfers in chunks of about 40MB before pausing briefly. It is a good thing as it prevents damage to the storage component, hence increasing lifespan, but at the cost of speeds. But after 33mpbs, it further drops down to 20, then 13 and becomes stable there. Here it's just too slow for heavy everyday use like transferring videos for editing. (Room temp 24C), your milage may vary with different types of files, computers and ports))But for the vast majority of users, who just use it as a backup, or for once in a while storage, or for regularly working with small files like pots and photos, it's perfectly fine. Its fast, makes it convenient to transfer files between phones and laptops and desktops, because of it's versatile setup of a changeable usb c and a setup. It feels strong and durable, even through its made if plastic.For the price of 719rs (for the 64gb variant) it is not very affordable. A regular usb a pen/flash drive and a type a to c adapter combination (as illustrated above, available for about rs 130 as of writing this review, and a 64GB flash drive costing anywhere between 400 and 550rs as of writing this review) will cost less. But a regular usb drive and the combo will not be as convenient and fast, but again it's not required for most people not to mention that the adapter is quite useful elsewhere as well; but for the small niche of users who want speed and have small files (below 1.5GB at a time) to work with, it's recommend.Otherwise going with the luxe (for performance) or the adapter setup (better value for money) as mentioned above will be a better decision.Hope you find this effort helpful,It would be better if the holder of pendrive is strong enough.And it's very hard to insert into my type c mobile (lgg8x).I got bit scared thinking of it will get broken.Better to buy this in offer the price gets less than I bought. I got it for 720₹.,pros:-received product on time with good package-nice design, portable and easy to use-optimum data transfer speed and reasonable pricecons:-built quality could have been better-type c is not as easy to plug and unplug,It's look good with nice finish. It is very convenient to use. One drawback is plastic is soft it seems fragile compare to metal pendrive.Plastic material is thin and light weight,Storage mentioned 64 but it has only 57.2 gb.Value for money.,Good product, but not so sturdy,Good,Very good product", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/410l0pKc2OL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SanDisk-Ultra-Drive-Pendrive-Mobile/dp/B0819ZZK5K/ref=sr_1_99?qid=1672903000&s=computers&sr=1-99"}
{"product_id": "B096VF5YYF", "product_name": "boAt Xtend Smartwatch with Alexa Built-in, 1.69” HD Display, Multiple Watch Faces, Stress Monitor, Heart & SpO2 Monitoring, 14 Sports Modes, Sleep Monitor, 5 ATM & 7 Days Battery(Pitch Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹2,999", "actual_price": "₹7,990", "discount_percentage": "62%", "rating": "4.1", "rating_count": "48,448", "about_product": "Alexa- Alexa built-in Voice Assistant that sets reminders, alarms and answers questions from weather forecasts to live cricket scores at your command!|Screen Size- ;1.69\" big square colour LCD display with a round dial features complete capacitive touch experience to let you take control, effortlessly.|Watch Faces- Multiple watch faces with customizable options to match your OOTD, every day!|Brightness- The ambient light display allows automatic adjustment of brightness on the watch, suited to your environment|HR & SpO2- The watch comes with a stress monitor that reads your HR to indicate stress levels.It also monitors your heart rate and SpO2 (blood oxygen levels) to keep a tab on your overall health.|Sleep Monitor- Track all stages of sleep every night and keep a tab on your sleep health with the sleep monitoring feature on the watch.|Sports Friendly- Its 14 sports mode and 5 ATM dust, splash and sweat resistance makes it the perfect fitness companion to have.", "user_id": "AE6CROVUGPHR7BRT5JASNRWSPBVQ,AHL5MROK5N63VXVBMKVZJ3GNB7ZQ,AFPCHRP52XCWFQ625WEACPUTXO7A,AHIUG7OVT3SRXSCNUZPNKHTQH57Q,AGVPDZ73B6LF5BBIZ3YGX2WRGJ2Q,AEQEIF23AAXTOBTLBICNMLFK662A,AGDPIWXL6XEBCXAGBYTER5S2JZ4Q,AFPDHMQW4AYII5KK7CLG4MMTIAHA", "user_name": "archit,Arjun Sen,Divya Devkar,User,Vaishnavi Sonker,Santhosh,Sai raj,Mohammed.afsar", "review_id": "R1ZQQKZCCG4KD2,R1OHAWNCB4K26S,R1A7EDRAMKIXJ6,R2H3UO33625F4U,R3UX0I4P6QYZDT,R2WBZ23WWYQWIS,R2VDCJG8SCEN6I,R1NEXD5T49KYP9", "review_title": "NOt worth the money,Good budget smart watch with Alexa,👍,Good product,I don't have flashlight function and speaker is not working,Nice,It's little cost,Wach not working", "review_content": "Review OverviewAverage2.7The Boat today launched the ‘ Boat Xtend ‘, the company’s latest budget smartwatch with a price tag of Rs. 2,999. The Boat Xtend Smartwatch comes with a stylish design resembling the Apple watch. Moreover, it has built-in Amazon Alexa support, SpO2 tracking, stress tracking, and much more. Coming in a budget segment, is it worth it? Should you buy this smartwatch? If you too have such queries, then there is nothing to worry about. It is a detailed review of Boat Xtend Smartwatch which will clear all your doubts about it.ContentsBox ContentDesign, Build & ComfortDisplayWatch UI And FeaturesAlexa SupportWatch FacesBoat Wave AppAccuracyBatteryFinal WordsBuy Now:Box ContentBoat Xtend box contentSmartwatch in black&gold colourCharging clipUser Manual and warranty cardDesign, Build & ComfortWhen buying a smartwatch, one always thinks about its design and look. Apart from features, design and build is another major aspect one should take care of when buying a smartwatch. The boat has worked on its design this time which brings it to a premium side in terms of look. The design is inspired by the Apple Watch 3, but it cannot be compared to that. Obviously, in every aspect, Apple Watch 3 would be much better than the Boat Xtend Smartwatch. Redmi Watch as well as Amazfit Bip U Pro has the same shape and design, but the build quality is much premium on this one.Boat Xtend design and buildI personally don’t like the color scheme of this Boat Xtend Smartwatch. The black color variant comes with a golden color metallic frame. I believe the gold color would fade away after some time. There are three other color variants, which also don’t look stylish as this one. However, that is my personal opinion on the color scheme, so maybe you might find the color scheme to be good.Boat Xtend designThe watch has 5ATM water resistance. It has silicon straps, which are quite comfortable. The straps are good quality straps which you will find comfortable with regular usage.DisplayComing to the display, the watch has a 42mm square shape display. What you see on this one is a TFT panel. The screen has big bezels, however, the good part is that the screen goes completely back when it is off, so you won’t notice the bezels, and the screen quality won’t feel cheap at all. It doesn’t have an always-on display, but we cannot complain about that. The watch offers a screen on time of up to 20 seconds and up to 12 levels of brightness control.Boat Xtend display qualityI find the display quality of the Boat Xtend Smartwatch to be better than the previous smartwatch from Boat. View angle is good on this one, and you can clearly see content on this smartwatch even in the sunlight. The color on this one is not very saturated, but this isn’t something that we can complain about in this price range.Watch UI And FeaturesThe UI of this smartwatch is clean and easy to use. There is a single button on the watch which works as the power/off button as well as the back button. Moreover, the display is a touchscreen display that works without any problem. There isn’t much animation on the bar menu, and the navigation is simple, so you won’t find it difficult to use. However, the watch may lag a bit. The company has done cost-cutting in terms of the processor, that’s why you may find it to lag a bit, but it is OK, and not a big deal at the price point you get it.Boat Xtend UiThe watch offers all the basic fitness features such as daily activity (which includes total steps walked, calories burnt, and time), heart rate, sleep tracking, stress tracking breath training, SpO2 training, meditation, find my phone, and music control. Apart from that, there are 14 different support modes on this watch. I tried a few of them, and they worked fine. The watch notifies you of the incoming calls, messages received, and various other notifications in detail.Boat Xtend smartwatch reviewAlexa SupportThe main highlight of the Boat Xtend is the Amazon Alexa Support. The watch has an in-built microphone, and you can access it by long-pressing the back button. Do note that you can only do some basic tasks with Alexa on the watch like setting an alarm, setting a timer, and such. Well, it is a good thing to have Alexa on a watch, but you won’t find it very useful. Probably you will use it for a day or two out of excitement, and then you won’t prefer using it because it only does some basic tasks. So, even if Boat missed this feature, it won’t be a problem.Boat Xtend Alexa supportWatch FacesThe next cool thing about this Boat Smartwatch is the watch faces you get on this one. You get more than 100 watch faces on the watch, and probably more watch faces will be added to it. Moreover, you can also set a custom watch face as well.Boat Xtend watch facesBoat Wave AppYou will have to download the Boat Wave App to use the watch. The app is available for both Android as well as iOS devices. You won’t be seeing bugs on the app, and it works perfectly. I haven’t noticed any problem with connectivity like frequent disconnection. The interface of the Boat Wave is clean and simple. You will get all the fitness-related options and all the watch settings on the app itself.Boat Xtend boat wave appAccuracyAccuracy is one of the important aspects that one should take care of when buying a smartwatch. So talking about the accuracy, I tested everything on this watch, from normal walking to running, sleeping, and much more, and I find the results to be accurate.Boat Xtend accuracy testCompared to Realme or Redmi Watch, the result was the same on all of them. So, there is no problem with the accuracy. I don’t find the results to be accurate on most of the budget fitness trackers, but yes, this smartwatch is accurate in terms of fitness tracking, sleep tracking, and everything it does.Boat Xtend accuracyComparing it to the Noise watch which we tried recently, the stress level as well as the SpO2 tracking is much more accurate on this one. It also has the option to track the menstrual cycle in women.Boat Xtend accuracyBatteryYou get to see a 300mAH battery on this one, which the company claims to last 7 days. However, if you use most of the features of the watch, then the battery will last about two and a half days. If you keep the brightness low, then the battery will last about 3-4 days. I find the battery life to be a downside of the watch. It comes with magnet hook charging support.Final WordsBoat Xtend Smartwatch is a decent smartwatch from the Boat. It offers all the basic fitness features you will find on a budget fitness tracker, a good display, Alexa support, good design and build, and much more. The smartwatch at this price is quite good. Personally, what I didn’t like about this smartwatch is its color scheme. However, if you like the color scheme, then I would recommend you to go for it. Overall the watch is good with nothing to dislike about it except for the battery life. The battery life on this one is quite low. The company claims it to have a battery life of 7 days, but with regular usage, it will last for 2-3 days. If you are looking for a good smartwatch under Rs.5000, and you can adjust with the battery life, and you like the color scheme, then I would recommend you to go for this smartwatch. It offers all the features that should be there in a smartwatch under Rs.5000.,Pros:1. Premium build quality with matte finishing- sturdy polycarbonate frame, good soft silicone straps that r absolutely flush with the body of the watch. Attractive, trendy colours.2. Heart Rate (except heart rate spikes in weight training), Pedometer(steps counter) are accurate but SPO2 is off by +/- 2% when compared to Pulse Oximeter readings. But most smart watches offer the same accuracy. Sleep tracking is accurate only for bed time & wake up time, duration but stages of sleep are inaccurate. Light, deep sleep, waking detected but no REM sleep detected. Sleep data from the watch synchronises smoothly with Boat Wave app. Issues warning msg if watch not worn on hand properly and does not detect data of surfaces.3. Large (1.69\"), clear bright, sharp LCD IPS display even in the sun.4. Touch not smooth, experienced jitters. UI also lags at times & after attaching the tempered glass sometimes some functions require 02-03 taps to work. But acceptable scrolling response if finger moved diagonally instead of vertically.5. In app GPS works superbly. Excellent route tracking on the map. This feature is not advertised in their description.6. Bluetooth 5.0 connectivity is good if mobile is kept in close proximity(7m). The Boat Wave app must remain running in the background at all times.7. Definitely splash proof though did'nt take the risk of submerging the watch.8. All notifications are working, no problem with call alerts or SMS msgs or social media app notifications. No lags at all though there is provision for a 3 sec lag which can be turned on.9. Alexa works superbly but since there is no speaker, info is displayed on the screen. My Wipro Smart Bulb, FireTV stick can be controlled easily using the inbuilt Alexa on the watch. Alexa can do mathematical calculations, currency conversions, even foreign language translations, apart from supplying info on anything under the sun. But ofcourse, Alexa cannot make calls. Alexa can set alarm, timer also.10. Sedentary alert, drinking water reminder, stress alert, menstrual cycle alert, alarms, timers function well.11. Boat Wave app connects easily & no lags observed. Data syncs smoothly with Google Fit app. Excellent health reports and motivational rewards system in the form of badges. But settings can be changed only through the app and the watch needs to be restarted for the new settings to be effective.12. Training, Sports modes r good.13. Guided Breathing mode is also good.14. Find my phone works well.15. Extremely stylish, light weight & comfortable for all day wear.16. 07 watch faces available in the device with 04 preset which cannot be deleted. The rest can be changed from the Boat Wave app.Cons:1. Lacks vibration intensity control.2. Lacks Camera control shutter. But can't figure out its use as my handset accepts both voice commands & gestures to click pics.3. No quick reply messages for notifications/call alerts.4. No call acceptance or silencing feature. A work around can be if bluetooth handset is connected at the same time.5. SPO2 is not accurate and sometimes freezes at 97%. But this is common in all smart watches.6. Battery does'nt last more than 03 days if continuous HR measurement is turned on. Otherwise easily lasts for 7 days.7. Watch faces are very childish. Expected better quality designs. Company can easily improve on this in their next update.8. Amazon Prime only replacement, no refund policy is not good. At least colour change should be allowed once.9. Music control feature does not display the title of the song.10. No BP monitoring or temperature monitoring feature. Smart watches usually do not provide reliable BP data.11. No calling feature. But it does'nt matter as most don't want conversations to be public.12. A bit large for narrow wrists, band @22 mm is a bit wide.13. Company should provide a tempered glass protector. No mention of protective glass on the display mentioned. Have attached a Scot tempered glass purchased separately.14. There are actually only 10 sports modes. Boat has bloated the list with Indoor-Outdoor combi of 4 sports (Walking, Running, Swimming, Cycling).15. There is no light sensor. Auto brightness is only time dependant but works well.Was a wedding anniversary gift for my wife who liked it very much even the colour- the evergreen, classic gold-black. Overall the best smart watch with Alexa built in, available at the budget price point of under Rs 3000. An excellent Fitness Tracker but average Health Monitor.,👍,Plz add calling feature with this,Otherwise it is ok,Good,It's little expensive but okkk,", "img_link": "https://m.media-amazon.com/images/I/41pfjyUPZLL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/boAt-Smartwatch-Multiple-Monitoring-Resistance/dp/B096VF5YYF/ref=sr_1_100?qid=1672903000&s=computers&sr=1-100"}
{"product_id": "B08QJJCY2Q", "product_name": "Tizum Mouse Pad/ Computer Mouse Mat with Anti-Slip Rubber Base | Smooth Mouse Control | Spill-Resistant Surface for Laptop, Notebook, MacBook, Gaming, Laser/ Optical Mouse, 9.4”x 7.9”, Multicolored", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Keyboard&MiceAccessories|MousePads", "discounted_price": "₹169", "actual_price": "₹299", "discount_percentage": "43%", "rating": "4.4", "rating_count": "5,176", "about_product": "9.4 Inches X 7.9 Inches) 240mm x 200mm x 2mm Size: This mouse pad is ideal for Gamers, Graphic Designers, Students, or anyone using mouse for long sessions. This helps to improve the gaming experience for gamers or the work efficiency in the office.|Durable Manufacturing Design with Enhanced Presicion: High-density premium texture which was processed in high temperature and high-pressure chamber to ensure long-term use without deformation and degumming.|Ultra-smooth Lycra Cover: Our mouse pad adopts high-quality Lycra cloth on cover for smooth gliding. It was optimized on fast movement while maintaining excellent accuracy and control. It is compatible with mechanical and optical mice.|Works with Laser, Optical Mouse, Bluetooth Mouse.|Non-slip Rubber Base: The soft and dense non-skid nature rubber base keeps the pad firmly in place. It provides stable operation of the mouse. Just immerse into your work or games without worrying about the annoying mouse pad movement.", "user_id": "AG7XUAMM5BZSSPCBAQJ3YGYSIPXA,AGS6JTKZGW3L2TCNL3ERIOHLMCGQ,AFI4YPCZQHDV6ZO7ZJS4IEGDMNMA,AH7WGTWJ5AZHJIATOQGSXBUJ5ENA,AEQVMOXFRHZEVVSM4JNAJ7T3UHPA,AFC5NBFKNTHLIZE4PFLSCEIUHAYQ,AHWWTEG22SBYSSAAMFW4EKBWFJ2Q,AHZS47WK6D5XJ6FS6DINGACMRQKQ", "user_name": "Divya Nancy,Jay Mishra,Md Kalim,Saktyy,Venkat goud,Amazon Customer,Rahul Guha,Murugan", "review_id": "R10758I9J937X1,R2QT07V4QXKIFY,R2BLT775YXVSXH,R3V1U8IIB8FFO2,RVBV8BEJ26OG6,R1LXTDC37JH60V,R1ICRMTTWYOFPK,R1HTJYYR59HC3S", "review_title": "Nice product,Size is not to big not to small,I liked it,Ok,Really good,Thinner but nice,Superb product as quality and comes at affordable price.,Costly mouse pad", "review_content": "Nice product,if you want to use your mouse for gaming and stuff life photo editing than please dont purchase thisthis product is for the mouse which is used for web surfing , pdf reading , study , ms office , pros:durability 5/5printing 4/5spill resistance - idkgood for 3200 and 2400 dpi mousecons:too small for gamingvertically it is not so big if your mouse is big[gaming mouse]other than that everything is good total points 4/5,It's very smooth to run the mouse very fast  for gaming and for casual work,Ok,,It's thinner than my existing one but works fine e..looks nice,I would suggest anyone who needs a mouse for daily use due to office work or gaming purpose superb deal at this price.,Mouse detection is good but costly mouse pad", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51SzLWO7e+L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Notebook-MacBook-Computer-Anti-Skid-Mousepad/dp/B08QJJCY2Q/ref=sr_1_101?qid=1672903000&s=computers&sr=1-101"}
{"product_id": "B07L5L4GTB", "product_name": "Epson 003 65 ml for EcoTank L1110/L3100/L3101/L3110/L3115/L3116/L3150/L3151/L3152/L3156/L5190 Black Ink Bottle", "category": "Computers&Accessories|Printers,Inks&Accessories|Inks,Toners&Cartridges|InkjetInkCartridges", "discounted_price": "₹309", "actual_price": "₹404", "discount_percentage": "24%", "rating": "4.4", "rating_count": "8,614", "about_product": "Superb savings with extremely high page yield;Compatible with L1110/L3100/L3101/L3110/L3115/L3116/L3150/L3151/L3152/L3156/L5190 Epson Printer Models|Instant-drying and water resistant documents for professional business quality prints|Protect your investment, quality and longevity of the printer|Country of Origin: Indonesia", "user_id": "AEQGYJXCSCCNZSPU6KO2ROAMEJXA,AFAXMU7HOTIJ56JF2AK52OFSTR5A,AEDN6ICRLDC6CVKYHK3F5747TF7Q,AEDKALHSURZRICZ2LRUS4QMUGK5A,AHG53EP2KNCQJLYG56QPMWGNY3MA,AF2C67JL7AXARCQIW5JJGKTMIWQQ,AGPWV7WDFN56ZITTHJJTONXPBBGA,AGDVP275BZYGQLMEGEB3RSVZUS2Q", "user_name": "Genuine Reviewer,Rajib Barman,Jhala Digvijaysinh Pravinsinh,sunil,Jayashree,Mohammed Saleem,Daljeet Dahiya,Ujjawal Singh", "review_id": "R4S7MHI8MJKLU,R1FNXA35SQ0AGR,REM1ZOQ5E2OE4,R3CD63WPYMHSO9,R3CYO0PKFDTBV2,RT4VEG1QJSZ5D,R1BLZ8NFKP1FN8,R312VCX5UBOTYJ", "review_title": "Got it for 280/309MRP in amazon sale,Easy Installation!,Original,Good,Orignal product,Ok,Excellent,Original", "review_content": "Cheap & best genuine black ink 003,First of all, the seller needs to add some more decent photos of the product (first time I searched for it and landed on this one, but honestly I thought it would be a duplicate one, but no it is a original one, photos are attached) .Packing:Packing is ok ok! The bottle comes with a plastic cover coating so no-worry about that.Prize :In my local store it cost me 390 rupees but including the delivery prize I find it cheaper here like 50 rupees or more than that.Genuinity :I scan the QR code and it showed It's a real one (photo attached)So, here we are at the bottom, if you need to refill your printer's tank and searching for a real and cheap one, go for it, don't look elsewhere, it may void your warranty and give you some real headache in future. Always go with the original one. Thank You!,Buy it original,Good,The pic looks little discomfort but received the original product and satisfies,Easy to Install Good Printing,Excellent,Original color", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41PcrlfQ2iL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Epson-003-Black-Ink-Bottle/dp/B07L5L4GTB/ref=sr_1_102?qid=1672903000&s=computers&sr=1-102"}
{"product_id": "B07L8KNP5F", "product_name": "ZEBRONICS Zeb-Thunder Bluetooth Wireless Over Ear Headphone FM, mSD, 9 hrs Playback with Mic (Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|On-Ear", "discounted_price": "₹599", "actual_price": "₹1,399", "discount_percentage": "57%", "rating": "3.8", "rating_count": "60,026", "about_product": "Comfortable Design: Beat the workday blues with music on Zeb-Thunder wireless headphone that comes in an ergonomic design a perfect fit and design for long hours use. Microphone sensitivity -40dB ±1dB|Soft & comfortable earcups: Listen to music, podcasts and more for long hours with soft ear cups making it super comfortable for daily wear|Adjustable headband: Adust your headband to your comfortable best while you work or listen to music, Charging time 1.5H|9hrs Playback Time: Fall in love with the audio experience with 9 hours of playback time to keep you going. Sensitivity : -113dB ±3dB|Superior Sound Quality: Magnify every speck of sound with superior sound quality on Zeb-Thunder wireless headphone, Microphone impedance : 1.2k Ω|Call Function: Enjoy online conference, online classes, calls hands-free with a built in mic on the headphone|Multi Connectivity Options: Be spoilt for choice with multi-connectivity options like like BT, 3.5mm AUX input, FM and MicroSD card|Country of Origin: China", "user_id": "AFMBNWKA4H7GP6PAHPYY25A6Z4HQ,AGMBVEO4J5JYGUM6X5INZMD4FRRQ,AHKQXI6UBPLTL65RPYN7PJ24ELLA,AGWRIXDLH7IBOX4O6L3MW66IJJPQ,AHPV4OCEUB4DZDFNOPHTRE4FHN5A,AG4PTAEZKGTC4UKZX5RSZKK32JIA,AHPD7DFCKP7UFYA4KRGXU3BLR7DQ,AHSUCDSAY4VEIJ3KL6M7NSFL2W3A", "user_name": "ram,Abhishek kumar,Syeeda Naseera,Mudit Sobti,Amazon Customer,Beljo kodiyan,santosh giri,Manish Gupta", "review_id": "R11O7WDJVC8065,R2UF3J3M2DDJ07,R1J14TB65SWAKO,R97GYSJA4SZEV,R3GJ3X7MYRST9G,RGI050G1TY9NP,R11LGEEJ1QQ8HI,RP53N14Q2723T", "review_title": "Note it before purchase headphone,Totally value for money, sound quality is good,Ear cuffs easily detachable,Decent for the Price,Best one in this Budget,Bluetooth is connecting should be improve.,Good Product.,Nice product", "review_content": "I have used boat 900, boat 400,boat 550 and i go for a 1st time with zeb thunder pro, actually im a music lover and i expect more sound quality, bass thump and rich music feels , trust me below what i quote hereBoat 900 is a budget segment wired type less than 800rs, its overall massive performance looks quite simple but gives extra bass overall worthAnd boat 400 (900rs) is discomfort because of over tight pressure in ears , i hope by long days its become loose,by the sound its gives a pinch more than extra bass than boat 900 , and looks smart, here sound is more and bass thump is very more..but here voice or somewhat looks bassy ,not suitable for online classes,...its only use for music loverBoat 550 is around 1800rs its only suitable for online classes for voice no thump or bass at level, totally very mild sound with clear vocal ,dont expect bass or beat here and i met agreat issue is its over ear headphone and its make sweat my ear and make my body temp increase.Now zeb thunder pro, ( 699rs) for this price its a great product , classy look ,sd slot and so... But here some negative points also here,Buttons or not sturdy some what loose and body parts are like head band are toy plastic, for music full volume is very loundness not lovely to like, make a shout punch in a ear painfull, bass is also very good but overall its always below tha boat products im not a hatter , but if u used a boat product u wont like it, same that if u use sony u wont like boat😀,.  If u use no other brands and  zebronics 1st time u become lover to this, still im surprise how they give this product for this price shocking ( aux + type C ) under 700 is shocking bcoz if u go for boat type C product is 1700 aboveZeb or not bad its more ok for this priceSound 4/5  heavy (loud) in full voume looks shouting inside ear , otherwise niceBass : 3.7/5. Not reach boat product , but u wont feel diff if u use for 3 more daysMusic + sound  + vocals i cant separate in this productDurability :3.8/5 bcoz they used toy plastic in band, but however not easily breaks, compare to boat 450 its strong onlyOverall i look for a aux + type C + best bass effect, so at last above all are not reach my concern😆, now i ordered zeb bang pro(699)rsIf it also sound loud thing, then i shutdown with boat 400 (900rs) segmentNote: if i get boat 660 in initially , i wont go for these alllllll). Bcoz unbeaten and full fil my all expect thanknu😊,Sound quality is good, built quility is ok as per pricing . I got it for 600 rs totally worth it. Its been more 10 days since i am using. Its working totally fine.,Sound and other qualities are doing well except ear cuffs are getting detached easily and no firm support for them,Pons-They are good for the price they come. Sound is decent.Battery life is long enough for 2 days (not countinously).The wired features is a charm if battery goes dead. Noise cancellation is also decent.Coming to the bad points.Build Quality is a  little Cheap according to the price , the hinges shouldn't be used that much it will lose it's grip.Also the Bluetooth is not that grt , if you are on a vehicle and connected your phone you will hardly hear any song.The connectivity is a issue. The dual connect is good but their is a latency of about 2-3 second when switching from one to another.That's all, You can buy this if your budget is less and as a student this is the best headphones at this price range.,Sound :* Great Bass* Vocal and Instrument Seperation : Average ( To be expected like this for this price)Connectivity :*Fast BT connection.*BT disconnects when AUX connectedComfortable to wear since its over the earAverage build qualityOverall 4/5,I like this product. I use it everyday while travelling to college far away places.,If you are getting this product within 1000 rupees then it is a good product for you. ☺️,It is overall a nice product", "img_link": "https://m.media-amazon.com/images/I/41AP5QV2M0L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zebronics-Zeb-Thunder-Bluetooth-Headphone-Input/dp/B07L8KNP5F/ref=sr_1_103?qid=1672903000&s=computers&sr=1-103"}
{"product_id": "B08CF4SCNP", "product_name": "Quantum QHM-7406 Full-Sized Keyboard with (₹) Rupee Symbol, Hotkeys and 3-pieces LED function for Desktop/Laptop/Smart TV Spill-Resistant Wired USB Keyboard with 10 million keystrokes lifespan (Black)", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Keyboards", "discounted_price": "₹299", "actual_price": "₹599", "discount_percentage": "50%", "rating": "3.8", "rating_count": "3,066", "about_product": "PLUG & PLAY CONNECT: Easy to connect with your laptop or PC. The keyboard has a long wire with a USB cable that connects instantly without any lags. Absolutely stable transmission.|BOLD AND SLEEK DESIGN: The matte-black keyboard has an ergonomic design with an extremely durable body. It’s also lightweight and easy to carry around. It’s designed in a way to keep your hand in a restful typing position.|NOISELESS KEYS: The keyboard has soft-touch keys which go all the way down when pressed. Moreover, it doesn’t create any sound while typing, enabling you to work without creating any disturbance.|HOTKEYS FOR SPECIAL FUNCTIONS: The hotkeys help you to perform special operations like multimedia actions, shortcuts, manoeuvering, etc.|COMPATIBILITY: The laptop is compatible with almost every existing software which includes Windows 10/8/7/Vista/XP/98/2000, Mac, Linux to name a few. Works with major brands.|WARRANTY: 1-year warranty from the date of purchase as provided by the manufacturer.", "user_id": "AEZRH2UWC5CQXUVLFUEAYAPXDFGQ,AEVMIO4NTG5PTXCPYF3BTUXZ66PQ,AF4JRMMORST2B2X2W6XBRMWNKZ5Q,AHCUDG4P7CG35HNQJUAAVOYPZ4WQ,AGA5GE5IJRW4L4BHWDNC5BFS4UUQ,AHLUETN2P3TVLZUYVNMSIJ3GVVPA,AGLKQIVDJLMLUZ5MP3HOO7CDT6DA,AEQPH4WG6ITTFAJPV2MAS6SL46IQ", "user_name": "Hariom Mishra,Vikas yadav,Santosh Chauhan,SIDDHARTH A.,Dhananjay,amitosh biswas,tpcgupta,Dan", "review_id": "R2L4XIZ518GOR1,RPVZZE1EB5RNS,RF4O6NIV5JCCW,R34V1K30QYA0OB,R3QB4RKKFY10JI,R19ZQCPYHQWLK7,R2XHVF9XQDSISL,R3JGGBNU2POS7K", "review_title": "Comfortable keys and smooth typing,Good at this price,Good but space button very not working properly.. defect product..,Descent,Good product,as money as goods,good,Came with 2 keys not working", "review_content": "Comfortable keys and smooth typing,Good,Average,Ok,,nothing to say...,good,So the space bar was just horrible, zero response from both side of the key and had to press hard in the center part as well, and the minus key on the numpad was not working at all, you just can't use a keyboard with a space bar like this.", "img_link": "https://m.media-amazon.com/images/I/41y181oD7ZL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Quantum-QHM-7406-Spill-Resistant-Wired-Keyboard/dp/B08CF4SCNP/ref=sr_1_104?qid=1672903000&s=computers&sr=1-104"}
{"product_id": "B09XX51X2G", "product_name": "STRIFF Laptop Tabletop Stand, Fold-Up, Adjustable, Ventilated, Portable Holder for Desk, Aluminum Foldable Laptop Ergonomic Compatibility with up to 15.6-inch Laptop, All Mac, Tab, and Mobile (Silver)", "category": "Computers&Accessories|Accessories&Peripherals|LaptopAccessories|Lapdesks", "discounted_price": "₹449", "actual_price": "₹999", "discount_percentage": "55%", "rating": "4.0", "rating_count": "2,102", "about_product": "A lifestyle brand with a mission to create a wide range of cutting-edge tech products, allowing people to make the most of a multitude of different activities|Aluminum Alloy Portable Foldable Holder for Notebooks & Tablets Multiple uses Multi-purpose foldable laptop riser Not only for laptops but also for mobile phones, iPad books, etc|Item Package Weight: 280.0 grams|Lightweight, fold-up design can be opened or closed the laptop stand in just 1 second; saves time and space when moving around the home, school, or work; also includes a small drawstring bag|0|0|0", "user_id": "AHPKWPXNLGMP6BBOUC3MKMDWBIDA,AGMBJC7TRKMW6NZEZ3MPTBCTYQAA,AGMR74PGVNG5IU7X25GJGDAT63TA,AEEVP6GP6VPJ3DKV2WCQZXRYF4NA,AGBCEE2BSSGUDXRORMHMYUZVK6LQ,AEVNRR2MLSJBNKXZWO5FKQSJA6MA,AEJRNRKY5EAXSJJK4Y42EIHW7CIQ,AHSUVTV6XML6IBKSEU3PV37SNICA", "user_name": "Rahil,Swapnil s.,HIREN PARMAR,Khushi sharma,Chetankumarkanthi,Vaibhav Goel,Joen Joy,Vishal Ghadage", "review_id": "R1INL4UFJMHNYR,R1JKLP968JFII9,R1V4XNUIURS7GC,R3ADRUHE42WCJE,RS7H27GCGREXQ,R41ZM7UPJZQ8W,RXM4QJZX5M7Q4,RUWA5ZR9LSQBH", "review_title": "bit wobbly and too compact,Easy for the eye level,Not up to the mark,Good product,Nice,Serves the purpose,Best to buy,No", "review_content": "for 17\" it might be too small. also it's wobbly. was good enough for not making me return it,If you own gaming laptop and want some elevation for those fans it's not a bad purchase but the temperature is not much but good for eye level,As it has simple design it may not block air flow but it will not comfortable if you use laptop's keyboard as it will start shaking as it doesn't provide such stability and so it is nor usable for typing purpose you must have to use external keyboard and mouse,https://m.media-amazon.com/images/I/71cbMITZDRL._SY88.jpg,Good,Works as expected, small form factor,Under slightly rough usage Bottom pads came off but still works as expected,Quality productBest to buy,Good", "img_link": "https://m.media-amazon.com/images/I/319cuUVHCwL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/STRIFF-Adjustable-Ventilated-Ergonomic-Compatibility/dp/B09XX51X2G/ref=sr_1_105?qid=1672903000&s=computers&sr=1-105"}
{"product_id": "B01M72LILF", "product_name": "Logitech M221 Wireless Mouse, Silent Buttons, 2.4 GHz with USB Mini Receiver, 1000 DPI Optical Tracking, 18-Month Battery Life, Ambidextrous PC / Mac / Laptop - Charcoal Grey", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹799", "actual_price": "₹1,295", "discount_percentage": "38%", "rating": "4.4", "rating_count": "34,852", "about_product": "Enjoy the sound of silence. With the same click feel and over 90% noise reduction on the click sound, enjoy a quiet experience for yourself and those around you. Plus, it has feet made of high performance material and a rubber wheel for quiet gliding and scrolling.|Enjoy a wireless connection up to 33 feet (10m) away* thanks to a plug-and-forget nano receiver. M221 SILENT features Logitech Advanced Optical Tracking for ultra precise moves on almost any surface. No hassle, no software needed. Works with Windows, Mac, Chrome OS or Linux-based computers. *Actual wireless range may vary based on use, settings, and environmental conditions.|With 18-month of battery, you can go longer between battery changes thanks to energy efficient engineering. Plus, M221 SILENT automatically puts itself to sleep when not in use. *Battery life may vary based on user and computing conditions.|Ambidextrous design offers more comfort and precision than your touchpad. Its small size is perfect to toss in a bag and go.", "user_id": "AEEYJCTR44VPW4DW537EAZHK5CPQ,AGHDZUKPZDC4HH2GVGDOBXWU4D3Q,AFM7R5JRUEXGKULZMOOZCS2DWRIQ,AFDEGSSFTG26ISJWFNZXKO5VINOA,AFLJZDGN73GMYGJB4HNT2CXBEDIA,AHSPJR6ZDZZBC7PN5ENIUNZ637NA,AHGZYHF5ZRYSA3NOF7NFU4AHW2ZA,AFQ563OKBUIIL2NHNPXX7KRKPYVQ", "user_name": "Kshitij,UMAKANTA SASMAL,Deepak Kumar Singh,Anand Raj A,Shiv SV,Takreem R.,Anupam B.,Durgaprasad", "review_id": "R2ZXDFN8U4X0T3,RD94LCPFDC5TC,R2S5WXQYTXTQYQ,R2ACY9811MRUN5,R3LCHR1A1RPV6S,RT7JIX9SX80E1,R3L8S4KNQ9XCO6,R5F8EK88EABNY", "review_title": "Worth buying it.,Nice,Good product,Good,Logitech is the best there - problem with the sroller,Very good product,Value for money product,Good quality", "review_content": "I am using it from 1 month, it works decent.Size is bit small, so it does not provide a good ergonomic.As they say clicks are noiseless, that is not true, button press sound is there.Overall it's considerable and worth buying it.,Like,Light weight and work well,Good,Hands down, logitech is the best in mouses. But I am finding an issue with the scroller. On some days, all of a sudden, the scroller isn't smooth. I have no clue why. I am not able to scroll smoothly with it.,Good battery life, no noise. Good for normal routine usage,M221 is a very good product from Logitech. this is 2nd wireless mouse I bought from them. I bought this product on 1st July 2017 and I'm writing this review as my left click is going kaput. Everything is good about this mouse except the battery part. I use this mouse 12-15 hrs a day and I had to change its battery every 2nd month. so those who are buying this product should also buy a rechargeable battery and charger. This mouse is only meant for general work and a bit of casual gaming [ small games]. If you try to play those Triple AAA games you will feel the lag.,Good", "img_link": "https://m.media-amazon.com/images/I/31ROHZJMEUL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Logitech-Silent-Wireless-Mouse-Charcoal/dp/B01M72LILF/ref=sr_1_106?qid=1672903000&s=computers&sr=1-106"}
{"product_id": "B07KSMBL2H", "product_name": "AmazonBasics Flexible Premium HDMI Cable (Black, 4K@60Hz, 18Gbps), 3-Foot", "category": "Electronics|HomeTheater,TV&Video|Accessories|Cables|HDMICables", "discounted_price": "₹219", "actual_price": "₹700", "discount_percentage": "69%", "rating": "4.4", "rating_count": "4,26,972", "about_product": "Flexible, lightweight HDMI cable for connecting media devices to playback display such as HDTVs, projectors, and more|Compatible with Blu-Ray players, computers, Apple TV, Roku, cable, PS4, Xbox One, and other HDMI-compatible devices|Solid copper conductors and full metal jacket shielding for durability and high-performance connectivity|Supports Ethernet, 3D, 4K video and Audio Return Channel (ARC) and meets the latest HDMI standards|Supports bandwidth up to 18Gbps and is backwards compatible with earlier versions|Includes a 3 foot cable", "user_id": "AEYJ5I6JZZPOJB6MGWRQOHRQLPSQ,AFY5TVFOMVHGBPBTIJODYDQRZM5Q,AE3O6366WGEQAANKJ76QETTUQQTQ,AEQIJCPWSBCDKUO5VROXXHWX3PPA,AGVIAQK2HQ47P7UVXHW2NBAEU7YQ,AE3D5CJ2GDUP5SQ3AAYMVAGDTX7A,AH77IQRYD54XCRMCO7XEAIAYCLPA,AEA2HQHMFG3ZGJFOLLJQ65WKIZUQ", "user_name": "Rishav Gossain,Shashank Mallamraju,Purnendu,gunasekaran desomayananam,Anto RK,Sukrit Basak,Manoj Kumar,Sethuram.S", "review_id": "R1FKOKZ3HHKJBZ,R2WNMZI1EXTA0H,RCA1M3W4RIXUR,R3BKCLL6D7ZLIX,REVSR0ILY3547,R15W5KMQB95IV5,R10PB68FRUHT5V,R3TLCE9JSBU3UP", "review_title": "It's quite good and value for money,Works well,Hdmi cable,Value for money,All good,Gets the job done,Delivery was good,This one was my need to purchase", "review_content": "I am using it for 14 days now. The experience is pretty good as of now. Picture quality is also not bad. Don't expect something out of the world at this price point. But you can go for it if you have a tight budget.,Initial impressions: works as said, glad I didn’t go for cheaper options (not that it’s too costly) just plug and play. Will update if it screws up,The hdmi cable is good to watch movie,sports and its gives better quality while connecting your laptop with TV and play 🎮.I loved it,Works as expected. Length of the cable is short and it was mentioned also satisfied my requirement. If you need more length better look other options.,All good,It's the best HDMI cable at this price range. No problems yet. Just go for it !!,I was expecting this to be delivered on time and it was delivered on time.Product is good as i have tried other cables and wires from Amazon basica brand.,Good one", "img_link": "https://m.media-amazon.com/images/I/41nPYaWA+ML._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/AmazonBasics-Flexible-HDMI-Cable-3-Foot/dp/B07KSMBL2H/ref=sr_1_107?qid=1672903000&s=computers&sr=1-107"}
{"product_id": "B00LZLQ624", "product_name": "Classmate Soft Cover 6 Subject Spiral Binding Notebook, Single Line, 300 Pages", "category": "OfficeProducts|OfficePaperProducts|Paper|Stationery|Notebooks,WritingPads&Diaries|WireboundNotebooks", "discounted_price": "₹157", "actual_price": "₹160", "discount_percentage": "2%", "rating": "4.5", "rating_count": "8,618", "about_product": "The cover design of the notebook is subject to change, it depends on stock availability|6 subject notebook-single line, 300 pages, spiral binding, soft cover, 297mm*210mm|Six subjects one notebook only the best from classmate|Classmate uses eco friendly and elemental chlorine free paper|This notebook consists of papers", "user_id": "AF3GETWWBGMLASY2KKNNBS2VO6DQ,AEZPNXZLF5U7XEX6TOW3J56C3XDA,AF772O5YC4ZR6O2Y4VMIWTWEZMPA,AECNKBFNUZ5AY4RLJIYQOHMMKQVA,AH7MHPNMOPCXJHV56ITYG5BNCVNA,AGVVJUVII5T3HT6O5F7YHQNOXCPA,AGEDNYHQPV3GSF7ZKA3WWGDLKGGQ,AEDVHCTFRSHLBEEGFK3H45GATQFA", "user_name": "Anirban B.,Amita,Ayushi Raj,Neeraj Rawat,Salma,Certified buyer,Ayush,S.Balasubramanian", "review_id": "R2QV1JD5V8C2S1,RG4C2KF3ZRM0O,R2W29VY8NK4944,R1CND8STT3PIJ9,R28HD6AAAURKH9,R1YCVCHRY2S75S,R3HTDIUAXMK62H,ROTGU2DMM6OU0", "review_title": "An Overall Good Product.,Great notebook, but..,Good,Awesome,Paper quality not nice,Very good copies,Design,Good product", "review_content": "First Of all, the item looks good attractive. The front and back side covers are good, feels smooth and premium. I give it a 4 star considering the below points..Also, Thanks to Amazon for Superfast Delivery.1. Paper quality - nice, I used Ball pens, Sketch pens and also inkpens. all cases no soaking of ink.2. Binding - Spiral Binding and qality is good and attractive.3. Sturdiness - Here it could have been a little better, considering the price tag.4. Light Weight - Binding and Paper quality is nice, still lite weght. That's a Plus.5. Writing Experience - Better than average available notbooks in similar pricetag.,First off, the notebook design is great, pages are nice and smooth, but a bit on the thinner side. The subject dividers are thicker than other pages.The QC has some issues, as of the one unit i ordered for testing this product @118 rs some pages were folded up from the corners and become larger when unfolded as depicted in the picture above. Many pages were glued onto each other hence, tearing some part when flipping them again, illustrated in the picture added above.Its an absolute steal deal for rs 118 per piece as no other notebook competes in the spiral bind 300 page market, and notebooks of about 200 pages non spiral bound of a simillar size are sold for @84 rs as of writing this review.The only downside I found besides the QC is that it doesn't include an index page, otherwise; it has some games, riddles and a notes pages like other notebooks and the first page is dedicated to the owners details and contact N.O. Great to see it present.Overall i recommend this product because of the value for money and the quality. I understand my unit was a one off as other reviews don't seem to mention this. Will update after using this for a few more weeks,The product is worth the money. The paper quality was good and it has six separations for six different subjects.,Valu for moneyPremium quality,,I ordered 3, only one copy was a bit damaged from the binding.,I got all the same design notebook. Which is Little disappointing me. Except that everything is fine!,Good product", "img_link": "https://m.media-amazon.com/images/I/419KXo-7kDL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Classmate-Premium-Subject-Notebook-Single/dp/B00LZLQ624/ref=sr_1_108?qid=1672903000&s=computers&sr=1-108"}
{"product_id": "B07DJLFMPS", "product_name": "HP 32GB Class 10 MicroSD Memory Card (U1 TF Card 32GB)", "category": "Electronics|Accessories|MemoryCards|MicroSD", "discounted_price": "₹369", "actual_price": "₹1,600", "discount_percentage": "77%", "rating": "4.0", "rating_count": "32,625", "about_product": "Class 10, UHS-I, U1 Memory Card with Adapter|Perfect for storing and transferring more mobile content across your devices, including photos, music and movies for entertainment or apps and e-books for school or work|Ideal for the latest tablets, PCs, smartphones and mobile devices|16-128GB: Read speed up to 80MB/s, write minumum 30MB/s|Importer Details: Fortune marketing Pvt Ltd D1/2 -Okhla Industrial Area Phase -II New Delhi 110020|Country of Origin: Taiwan", "user_id": "AE2OFVZSIE6KSBAPG6GMKCER35LA,AFEOAY5PB4XEYIOL6DY5WJBOYSKQ,AEJTETVJ7NY3GMARSTJNPOG3AY3A,AFMQHAPYUAV7ZSPABOAVTNZVESWA,AEGYHN3DWMVH2RZLTP2H2A2U6EHA,AFIWP2JBBUU6SH3MK355UEG4TZGA,AF7XGOMQWMA2ITB72BPIVHL23EJA,AHBTDCFI4HA6ONMJZRTYUXAEP46A", "user_name": "Ajit Kumar Rai,chetan tandel,Tanankirambabu,Mohammed amaan,ashish bajaj,SUMIT KUJUR,Yajnesh,Raj Kishor Singh", "review_id": "RPA8V1051ERUL,R2M7ENP70GK5P4,R3PA1IDUY9QNC8,R1QVT2JWXS2Y8Q,R2D2Z6QVL2FXNO,R2W3Y5HX9WED9J,R2TUAIDPW255N6,RWLGI93AXFKRD", "review_title": "Best,genuine,Nice product,Good product,Value for money,Good,worth of purchase,Good 👍", "review_content": "Best wishes,brought it online as cautious about buying offline coz of fake and overpriced products. using it for my wifi camera. working fine,Nice product,Nice quality product easy to use. Thanks amazon,Well known brand ..Nice product.,Good,worth product,Bahut achcha laga Raha hai", "img_link": "https://m.media-amazon.com/images/I/41z7FRqEerL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/HP-MicroSD-U1-TF-Card-32GB/dp/B07DJLFMPS/ref=sr_1_110?qid=1672903000&s=computers&sr=1-110"}
{"product_id": "B09GB5B4BK", "product_name": "HP 150 Wireless USB Mouse with Ergonomic and ambidextrous Design, 1600 DPI Optical Tracking, 2.4 GHz Wireless connectivity, Dual-Function Scroll Wheel and 12 Month Long Battery Life. 3-Years Warranty.", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹599", "actual_price": "₹899", "discount_percentage": "33%", "rating": "4.0", "rating_count": "4,018", "about_product": "Looks good, feels good: Elegant ergonomic design gives you all-day comfort so you can get it all done. It feels so natural, you'll forget you're holding it.;Lefty or righty: Whether you're a righty, lefty, or bothy, this mouse is ready for however you click.|Control the scroll: Three buttons in one mouse. Left click, right click, or center click on the dual-function scroll wheel. You've got all the control you need in one fingertip.|Precisely right: With its 1600 DPI optical sensor, this mouse works on almost any surface with astounding accuracy. Stash it in your bag with your laptop and you'll be good to go.|No strings attached: Roam free from wires or clutter with a 2.4 GHz wireless connection via simple dongle.|Power Source Type: Battery Powered;Style Name: Ambidextrous Wireless Mouse", "user_id": "AEDZXGGZW3ZS22XINYAPXX347GKA,AGGIQC3X6SACWMNN7EQANQMS36IA,AEJHA2E6YBI635Q3AKE2QNBOM24Q,AHBXRBDR7QC3GHIMO3KBIIA4U26Q,AHVNWCICNY3UEAX4JMSJGPQNPVRA,AG7KWVG7HMZOHCIDXRJ7KARTAFQQ,AGU4QDN3LU25GWIUH3PQUSSGODPQ,AFL5ZDARQ6ARU2TN3RCY7KFBJBZA", "user_name": "Wajiha,Gaurav Choudhary,Kenil,Indrajeet kumar Sinha,Dishant Mann,Rizwan,Srikrishna,PRASAD ALPE", "review_id": "R30U9FM8KQM6XF,R29JQ2K07HBYIF,R2E2HQUWWCQ7KQ,R296GRK7CYBW8R,RQYGF5HURT4Q7,R2UMKGAL43EGDB,R2BJNGYIXCJZR3,R1LPMCFZIBBS1E", "review_title": "Nice,Scroll wheel is extremely small,Value for money 💰 during sale price become much lower than normal that is time to buy this.,Ok,It's a quality product...,Good product,Mouse OK but upper part Flimsy,Product is good", "review_content": "Packing was not good, over all good product..,Scroll wheel is very small otherwise the product seems good at least at the first use,https://m.media-amazon.com/images/I/615o-xCWE-L._SY88.jpg,Ok,,A bit disappointed with on/off switch.. it’s too tiny .. otherwise product is nice ..,Gave -1 Star for the flimsy top cover and on/off button. Rest all is good. Easy to navigate. On OFF button at the bottom could have been better. Not the regular type of putting the battery at the bottom part. Pull the Top cover and place the battery. the slot is given for the wireless adapter adjacent to the battery compartment. Easy to use. simple plug-and-play. For better results, switch off the mouse only during weekends. draining of battery power to some extent is fine when compared to the clumsiness of the small on/off button.,Good to use.", "img_link": "https://m.media-amazon.com/images/I/21ci6bwxtdL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/HP-150-Ambidextrous-Wireless-Mouse/dp/B09GB5B4BK/ref=sr_1_113?qid=1672903000&s=computers&sr=1-113"}
{"product_id": "B015ZXUDD0", "product_name": "Duracell Rechargeable AA 1300mAh Batteries, 4Pcs", "category": "Electronics|GeneralPurposeBatteries&BatteryChargers|RechargeableBatteries", "discounted_price": "₹479", "actual_price": "₹599", "discount_percentage": "20%", "rating": "4.3", "rating_count": "11,687", "about_product": "Duracell Rechargeable AA 1300mAh batteries stay charged for up to 12 months, when not in use|Unused Duracell Recharge Ultra batteries are guaranteed to last 5 years and Guarantee starts from the Date of Purchase|Duracell Rechargeable AA 1300mAh batteries come pre-charged, ready to use|Duracell Rechargeable AA 1300mAh batteries can be recharged 100's times|Suited for regularly used devices like wireless mouse or babyphone|They are available in AA 1300mAh and AAA 750mAh sizes|They work in any NiMH charger", "user_id": "AE3PTJFRVU3YM5YFYN3ICDA5X6FA,AGF5DMXE65QXZPJX6BJANVMCGHGQ,AE5VM7Y43HENV5JBN7JB4LCDHO4A,AHBWFF4SD5LBHN6R3W43JNZW4A2A,AGSOXL3BMIL55ANW7OYCFRBWUGEQ,AEY7GHROFM3MCCHU6VOU5GAUQNCQ,AE6ELRMJIUHC3CN34MMM7JRL5RBA,AHDXDGROQRENYUGOZNF4LBVDF73Q", "user_name": "Rameez Khan,Sidhdharth,Daljeet Singh kang,Ram Gopal Kushwah,Amazon Customer,Amazon_Customer DN,Shahul Hameed,Niraj K.", "review_id": "R32VTB32ABV5KD,R6MP28BOL57KT,R2EAVEVO5QBCY0,R2RGL2ER7IIAIM,R14FBKM06QD50M,R1LYEOV92R84LX,R2DQHH5ZDEIZF7,R20YKGEYEPCEGL", "review_title": "Decent Product,Very useful,Daljeet,***,Good,Working well but heated much while charging,Value For Money and Worthable,Good among all rechargable batree", "review_content": "The quality of this batteries are really good. I used this batteries in wireless mouse and trimmer. In wireless mouse the batteries lasts for more than 7 days and in trimmer it lasts for 15 days. Happy with the product and happy with the packaging and delivery standards of amazon.,Too useful. Good for normal usage. I am using it for my point and shoot camera and it works pefectly well,Worth buying prodect,Good product.,Remote control n longevity,Working well for my camera external flash. I took almost 50 photo with various flash power, and it had still charged. Then I charge it again with Panasonic c55 charger and it was fully charged within 1.5 hours. But when I charge it for the first time batteries were talking too much time, though company claim its pre charged, one battery took 2 hrs to fully charge. May be one cell is weak and I got 2021 packaging.Till now only negative I found that batteries becoming too much hot while charging.,It is powerful batteryFor Muse Usage is coming upto 1 Month after full rechargeFor Key Board Usage is coming upto 1 Month after full recharge.. Medical Equipment are getting Long Time...WALLClocks are only eating Battery Life within TWO Week.But DON'T USE for  KIDS TOYS every 2 days you have RECHAGE your Battery.. it is also beatiful and efficency instead of buying new battery ....all other Electronic Devices are it is ok for easier life...,Super batree... Good life", "img_link": "https://m.media-amazon.com/images/I/51pZRhR1wWL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Duracell-5000174-Rechargeable-Batteries-Green/dp/B015ZXUDD0/ref=sr_1_114?qid=1672903000&s=computers&sr=1-114"}
{"product_id": "B085DTN6R2", "product_name": "Portronics Konnect CL 20W POR-1067 Type-C to 8 Pin USB 1.2M Cable with Power Delivery & 3A Quick Charge Support, Nylon Braided for All Type-C and 8 Pin Devices, Green", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹350", "actual_price": "₹899", "discount_percentage": "61%", "rating": "4.2", "rating_count": "2,262", "about_product": "[20W PD FAST CHARGING]-It’s supports 20W PD quick charge protocol, charge up to 50% in around 30 minutes. It is ideal for charging your USB type c enabled devices at maximum speed|[USB-C to 8 Pin Cable]- It’s offer rapid charging and syncing between USB Type-C and 8 Pin enabled devices. Safe charging at up to 3A is ensured by high-standard components|[MORE DURABLE]- This cable is unique interms of design and multi-use and is positioned to provide the best comfort and performance while using|[FLEXIBLE CORD]- The Cable uses nylon Braided + Metal Housing material to make sure that the life of the cable is enhanced significantly. It is 4mm extra thick slim 1.2meter long|[UNIVERSAL COMPATIBILITY]-Charge for all Type C USB connectivity devices including MacBook 12 inch, Nexus 5x, Nexus 6p, OnePlus 2, pixel c, Lumia 950, Lumia 950 xl, Nokia n1, etc", "user_id": "AGUAYQHARAKR2VZTRP276KAGETKQ,AFKTST2773VUOKUHE7FCR6QCAURQ,AEGLHOQOWUUUQEDV6EWXTSHIUE7A,AEHQYGI5L4FFALBMC5XMT5KXSZCA,AHJFXFGDAXEHIG2ZLUWVMZ3LWPBA,AEP4CW3UI7AJ7XM7PAAKVCB6U3ZA,AHIWCPCQ2Z4HWEM7V4HGTLVZQM6Q,AHT4JDEYWRIQGCA2WAQJ6E2POHCQ", "user_name": "Priya,Mansi,Plaban,Vivek,Taufique Ahmed,Praveen kumar,Robbin,arjun sharma", "review_id": "R1QETDIPRCX4S0,RARQYQ8POOFA9,R952F931MCOR5,R3LLDHV3WXED9C,R282YHZ5A4GMY4,R34W3B1C7RP98Q,R1467F9VL3DLSY,R3KLQRR1UM44JG", "review_title": "Works,Nice Product,Fast Charging as original,Good for data transfer,Average. Cost effective,Good quality,Great Product,Nice", "review_content": "Definitely isn’t as good as the original cord but works. Fast charging and pretty sturdy,Worth it,So I had a faulty cable. I was lazy and have a lot of money so instead of calling Apple I bought this for like 300 bucks. Didn’t expected much but for my surprise, this cable actually works and has fast charging. JUST GO FOR IT,Felt quite sturdy, the connectors look premium and were easy to insert. I used this cable to switch all my data from iphone 7 to an m30s. Cable worked like charm while using smart switch app, all my data including whatsapp data was transferred successfully. Satisfied with performance.,Just good,Quality is very goodWorking smoothly.. using same portronics pd charger,This is a real fast charging cable that is serving the purpose,Very good", "img_link": "https://m.media-amazon.com/images/I/31J6qGhAL9L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Portronics-Konnect-Delivery-Support-Braided/dp/B085DTN6R2/ref=sr_1_115?qid=1672903000&s=computers&sr=1-115"}
{"product_id": "B09PL79D2X", "product_name": "boAt Airdopes 181 in-Ear True Wireless Earbuds with ENx  Tech, Beast  Mode(Low Latency Upto 60ms) for Gaming, with Mic, ASAP  Charge, 20H Playtime, Bluetooth v5.2, IPX4 & IWP (Cool Grey)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹1,598", "actual_price": "₹2,990", "discount_percentage": "47%", "rating": "3.8", "rating_count": "11,015", "about_product": "Clear Voice Calls- Be heard absolutely clear across voice calls without those usual interruptions, with the ENx Tech enabled Airdopes 181, that cancels out unwanted background noises during calls|Beast Mode- Enjoy a lag less entertainment experience with BEAST Mode for low latency so that your gaming sessions always stay smooth.|ASAP Charge- Courtesy our ASAP Charge tech, these true wireless earbuds can garner up to 90Min of playtime in just 10Min of charging.|Playback- It offers a total playtime of up to 20HRS, including up to 4HRS of playtime per charge.|Drivers- Delve into the boAt immersive auditory experience on Airdopes 181 true wireless earbuds courtesy its 10mm audio drivers|Instant Connect- The IWP tech makes it easier to power on the TWS earbuds which occurs as soon as you open the case lid when the earbuds are being kept inside.|IP Rating- The ultra-lightweight earbuds are marked with IPX4 water resistance for a carefree listening time wherever you go.", "user_id": "AFWDV7TXGNYDA54LFNRDRJBTBH4A,AFEPCSTHZXN35QN2NFRS6X54AFQA,AGZEBZMUHSRT37TWDJQAIFK7R7NQ,AFRSTB6WTL3CEY6EHWNZYGP7F5IQ,AFXYRRVG6WFFNONQ2DGVUOCPP2TQ,AFGHPNJCPTG3GN4WG2YTPWNFYPHA,AGKAIBTFKDPPNNZ22TC34TRNBNMQ,AFJJH654JT5YBKS72KDWAOPPCZPA", "user_name": "Alif Rahaman,Mahesh Sargasree,Simranjeet Singh,Sanu Ghosh,Angad,Vyshnav,Shankar tonne,prakash", "review_id": "RO77OQG21KZ7C,R14P5VL1FNT9AH,R2XDRJHJRKJC9T,R18FB15M733QII,R892AATDO8QNT,RZ5L8BVT0THNE,R3LEJZ4FF2OSYZ,R3CQCCWYS8XQ4Q", "review_title": "Works just fine,Nice earbuds, but not quite as advertised,The sound quality is good but not better than wired or neckband earphones.,Overall Good,Nice product,Good to buy, for compact ear pods with decent sound battery and sound quality,Good,👍 Good", "review_content": "Review after using it for about a month -pros-• battery backup is the most amazing of all.• sound quality is amazing but bass is on the low side.• build quality is well made almost feels premium but could be improved.• very comfy even after a long day use.cons-• There's a noticable delay in touch controls (most irritating one).• There's no such thing as no delay during gaming on wireless earphones. just get wired instead of this if you are planning on using it for gaming.• Noise cancellation calling or enc doesnt work, also while calling 2nd person most of the time says that \"I can't hear you well\" or \"Your voice is so low\" on outdoors.• Sometimes a earphone doesn't turns on, so I have to manually turn it on.• To pickup a call one tap, but here's the catch to disconnect a ongoing call I have to double tap on the touch panel. (boat says single tap tho)Conclusion - If you have a little more budget, don't buy this. else this just works fine.,I recently purchased the boAt Airdopes 181 in-Ear True Wireless Earbuds and have been using them for the past week. Overall, I am satisfied with the product. The earbuds are comfortable to wear and have a good fit, and the sound quality is impressive for the price point.However, I was disappointed to discover that the earbuds do not have noise cancellation as advertised. While they do block out some ambient noise, they are not as effective as other earbuds I've used with noise cancellation technology.The battery life has been satisfactory. The earbuds last for a good amount of time on a single charge, and the case is convenient for charging on the go.Overall, I would recommend the boAt Airdopes 181 earbuds for those looking for a budget-friendly option with good sound quality. Just be aware that they do not have noise cancellation.,I am writing this review after two days of usage.1. Sound Quality: The lows are good and pleasing to the ears. Bass quality is good. I just felt like the treble is a little too high which makes the high frequency music sound a bit unpleasant. Overall the quality is okay but not as good as a wired headset or neckband earphones. (Kaam chal jayga)2. Battery Backup: It's been 2 days and I haven't charged it yet....still showing 70+% of battery remaining. So I don't think battery backup would be a problem. (moderate usage)3. Built: The case is small and handy. It feels sturdy. The buds fit well in the ears. Overall built is good.4. Latency: This one's for gamers. I am actually impressed by the low latency it has. Even without turning on the 'Beast Mode', the feedback is almost instantaneous. And after turning on the Beast mode, it becomes flawless. I played BGMI and COD and didn't feel any lag in the sound.5. Calling: I tried calling in a silent atmosphere and there was no problem faced. Will update you guys if there turns out to be a problem when calling in a crowded area.,In 1399 rupees it is a good earphones. Good battary life, good sound, good connectivityCons- very poor build quality, feel so cheap. If you r a choosy person then you don't like the product.,If you're looking for wireless earphone under 1500 go for it. This product is good the sound leakage is there no doubt but you won't feel any sort of distortion,the airdrops 181 are very handy, compact in size ,long lasting battery for its size and the connectivity is is pretty good along with the sound quality , though it has a room for improvement in noise cancellation but still performs very well for this price point.,Its a good product sound quality is also agood but noise cancellation is average,It is good product but only for 4-5 months.", "img_link": "https://m.media-amazon.com/images/I/314g1W9h2rL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Airdopes-181-Playtime-Bluetooth-Wireless/dp/B09PL79D2X/ref=sr_1_116?qid=1672903000&s=computers&sr=1-116"}
{"product_id": "B098K3H92Z", "product_name": "TP-Link USB Bluetooth Adapter for PC, 5.0 Bluetooth Dongle Receiver (UB500) Supports Windows 11/10/8.1/7 for Desktop, Laptop, Mouse, Keyboard, Printers, Headsets, Speakers, PS4/ Xbox Controllers", "category": "Computers&Accessories|NetworkingDevices|NetworkAdapters|BluetoothAdapters", "discounted_price": "₹599", "actual_price": "₹899", "discount_percentage": "33%", "rating": "4.3", "rating_count": "95,116", "about_product": "Bluetooth 5.0 —— Applies the latest Bluetooth 5.0 technology, backward compatible with Bluetooth V4.0/3.0/2.1/2.0/1.1|Wireless Connectivity —— Provides stable and convenient communication between Bluetooth devices and your PC or laptop|Nano-Sized —— Ultra-small for convenient portability with reliable high performance, Supported Operating System – Windows 11/10/8.1/7|In an unlikely case of product quality related issue, we may ask you to reach out to brand’s customer service support and seek resolution. We will require brand proof of issue to process replacement request.", "user_id": "AGO7FWIRBIVDDEAYX2UI6DP4G6GA,AGSJBU7AZR5BNW5HGXFDNH76SNWQ,AELVWGIYLMQUY65GUKSUJYVXRODA,AGSZBM525VC5PTNWEZC6I5CTH66Q,AGQDGNLHK6VLEZF33POQLAQ6NNSA,AG76GICZHJGA7YVN4TORX36ONVYA,AH42ECAG6LPCU22T5BYN5OXQO74A,AGHDZUKPZDC4HH2GVGDOBXWU4D3Q", "user_name": "Noble P Mathew,Rahul,SINGH,Edwin axel,Siddharth Gupta,Deepak,SOURAV DAS,UMAKANTA SASMAL", "review_id": "R3NMEJ9FHUKIM5,R9Q5HZCYA8M7W,R1TBL4GV1NUX07,R107YDPAWIHVKN,R3ON78SE4U0D4D,R1S9OCH99PFHGW,R3VB6LUO0KQAC7,R38WR5MFISLU9H", "review_title": "**UPDATE MARCH2021**Decent for a USB 2.0 Device but don't expect anything above SBC *FALSE*aptX,Works very well, for Linux too,Using it to connect with ps5 controller on pc, no issues !,Not bad,Nice product with some cons,Overall good product 👌,Okay if on tight budget,Nice", "review_content": "***This is the Update MARCH**.I want to make a huge point to anyone who doesn't get good distance, may I suggest purchasing either of the extension cables because they are what I use and they work great,FEDUS USB 3.0/2.0 Male A to Female A Extension Cable  orStorite 2 Pack USB 3.0 Male A To Female A Extension Cable.I have my extension cable from the laptop USB port hanging from the tubelight and this increased my BT range to 25-50 feet radius. Only my kitchen work area which has 3 walls and 30 feet distance the connection intermittant.OnePlus Bullets Wireless Z Bass Edition (Reverb Red), Sony WI-XB400 Wireless, Anker SoundBuds Curves, Jabra Elite Active 65t, Tribit QuietPlus 72 Over-ears Headphones.Only the Anker has aptX connection.I purchased Anker SoundBuds AK-A3263011 Curves and this set has aptX, when connecting this headset the CSR Software recognized aptX. Is there a difference in SBC/aptX? I cant really tell in audio quality but the connection IS more stable. Also, I have not discovered a way to switch between SBC/aptX like Smartphones. It automatically connects as aptX.*******SOME HEADSETS may not work properly--->*******My Brandnew Tribit QuietPlus 72 Headphones DID NOT work well at all. It kept running in Handsfree (mono) mode.For comparison it sounds like listening to AM Radio Station. If you experience the same effectTHERE MAY BE A WAY TO FIX THIS*******---Before connecting your BT device----Right click the BT icon--> Click on Bluetooth Settings-->Click Audio/Video Tab--> you will see SCMS-T content protection etc.. In the dialogue box Click the box to enable Connect to content protection enabled headset onlyNow hit Apply then Ok. Right Click BT Icon in Taskbar-->Add Bluetooth Device--.Audio/Video Device then Search for the BT Device...Now when you connect give it about 10 seconds--> then once connected it should provide the Stereo mode under Speaker icon in Taskbar. Once you disconnect, depending on any other Headset you will have to go back to these settings and Disable Content Protected device. For My ONEPLUS Bullets Wireless Z I have to disable or else they only connect in Mono mode.A very short walkthrough for connecting headset....Make sure the BT Icon is turned on - Blue color=On - White=Off in Windows TaskbarRight Click and will bring up table with headingsThe 1st is to turn on/off the BT Radio which is the TPlink BT dongle itself. (BT signal is radio transmission)The 2nd heading is for turning on/off Discovery (Transmit/Receive on/off)The 3rd heading is Add Bluetooth Device. when you highlight this it will bring up the table which showsPhone,  Computer,  Audio/Video device,  Printer/Imaging Device,  and Keyboard/Mouse,  ALL.The 4th heading is Show Bluetooth Devices (devices that are Already Connected)The 5th heading is Bluetooth Settings (only for TPlink Bluetooth Dongle,not onboard bluetooth)The 6th and last heading that mine shows is  About (this brings up the software provider and vers., there is no Update option here, we have to physically check the TPlink website for UB400)I only use Audio Devices, I don't have any other BT products so I am unable to test other than headsets.under Add heading go to Audio/Video Device left click --> brings up dialogue box to Select a device to connect with this Computer. at the bottom right corner click Search (make sure your headset is on and not connected to any other system/home theater/smartphone.Once the Device shows up you can sigle click on it then Next on bottom of page or you can double click. Either will connect to the device. Once it is \"Connected\", give about 10 to 15 seconds for Windows to recognize the Connection. You will see what the options are in next description -->In the taskbar click the audio profile (speaker icon) Here there are 4 options that pop up for me --->(**Note-if you only see 2 or 3 then read the section above that says SOME HEADSETS may not work properly) TV sound, Laptop speakers, Bluetooth Audio Renderer (Stereo) and Bluetooth Hands Free Audio (Mono).Click on Bluetooth Audio Renderer (Stereo) wait a few seconds for it to comply.Now your headset should be connected.In watching Youtube I do get some lag but with different headsets the lag increases or decreases.The same with me using VLC or Windows Media Player. Sometimes if I stop the video app and restart then it will be no lag.I don't use ZOOM,Teams,Skype, so I cannot test how the mic setup would function.Any one that has any input for this please use any or all of my post and add to it. This would be helpful to alot of people.*FIRST post* So for a few months I was using it strictly thru Win10 utilizing Win10 drivers and bluetooth connection page thru Settings/System. But a few times i tried to use with music streaming to Sony XB400 or Oneplus Buds Wireless Bass edition and there would be intermittant drops. Also when it came to pairing and connecting it would consistanly slow down my HP AMD A6 chipset laptop. Also anytime I took the dongle out it would also affect disconnect my thumbdrive. So I assumed it was a throttling going on with my USB ports. I have Sandisk Dual Drive, WD Passport, DVi to HDMI and Logitech dongle. So one by one i disconnected everything and left the BT dongle and it was a little better.So I checked the TP Link India site for any FAQ related. When I searched in the Downloads->Drivers section there was software driver present.  So I downloaded, installed it and Win10 taskbar shows BT icon to use theBT Dongle. The Driver software is by CSR Harmony Wireless Software Stack Version 2.1.63.0.Once installed there are more options that can be accessed thru the BT icon in taskbar. The BT icon sits in the system tray as before. Audio transmission can be switched between stereo and mono. Also if your playing a video or audio file and you start the pairing process once connected there will be slight pause then it connects to the output in stereo. It works really well, I purchased a long usb male to female cable and now i have a little bit more increase in connection distance. I have not tried this for transfer of files. If and when I find a need to do so I will update.for now, at this price point it gives me freedom to connect my BT audio gear instead of purchasing a more expensive unit to give my laptop BT capabilites. and this is as small if not smaller than some thumbdrives. Oh and I also purchased a seperate QZ Powered USB hub for my drives. So the only USB devices connected are the Dongle, and the hub. Now when I disconnect the BT dongle my drives stay connected.I hope this information is helpful, I tried not to make it too long but it happened. If any questions arise please drop me a line and I will respond with whatever help I can give.,TP link products usually work well...while longevity with continuous use may vary, but these devices are not intended for prolonged or continuous use..I have had multiple to link devices ranging from wifi adapters, routers, range extenders, etc..Now I have tried this Bluetooth adapter..Pros:-Minuscule size, you can keep attached to the device, not noticeableBut not recommended to do so..as it's usually set to discoverable during setup and it has decent range..so if one is too skeptical, might lead to security issues.. although the hacker will have to be in the same house probably!Range is decent..works good in the same room..this kind of device is usually meant for local connectivity, usually without barriers...I use it to connect headphones to the PC and it works nicely for that..I earlier had a Bluetooth 2.0 adapter from enter and that worked well too, except for the range and bandwidth required nowadays has increased..so some choppy audio did occur with today's high quality audios and that got managed with this Bluetooth 4.0 adapter..nice clean audio..Lastly, it works nicely with Linux..i use debian based Ubuntu..and its almost plug and play..I did have blueman Bluetooth manager installed from the previous adapter I had.. And when I plugged it in..i didn't have to do anything else..So unlike what the site says, about only windows, it definitely works with Linux..I can't say if the 5.0 version UB500 will work though...While installing the driver in windows, I noticed it was installing CSR stackAnd CSR original chip ( there are many fake ones) is known to work with Linux..so maybe that's why it worked well..Coming to windows, i have win7.I had bluesoleil pre-installed, and it worked with it.Didn't have to install any driver separately..But there is a driver available in their site for xp/7..In win8 and above, it's supposed to be plug and play..So no issues there..Now the cons:-A bit high price than rest of the companies.. probably can improve on that....i bought it for 400Audio quality is good, but somehow, compared to my enter Bluetooth 2.0 stack..The audio was a bit muted..had to increase the volume higher to reach the same level of loudness..but even then, i feel, a slight reduction in the dynamic range of the audio.. no idea if that's a software or hardware issue..encoding/decoding issue..It's not very noticeable.. specially of someone doesn't have anything to compare with..Lastly, the windows driver is 400 MB!granted it has both 32 and 64 versions..but each one is almost 200 MB!Thats way to big for a driver of these devices..Neither bluesoleil/blueman cross 30MB..So I don't know what is being packaged in those drivers..Also, somehow the driver didn't have a clean install in my system, something to do with incorrect loading of c++ library...It didn't matter as I already had another driver installed..Overall a nifty little device.I have no need for 5.0 Bluetooth as i don't have any device that requires it..I just needed a 4.0 adapter to solve the bandwidth problem..and that purpose is nicely served and that it works both in win and linux is very helpful..Does the job well, few consHence one star less..,Using it for 2 weeks. Just plug it , install drivers and you are good to go ! Seem less connection with ps5 controller! Latency is very low around 1ms . So basically connection is even faster than wired connection (2ms) .  But when I simultaneously connect airpods gen 2 the sound output was very weak , it was muffled! But it serves my main purpose with ps5 controller .,Apparently, it seems like its the most relevant Bluetooth adapter out there good connectivity and all sort of stuffs like that, generally comes in a BT adapters I'd say the only con is the installation part it took a while figure out which was their website and drivers of ub500 aside from this everything is fabulous.,Very easy to install, connectivity is also good but sometimes while using Bluetooth earphones sound cracks also Bluetooth sharing is quite slow .....that's all*Otherwise th product is very good*,1) Easy to install, I mean just plug in .2) Connectivity is on all point but 1-2 time i feel fumble issues.3) sound quality is all depends on your wireless speaker.,If you are tight budget, it's okay then. Otherwise if can spend 150/- extra, go for BT 5.0 version. Much better in both range and connectivity.,Like", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31TZq2dY-hL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/TP-Link-Bluetooth-Receiver-UB500-Controllers/dp/B098K3H92Z/ref=sr_1_117?qid=1672903000&s=computers&sr=1-117"}
{"product_id": "B09KLVMZ3B", "product_name": "Portronics Konnect L 1.2M POR-1401 Fast Charging 3A 8 Pin USB Cable with Charge & Sync Function (White)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹159", "actual_price": "₹399", "discount_percentage": "60%", "rating": "4.1", "rating_count": "4,768", "about_product": "[CHARGE & SYNC FUNCTION]- This cable comes with charging & Data sync function|[HIGH QUALITY MATERIAL]- TPE + Nylon Material to make sure that the life of the cable is enhanced significantly|[LONG CORD]- The Cable is extra thick 1.2 meter long, optimized for an easy use for your comfort at home or office|[MORE DURABLE]-This cable is unique interms of design and multi-use and is positioned to provide the best comfort and performance while using|[UNIVERSAL COMPATIBILITY]- Compatible with all devices like iPhone XS, X, XR, 8, 7, 6S, 6, 5S, iPad Pro, iPad mini and iPad Air", "user_id": "AF2XXVO7JUBUVAOBTJ3MNH4DGUFQ,AH6VDJLLPBXKCWXMLBKMBCQ2ESGA,AE642RIGZIT2VPQJOLNUZ34QVWJQ,AFLHNKQH5UQZU3ATISKSMRE2KEDQ,AF2L4MCRCIDOOREQJN7QPQ4QBZCA,AGKLZ4SUHAU47KJXDVHBBEWJODUA,AHESCOYXLCXB56F4JO45X4CZQCYA,AGGHDE6KFZHEDUDJBD5R27AYMEWA", "user_name": "Deepaak Singh,siva k.,MUNDATH BALGOPAL,BOOPATHI,Rakesh,Ana,Xolo,Rushi", "review_id": "R20XIOU25HEX80,R2X55FA2EEUEYM,R393Z224NBTDLN,R3Q4ZCHWSAQD5B,R1AE3A4NSVM9SC,R2U1YAAZE07I1V,R36NVL58WQ7D64,R1E7GPZ569TBIZ", "review_title": "Great but,Worked well for 6 six months that’s it,Compatible with Apple iPad 2nd generation and charging very well.,CABLE,The product is good but the phone gets disconnected at multiple occasions.,Not a fast charging cable,Good item. Value,Amazing product and value for money", "review_content": "Loosing charging cable of apple is costly affair. This wire was great purchase made to correct it,Worked well for six months that’s it, now it’s stopped working, now planning to buy one more because the price has come down to 150,Very good product. Compatible with  iPad 2nd generation  and charging very well. Quality of the product is very good and also works fine. Totally worth for its price.,Product is super,I'm using from last 6 month. Till now it was good functioning. Now I noticed phone gets disconnected at multiple occasions. might be cable may be damaged.Overall worked well for 6 month.,Takes 5-6 hours to charge full.,Good item. Value,It is the best product I have used till now.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41R08zLK69L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Portronics-Konnect-POR-1401-Charging-Function/dp/B09KLVMZ3B/ref=sr_1_118?qid=1672903000&s=computers&sr=1-118"}
{"product_id": "B084PJSSQ1", "product_name": "SanDisk Ultra Dual Drive Luxe USB Type C Flash Drive (Silver, 128 GB, 5Y - SDDDC4-128G-I35)", "category": "Computers&Accessories|ExternalDevices&DataStorage|PenDrives", "discounted_price": "₹1,299", "actual_price": "₹3,000", "discount_percentage": "57%", "rating": "4.3", "rating_count": "23,022", "about_product": "The all-metal, 2-in-1 flash drive with a reversible USB Type-C and a traditional Type-A connector.|Seamlessly move content between your USB Type-C smartphone, tablets and Macs and USB Type-A computers.|Free up space on your USB Type-C smartphone so you can take more photos.|Automatically back up photos using the SanDisk Memory Zone app.|High-performance USB 3.1 Gen 1 drive with 150MB/s read speeds lets you quickly move your files to your computer.|Dual-purpose swivel design in a stylish metal housing protects connectors and features a keyring hole to take your drive on the go.", "user_id": "AHOXZCFLXIOIPGI7DXYFAI2644UQ,AERATALW2RRDMFXI77X4JJBT23RA,AFCKOCN7FG2KC4PCZZUORJFFGEJA,AHWQSD5JHCOHW7JYN7F52ABQCJQA,AFAVZL5OGYPPWWRW6TJ7XTEHPVFA,AGKSU4ZSIR6TKLSZKM3IHFEH3FZQ,AFPXTEAIUHCMFSNSGOL4CREXR4PQ,AH4TEK5IQCC2BSF2KSQNKQEXAPLA", "user_name": "Arun,Muneeb,Jatin,Gangadhar,Rohael saifi,Amazon Customer,Amezing books jordar.v.mc,Ramamoorthy", "review_id": "R21XRUZQ2MQ2ME,R368V5GBBAVTKL,RWYWGRLTSJX7N,R3VR8G8SJCIQM,R2SME90R32XR18,R2BTUXHC0LJSK2,R2LJ7EU195HEBH,R3SQTXO5SE96IF", "review_title": "Ya Nice..value for money..,Overall decent Product,Great deal for 1200,Good but heats up a little and error issues,Fast and efficient loved it,Does the job,Very good,superb", "review_content": "I think it's value for money.Speed Test# Read speed  USB 2.0 : 80-90 MB/s  USB 3  : 85-95 MB/s  USB Type C : 85-95 MB/s# Write speed  USB 2.0 : 20 MB/s  USB 3  : 21-25 MB/s  USB Type C : 20-25 MB/sPros:-* Metal body and not heavy* easy use* have type c* good qualityCons:-* product gets very hot while it's connected  (because it is a metal body)* We are not getting the speed that they said.,I like the metal body and build quality but at the same time it is metal so it heats a lot and speed is good it reaches 140-145 Mbps write speed when it is cold when it gets hot the speed get low as to 8 Mbps and storage not good i purchased 128gb varient and I got only 115gb 15gb less storage.Overall decent Product.,1)Heat alot as it is metalic2) Speeds are not consistent somtime it give 20Mbps speed and sometimes 5-15 mbps.3) I can say it is value for money for those who want a pendrive with type c connectorNote- I preferred metal because it is durable,you can also buy it's plastic varients both are same in speeds.Also plastic heat less,Pendrive is quite good. For write operation i am getting 10-15mbs, it heats up more when we perform r/w operation for a long time continuously. When we plug in mobile and then in pc i am getting some kind of error but files are intact and able to copy it,I like it's designe speed and build quality but there is a negetive point after you flip side for 10 to 20 time you will find that tha flip cover is starting to get loose,So far so good, it's early to right a review, as per my usage i will update accordingly,Good,user friendly", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41IZ3JvOvwL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SanDisk-Ultra-Drive-Flash-128GB/dp/B084PJSSQ1/ref=sr_1_119?qid=1672903000&s=computers&sr=1-119"}
{"product_id": "B097R25DP7", "product_name": "Noise ColorFit Pulse Smartwatch with 3.56 cm (1.4\") Full Touch HD Display, SpO2, Heart Rate, Sleep Monitors & 10-Day Battery - Jet Black", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,599", "actual_price": "₹4,999", "discount_percentage": "68%", "rating": "4.0", "rating_count": "67,951", "about_product": "[10-day battery]: With a battery backup of 10 days, just concentrate on your game without stopping.|[Noise Health Suite]: Automatically monitor your blood oxygen (Spo2 levels), real-time heart rate, and provide comprehensive analysis of your sleep quality (deep sleep,light sleep and wake up time) on this smart watch.|[Personalise your look]: Choose from 60+ cloud-based watch faces or customise them as per your preference.|[1.4’’ Full Touch HD display]: Get the perfect viewing experience on the 1.4’’ display with 240*240 pixels.|8 sports modes: Choose from 8 sports modes and give it your best.", "user_id": "AHECNVXSW6REC5TOGBH6OJXIBL4A,AFWAX2O5B5I36ESHPOWZKN25BYPA,AHSDH2Q4Q2QSUYUGEAGPIR22MT7Q,AFSJOIQSSLDDJPOWX3DDKXDA6T5A,AF7YEBOIUIR3AWM2L4PCV2MCTUOA,AGUXZXNTCLWNP7Y5QA2KYEJLBMKA,AGBT7W456GGMVOR73SNSIGLSK5DQ,AGYF2BCD5W756VOY2V5HJQCX4H4A", "user_name": "Ankita Dwivedi,Malathi Alunkar,Shubham♎,Oishi Basak,Vikram Sen,Dhananjay Sevalkar,Manohar salave,Kareti Naveen", "review_id": "R1NARG7VJ59AD3,R6BEKBJDZAEX5,R36J5LRZNMMZXL,R2AHCTVOGP0T6P,RXW00MCJXW4UW,R3HDBTGLJJ34YO,R1K6IPHKQQ03AJ,ROANI9ZPECRM0", "review_title": "Noise smartwatch,The product is good overall,Good Battery backup,Okayish product,Watch not working,Satisfied.,It's great watch,Noise", "review_content": "Good fit, nice smart watch in this price range, especially for  those who need only basic features . I bought grey color,It's been long I'm using this now. It has no issues. The battery, touch screen, bluetooth connection every thing works fine. I was looking for something simple and I got this.,Nice design and functionsCan't connect to Whatsapp and other social media app 👎,The modes in the watch are good. The UI sucks. Responsiveness could have been better. Battery life is moderately upto 3-4 days if worn constantly. Colour of the band is a bit faded too.,My new bill provide,Activity Record, sleep tracking is Good.,I bought it for my wife and she was very glad.,Good", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41XH-IpxCQL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Noise-ColorFit-Smartwatch-Monitoring-Waterproof/dp/B097R25DP7/ref=sr_1_120?qid=1672903000&s=computers&sr=1-120"}
{"product_id": "B097C564GC", "product_name": "rts [2 Pack] Mini USB C Type C Adapter Plug, Type C Female to USB A Male Charger Charging Cable Adapter Converter compatible for iPhone, Samsung S20 ultra/S21/S10/S8/S9/MacBook Pro iPad Silver", "category": "Computers&Accessories|Accessories&Peripherals|Adapters|USBtoUSBAdapters", "discounted_price": "₹294", "actual_price": "₹4,999", "discount_percentage": "94%", "rating": "4.3", "rating_count": "4,426", "about_product": "【WIDER COMPATIBILITY】This USB C Female to USB A Male adapter converter allows you to connect legacy Type-A laptops/PC,Power bank,Adapter and Charger with USB Type-C cable,USB Type-C hubs and USB Type-C peripherals. Specially compatible with iPhone 12/12 Mini/12 Pro/12 Pro Max,Samsung Galaxy Note 10/S20 Plus Ultra,Google Pixel 4/3/2 XL. ❌IMPORTANT NOTE: This product is NOT compatible with Mag-safe wireless charger due to the incompatibility of charging protocols.|【FULL FUNCTIONALITY】The USB A Male to USB C Female adapter has a multiple functions.You can easily hook up any USB-C peripherals (USB C cable, Type-C flash drive, USB-C hub) that make use of the newer USB-C connector.This USB C Female converter can be used for charging,date transfer,audio signal transmission and connecting keyboard or mouse.Additionally,it can be also used to plug into the car USB-A port.|【CHARGING AND DATA TRANSFER】This USB 2.0 adapter offers both sides date transfer speeds of up to 480Mbps between connected devices and also supports up to 2.4 Amps of power output for charging your devices,due to the built-in premium chip.Just plug into a regular USB A port,allowing you to convert to a upgraded Type C device.Truly a plug-and-play solution. ❌NOTE:NOT support video signal transmission.|【2 PACK COMPACT DESIGN】Comes with 2 packs: One for home, one for office, one for car and one carried in the bag, sticking with laptops or commonly used type C cable or others can be used as backups. Micro USB to USB C adapter is smaller than a coin, easy to carry around or toss in a bag. 15mm width allows you to plug them side by side, taking little space and working well in tight spaces.|【SAFER USING】USB C and USB A connector is made of premium aluminum alloy on the ends, designed for frequent plugging & unplugging and heat dissipation, which is safer compared to other plastic adapters. Every USB adapter has built-in 56KΩ resistor ensure safety during charging. Just plug and charge your devices with assurance.", "user_id": "AGO5SRT3ESLNL5WTRQFD5BSIYPQA,AGGNODUMRADB3PQQTLA3U7UKYEWA,AHOUPKNSFRTL4F3KLBXFMEFJSKUA,AE2BXTBQXZ54NAE4NYNFSBR2WREA,AFC3FFC5PKFF5PMA52S3VCHOZ5FQ,AFVUO24OGRVCE6Y7NXYDIOQZONCA,AFJGD6THKLQUOW46YHUM7RY2IPJQ,AEXCIDSOW3GVBORUKET6SP7RJ2PQ", "user_name": "Naga Sai Gadagottu,Neha Sharma,Amazon Customer,Ankita singh,S.ARUMUGAM,Umesh,Vasudeva,Krishna Chavan", "review_id": "R3CUNCZTU43JPP,RSO46BN8S4OSU,R2UD5D7T4DZRE5,R2XLJQREI5N1VB,R29MV5DZH3FQBH,R9F5EX21OJF17,R12QT09SFCET3,R2RQYG7OHKC98T", "review_title": "Tiny helping hand,Good product,As a whole good product,It works,Used ,as of now satisfied with the product,beep sound while connected,Good product,USB to C adopter", "review_content": "This eliminates the need to buy chargers for the new USB-C charging cables.The adapters tend to heat up while charging with Samsung fast charger.,Good product,Value for money,It works worth the money,Value for money,Its continuously play a beep sound while connected to the laptop, which is irritating.,Nothing to complain!,Good product but finish could have been still better.As of not working fine but doesn’t look much durable.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/3172BJyynBS._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/rts-Adapter-Charging-Converter-compatible/dp/B097C564GC/ref=sr_1_121?qid=1672903001&s=computers&sr=1-121"}
{"product_id": "B08CYNJ5KY", "product_name": "HP 682 Black Original Ink Cartridge", "category": "Computers&Accessories|Printers,Inks&Accessories|Inks,Toners&Cartridges|InkjetInkCartridges", "discounted_price": "₹828", "actual_price": "₹861", "discount_percentage": "4%", "rating": "4.2", "rating_count": "4,567", "about_product": "Page yield-480|Compatible with HP Deskjet plus ink advantage 6075, 6078, 6475, 6478|Original HP ink cartridge", "user_id": "AHCS34T4DOHWPNKZ2G3W76AITIKA,AGEMHG7WVU23NHOM3FGBFUDR4U2Q,AGCOAUC6ORUPLX2ZZZQR5HD3HGHA,AHO4LKHLICKCC2UKDNIAITWMGBJA,AGU4OVT7IYKSJIBKTMGCTB6DYUOA,AG6JGUFT2AOXWJS7UIOZBRYVE7VA,AFUES4NRZYASSBOKEIWJLHRO7CPA,AHDATOMH7HPV57Q6UFWUI47QEQ5Q", "user_name": "Hrishikesh,Mir Manzoor,Hanumathkumar,Amazon Customer,Gerry B,Yamini,Christin Sebastian,DIMPLE BATRA", "review_id": "R3C592OSGL2F93,R1E0XZJHFH6TXM,R2ENRB8YO7Y4S1,R3D1R5YMT9NWFM,R333HIWFHBI9EX,R3EGM0TULXVGUT,R3IJK2M8NM5F25,RYO5JW13I0MCH", "review_title": "On average is ok ok pricing,Good,Quality good.,Better,The original ink cartridges are always the best,Costly,Expensive but the product was good,Good", "review_content": "A lot of people rate this product low as there cud be other underlying reasons for catridge not working, the seller is giving 7 days return policy enough to test the catridge,Good,Quality is good,,Better than refill cartidge,HP original ink Cartridges for HP Printers are always the best and the safest way to go!,Too pricey,Easy to install, perfect fit for the mentioned printers. But its expensive,Good", "img_link": "https://m.media-amazon.com/images/I/4152kKO7W8L._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/682-Black-Original-Ink-Cartridge/dp/B08CYNJ5KY/ref=sr_1_122?qid=1672903001&s=computers&sr=1-122"}
{"product_id": "B00Y4ORQ46", "product_name": "Logitech H111 Wired On Ear Headphones With Mic Black", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|On-Ear", "discounted_price": "₹745", "actual_price": "₹795", "discount_percentage": "6%", "rating": "4.0", "rating_count": "13,797", "about_product": "ADJUSTABLE HEADBAND This sturdy yet lightweight stereo headset has a broad range of adjustment. Ultra-soft foam ear cushions provide hours of comfort.|ROTATING MICROPHONE The boom mic can rotate 180° to be worn on the left or right and tucked out of the way when you’re not using it. The flexible mic can be positioned for better voice capture and background noise reduction|MULTI DEVICE HEADSET WITH NOISE CANCELLING MIC:The simple way to start talking when using computers, smartphones and tablets. Features a standard 3.5mm audio jack and is compatible with most operating systems and platforms. Get just what you need to hear and be heard clearly.|STEREO SOUND: Enjoy clear audio for calls, music, and games. A reliable headset for daily audio including video calls with family or colleagues. Frequency response (Headset): 20 Hz - 20 KHz|3.5MM AUDIO JACK CONNECTION:Simply plug the 3.5mm jack into your computer, smartphone or tablet and you’re ready to talk.|SYSTEM COMPATIBILTY:Computers/ smartphones/tablets Windows/Mac/Chrome OS + more", "user_id": "AE4XKNCRFDT42UVC2DCKMIXW4MVQ,AFF4VJIKK6EL5VW7Z7QZGE2JAG6Q,AEV7WXLS2DB6RQA4TZIZ3A3E5L3Q,AGQUCM3GAU6HWOILIQRBR73AAR6A,AFRRHZVMJ63DSEXGYKGIGH7QJYJQ,AE5B4IQUTNKHTVKOPXPIZF7BSVCQ,AHQTD5TF5VW5IPOSAGIZ7VYFB66A,AFHJSGFTBH6DO62VXXNYJWTRC5JA", "user_name": "kishorekr,Anil.c,Abhishek B.,Ashutosh Bhagwat,Sandeep,Shivdev Singh Dhanjal,Avinash,Ankur Singh", "review_id": "R3H4H2BLYJ8K54,R1P0BZF3X3CT7I,R2UC6S1JJBFG43,R3NEEKXGIP67K0,R1U5XLD5P7F7FU,R2A1XQCL3IR2SO,R1PQT6I4G8V4UP,R3ALX1UAMP0V5F", "review_title": "Good product but low quality at less price,I took for meetings and it working well.,Good but built quality ok,Problem with comfort for long hours calling,Headphone,It does the job well.,Noise cancellation is quite good in this price range.,Work with teams! perfect budget headphones.", "review_content": "Sound quality is ok, noise cancellation is not Upto the mark, volume is good. Overall for the price it’s worth product. The cushion on the mic comes out easily , couldn’t have been fixed properly,Good,The built design is ok for the product. Everytime i wear and do the resizing my hair gets stuck in the band which is irritating. Rest sound and all is good👍🏻,I stopped using it after continuously using for 3 hrs for office use. It can not be used for long duration calls or back to back meetings. Ears starts paining after 2-3 hours use. Speaker cover is very thin. I will give this device to someone needy.Sound quality and built quality is nice but comfort is huge issue with this device due it's tight overhead band. It keeps both sides on ear for getting better sound or noice cancellation. But the one who is looking for noice cancellation will buy over ear bigger headphones.I use all types of headphones, over-ear, on-ear, earbuds. Earlier used Sennheiser on-ear headphones but it never gives pain.Ideally if anyone buying on-ear simple headphones then it is for calls or meetings where they still want to hear sound in their room. Some attention to sound in your room, for example keeping an eye on kids while being in meeting. Basic padding or multiple layer soft covers for on-ear will be helpfull.Guys go for iBall rocker over-ear or HP over-ear wired headphones for long duration office calls. It cost less compare to this Logitech device.However this is still good buy for upto 60 mins use for 1 session/call/meeting and then a break. Only issue for people having back to back meetings.,Nice quality,I bought this because I had to work from home and had to take calls. My only worry was the noise cancellation because I live next to a busy road. And I am happy with the purchase as the noise cancellation is working great. People on the other side of the call have never complained about any kind of background noise. The plastic quality used is great and it's not squeaky. The wire is long enough. The sound output is good enough, but I don't intend to listen any music on these. If you need something for music then this is a wrong product.Con: The cushion is not adequate and starts hurting the ear lobes within 5 mins. I had some extra cushions so I added those over the ear piece.,Build quality is not that good but sound quality,noise cancellation is best in the range of less than 1000.,After covid-19 our life changes a lot. Online meeting, conferences, webinar, even online classes became new normals. In this situation a good headphone with mic is necessary for doing work flawlessly and this headphone has everything which i needed.1) Audio quality is good and crystal clear without any additional noise2)Mic is also very good with good noise cancellation3)Thanks to amazon for their service and ontime delivery. Getting early delivery for the product was bit urgent for me and it was delivered in almost 6 hour after placing order,I am fully satisfied with the product highly recommend for students and working professionals who have limited budget,you wont regret it. :)4. Only thing i am missing is volume control on headphone", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31puHGasbOL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Logitech-H111-Stero-Headset-Black/dp/B00Y4ORQ46/ref=sr_1_123?qid=1672903001&s=computers&sr=1-123"}
{"product_id": "B074CWD7MS", "product_name": "Digitek DTR 550 LW (67 Inch) Tripod For DSLR, Camera |Operating Height: 5.57 Feet | Maximum Load Capacity up to 4.5kg | Portable Lightweight Aluminum Tripod with 360 Degree Ball Head | Carry Bag Included (Black) (DTR 550LW)", "category": "Electronics|Cameras&Photography|Accessories|Tripods&Monopods|CompleteTripodUnits", "discounted_price": "₹1,549", "actual_price": "₹2,495", "discount_percentage": "38%", "rating": "4.4", "rating_count": "15,137", "about_product": "Premium finish light weight professional tripod with adjustable height, multi level locking and steady rubberized legs|Compatible with most video cameras, digital cameras, still cameras, GoPro devices and smartphones. Height Range: 615 mm - 1700 mm|Multipurpose head with Quick Release helps ensure fast transitions between shots|Built-in bubble head to adjust horizontal position and 3-way head with adjustable pan to allow for tilt and swivel motion with portrait or landscape options|This professional tripod features multipurpose head for DV camera's|Convinient accessories hook to latch all your shoot belongings|Recommended max load weight is 5kg for optimal performance", "user_id": "AEACCLBAYRCRJLUMTQVS5JSOYYVA,AEBFS3LI626ABZMQMQQZAVCZMSEA,AEPNFXQVCUUGVV74K5KGJEIGCBMA,AE7YHD67JEECIX3IESFI44QL4HNQ,AFCCTAOXYH2XQNESLRQRH72G27ZQ,AGSVOGYYWRHJDZKU3MCFFYIPEVWQ,AGWVUW6YRWVQ3III5WXH7X4RE4DA,AHEH2QAVUEPNGB7EQJJWPYAOCAAQ", "user_name": "Joel Thomas,Joy Ghosh,Amazon Customer,Pıŋkɘsh Goʋɽ,Deepak Kanwaliya,AVINEESH,anoop tiwari,Kumud Prajapati", "review_id": "R2QDKL6M3BGGR8,R2GXKYBJXNF3HR,R3OBHPHLETR6ZR,R6ZP9NF1BL84O,R1OIEL27NJ0RCO,R1JQG83T7U855F,R3J34H7VBLFKDM,R39DXFGYRXPIW2", "review_title": "Worth a Purchase. Good Quality product,Strong, Mutiple channel, Durable.. Worth it ...,Robust, Durable (Phone Holder is added but not mentioned in Product details),Really Liked It!,Mast h,Nice amazing product,IS GOOD BUT NOT RECEIVED MOBILE HOLDER AND THIS PRODUCT BUY ONLY VIDEO REIVIEW,very handy and build quality is good at this price point", "review_content": "I generally don't write reviews on Amazon. But this product is worth every penny.Amazing Product1. It is sturdy2. Good heavy-quality metal is used yet still lightweight and portable.3. Can be easily carried in 1 hand4. On Full Open, total Height reaches 5ft 9in (so can even cover if there's a stage)After buying this, I even surveyed the local market, I can now confidently say I have invested in the right product.There are products available for 1,000 Rs, but paying another just 500Rs for such a quality product is a better decision (Keeping in mind long-term use).,Its been 1 yerar 3month i am using the stand fr my video shoots ... Either its indoor or outdoor ..the stand is so strong and so many option to manage your stability and angle.. Even its so handy that often i use it just holding it like a gimble (though it do not stabilize the video) but i am very use to of it bcs of its  compact look...Go fr it... You will not regret 🤞🏻,Likes:Robust, durable, very well assembled.Dislikes:Due to strong built up, and bigger in size it is difficult to record video of the downside part as tripod legs come in the picture along.As mentioned in the product details, phone holder not included. I purchased a new one alongwith this product. However, there was one phone holder given in the Tripod Box. Due to this false detail, I had to purchase one more phone holder which is under non-returnable products category and is to be kept now.,Same As shown In PicturesGood And Well StableReally Wanted One for My video shootsMust Have For Camera And SmartphonesThey Say It Doesn't Have phone Holder, But They have Sent One Included, So Don't Order Already One.Thank You Soo Much For That Merchant.,Mastttt,I really like this amazing product. Worthy money buying it. Don't worry about negative reviews.you are worth buying it. Tqs,Ok,", "img_link": "https://m.media-amazon.com/images/I/41NJeh+qQRL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Digitek-DTR-550-LW-Tripod/dp/B074CWD7MS/ref=sr_1_124?qid=1672903001&s=computers&sr=1-124"}
{"product_id": "B083342NKJ", "product_name": "MI Braided USB Type-C Cable for Charging Adapter (Red)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹349", "actual_price": "₹399", "discount_percentage": "13%", "rating": "4.4", "rating_count": "18,757", "about_product": "1M Long Cable. Usb 2.0 (Type A)|Braided Usb Type C Cable|Toughened Joints|Strong And Sturdy|Country Of Origin: China|6 Months Warranty", "user_id": "AGSGSRTEZBQY64WO2HKQTV7TWFSA,AEYD5HVYAJ23CR6PTWOOIKUOIDHA,AFRMNW6TDHDZBP2UHF2K3MEAEYUA,AHICHCW6EC3BNV2IDAEAJPBG4HZQ,AGWFKE7RNP6EVC4JFLFSL76EEVVQ,AGEOQQHGNELZNEUKJAJUA7NTPBLA,AFS3QBSOMCE2FAZFUYZ3NBFQDLMQ,AGJYG6ZWCWD74WNE6Y37XZ2VUSMA", "user_name": "Birendra ku Dash,Aditya Gupta,Abdulla A N,Deepak,Gowtham,Rakesh,Pawan Kumar,Prabhat Raj Pathak", "review_id": "R2JPQNKCOE10UK,RQI80JG2WZXNF,R2LYZ4CUWPMUJN,R1ZBD2ZB2ZYEWX,R2ITEDC9KOCY3N,R1115HIQP3BKKJ,R31OMS6DNMI7M,R2DCFXQMUNO93L", "review_title": "Good product,using this product 8months It is done  I have not faced any problem so far, its build quality best,I really liked this one.,Very strong and support fast charging ,,Nice cable,Best data cable charging fast,Good job,Good but need some improvement", "review_content": "I like it 👍👍,Best charging power . I used this cable on note 8 pro mi. Using 8month also fast working.,350 might be a little expensive but physically it’s so good. Feels premium. But power limitation is there it is not suitable for fast charging.,,https://m.media-amazon.com/images/I/61WnvIUaIwL._SY88.jpg,Best data cable charging fast,Very good quality and good durability,Overall good but need some improvement...", "img_link": "https://m.media-amazon.com/images/I/31gaP7qpBNL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Mi-Braided-USB-Type-C-Cable/dp/B083342NKJ/ref=sr_1_125?qid=1672903001&s=computers&sr=1-125"}