{"product_id": "B0B82YGCF6", "product_name": "Tokdis MX-1 Pro Bluetooth Calling Smartwatch - 1.69” LCD Display, Multiple Watch Faces, Sleep Monitor, Heart & SpO2 Monitoring, Multiple Sports Modes, Water Resistant", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹899", "actual_price": "₹3,499", "discount_percentage": "74%", "rating": "3.0", "rating_count": "681", "about_product": "【Bluetooth Calling Watch】- Tokdis MX-1 Pro enables you to make and receive calls directly from your watch via the built-in speaker and microphone. This smartwatch features a dial pad, option to access recent calls & manually sync your phone’s contacts.|【How to activate Bluetooth Calling】- To enable Bluetooth Calling Function, first connect it to the Fitpro app. Once connected, manually go to the phone's Bluetooth settings and pair this smartwatch. Upon pairing, you will get a notification.|【1.69 inch HD Full Touch】 - Large Display of 1.69 Inches Size 【Full Metal Body】 - This Watch features Sleek & Fashionable Metal Body The one-click control mode and honey comb menu helps you quickly navigate|【Music Experience On The Go】 - Equipped with an inbuilt speaker, this smartwatch lets you play your favourite tracks on the Watch without having to take out your phone.|【Multiple Watch Faces & Smart Controls】 - The Smartwatch has unlimited Watch Faces on cloud. It has Smart controls like Weather Forecast, Alarm and many more. Get a 6 Months assured warranty from Tokdis in case of any Manufacturing Defect (Just Contact our Customer Care).", "user_id": "AFEMYJODFSKRPR4XTYKCPXMCO4YA,AH7PGDCSET6C5NOBBY2TLG2GX3IA,AEU243XCV5FGTBUI3KKCC5BGXH6Q,AFIQV62SLZITCC4FDVBUSBXBBIEA,AEHSXJA4C4V3JQWZMSE6FTILXNXQ,AEOODTBGBG2EUG3TEFGVON7V5NLA,AGMO4AMM5IA4MMUHGAXVMUHY37LQ,AHUIRRUDX4AQRQM4N7WNVLAJLSPQ", "user_name": "Gourav Choudhrani,Mustak ali,Amit,Pankaj solanki,yemcee1954,Shekh ismail,Mukta,Penchalbabu", "review_id": "RGEDIZCX7LB34,R19GGFEAAXAUKK,R3L3EFRRM8X2IY,REN3MEL7IYDKT,R2H176Z5380NWJ,R1AFCXRUZ8KCCK,R16381PP969JBP,RFDKRGYGQB7U6", "review_title": "Its is good but battery life is very poor,Heart rate sanser and battery backup,Nice product,Good product within small price range,poor.,Cool product,Gets disconnected , time n data doesn't updates automatically,It's good deal at 849/- works fine for first few days", "review_content": "Its is value for money,,Good product,Good, liked,,charging lasts short time. charging with straps impossible. very poor working. not worth the money paid.,It's tiny specially can be look great on tiny wrist, look is also nice but internal feature is some down it must be upgrated.,Auto data collection n update not there . Gets disconnected all time. Hard to connect. Doesn't get update automatically with time n day . Today is 12 dec Monday n it's still showing 10 dec Saturday. Had to update time everytime,It works fine for first five days, even it is cheaper, it should be worth of the money. And now two months works good", "img_link": "https://m.media-amazon.com/images/I/31M4nb0+JKL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Tokdis-MX-1-Bluetooth-Calling-Smartwatch/dp/B0B82YGCF6/ref=sr_1_370?qid=1672895857&s=electronics&sr=1-370"}
{"product_id": "B08HF4W2CT", "product_name": "URBN 20000 mAh lithium_polymer Power Bank with 12 Watt Fast Charging, Camo", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|PowerBanks", "discounted_price": "₹1,599", "actual_price": "₹3,499", "discount_percentage": "54%", "rating": "4.0", "rating_count": "36,384", "about_product": "Proudly Made In India|It will charge a 3000mAh phone battery up to 4.7 times & It will charge a 4000mAh phone battery up to 3.5 times|Dual USB Output 2.4 Amp 5V Fast Charge|Compact body along with smooth touch finish gives the Power Bank its premium look, weighs only 354 grams|Micro USB Input. Takes up to 10-12 hours to charge the power bank", "user_id": "AFQUZXA3JPEY4SN7Y772C3Q55IWA,AGUHIAX34GIKOODYIJPF3WLC7D4Q,AFU2GGLEYBWH47VH3HVIR3352MPA,AFHP4M777XP7BFZDMZBUR755IQWQ,AEUXG6K2NIXVHWICO5AUEZ5TZX2A,AHWNDRVWM3DJTAWT2AXHUU2QMVMA,AGPCRJBUW6U66EYH5WARIXLIWLVQ,AFK6EVINI6JZPXK6CRXGD6G7V6VQ", "user_name": "Rajesh Martis,priyanka Gowda,Velmurugan,Nitin,Sowdesh K.,Kumar,Vinod kumar,Jayan Menon", "review_id": "R3FQMPLCZV75E,R3CXYW32DE2XCE,R3VMIAJI5S2S9M,R33BXR8IIASQCO,R31X014WG1MEMQ,RNZ3UOYY7B2N0,R28IU0P7UBCRG6,R34GOU1HWA68GA", "review_title": "Worth the price,It is good,Not Bad,BATTERY LIFE,It melts the smart watch charger,Very good light weight,Achha laga,Can’t be repaired", "review_content": "Good for the price,Nice one,Just OK for the price...,BATTERY NOT WORKING,Comfortable and small to useIssue in power supply that melts the charger cable of smart watch,,Pasand,Sleek etc yes, but mine stopped working after 7 months.  It has a moulded outer casing ie no screws to open/repair if it stops working. Replace it in warranty else throw it away..Buy at your own risk.High time Indian consumers got #righttorepair", "img_link": "https://m.media-amazon.com/images/I/31S1zpNb8bL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/URBN-20000-Li-Polymer-Compact-Charge/dp/B08HF4W2CT/ref=sr_1_372?qid=1672895857&s=electronics&sr=1-372"}
{"product_id": "B08BCKN299", "product_name": "Sounce Gold Plated 3.5 mm Headphone Splitter for Computer 2 Male to 1 Female 3.5mm Headphone Mic Audio Y Splitter Cable Smartphone Headset to PC Adapter – (Black,20cm)", "category": "Electronics|Headphones,Earbuds&Accessories|Adapters", "discounted_price": "₹120", "actual_price": "₹999", "discount_percentage": "88%", "rating": "3.9", "rating_count": "6,491", "about_product": "WIDE-RANGING USE: The cable features one 3.5mm Female and two 3.5mm Male connectors, enabling you to connect a 4-position headset with Audio and Microphone input to your PC or Laptop.|PURE ESSENTIALS: 24K gold-plated contacts, pure metal housing, strong nylon-braided exterior, secure-fit design, and oxygen-free copper wiring,to ensure to present.|SUPERB PERFORMANCE: Connect a 4-position headset to a computer that has separate microphone and audio ports. metallic housing which makes it easily survive everyday usage.|STRONG BRAIDED EXTERIOR : Creates a durable design. It’s our first time to use fishing-wire-kind materials braiding with audio cables for maximum protection.|QUALITY: The jack itself has additional insulation which helps in the durability of the product during multiple plug-in and plug-out maneuvers and keeps the interference to minimum.", "user_id": "AG4KZO4DB3TYVVMBWPWMMJGD4ZYQ,AHE6VSQN5XCADFDWC3TZMMWKYADQ,AHRNAZGI4ZD7G633XI64QAT6F3WA,AHUX4GCB3OYN52TETLMI7OO4JJGQ,AET2XG6WT3TJSTOJRZ5UFC5TYYHQ,AEOIVRQ4ELTA76SML2EVSFT4UM6A,AHEXJOGQ4ZOV6QSW3IHMLRYGFMQA,AEWG5SV4CCM5NUDRMA22BMJDGZVA", "user_name": "shaan bishwas,Anirvan Kule,Tannu Mahanand,Sunil Sharma,Anuja Lad,Sankar Agarwal,Amazon Customer,Jophin Joseph", "review_id": "RO163Q6WRVSZZ,R28DMP1E79OWIH,R2FJI6OH7CFVRL,R1CHL5MG2PHSFJ,R2T11MDTCMZ8IQ,RV544Y0ARIS17,ROHRC9ZCY3ZKI,R28O9QSWHZF2KK", "review_title": "Recommended !,Good product,Please wire quality improve karo,Value for money product.,Amazing Performance & Great Quality,A lot of noise when mic is plugged in.,Great product,Good", "review_content": "I bought this splitter for 120 rupees. I did not find any issue with this product. I am using my wired realme buds 2 earphone and MSI gf63 laptop to test it. My feedbacks:My mic is working properly.No issue with left and right sound.Build quality is also not bad, splitter used flat cable which seems durable.RECOMMENDED 👍,Good product overall. I needed this type of adapter for connecting my mobile headset to my Pc for listening & recording so it's working well on my Pc but only problem is if the earphone jack is inserted fully to the line out socket of Pc (front side), the sound is very low so it needs to be inserted 3/4 only & in that way full maximum sound coming,https://m.media-amazon.com/images/I/61ytYJ9ba7L._SY88.jpg,Good working with boya m1 mike.,When I decided to buy this, I found this with good reviews and Amazon recommended. After using it for many months, there is no disturbance in the quality, both mic and sound.Since I use Laptop and Desktop with same earphone, I need to frequently connect and remove the earphone from the cable, the cable is connected to Desktop, to connect the earphone directly in laptop, having done this so many times there is no issue when it comes to quality.I have recommended this to my colleagues and they also have liked the performance.You can buy this without hesitation.,The headphone jack works well, but when I put the mic jack in the pc, it creates a lot of noise which I am easily able to hear. It causes a bit of irritation sometimes. Elsewise the product is quite good,Great product and really durable.,Good product", "img_link": "https://m.media-amazon.com/images/I/41jmiwgyu8L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Sounce-Plated-Headphone-Earphone-Splitter/dp/B08BCKN299/ref=sr_1_375?qid=1672895857&s=electronics&sr=1-375"}
{"product_id": "B0B2X35B1K", "product_name": "Noise ColorFit Ultra 2 Buzz 1.78\" AMOLED Bluetooth Calling Watch with 368*448px Always On Display, Premium Metallic Finish, 100+ Watch Faces, 100+ Sports Modes, Health Suite (Jet Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹3,999", "actual_price": "₹6,999", "discount_percentage": "43%", "rating": "4.1", "rating_count": "10,229", "about_product": "BT calling: Experience advanced calling experience right on your wrist. Manage calls, dial from recent call logs or access favourite contacts.Strap Size & Material : 22mm & Silicone|Single-chip BT calling: The single-chip BT calling with BT v5.3 ensures faster pairing & connectivity along with low power consumption|1.78’’ AMOLED Display: See everything that’s going on in your day on the big, bright Always On Display with 368*448 pixel resolution and 500 nits brightness|Noise Health Suite: Stay in the loop with what’s going with your body via Noise Health Suite|100+ watch faces: Be the trendsetter and wear a new face every day|100 sports modes with auto sports detection: Step outside your comfort zone and get more active|7-day battery: Say goodbye to the battery woes as the smartwatch stays with you through the week", "user_id": "AHN6E6FWRU4KL6CALQVHR3IUMIAQ,AGHGAMWSDB7XXN3GEC4YFDG47CJQ,AGMDO4P3J3J6EV3C7KL5LNIZ3OMA,AEJVKFNPY3U6JF4OWLCJ2XMZNFWQ,AGSVPPCUSENUIYUPBIHKEYIG2NCQ,AF7HMPO2QTCXQ3LHWO4WXXWVH63A,AFF3B5BNL52NXU2E3X5MOBNVGKGA,AFX7BRLKONY7SL2HZRE7RXKZRPHA", "user_name": "Shanti Devi,Amol B,shamsher alam,Ravi Shankar Sharma,Monesh,mohammed Junaid,Akshay,Sachin Singri", "review_id": "R3PAFFUU229VTJ,R1FZWI2NPCR3IO,R3BENPL8J8RWGA,R1L15IJRIO4PAL,R3GC9CY0SL1XKW,R2ONYYWA0QB6FS,RP7C5V4J1BO3B,R2WXTI182FAGGR", "review_title": "Wonderful smart watch,Value for money. Good for first time users,Awesome,Best in market,Good,Worst customer support noise,Calls and userinterface is nice,Noise", "review_content": "This smart watch is very nice one. It's battery back up is also very nice. Bluetooth connectivity is also excellent. But, wheneveor i try to see share price it takes few more seconds by pressing side key. It must be seen by changing the page without pressing side key to open new menu.,It is nicely designed device. Good for tracking daily steps and heavy exercise.Once charged fully, battery discharges within 4 days.,Thanks for offer,Best in market,Watch is nice but some features are not there like ai assistant while the other low budget watches have,Worst customer support noise has I have raised the complain 3 times but no one has contacted me yet and really worst if we call customer care it takes half n hour to connect they will tell our executives will call you and get the products no one is calling after 2 days they complain has been solved and closed,I did not use.  Sleeping track yet but  touch screen and over app experience is very nice and. Display quality is also nice,Nice product", "img_link": "https://m.media-amazon.com/images/I/41wlZ0cZChL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Noise-ColorFit-Bluetooth-Calling-Metallic/dp/B0B2X35B1K/ref=sr_1_379?qid=1672895857&s=electronics&sr=1-379"}
{"product_id": "B09QS9CWLV", "product_name": "Redmi Note 11 (Horizon Blue, 6GB RAM, 64GB Storage)|90Hz FHD+ AMOLED Display | Qualcomm® Snapdragon™ 680-6nm | 33W Charger Included", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹12,999", "actual_price": "₹18,999", "discount_percentage": "32%", "rating": "4.1", "rating_count": "50,772", "about_product": "Display: 90Hz FHD+ (1080x2400) AMOLED display; 16.33 centimeters (6.43 inch); 20:9 aspect ratio|Camera: 50 MP Quad Rear camera with 8MP Ultra-wide, 2MP Macro and Portrait lens| 13 MP Front camera|Battery: 5000 mAh large battery with 33W Pro fast charger in-box and Type-C connectivity|Processor: Qualcomm Snapdragon 680 Octa-core; 6nm processor; Up to 2.4GHz clock speed|Memory, Storage & SIM: 6GB RAM | 64GB UFS 2.2 storage expandable up to 512GB with dedicated SD card slot | Dual SIM (nano+nano) dual standby (4G+4G)", "user_id": "AEJLOEHISUISLO2Z4RE2TO2V6NGA,AEJ4UYFD3M2WGB3WEQJOZ3GGJY7Q,AFJ3CVFC3MO2Z3MYQTCELWT4TTKQ,AEEBECR65JN34YC7NEJIFAQB67TQ,AE5XN2CICXIBA4IK6F4ONOJ6TOCA,AGUZQN2LWKQXLXBJO2NRTXGV7EUA,AHWQSD5JHCOHW7JYN7F52ABQCJQA", "user_name": "Meghnad,Partha Dey,JAIDEV CHOUDHARY,Mayank Singh,JeneZ,chetan kamerkar,Gangadhar", "review_id": "R1GQJYYLCFOXJ8,ROASRYCFUFCK0,R1M63KP70YH4TU,RV26OEPPLTVTZ,RAS4252SOW901,R1EQV38U53I993,RD4X602L8KNNS", "review_title": "Excellent Phone in the budget segment,Best value for money... But afraid of future MIUI updates.,Don't purchase it as camera phone 😤,Dependable & it's been a year.,Budget mobile,Good for basic use,Phone is nice , but software is not", "review_content": "I was looking for a phone below 10K. I am not a person who believes to burn money for phones. My requirement was a phone that has good network reception, good wifi reception, a balanced software, good battery life, good screen that don't strain eyes, a good hardware, 3.5 mm headphone jack, and a charger. i don't need 5G network because 5G drains battery a lot and 5G spends too much data. I don't watch movie or YT on mobile network and I wonder how many does watch FHD, 2K, 4K videos over mobile network. For downloading documents, social networks, banking apps 4G is more than enough.In my budget I found all phones have 4gb RAM. Realme Narzo 50 was 9999/- during GIF and had all those features along with a good processor and another one was Redmi note 11. But I found that if I can extend my budget a little more with all coupons and bank offer I can get a Redmi note 11 with 6gb RAM at 11749/- . 6gb RAM is always preferred over 4gb RAM because nobody knows whether with future updates the OS would demand more RAM or not, also the softwares may require more RAM as time passes away. So this was the only option I knew then available.Redmi note 11 has AMOLED Display, I am not bothered with 60Hz, 90Hz,120Hz. I keep the refresh rate at 60Hz and display works without zero lag or stutter. All my Desktop screen has 60Hz refresh rate and I am happy with them so why do I need a 90 Hz screen? I think this is all just gimmick marketed by companies and online reviewers. The display has excellent colour reproduction capability and colours look rich. You can adjust colour temperature to warm or cool but I think standard is fine for me. Also you can calibrate display colours in settings but I think you don't need that. Display size is 6.43 inch it could have been better if it were 6.7 inch. I prefer big display phone. Redmi note 12 has that big display. A plastic screen protector is pre applied on screen and I am happy with that. The screen protector feels smooth and fingerprints can be easily removed by wiping with a damp cloth. The screen has a punch hole camera which looks good.This phone duel speakers. One is more powerful at bottom and another on top. But i think the second speaker is actually earpiece which amplifies while watching movies or YT. Bottom speaker is louder than top speaker and volume is good. What more do you expect from such tiny speakers!The phone has excellent wifi and mobile network reception. Many have complained about poor wifi connectivity but from my experience I can say my phone and Wifi modem stays at different floor, still I get good signal, and never disconnected. Voice over mobile network sounds nice and clear and the other party can hear you well and clear. However because the second speaker is an extension of earphone piece the sound will leak if the other person is shouting over phone.The phone has 5000mAh battery and comes with 33W charger which is a bonus at this price point. The battery gives long backup. With good mobile network you can use it for 3 days without charging using basic features, like phone, sms, email, FB, WA etc. But I charge it regularly and battery charge never drops below 70%.The phone has SD680 processor which is more that enough for basic tasks and performs well without any lag. The experience is butter smooth. However the apps get automatically cleared from RAM which I like because I don't have to clear RAM manually. However after Android 12 update the RAM hold App for longer time but eventually cleared. SD 680 doesn't heat up and it is very energy efficient. Because of that battery drains very little and 33W charger charges phone within 30 mins for my usage. The cable is USB A to C and feels good.This phone has IR blaster so in your home office you can control AC or other supported gadgets with this phone when remote is unavailable.This phone has DDR4X RAM and UFS 2.2 storage. The RAM is 6GB and can be expanded additional 1 GB as virtual RAM by occupying storage. But I have disabled that option from settings because it increases SSD life. This has 2 Sim + SD card slot. Which is a great. Both SIM have VoLTE and carrier aggregation.The phone has beautiful back and colour is attractive. Some people may complain about plastic But remember plastic back phone has better network reception than metal or glass back phones. And I have no problem with plastic. I don't think plastic back makes your phone or you look cheap. I am happy with plastic back. The phone also gives a TPU cover and the cover however yellowing after i month. This is inherent chemistry of TPU, and no one can prevent this chemical degradation. How ever can be slowed by not exposing it to sunlight.The fingerprint scanner is excellent it works flawlessly. The touch screen is excellent too.However I dont like some of the preinstalled apps. Some can be uninstalled a few can't especially Mi pay and getapps from mi store. I don't like them. However I like the pre installed security app. There is no ad in notification  and all can be easily disabled. Camera at back is good and sufficient for me however the front camera is not good. Does not show pictures like 8MP camera. I have added some pictures clicked by Redmi note 11 back camera. MiUi is fluid and has many user friendliness like OneUI. MiUI is now free of Bugs and has an extremely polished version that will please the user.So I give Redmi 11 a score of 9.5/10. This is an excellent phone the I got at 11749/- during Great Indian festival. I recommend anyboy with basic usage to buy this phone. This phone is not for gamers or people who watch 2K, $k videos or shoot such things. This is not or those who are crazy for 5G. Otherwise this phone will fulfil your every requirement in this price segment.,50 days usage...1. Good battery LIFE. Bqest for day-day use. 33W charger also good.2. Best display but should've 120hz instead of 90.3. Sturdy in-hand feel4. Stereo speaker is loud and crisp(65-35 split).5. Camera above average... But good concerning the price.6. Buggy UI(minor) as expected. But ui13 all way better than bloody MIUI 12.5.7. 4G chipset SD 680, which is fine... 4G+ always available.8. Some minor issue with WiFi reception. Don't know may be they will fix it through OTA.*** THIS PHONE IS FOR PEOPLE WHO CLICKS PHOTOS HERE & THERE, CASUAL GAMER & BINGE WATCHERS OF WEB SHOWS/MOVIES... \"NOT INTENDED FOR HEAVY GAMING\"NOT FOR PUBG, COD LOVERS.,The first look of this starbust design is eye catchy...no word to express its design,in hand feel and and it's all physical dimension. the second this which impress me, it's battery backup.....even you playing game hardly for a long time....it gives you sufficient battey backup and charging speed also 33W, is also a good deal at this price. The third impressive factor is it's dual speaker....I have an another phone of 40k and the sound quality is almost same as it. Media playback experience is also enhanced by it's amoled display, very colour charming display...... literally the display quality is unbeatable. The camera notch and dual speaker increase the media playing experience. Other Performance like gaming is also good at this price point. Fingerprint button is also very responsive. All other things and features are good to the price point.Only one thing is very disappointing bcoz the hype of its camera that company shows is very up to the mark and professional photography but the camera is lower grade...even my old Redmi Y2 which I exchanged with this, had better camera than this ....So plz I request you to all .... don't buy this for camera....just don't. The images are shown of camera pictures on the website is illustration according to me......I don't recommend you to buy this phone as your camera phone.If you are non camera user then you will surely go for it.Pros- design, in-hand feel, battery and charging, amoled display,dual speakerCons- camera😤😤,Quite a smooth daily driver phone. The overall experience has been satisfactory, camera's good, durability also seems to be good, I've dropped it quite a few times & the gorilla glass 5 seems to be holding up. 120hz feels great. Charging speed is good too, nothing mind-blowing though. Battery life is decent. Lasts quite a bit, but since I keep it in the 120hz mode all the time, it's a little less for me. But I don't have any problem with battery life for now.,It does what the description says.Camera quality not upto the mark, compared to other redmi mobiles. Even A3 model clicks better pics.Finger print sensor is same as that of the lock  button. You need to press the lock button every time to get the fingerprint read.Volume is good for both call and streaming.Fast charging but charger gets heated soon.Battery back up is good, unless you don't do heavy gaming and all day video sreaming.Dual app and dual space option is missing.Light weight and good video resolution.Overall good for learning students for online sessions and persons with less need for photography & gaming.,I bought this for my dad and it's working good for him, if you are planning to give it to your parents or elderly people in your family just install third party launcher and hide unnecessary app aslo turn off spamming notification and lockscreen ads overall good Phone for elders or first time smartphone user.,Phone is good, but i facing weird bugs due to software issues. After that i manually installed latest global software then working fine.When i was using indian firmware, after the update the phone got into bootloop every 10 sec, but after manual installation its working fine", "img_link": "https://m.media-amazon.com/images/I/4121yWSVFmL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Redmi-Horizon-Qualcomm%C2%AE-SnapdragonTM-Included/dp/B09QS9CWLV/ref=sr_1_382?qid=1672895857&s=electronics&sr=1-382"}
{"product_id": "B0B1NX6JTN", "product_name": "Spigen Ultra Hybrid Back Cover Case Compatible with iPhone 14 Pro max (TPU + Poly Carbonate | Crystal Clear)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Cases&Covers|BasicCases", "discounted_price": "₹1,599", "actual_price": "₹2,599", "discount_percentage": "38%", "rating": "4.3", "rating_count": "1,801", "about_product": "[Compatibility] Spigen Genuine Case Compatible with iPhone 14 Pro max|Clear Design : Crystal clear transparency flaunts original phone design|Protection : Air Cushion Technology for shock absorption|Precise Fit : All connections and buttons are easy to reach and use|Material : Hybrid technology made of a TPU bumper with a durable PC back", "user_id": "AHROIYVXUABAGL5GUFHMEZK3WQQA,AF4VIP5F264O5O2GKFZICPZ52E7Q,AH5ZOJA5RWLFQL3XE3GPOEXYDENQ,AHM5SJCQQWFMCWZ5776MEZGW5VWQ,AE7NBFOB3OSILKUH2JW5D2E26VFA,AG3DYTM7NUZADEFMPATX4TTIKH6A,AFGEXNVVJZMM7UZDPN6EBCUWSQNQ,AFZZGR3USTVT3SLKK2EJHBPJI7XA", "user_name": "Rajat,Ashray Tyagi,Ritesh,RAMESH BABU K,AstroQueen,Vishal Salian,Doctor,raj y.", "review_id": "R6LNTBPRGQ5SH,R8XCX03RG32U,RNP9KG0AKI8QG,R3LP9C2W2RTAQH,R2FX53CQOLKI7A,R2FAY534DIE3GK,R3BS9HLFNF3IKI,R35GQXCRXTDQ4Y", "review_title": "Good Looking Sturdy cover,Perfect fit for 14 pro max,Excellent fit and value for money must buy if using non mag charger,Excellent,Over priced,Awesome,Worth the money,Quality product", "review_content": "The cover felt sturdy and came in sealed package. There were protective films covering the cover from both side which had to be removed before putting cover on the phone.The fit was perfect and to take off the cover we might need to use some force . Overall the quality is good , will update after few months of usage about the colour fading/scratches.,The cover wraps around the iphone 14 pro max too tightly, making it difficult to remove once put. But at the same time, the cover feels solid and sturdy, providing complete protection the phone.,Excellent product. Avoid local market product for such premium phones 100% value for money,Excellent,normal transparent one but the price they are asking is too much. Like they are trying to loot ppl.,Awesome,Bought this as spigen is a decent brand. This is my initial case as I am waiting for better cases to be designed and released. Overall a decent case with decent protection for the phone and cameras.,This product is of good quality", "img_link": "https://m.media-amazon.com/images/I/51JrMWMAmnL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Spigen-Hybrid-Compatible-Carbonate-Crystal/dp/B0B1NX6JTN/ref=sr_1_389?qid=1672895864&s=electronics&sr=1-389"}
{"product_id": "B078G6ZF5Z", "product_name": "Oraimo 18W USB & Type-C Dual Output Super Fast Charger Wall Adapter PE2.0&Quick Charge 3.0 & Power Delivery 3.0 Compatible for iPhone 13/13 Mini/13 Pro Max/12/12 Pro Max, iPad Mini/Pro, Pixel, Galaxy, Airpods Pro", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|WallChargers", "discounted_price": "₹699", "actual_price": "₹1,199", "discount_percentage": "42%", "rating": "4.0", "rating_count": "14,404", "about_product": "🎁【18W Fast Charging- Always Speedy】Two ports pump out up to 18 watts of power, enabling simultaneous fast charging for two devices. 18W Type-C output port to give the latest devices a full-speed charge.|🎁【Universal Compatibility】Support all iPhone and Android Fast Charge, Quick Charge protocols like PD3.0, QC3.0, PE2.0, etc.Support all Android fast charge protocols, QC3.0, PE2.0, Dash Charge, VOOC, etc. Perfectly fits the charging needs of iPhone 13/13 Mini/13 Pro/13 Pro Max/12/11/11 Pro/11 Pro Max/XS/XR/SE/X/8 Plus, AirPods Pro, iPad series, Galaxy S21/S20 series, Note20/Note10/S10/S9, Pixel series, Nintendo Switch, and more.|🎁【PE2.0,PD 3.0 & QC 3.0】: Equipped with a 18W Power Delivery,3.0 port, and an 18W Quick Charge 3.0 port, the charger allows for charging two devices simultaneously|🎁【Safe and Reliable】This UL-certified USB C charger With the built-in intelligent chip, the wall charger matches the current as your device needs automatically, ensure safety and protection for your devices. No matter how fast it charges, you won’t have to worry about your phone heating up at all. A combination of 6 safety features that work together to provide ultimate protection for you and your devices|🎁【 Ultra-Fast Type-C Cable Included】 Oraimo 18W fast charger adapter comes with a fast charging type-c cable, It enables full speed charging and syncing to new Type-C models in the market.", "user_id": "AEKSR7FVH2XR55S47DZZLAFA4KHQ,AH2Z4CKZS7LRJGKNN7CBOZMQ5SNA,AGZOQA4S3KYQ5XWA2NNCVAPL5NAQ,AFAI2HVZTWZTAN4VOOOMVS5H55VA,AEQ2H25C6M6LFUM7FSHRKM7MMHOA,AE562XMNDX7ZSE5LXF3ML73JYBFQ,AFVF4DJMF7VPQN73T57F4CZT2HGA,AEN6F63NGBECRWCS3ZXU6TVDF2XQ", "user_name": "Samar Kumar Das,Jamshed,Jitendra Prajapati,Om Parkash Gagneja,Pavitra S,Dona Sreekumar,Souryajit Swain,Shreevathsa NC", "review_id": "R1DSLJ58BW45MG,RZF2IS7TK6MF4,RLAJSE9228SAA,RHZFWFPW57PEH,R5V3SEBXEYTV9,R3QW79LOKH6EDA,R15LLZLNGUHHTJ,R2NS5ZCYJFF5KE", "review_title": "Good,NICE 👍 IN VALUE.PARACASED ON TWO OLY,Working fine,Good product,Good one,Good one,Very good product,Decent product, worth every penny", "review_content": "Expect it will last long, price wise it's a good product. Till date it's working well.,One slot got out of order and one using now.value of money and second slot of the charger is average to use.🤪🤪🤪😂😂🇮🇳,Good quality no issues till now working fine with 5v 2ampAs it is 10 watt charger.,Fast charging,Yes it's very nice,https://m.media-amazon.com/images/I/61pgVx61I7L._SY88.jpg,Amazing product. Great charging power even two devices  connected with the charger. I charged my pixel 6a and wireless headphone together, both get charged quickly. But issue with the build quality. I once by mistake sat in the charger and the socket end of it broke from the edges and came out completely. I had to fix that with a fevi quick. Now working fine . Overall a very good product. Don't think, just go for it.,It's a good product for this price range. Works fine.", "img_link": "https://m.media-amazon.com/images/I/31gNcDrEskL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/ORAIMO-SUPER-FAST-CHARGER/dp/B078G6ZF5Z/ref=sr_1_402?qid=1672895864&s=electronics&sr=1-402"}
{"product_id": "B0BBW521YC", "product_name": "LAPSTER 12pcs Spiral Cable Protectors for Charger, Wires, Data Charger Cable Protector for Computers, Cell Phones etc.(Grey)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Décor|PhoneCharms", "discounted_price": "₹99", "actual_price": "₹999", "discount_percentage": "90%", "rating": "4.4", "rating_count": "305", "about_product": "SPIRAL TUBE CHARGING CABLE PROTECTOR are designed with highly flexible silicone and can be used as phone charger cord protector and phone charger saver to completely protect cables for all devices including, cell phones, computers, laptops, apple / android watches, lightning cables, pc’s, the list goes on and on.|Besides protecting all Your USB cables / cords, SPIRAL TUBE CHARGING CABLE PROTECTOR feels surprisingly nice and is fun to install on any wires end. Use it as your headphone cord protector or charger cable cover. Simply touching it can relieve your stress too! Yet, even better, the Lightning Cable Protector looks super cool. It doesn’t get any better than this!|works with virtually all computer and cellphone cables. You can even use it in almost anything like as pet cable protector, chewsafe cord protector, cord protectors from pets, wire protector from pets and as a wire protector tubing for phone and computer cables.|Spiral Tube charging Cable protector is your permanent fix to all those damaged lightning cables. It perfectly works as a cable strain relief or a critter cord so you won't have to deal with cable repair or iphone cable repair and frayed wire repair.|Wrap the cable protector onto Your preferred cable as an iphone charger end piece. SPIRAL TUBE CHARGING CABLE PROTECTOR will wrap around any wire just like a protective sleeve would but with more mobility.", "user_id": "AEJSMM2J65DGILOOHC24C74VWPBA,AFC4X5UHL2LN4PBS2TWOMIZ2GHAQ,AEO5TWJ7OMCWVSYFCFNFE7IPHZYQ,AH4V7BEA2Q4XN6RTECG52HJ2HQEQ,AEQ567MMOMWFLO5Z2P4L54R4M3MA,AF3VFLFIMQBQ33R3XIVUEAEERSHA,AHQQTNBM4SFZLLOLXJXA7N42YTTA,AHOF7ZRAY3XJT452UT7VOSM3FSXA", "user_name": "Mihir Deshpande,sejal ghuge,SM,Pavan,Mallikarjun Patil,SM,Vigneshvikiy,Payal", "review_id": "R173QPQASTIM5E,R2RU5623DZ9ZWI,R16QI7DHVXJVCI,R3JNLJTK4WJSKY,RLJ5VUW87FE0G,R3VFYJ2WAD73ZC,R37T2ABX4GMGHX,RAR3D2XLJPVF7", "review_title": "It's OK,Useful product,All peices arrived,Good product 👍,very nice quality and durable,Seems to be made of recycled material, serves the purpose,Worth to buy!,Terrific purchase", "review_content": "Doesn't always stay at the neck of the cable, but does help in reducing bending and stress. I would however recommend just getting some L-connector cables to avoid this issue altogether.,Good useful product,Weak packaging, but all the pieces came. They are not the most sturdy, but they are value for money, would repurchase,Good product,This cable protecter is really saved my cable.very easy to use , got so many in one pack.must buy product,Definitely not worth the huge MRP quoted, paid 99/- for 12 pieces.The material seems to be recycled. Remains to be seen if it will last. Serves the purpose of strengthening the flex point for cables. I have installed these on all my USB charge cables.,Simple and good product.,,Best Solution to broken wire", "img_link": "https://m.media-amazon.com/images/I/41WYWN1pdvL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/LAPSTER-Protectors-Charger-Protector-Computers/dp/B0BBW521YC/ref=sr_1_403?qid=1672895864&s=electronics&sr=1-403"}
{"product_id": "B09HSKYMB3", "product_name": "MI REDMI 9i Sport (Carbon Black, 64 GB) (4 GB RAM)", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹7,915", "actual_price": "₹9,999", "discount_percentage": "21%", "rating": "4.3", "rating_count": "1,376", "about_product": "Operating System Android 10|Primary Clock Speed 2 GHz|Secondary Clock Speed 1.5 GHz", "user_id": "AHZWXUWE3RGLDH4JJUK3HT3VMBJA,AFWUWJMEO4IQEMHKMUXYUILK47LQ,AHESBMCCD2JGQWVMDSW2G6QVJS7Q,AGJ2JB67X6WE4WZMZH4NWXHEGP4A,AEH5FAS6HXOZKYQOUM2YV5KKCNHQ,AGZYICOVCDNGVWXHJCDF63UTU7FA,AFIAREIU3BQVJUNZTYKC5I4TTN7A,AGVOPDVJX5H5BXDGMWPRSWAJSJAQ", "user_name": "N. Lalhunchhungi,Ramakhilavan,Narender,Kotteeswaran K,Gaurav Chauhan,Rajesh,ullas,Vetri", "review_id": "R1GS92IDBGXYCS,R8H8QTOWYMITR,RCSP9RH3A0VAE,R2S4F8S012C7RT,RVRXFESU2TRZK,RSKOVH69IL8VG,R2OUN5B9KJNAPN,R2EBVOLHYZ8SFR", "review_title": "Good,Ok,Nice product in this range,1.Camera is not good. Not matching up to 13mp,Overall good,Good mobile at reasonable price !!,No Fingerprint reader,Too good", "review_content": "Good phone,Ok,Nice product in this range.,Performance is fine, it is not a C Type charger. But Q/A mentioned as c-type,As of now its fine, will write off after using 15 days.,Good mobile at reasonable price!!,No finger print reader in this model. Never expected a phone with 4GB Ram and 64GB Rom would come without fingerprint reader.,Good mobile", "img_link": "https://m.media-amazon.com/images/I/31Hb9RGI+jL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/REDMI-Sport-Carbon-Black-RAM/dp/B09HSKYMB3/ref=sr_1_405?qid=1672895864&s=electronics&sr=1-405"}
{"product_id": "B09YV42QHZ", "product_name": "Fire-Boltt Ninja 3 Smartwatch Full Touch 1.69 \" & 60 Sports Modes with IP68, Sp02 Tracking, Over 100 Cloud based watch faces ( Green )", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,499", "actual_price": "₹7,999", "discount_percentage": "81%", "rating": "4.2", "rating_count": "22,638", "about_product": "Fire-Boltt is India' No 1 Wearable Watch Brand Q122 by IDC Worldwide quarterly wearable device tracker Q122.【1.69” HD Large Touch Screen】- Fire-Boltt Ninja 3 comes with a 1.69” HD Full Touch Display for smooth swipes and clear vision;【SPO2/ Oxygen, Heart Rate】 - Fire-Boltt Ninja 3 Smartwatch comes with real time 24*7 SPO2 / Blood Oxygen tracking, Dynamic Heart Rate Monitoring (If a patient is suffering from Covid 19 please use a medical device prescribed by the Doctor)|【60 workout modes】- This smartwatch consists of 60 sports mode to track. Keep a track of all your activities and compare history to analyse your performance. Count steps, distance, and calories burned.;【IP68 Water Resistant】- This smartwatch can withstand dust, spills, raindrops and is sweatproof too|【POWERFUL BATTERY】 - About 7 days battery life and a Standby Time of 25 Days 【Multiple Watch Faces】- Unlimited Customized Built in Watch Faces and also multiple watch faces through the app;【Stay Social Stay Updated】 – Inbuilt Social Media Notifications.|【All In One Smart Coach】 - Track your Daily Steps, Sleep, Fitness, Sports, Heart Rate and SPO2 【Enjoy Music And Camera Control】 【IP68 Water Resistant】- This smartwatch can withstand dust, spills, raindrops and is sweatproof too; Water Resistance Level: water_resistant|Connectivity Technology: Bluetooth; Clasp Type: Tang Buckle; Compatible Devices: Smartphonetablet; Human Interface Input: Touch Screenbuttons; Item Type Name: Smart Watch; Included Components: 1 Smartwatch, 1 Manual, 1 Magnetic Charger, 1 Warranty Card; Band Color: Green; Band Material Type: Silicone; Case Material Type: Plastic; Color Name: Green", "user_id": "AH2OARRWRYKQNYKCWGQKO3NOINQQ,AFIIBGWYNYPKBPVV3YRZPI3PYGBA,AF6HCCU2LSBC7VI7PXDP7BV234VA,AFOFD4PXG6Q4MMOSO5DL3Z6SPH3A,AFJLVCFIQOLK52GX6GEPNDVDXMLQ,AEQQH4MFXL57BHAPR5HEDWJ7IYSA,AHKFAQZRUQBRNNHBMARKC5YBCLBQ,AFU4L7YEY73K63B4VWGPBWQVAYWQ", "user_name": "Rahul Singh Rauthan,Sanjoy C,Prashanthi,Aditya Singh,Satyajit Patale,Owais,Amazon Customer,Himon Roy", "review_id": "R2VEHBS4GTI9SH,R560D18O1BJM7,RYPXAOQI77XRF,R2T1AP2XBIAQBK,RU2RYKNTJU52I,R3D6UA9AB1KZ5D,R1YFZYNSZI9FAG,RQU8SHDXBG8NZ", "review_title": "Premium looking watch,Excellent Product,The Tracking and touch would be better,Bluetooth connectivity,Very good,The watch is good,Felt Good,Not bad", "review_content": "Its only 4 days since we are using the product and based on so far usage, review is as below :PROS :1) Looks, it looks premium.2) Features at this price range3) Battery : It seems as if the battery will easily last for a week or more with normal usage ( Have closed all notifications which saves battery )4) Steps Accuracy : Will give 8 out of 105) Magnetic charger ( easy to charge )CONS :1) Have not noticed anything till now.,I ordered 2 watches for my wife and sister. Got it at the price of 1500. I am always a fan of Firebolt. And ninja 3 is very good. Touch responce is good. Good battery life. Sleep track is very occuracy. It has all necessary features and those are quite accurate. It's light weight and looks good. Over all it's an excellent product at this price.,Touch screen is not so good it takes time may be i need to use it for a while for better experience,I like the sleep tacking , heartbeat measuring , Spo2 and exercise tracking .I dislike the bluetooth of the smart watch only .  I use this watch for exercises,Battery is goodTouch screen is niceAll fixtures are very good,I like the watch style and charging is so fast,Firebolt Ninja 3Felt Good  for the watch , simple and easy,Its good, value for money, overall performance is good.", "img_link": "https://m.media-amazon.com/images/I/41GwFR981CL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Fire-Boltt-Ninja-Smartwatch-Sports-Tracking/dp/B09YV42QHZ/ref=sr_1_408?qid=1672895864&s=electronics&sr=1-408"}
{"product_id": "B09BF8JBWX", "product_name": "Lava A1 Josh 21(Blue Silver) -Dual Sim,Call Blink Notification,Military Grade Certified with 4 Day Battery Backup, Keypad Mobile", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|BasicMobiles", "discounted_price": "₹1,055", "actual_price": "₹1,249", "discount_percentage": "16%", "rating": "3.8", "rating_count": "2,352", "about_product": "Display Size- 1.77Inch|Battery- 800MAh | 4 days long Battery|Auto Call recording available|Bluetooth Support|Number Talker", "user_id": "AEXCQMYUSJFK3Z4POJQTN7YOHRVQ,AHETGN27YLTEFPHLK2EM3JEE7JJQ,AE2NBVHMJEM7COMHX2XJ4UPZ7D7Q,AFSIUC3ZDSMMALO7LFNQ46WZMU3A,AHAO6YBR3EDW2EMTABK3HCGJ6LDA,AFHUNQB64BPF4MYZRRLEYY3KW4JA,AE4VZLYVX3UP3NDMCIFWLLDGVO2A,AHNKMCRLNHO3LUTYPZ5C4WBK5JYA", "user_name": "Sudhir Kumar saxena,Ashay Arun Sawant,Sahin,Thulasiraman,Rubel,kuldeep,Jaswinder ali,Akhil thukral", "review_id": "R2FRXUVIUPO3JD,R2S7JVQ4Z9GYLB,R2U2GZZ9ZUDTE1,R33GW8VLIA7TOI,R35DGD2XREWO5P,R17TQA9TZKL5LH,R15HVUSH6RX8V2,R3UME3PEOKCQ5B", "review_title": "Very Bad mobile,Value for money,Part missing,Ok,Good buy,Value for money,Value of money,Phone works well", "review_content": "Very Bad mobile,Best mobile.,Phone good but charger Nani aya,It's good,The phone serves all my purpose..very good one❤️,Value for money,https://m.media-amazon.com/images/I/71veEcoG5-L._SY88.jpg,Phone works well.", "img_link": "https://m.media-amazon.com/images/I/41ynwpRq+kL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Lava-Notfication-recoding-Military-Certified/dp/B09BF8JBWX/ref=sr_1_411?qid=1672895872&s=electronics&sr=1-411"}
{"product_id": "B0B5YBGCKD", "product_name": "POPIO Tempered Glass Compatible for iPhone 13 / iPhone 13 Pro/iPhone 14 (Transparent) Edge to Edge Full Screen Coverage with Installation Kit, Pack of 2", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Maintenance,Upkeep&Repairs|ScreenProtectors", "discounted_price": "₹150", "actual_price": "₹599", "discount_percentage": "75%", "rating": "4.3", "rating_count": "714", "about_product": "Compatible Device: iPhone 13 / iPhone 13 Pro / iPhone 14 | Area of coverage : Edge to Edge Full Screen Coverage|Hardness: High hardness level provides protection from accidental drop & scratches|Easy Installation: Contains 2 tempered glass ,2 wet wipe, 2 Dry wipes, 6 Guide Sticker & 2 Dust Absorber|Additional features: Bubble proof, Scratch resistant, Anti fingerprint, Anti-glare, Anti-shatter, Touch sensitive", "user_id": "AFUWV4HNHDWYGFGEHEMCKPR7HPBA,AH2QS2327TLYTXS5YHXNAS7X7URQ,AHWO6S34K43AUMEEVHEVFHHPOVQQ,AHRPIB6BCK5TKG2R5DH5H3AMRIHA,AEAYBCVEBO7ZZ4SXPQUEWWYXO7IQ,AGE6KNDSGW2KYR7DTGGTFWVWTGGQ,AFRRGE2IZFVEUFIY6PUKMSGSMZ5Q,AG5WZLHPQHKNWCKK3EZQG73THRGA", "user_name": "vivek vinod,robin mohanty,Sadique a.,Harsh,rajat,Jay,Janardhanam,Hrishikesh", "review_id": "RM88OEEDBGL7E,RA49OAQBPGOY1,R1P18CRYE9Z987,R1NE7OSB0O86A5,R2CN1JTT7L1C7H,R20OTH46ZTVPQN,RDXU0X5IQVEFY,R1F0IEQUUDWM18", "review_title": "Great product if you don’t mind the edges,Recommended !!,Looks premium,Real value for money however I wish there would have been stronger adhesive,Its a genuine product,Precision!,Does the job perfectly,A perfect fit for iPhone 13 and has transparent edges too.", "review_content": "It’s a no brainer to get this. Just that the edges don’t fix in properly. There is always air bubble kind of thing on the edge.,Easy to apply and no bubbles. For Rs 150 they send 2 units which is amazing too. Satisfied with the purchase !!,Overall good and easy to apply. Doesn’t cover 100 percent of screen a small gap is there in edges,Adhesive could have been stronger. Popio has great screen guard at much better price.,See if you own an Iphone then popio is the best out there.I got this tempered glass because my last one broke during a fall from the stairs. & my last one was from popio too. So I odered another & the prices are a steal (like seriously I wonder how do they manage it for so cheap)Buy it without a doubt its a genuine product.PS I like little note they left with the product.,Fed up of buying those exaggerated priced tempered glasses and looking for near by shops to apply it.This product is priced for its value and lesser than other products in the market.Bought this product after scrolling for the best on Amazon and ordered it. Honestly I was never satisfied with any other product like I had with popio product. A big thanks to the team!Bonus is DIY. I never tried anything self before but after following their guide and videos I was able to do it right at first time. I really felt DIY is convenient and no need to worry about finding near by stores who could help us apply/install it.,Got it for my iphone 14pro. Im using my phone with a ringke camo case and this screen protector fits inside snug.Install this glass with the case still on the phone else you may align it imperfectly and may cause fitment problem.Overall a good buy.,The quality is excellent. Refer to the installation video by scanning the QR code on the package; it is very easy to install using the guide stickers. The quality is good, and it covers the screen entirely, leaving just enough space on the edges for the cover.", "img_link": "https://m.media-amazon.com/images/I/41XaIckgKIL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/POPIO-Compatible-iPhone-Transparent-Installation/dp/B0B5YBGCKD/ref=sr_1_417?qid=1672895872&s=electronics&sr=1-417"}
{"product_id": "B01GGKYKQM", "product_name": "Amazon Basics USB Type-C to USB-A 2.0 Male Fast Charging Cable for Laptop - 3 Feet (0.9 Meters), Black", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹219", "actual_price": "₹700", "discount_percentage": "69%", "rating": "4.3", "rating_count": "20,052", "about_product": "Connect USB Type-C enabled devices (MacBook, Chromebook Pixel, Galaxy Note 7, etc.) with standard USB Type-A enabled devices (laptops, hard drives, power banks, wall/car chargers, etc.)|Ideal for charging and powering USB Type-C enabled devices, as well as syncing data, photos and music|Reversible design - easily insert the Type-C connector into any Type-C enabled device (does not matter which side is up)|Type-C port is half the width and one-third the height of a standard USB-A connector (slightly larger compared to Lightning or Micro-USB ports)|Up to 480 Mbps data transfer speed; power output up to 5V, 3 Amp|Certified by USB-IF to be compliant with USB 2.0 Standard", "user_id": "AHVZCQP5SYIVGZJK4LRP55ZXWETA,AF6YDBL3KYIK3LBKKDIHUMOLKN4Q,AHKL2U5BIK4ZODWORRJ5RWNLL2TQ,AFKZHMXRXMRTVZLMHATTD53AVKRA,AGFTWXF3QWIHMPN7SMTSHB6HNJ7Q,AE4G376L73UNPWICYOSYO2KNXYJA,AHGFA5MNVOFDMIL3322YZ6IOA5VA,AGUR3CFYVZUMDJQIESKOIQOGV7AA", "user_name": "Hremant,Anjaneyulu,Madhav,NOTTADRIS,Deepak,P,M.SASIKUMAR,S.Suresh", "review_id": "R1BC08IFG4REKS,R1FJKIHIO54SOW,R3JR48W2CI480,R3JH7SHSXDT1GT,R35QWAY83WL8H6,R25N2U90N2A5AS,R19AK3DT3JOE82,R210WJI15JCSRE", "review_title": "You can trust on this one,The best usb cable,Wel build just like original .,Nice!!,Working perfectly,Basic,Good,No issues", "review_content": "Previously bought amazon basic USB type A cable and i didn't last long, but this USB C product seems manufactured with high quality materials. Supports fast chagrining, data supply etc. just go for it,Exllent,Very satisfied with this purchase, just like orginal quality . Will buy again in future .,My sister is using this cable to charge her phone and the cable is durable and good enough for my sister's phone. Love it!!,I bought it to use Android Auto on Tata Altroz car by connecting to my one plus nord 2T mobile.I have been using this for more than a week now. It's working perfectly..I am happy with the product so far.,Basic,Great product money worth,No issues", "img_link": "https://m.media-amazon.com/images/I/31-BRsjrvDL._SY300_SX300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/AmazonBasics-Type-C-USB-Male-Cable/dp/B01GGKYKQM/ref=sr_1_418?qid=1672895872&s=electronics&sr=1-418"}
{"product_id": "B09MY4W73Q", "product_name": "Amozo Ultra Hybrid Camera and Drop Protection Back Cover Case for iPhone 13 (Polycarbonate| Back Transparent - Sides Black)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Cases&Covers|BasicCases", "discounted_price": "₹474", "actual_price": "₹1,799", "discount_percentage": "74%", "rating": "4.3", "rating_count": "1,454", "about_product": "QUALITY MATERIAL - Hybrid technology that is made of a TPU Material with a durable back panel|CAMERA PROTECTION - Raised bezels lift camera off flat surfaces|PRECISE CUTOUTS - Pronounced buttons are easy to feel and press, while large cutouts fit most cables|MODERN DESIGN - Elegant Design perfectly uses the advantages of the scratch-resistant PC plate and the flexible TPU|99.99% Transparent Back Panel", "user_id": "AEQRBL6PVEWH7MEXRN2ZI6FDU54A,AH365TQ2EE2HZM2YUGEBUUA3CBVA,AEIRPCB2GKJMM2D42JI56EZHN2PQ,AEOPPOFRNOWYNA3NCZ7FXRRILVBQ,AFGBMMBD6NTVHNHMZSTDYVKFE2SA,AHTJ4RNDSCXMGFI5GTVYAQNM6DKA,AGOJBMYF6L6P3HQ4W5N46QQIAPUQ,AFKWNS6UYCGBMT6TITLEW7DRFR4A", "user_name": "Dileep,Amazon Customer,Sharath N,Shubham,Himanshu Singh,Bijin Kurien,Surender Kumar,Sahil K", "review_id": "R1B4DF1E33G2SC,R1EUC6Y0ZY18QE,R3BW81NGN6FTO4,R1LUISQ85F9MSU,R1J90WSEGDNEMJ,RI68W30TV8E76,R3BBHIDI76JIAY,R1V51JJ6JQXQU6", "review_title": "Okay product,Descent product,Very Sturdy,Great protectione and design,Good Product !!,Excellent Case with Beauty,Awesome cover,Good quality", "review_content": "There are small scratches on the back apart for that the product is good.,Descent product. Exactly the way u wanted. Simple to look and transparent. Ordered for blue colour iphone,Case is good. The cutouts, the material, the camera bump all are very good. The back is transparent and made of glasstic, so it won't turn yellow but gets scratches easily.Overall recommended.,Great protection, buttons are comfortable to press, especially considering the price. Only problem I had with was the design, maybe a personal thing it's just not that good. P.S looks great on black iPhone just not on any other😬,Fit of cover is proper with raised edge for camera. This is what I wanted to have. Overal satisfied with the product,The fitting is perfect with raised borders overall and camera.Polycarbonate is hard enough to protect.The design is perfectly blending with the phone colour.A very good product at this price range I got it for ₹469,Awesome cover,", "img_link": "https://m.media-amazon.com/images/I/51xaoGdw9EL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Amozo-iPhone-13-Polycarbonate-Transparent/dp/B09MY4W73Q/ref=sr_1_419?qid=1672895872&s=electronics&sr=1-419"}
{"product_id": "B08R69VDHT", "product_name": "Pinnaclz Original Combo of 2 Micro USB Fast Charging Cable, USB Charging Cable for Data Transfer Perfect for Android Smart Phones White 1.2 Meter Made in India (Pack of 2)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹115", "actual_price": "₹499", "discount_percentage": "77%", "rating": "4.0", "rating_count": "7,732", "about_product": "[SYNC & CHARGE] : Ideal for charging and powering Micro USB port devices, as well as syncing data, photos and music.|[EASE OF USE] : Smoothly insert the Micro USB connector in a right way in your device.|[SYNC DATA] : Transfer data at high speeds.|[WARRANTY] : 6 Months hassle free warranty from the manufacturer.", "user_id": "AEGZSNGSJJAEMJ3RRNVZTKUILOHA,AGX46OTZ7C4VDXH4UA7ZAZIZUMYQ,AEDLLY6JXNCVYIW227SBCPVYHNUA,AGTJ44UNO6K5X567YLQPYGN3TV4Q,AFYCBABBI2GCQRSCKIRHPLQNO72A,AG55XGEMTFKS7BXQTNFKHFTMMW5A,AGQYGAK76B74HUWOOUOFTXH2LAZA,AHFHIY2KE5PQIJ6H7PKV6N7OLIZA", "user_name": "Vijayan C V,Sanjay P.,keshav,Dharemesh K.,Amazon Customer,Rajesh,Sagar Yadav,Vaibhav", "review_id": "R2VUNGNI96EEJ7,R2JGNI2T5LVFRQ,R9ISXRV6DA0OY,RZFW11UFTCBVH,R1WGHB13Q2OLYA,R11ETJ640KDIRW,R2IA54QBAYAGND,R23Y3AD6E6GE9N", "review_title": "Very good product and met my need.  Thanks,Decent value,Nice quality… trustable…,Just well in this price.,supports 2.4 amps fast charging,Nice,Nice.,Value for money", "review_content": "Liked the product.  Accurate to my usb apparatus.,Good value,Till now i had purchased about 20 cables both micro and c type for myself and my family in this last one year. Its all because this brand wins my trust by provinding great quality with reasonable price,na,tested with 2.4 amps charger and phone. gives full 2.4 amps power to phone.the cable LOOKS thick and it has nice texture. despite that, i am sure it is not very durable. the usb connectors are extremely sturdy and they dont bend or flex. the wire will break before the connector does!!warning: usb micro connector has a strong hook. be careful while plugging and unplugging, or you may damage your device.very cheap and usable cable for 120 rs,Super power,Nice product.,In this price this is the best one", "img_link": "https://m.media-amazon.com/images/I/41gFqSHngyL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Pinnaclz-Original-Micro-USB-Charging/dp/B08R69VDHT/ref=sr_1_429?qid=1672895872&s=electronics&sr=1-429"}
{"product_id": "B09T37CKQ5", "product_name": "FLiX Usb Charger,Flix (Beetel) Bolt 2.4 Dual Poart,5V/2.4A/12W Usb Wall Charger Fast Charging,Adapter For Android/Iphone 11/Xs/Xs Max/Xr/X/8/7/6/Plus,Ipad Pro/Air 2/Mini 3/4,Samsung S4/S5 & More-Black", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|WallChargers", "discounted_price": "₹239", "actual_price": "₹599", "discount_percentage": "60%", "rating": "3.9", "rating_count": "2,147", "about_product": "USB Charger with dual ports allow you to charge 2 devices at the same time with the total output of 2.4A current.|With the intelligent chip inside, dual USB wall charger matches the current as your device's need automatically. Over-current, over-voltage and short-circuit protection also effectively protect your smartphones from damage|Internal protection mechanisms offers multiple Protection against short-circuit, over-temperature, over-current, over-voltage and more|Robust textured casing and premium internal components ensure perfect performance|Power Source Type: Corded Electric; Specification Met: Bis", "user_id": "AGNJW4JB3SQZZEVJCOR6EXOTNMOQ,AFTBDE5KEINLXCQI2KBACSU4VO6Q,AHG766GX32WE357IIFA2PJWO7XRA,AG6TL6KXOCB6HW6QITVEZ3NFPYFA,AGD2H2SMDLQK62MH7BFWQ2INBP2A,AEHKGBC4LAMAC3AUCAWLJKKHRTAA,AHB6B3AB5OU3ITBYOSU2YSPVJ7RQ,AF7JC6AKO652RERHTNJ4NFM6NN4A", "user_name": "Bristidev Burman,P VENKATESH,D.Dutta,Swapnil Patil,ABHAY SINGH,Rohit,Manikanta,D MANJUNATHAN", "review_id": "R2XF84DPH68G5Y,R272LVPQ9OGM0S,RBQF76FUWS8PH,RUV6A5DB7ROJU,R25Z9XP6UQKEBZ,R33QHW049WSWGB,R3QAWS03V5OYSG,R3407AFPL16VUS", "review_title": "good till now,Good,An additional charger same as ORIGINAL .,Good adapter,Best,okay okay,Good,Good product", "review_content": "i use it for powering my bluetooth speaker and another usb light. so it powers then nicely,Good charger my feedback is 1 month after giving is nice product.,Working with any types of USB either C-type or micro.Temperature always normal with 2.4amp ranges .,Adapter is good but tyape c cable is not good bought for Rs.188,Very best,@99 or 149 that's the good deal, a normal changerlet's see the warranty conditions,Good,Nice product and value for money.", "img_link": "https://m.media-amazon.com/images/I/31Iuz7jlfqL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/FLiX-Charger-Charging-Adapter-More-Black/dp/B09T37CKQ5/ref=sr_1_431?qid=1672895872&s=electronics&sr=1-431"}
{"product_id": "B09GFPN6TP", "product_name": "Redmi 9A Sport (Coral Green, 3GB RAM, 32GB Storage) | 2GHz Octa-core Helio G25 Processor | 5000 mAh Battery", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹7,499", "actual_price": "₹9,499", "discount_percentage": "21%", "rating": "4.1", "rating_count": "3,13,832", "about_product": "Processor: MediaTek Helio G25 Octa-core; Up to 2.0GHz clock speed|Camera: 13 MP Rear camera with AI portrait| 5 MP front camera|Display: 16.58 centimeters (6.53-inch) HD+ display with 720x1600 pixels and 20:9 aspect ratio|Battery: 5000 mAH large battery with 10W wired charger in-box|Memory, Storage & SIM: 3GB RAM | 32GB storage | Dual SIM (nano+nano) + Dedicated SD card slot|Form factor:Bar,Operating system:MIUI 12", "user_id": "AF7B5AJJZP2WKRD74Z45L7YDOEHA,AGEYI2JEUE752XDEXSTEIO7LJI5A,AGNNZL2OXJSOP4LC4PWWYSTCZAAA,AF7O7XT6CTT6WPOITPUURTLR373A,AEI3CRGT2GQUOOD67T5H2NK6J32A,AFVNPALAXLPTQV7PA3A6GG6GNKHQ,AGFWKP74BJOEEMWDPDRITXUIW45A,AF36F2CYTEDAZ7XUT5FIVJV5WIFQ", "user_name": "Roshan Renji Cherian,SivavaraprasadPV,Kranthi,A K Bindhani,pravesh,Subrat,Max,JAWAGAR T", "review_id": "RCP907FSHW2CI,R2XSNFIDSF8IL4,R2JB9PO5MV9LER,R1WOXRK1I1XUD1,R2R7NPFFHBHV2M,R209MH0VOGQ7EF,R276N47ZR7TWCM,RFYYONBM15HX5", "review_title": "Best phone for below normal use,Good mobile for minimal usage , but technically highly worth,For simple use,Ok,Good quality product,Good unit,Good,Best Budget mobile", "review_content": "If you want a smart phone for just the use of calling and using social media. This is a very good option for you. I bought it for my mother who specifically told she just want a phone for calling purpose. This has only 2 gb of ram so don't think of running games like bgmi or asphalt and it also won't run very smooth under above normal conditions. There is no fingerprint sensor and the camera is trash. But the battery is 4000mah and has considerably high battery life. There is no fast charging only normal charger is given. So in my opinion this is a phone for a below average user who uses the smart phone just for calling or for scrolling through social media.,This is worth for price , has the latest technical softwares and perform well for minimal usage , ofcourse it has configuration less so we should not look better than thisBattery life more than expected, we could buy for this budget range,Simple and good, ok camera,Ok,Overall good quality product,Good unit,Good,Good mobile for basic users", "img_link": "https://m.media-amazon.com/images/I/41i7LM0pGwL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Redmi-9A-Sport-Octa-core-Processor/dp/B09GFPN6TP/ref=sr_1_432?qid=1672895872&s=electronics&sr=1-432"}
{"product_id": "B0B298D54H", "product_name": "Prolet Classic Bumper Case Cover for Samsung Galaxy Watch 4 44mm TPU Plated Full Screen Protector (Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹265", "actual_price": "₹999", "discount_percentage": "73%", "rating": "3.7", "rating_count": "465", "about_product": "【Compatibility】 This screen protector case is compatible with Samsung Galaxy Watch 4, 44mm. [NOTE: WATCH IS NOT INCLUDED]|【Shock-Absorbing】 Made of TPU Material, anti-scratch plastic, thin case cover the full front and curved edges of the watch ,offer full protection for your watch against scratches, drop and bump.|【Light Weight】 lightweight and Slim protective bumper case cover shell is perfect for your watch.|【Easy Installation】 Easy to install and make off, When charging your Watch, you do not need to remove the watch case.|【Touch Experience】 Case is High-Definition Transparent and gives you 99.99% HD clarity with true color reproduction and gives you the original touch experience.", "user_id": "AG3EJCPDMWMFHVD75JLK6447GEYQ,AG6U76PUTURMNUURSZUAARGW4JGQ,AFUPVR34RLXDQ4KH53C63MQSFISQ,AH6TCUCBZUAI6HVVV3CRMHOYA7EQ,AHDLB7WWZVSRDGIQWDPGPKV6MUZA,AGPTBPJMGFIJOZ7TDQYIDTKYELCQ,AGWOADYNA3ENWC5E2ZTCG44PPUVQ,AE4VHTKSWGIZRK2VBPA5W4BVVW6Q", "user_name": "Debasish Bhukta,Swastik Suman Sahu,immort4l,N,SB,Sitaram,Suprith,FAIBI INDIA", "review_id": "R1A8VRVLZEPPCO,R1G1WGHDY6EN6V,RDPRCGL4SELOQ,R14VFIZGF8DVCC,R3L5E72O2NPWAX,R1H6XVMAKGROHM,RL8QQ5LOOTC1B,R2USFYNMVOB95A", "review_title": "Good Product,Must buy case for samsung watch 4,Generic but good,Not for watch 4, but for watch 4 classic,Good Product. Touch sensitivity to improve,Worth of buying,Perfectly fit for samsung brezzel,Awesome Watch Cover..Fitted Exactly size ...", "review_content": "I have purchased it for my galaxy watch 4 44mm it fits perfectly and the touchscreen works good. But packaging should improve.,I am writing this review after using the product for 1month. Nice case for samsung watch 4, no touch problem I faced till now. Best thing about this case is it comes with warrenty so that you can replace it if any defect product you received.,Fells hard plastic.Lookwise it's good,There is an air gap between the screen and the case, which means it's made for a thicker body, which means it's made for the watch 4 classic. You have to press hard on the screen guard so you actually touch the screen.DO NOT BUY FOR WATCH 4.Otherwise it should be ok for watch 4 classic, though I cannot confirm .The case has integrated screen protector and protects the sides . Obviously it doesn't cover the back. The blue looked weird on my black watch 4.,Overall from a protection perspective the product is very good. Look is good. Only the touch screen sensitivity needs to improve.,https://m.media-amazon.com/images/I/7160DgLoRUL._SY88.jpg,Perfect product for samsung watches,", "img_link": "https://m.media-amazon.com/images/I/516BHYFQ3JL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Prolet-Classic-Bumper-Samsung-Protector/dp/B0B298D54H/ref=sr_1_433?qid=1672895879&s=electronics&sr=1-433"}
{"product_id": "B08VB57558", "product_name": "Samsung Galaxy S20 FE 5G (Cloud Navy, 8GB RAM, 128GB Storage) with No Cost EMI & Additional Exchange Offers", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹37,990", "actual_price": "₹74,999", "discount_percentage": "49%", "rating": "4.2", "rating_count": "27,790", "about_product": "5G Ready powered by Qualcomm Snapdragon 865 Octa-Core processor, 8GB RAM, 128GB internal memory expandable up to 1TB, Android 11.0 operating system and dual SIM|Triple Rear Camera Setup - 12MP (Dual Pixel) OIS F1.8 Wide Rear Camera + 8MP OIS Tele Camera + 12MP Ultra Wide | 30X Space Zoom, Single Take & Night Mode | 32MP F2.2 Front Punch Hole Camera|6.5-inch(16.40 centimeters) Infinity-O Super AMOLED Display with 120Hz Refresh rate, 1080 x 2400 (FHD+) Resolution \"|4500 mAh battery (Non -removable) with Super Fast Charging, FAst Wireless Charging & Finger Print sensor|IP68 Rated, MicroSD Card Slot (Expandable upto 1 TB), Dual Nano Sim, Hybrid Sim Slot, 5G+5G Dual stand by|5G Ready powered by Qualcomm Snapdragon 865 Octa-Core processor, 8GB RAM, 128GB internal memory expandable up to 1TB, Android 11.0 operating system and dual SIM|Triple Rear Camera Setup - 12MP (Dual Pixel) OIS F1.8 Wide Rear Camera + 8MP OIS Tele Camera + 12MP Ultra Wide | 30X Space Zoom, Single Take & Night Mode | 32MP F2.2 Front Punch Hole Camera", "user_id": "AEGEOVAES62OFGQTSPSDSQ5U7SHA,AGMBYTP5MS3JCQZ2NHRA3L2FTC6A", "user_name": "Mohammed Suhail,GVR", "review_id": "R3R5DS04EXELTJ,R3JBXYOBYRX0A8", "review_title": "WORTH BUY ! THE BEST,Good for the price.", "review_content": "It's been 15 days since i using the device extensively.I bought it on the Last freedom sale for Rs. 41,999 ( including 6k instant discount coupon).First let me be clear , I bought ' S20 FE 5G 'with Snapdragon 865 , not ' S20 FE with Exynos ' and i am a user who uses phone most of the time .This review may be long but it's worth to read it if you're buying this product.Let me divide between the Pros and Cons.First i would like like to start with Pros of the Device ,Pros :1. Display :Samsung has been already popular for it's AMOLED Displays but i saw some of the reviewers wrote about some display issues here . They might have got some defective Piece. I have no issues with my display . It's been long time i saw a great display like this ... with 120Hz it is Super Smooth.Also , it is very bright on outdoors and can decrease it to very low while using at low light conditions ( PS : No tint issues )The in display finger print scanner is very fast and didn't faced any issues with it .2. Stereo Speakers :As an extensive multimedia user , this is one of the most favorable feature for me.Believe me , you can't find any other device with such great Sound quality in this price segment , it's almost like flagship devices ..Both the speakers are adequately loud.3. Battery :As a person who's shifting from a normal 60Hz Device phone , i was very worried about the battery life of this device at 120Hz but it surprised me very well ..Initially i thought i would need to switch to 60Hz for better battery life for daily usage.But I didn't even thought this device would give this much great battery life at 120Hz.At 120Hz , I am getting around 7 hours of minimum SOT ( Screen on Time ).The maximum SOT i got at 120Hz is 9Hours 13 minutes.I didn't checked battery life at 60Hz because i didn't use it at 60Hz even a single day . The battery life is Excellent.4. Rear Cameras :I am not a very good photographer or something , i am just an ordinary person who use camera occasionally.I was very excited to use the telephoto lens which only can be found on flagship devices and it performs very well..Added Some Camera Samples above ( Pic 1 : Ultrawide , Pic 2 : Telephoto [ Pic may not be clear as it was when taken due to compression of the image while uploading )Both the three Cameras ( Primary + Ultrawide + Telephoto ) performs very well.If you're a camera guy you should definitely check this out.5. Performance & RAM Management :I'm not a gamer , I use my device for daily usage of social media , ott platforms , Calls , messages etc. but i use it extremely.I didn't faced any kind of heating issues with the device until now.Also ,Ram management of the Device is excellent , I am a person who uses 4-5 appsbackground at single time and i didn't have any issues of closing down the apps .6. ONE UI :I was a stock Android guy , but One UI actually surprised me , it is very well optimised and very user-friendly for single hand usage..initial days i found it little hard to use the stock menu of one Ui but I'm now got used to it.PS : I didn't found any kind of ads on my device as i didn't sign up or used any samsung Apps.7. Build Quality :Even though its back is made up of plastic , the overall build quality is super Premium the Aluminium frame gives us a feel like using a flagship device..8. Future Proof :  The device has 9 5G Bands , IP68 Rating , Wireless Charging which are very hard to find on any device in this price bracket.IP68 & Wireless Charging are mostly only found on Flagship Devices . Its good to see samsung brings it at lower price.This is the best future proof device as of now.So these are the Major pros i noticed as of now .Now let's move to the Cons.Cons :1. NO HDR SUPPORT ON NETFLIX :  As an extensive multimedia user , i found it very frustrating. even mid range devices offering HDR support on Netflix , Samsungs Flagship Killer doesn't have HDR support.IT WILL NOT BE FIXED VIA OTA UPDATE .2. No 256GB Variant :  This is actually not a problem for most of the people but as a power user who uses Dual sim , i found it little difficult.But if you're a single sim user , luckily it have hybrid solution ..so you can use a Sim card + expandable memory card ...3. Gorilla Glass 3 :  Other competitors are providing atleast GG5 in this price range. But S20 FE 5G has just GG3 ( Which also I'm not sure as it is not mentioned officially anywhere ).But at the end of the day , GLASS IS GLASS & IT WILL BROKE.4. No headphone Jack :  It is not any kind of unusual thing .most of the phones above 30K segment doesn't have headphone jack.So we have to buy 3.5mm to Type C adapter , type c earphones or bluetooth solutions .Note : Only Buy original Samsung type c adapter else it may not support.5. No 25W charger :  It is not actually a con for me as i prefer Low watt charger which is good for battery health and beneficial for long term usage .but it may be a con for you ,  Although the device supports 25W charging . Only 15W charger is provided inside the box .. They should have given 25W inside the box.I didn't have any issues with 15W charger but it would be great if they bundle it with 25W as competitors are way ahead in terms of charging speed.For the reference of Charging speed ,Both 15W & 25W will full charge the device almost at the same time but using 25W you can get about 50% within 30 minutes where as 30% with 15W charger.Full charge time i usually takes is 1hour and 35 minutes.6. Front Camera :  I am not a selfie guy , but if you're a person who's looking for a selfie device just don't buy it . it's not like the front camera quality is really bad or anything but it's not even near to the rear camera quality and you can find better selfie smartphones in this price rangeCONCLUSION :If you're a person who wants a device for normal day to day usage with good battery life , great rear cameras , great performance , better software support , better build quality and use it for more than 3 years & the cons mentioned above doesn't bother youJust buy it , I am sure you won't be disappointed.,It's been about 15 days since I got this phone.  I got it for 29990 on prime day sale. For the price it's good.Pros :1. Camera.  Coming from Poco X2, the camera quality on this is amazing according to the price. It gives you good colours, contrast, focus, and everything that you want. It has OIS which is very apparent while recording. At 4k60 the stability is worse. But set it to  1080p60 and the videos will be amazingly stable. And the main advantage of OIS other than stable video is GREAT night mode shots. Hold the phone stable for a while and along with OIS you will get great photos with accurate colors and nice exposure. Attached samples.2. Display : Absolutely best. Samsung displays are the best. 120hz FHD. Flows smoothly.  Colors and calibration is top notch. Brightness is good but I felt it's a little insufficient under direct sunlight. It's visible but could be better.3. OneUI : The main reason for upgrading to this phone was software. OneUI4.0 is the absolute best android skin right now. It has way too many customisations in it and let's you personalise your phone to a very high degree. Like there's a feature to read out the name of the person who's calling if your wearing headphones. It took me 3 days to fully go through all the settings and change them to my needs. Also Knoxx security is a special mention. Knoxx security is a software and hardware feature in samsung phones which protects your phone from all kinds of attacks and keeps your data safe. Even if it gets stolen you can remotely delete all your data. Secure folder allows you to store data in a separate storage. And many more such good features. While being a very feature rich and storage heavy skin, it still feels very very smooth and fast to use. Unlike MIUI or other skins, it doesn't stutter much and bugs are less.There are many other small pros like good stereo speakers. Nice premium build quality. Good data and wifi speeds. Other such features that you won't notice but definitely make a difference in your experience.Cons1.  Software.  I know I said it's a pro but I say this in the aspect of updates.  This phone was launched in 2021 March in India and samsung promises 3 year android version updates and 1 additional year of security updates.  But there's a lot of confusion regarding if or not this phone will receive Android 14. It will receive A13 for sure. There's a lot of debate on what they will do with14 because of global version launch date being earlier and yada yada. Basically the phones life maybe 2.5 to 3 years if they give a14.  But 1.5 to 2 if not. I researched on the Internet a few people say that it will receive a14 while I was few say it's not. It's hard to say who's correct.  So assume it's not getting a14 if you are going for it.2. Battery.  The battery on this phone is 4500mah and it's good enough for a days use. But that's because I use it lightly. Not much online streaming. No gaming light social media and other usual stuff. If you use it even a tad bit more heavily, you will run out within a day. If you're going outside for the better part of a day,like a day trip to somewhere nearby,it's better keep a power bank handy. In terms of Screen on time numbers, I once got 7 hours of sot on light usage, 1 hr YouTube and 1.5 hr streaming. I was at home and used wifi all the time.I got 3 hrs sot when I went outside for a day trip. I took many photos and videos and the phone shutdown before I could reach home. On a mixed use day,  you can get 4.5 to 5.5 hours of sot.Final verdict : The life of the phone in terms of Software Support is not great but you will get on time updates and almost no bugs in the software. So if you want to buy it you can and exchange it after maybe 2 years for other models. But if you planning on using it for longer than 2 years,  better avoid it. In the upcoming diwali and dussera sales,  the price might further drop to 25k even. I am just speculating but keep in mind your requirements and go accordingly.As always amazing delivery by Amazon.", "img_link": "https://m.media-amazon.com/images/I/41ezRvTwcaL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Samsung-Galaxy-Cloud-128GB-Storage/dp/B08VB57558/ref=sr_1_434?qid=1672895879&s=electronics&sr=1-434"}
{"product_id": "B09CMP1SC8", "product_name": "Ambrane 2 in 1 Type-C & Micro USB Cable with 60W / 3A Fast Charging, 480 mbps High Data, PD Technology & Quick Charge 3.0, Compatible with All Type-C & Micro USB Devices (ABDC-10, Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹199", "actual_price": "₹499", "discount_percentage": "60%", "rating": "4.1", "rating_count": "602", "about_product": "Stay ahead and never miss out with a 3A fast charging speed for your devices|It supports Quick Charge 2.0/ 3.0 technology to keep your devices boosted up|Its sturdy design and braided cord are tough enough to withstand 10000+ bends|Crafted for convenience, it allows you to charge and sync data with just one cable|It is widely compatible with all types of Micro USB & Type-C enabled devices", "user_id": "AHH2TIJJ2IGD5H3DJO3FROUHRRSQ,AF37X7ZH7JPA6H5Q64NV6QFIBCYA,AFKT7LV4XE6XJ2VTHCBHPQECW2RQ,AE7GGDNBOHD2JQ2X5JPD666SAQOQ,AENNAVVG4GBJKDQKJXQUEKQKTXGQ,AFPSO7EYQBYVEJGD4TAT7YFCM6UQ,AFV5W5BR6PKGHPIG3J6TNFK7BSXQ,AHILALAA7Q6SQRTFJVLT75P37FXQ", "user_name": "Gopal krishna rout,Customer,Amazon Customer,AMAN KUMAR,Amazon Customer,Ghanshyam Hemade,Satyam Pandey,Amazon Customer", "review_id": "R37D7HJR4MR520,RPXR67LNCQALE,R1K9WE1GDB2PP0,R34PZ2AX727RPD,R2HALNEM14EW7P,R3D6EV6X38WU4Q,R2NCR8UX28VRH4,R3PTXRLR7MPN25", "review_title": "Good product,Its good, but micro usb doesn't fit my phone.,Good and useful item,It is very best cable,good,2 in 1 Charging Cable.,Sturdy cable overall,Nice & Best Charger Cabel", "review_content": "Product is good , and also it's  strudiness .But no fast charging in this cable , it's normally charging . I love it because it's supported in micro usb , or type c . Over all good .Pros / advantage :- -1) 1.5 meter wire  2) more durable3) supported dual mode type c , micro usbCons / disadvantages:- normal charging , not fast charging,Though it is braided, but it is not strong like boAt. But it's okay to use it. Supports turbocharging.,Working well after months of use. Only thing is that if there is slight pressure, the C -type adapter will come off from the micro usb head. So better to see that the cable is not stretched when using the C type adapter. Otherwise working fine and very convenient for me since i usually have a phone with C type charging and a small Tab with micro USB charging when i travel. I need to carry only one cable now with my powerbank. Will recommend.,Best cable,good,Both Micro USB & Type C mobile connector's are getting charge.Good Decision to purchase this product.,Cable is a good fibre braided with good length.The connector also has a tight fit, sometimes you have to apply a bit force to remove(ig it'll wear off after usage).In comparison, boat has a better quality i would say if u get that in offer as it has metal braided cable and better quality microusb pin.,I like the product bcuz it's help me to charge both phone Type C & Micro Cabel", "img_link": "https://m.media-amazon.com/images/I/31x3IUfMneL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Ambrane-ABDC-10-Charging-Transmission-Compatible/dp/B09CMP1SC8/ref=sr_1_439?qid=1672895879&s=electronics&sr=1-439"}
{"product_id": "B09YLXYP7Y", "product_name": "Ambrane 60W / 3A Fast Charging Output Cable with Type-C to USB for Mobile, Neckband, True Wireless Earphone Charging, 480mbps Data Sync Speed, 1m Length (ACT - AZ10, Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹179", "actual_price": "₹399", "discount_percentage": "55%", "rating": "4.0", "rating_count": "1,423", "about_product": "Fast Charging Cable - The cable can support upto a charging speed of 3A making it the optimal cable for Quick Charge / Rapid Charge and Turbo Charge devices.|Reversible Connector – It has reversible type c connector that can be plugged in any direction, upside or downside.|Durable Cable- Using only premium quality materials and a tough, durable PVC Coating, the Ambrane USB cable is built for connecting and disconnecting over and over again without signal loss.|High Speed Data Transfer- 480 Mbps data transfer speed allows you to sync the data to the computer or other USB devices within few seconds.|Genuine USB Connectors- We use only certified and high-quality connectors ensuring not only the safety of the connected device but also reliable charging and high-speed data transmission.", "user_id": "AGU76WKSU62DUNTPCMTC4FCUNRTQ,AEOVR6JEQTAC77BXE5AJMWJGG5PA,AFIFHW5QMFMTWXNZ2JORBMINL3CQ,AG36G3XPHERLKRDG7XYQ2IWJWPIQ,AFEOAY5PB4XEYIOL6DY5WJBOYSKQ,AF2EHSXFZWWS2YEN22DV2ZCJDZZA,AGUFRJ5TPSUUBZBNRWHDRJV4VMQA,AGYEIMSVEDOLA2OV3DIOGX2IMCBA", "user_name": "Actual user,Shanti lal Gurjar,Gowthami,Amrut K.,chetan tandel,Mwnzil brahma,Amazon Customer,Karthik", "review_id": "R8QBCR9MM1LGY,R3VN8XDH215N7I,R341EQRY87EZP,R3HHTVIHY2U1FO,RNA87JCGRTQJU,RZ12R7OYYP0KX,R2GZZ3WYE0JJYA,RHE3HXKSONROE", "review_title": "GOOD,Thank you  Amazon very good charging cable,Good,Very good product,good quality,Very Good Product,This is fast charging USB!,Simply perfect at the price of below 100", "review_content": "Everything is fine but it is bulky and hard, it should be softer and thinner.....,Thank you  Amazon very good charging cable 👍,Good,Good one,quality is good. worth for 150-200 ₹. short but durable.,Very Good product . Satisfied..,This is fast charging C pin USB!You can purchase it.,Nice product at price of below 100", "img_link": "https://m.media-amazon.com/images/I/31l-eZHBfKL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Ambrane-Charging-Neckband-Wireless-ACT/dp/B09YLXYP7Y/ref=sr_1_442?qid=1672895879&s=electronics&sr=1-442"}
{"product_id": "B0B9BXKBC7", "product_name": "WeCool S5 Long Selfie Stick, with Large Reinforced Tripod Stand up to 61 Inch / 156 Cms, Ultra Long Multi Function Bluetooth Selfie Stick with 1/4 Screw Compatible with Gopro, Camera, and Ring Light", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Photo&VideoAccessories|SelfieSticks", "discounted_price": "₹1,799", "actual_price": "₹3,999", "discount_percentage": "55%", "rating": "4.6", "rating_count": "245", "about_product": "64\" Tall Cell Phone Tripods with 7 section adjustable telescopic poles, the phone selfie stick tripod stand is tall enough, can be adjusted from 12in to 64in. Therefore, this selfie stick for iPhone can capture a wider landscape with different Height|3 in 1 Design with Stable Base : Can be used as extendable Tripod for phone and camera as Phone Floor Stand. This Selfie Stick for iPhone can be quickly switched between the table tripod and selfie stick mode. Is compatible with gopro and Camera|360° Rotatable Selfie Stick Bluetooth : The mount of the tripod stand can freely rotate 360°, which can be quickly ratoted the screen horizontally and vertically , and the mount arm can be 190°flipped to shoot pictures at various angles.|Compact Size and Travel Friendly : After Being folded , the long selfie stick is just 12 Inches. So it can be easily packed in your bag, or Backpack without taking up more space. Perfecet choice for Travelling, Hiking and Camping. Very Sturdy Design|Large ABS reinforced non-slip Stable tripod-The tripod is very stable when it is mounted with phone or camera standing on desktop or ground,because it has non-slip silicone pads at the bottom of each foot and the lets have additional support|1/4 Screw Widely Compatible-The selfie stick comes with both a phone mount and a 1/4 screw,can be used at the same time.The 1/4 screw can be connected with Gopro digital camera and ring light.|The phone mount is compatible with most smartphones , support 360 degree rotation vertical and horizontal shooting , better for live stream , photo and video shooting , makeup , youtube watching", "user_id": "AFPYH3UF3GB4RNX3MX46AXFM2FTQ,AGWEQHJSUA4YCG44RKCCKPFNHNYQ,AER7URKAHGBZZUO54FO5YIX3BOJA,AEPCLRI6TOAXADIFPVP6BVUV6ZYA,AHMJGVHC6Z2PFDPRVL3FFO6HVWEQ,AHV4FNKMIPRVWQREJHBT3T7KQH3Q,AHHJWO56X2DQATPTWFHER2LAVAGQ,AGXRHQVYZUCT2IESEBL3JYAJ7ZNA", "user_name": "Sujili v,Paras Jain,Shailendra,supreeth achar,Anthony S.,SUMAN SEN,Wellwisher,Richa", "review_id": "R2MI4KSWYUEMDR,R2MNYKDL2UII1M,R2C6TUBM6IVLB0,R3VJF3LZ7XK3WV,R351DYT9RZYVC0,R2127U989S6ZZU,R29GQ8L9MVSU6H,R2H35ITTKGQLBH", "review_title": "Good,Good Product but Little expensive.,Happy with the purchase,Good buy in price range,Best travel companion,For instagram reels zoom in and zoom out switch is not available,MUST BUY FOR EVERY ONE WHO OWNS A MOBILE PHONE !!!,A good selfie stick", "review_content": "Good,Thoda sa kam stable hai, phone lagane ke baad thoda bohot hilta zaroor hai. Build quality thodi aur achi hoti, to pakka value for money hota.,We’ve been using it for around 2 months, it’s good, sturdy, Bluetooth connectivity is also good.Overall a good purchase.,Good buy in price range,If you travel, it’s your best companion. Has a great stability and length. It’s one of my best buy and cannot think of a vacation without it. No more need to awkwardly ask strangers to take photos, set the best angle and capture the moment. The service from WeCool support team is super cool as well.,Good product....but more efficient expected,Amazing Product. As a Youtuber and an Instagram Content Creator, this is the best gadget I like to have in my Back bag all the time. I even use this to record my live classes without making any scenes out there, since this is very handy and lucid. Moreover, their service is excellent. WHY ARE YOU STILL READING REVIEWS? ORDER NOW.Find my videos in Instagram using this S5 at shankarkumaran tamil,The selfie stick is sturdy and very good", "img_link": "https://m.media-amazon.com/images/I/41fDM4QUfvL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/WeCool-Reinforced-Function-Bluetooth-Compatible/dp/B0B9BXKBC7/ref=sr_1_445?qid=1672895879&s=electronics&sr=1-445"}
{"product_id": "B09NY6TRXG", "product_name": "POCO C31 (Royal Blue, 64 GB) (4 GB RAM)", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹8,499", "actual_price": "₹11,999", "discount_percentage": "29%", "rating": "3.9", "rating_count": "276", "about_product": "4 GB RAM | 64 GB ROM | Expandable Upto 512 GB 16.59 cm (6.53 inch) HD+ Display 13MP + 2MP + 2MP | 5MP Front Camera 5000 mAh Lithium-ion Polymer Battery MediaTek Helio G35 Processor", "user_id": "AF33ARIIERSZ4KGYWLBGIJO3PUQA,AGYPPUPGC6R6YHQ34BXG47EF27SQ,AGJETGMWID7POEU5LDGFS4RPXSAQ,AGRA45O5QGXARH6WCZBOIHOCESJA,AHJCD4A5IUH54M6QRKEW4LUHVJ2A,AHUDJY4VCIHRMXKXIYZEDXGGXGZA,AGXYMK52TU4YHFTS64FNCTDPJENQ,AGJBNYIE4GPKFMI52C33ZNTMSVAA", "user_name": "PREMAL H. SHAH,Amol Sangolkar,Abhishek Bairagi,Somu,Bernard Rocha,Ram,Naman kumar,Amazon Customer", "review_id": "R2FHGVLNMCEDS3,R1AHSDM5M325MM,R3E7Z6ZZCWNVTP,R2ARI9ILETH6A0,R1KRTG4TU6MUCU,R3SBJYLLR84FNM,R10IL98NTGTQH1,R2MS0CPATDN53O", "review_title": "Decent,Sad But Don't Buy,Ók,Nice mobile in this bugdet,Performance below low budget phone,Good performance,Budget phone,Very good product nice photo and display", "review_content": "Its decent,Don't buy this phone buy if you are aged at 40 + This phone is not for younger generation. Phone useful features are YouTube WhatsApp Calls only.,Ok,Nice,The phone is not very effeciently responsive. Battery runs low even when not used in 1 day. Finger pring does not work well - need a couple of tries to open.,Back camera is good, bettery life is not working well, bad very bad,Average phone day to day use,Finger lock fast", "img_link": "https://m.media-amazon.com/images/I/41hI-UvnhFL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/POCO-C31-Royal-Blue-RAM/dp/B09NY6TRXG/ref=sr_1_455?qid=1672895879&s=electronics&sr=1-455"}
{"product_id": "B09NVPJ3P4", "product_name": "Noise ColorFit Pulse Grand Smart Watch with 1.69\"(4.29cm) HD Display, 60 Sports Modes, 150 Watch Faces, Fast Charge, Spo2, Stress, Sleep, Heart Rate Monitoring & IP68 Waterproof (Electric Blue)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,999", "actual_price": "₹3,999", "discount_percentage": "50%", "rating": "4.0", "rating_count": "30,254", "about_product": "1.69\" grand display: Get the rich immersive viewing experience on the 1.69\" LCD display.;60 sports modes: Take your pick from a wide range of 60 sports modes. Accelerometer Sensor Yes, Charging Time 2.5 hours|Instant charge: Now enjoy more than a day’s worth/25 hours of battery in just 15 minutes of charge.;150+ cloud-based & customisable watch faces: Choose from 150+ cloud-based and customisable watch faces and change your look to suit your outfit.|Noise Health suite: Get valuable insights about your health from Noise Health Suite featuring 24*7 heart rate, stress, blood oxygen, sleep monitor and menstrual cycle tracking.;Quick-replies to texts and calls: Stay in touch with the world with quick replies available for Android.|IP68 waterproof: Live your life the way you want to, thanks to the IP68 waterproof rating.; 7-day battery: Charge your watch once and go about your week without a hitch.|Included Components: ‎Smartwatch, Magnetic Charger, User Manual, Warranty Card; Connectivity Technology: Usb; Item Type Name: Smartwatch; Compatible Devices: Smartphone", "user_id": "AF3JE3MHGVCOATHASUTMN3VGF3UQ,AEDSNOOD2D6SJAET2BTNBHLV2SSA,AGGTMAPT4WBWP2C62I6CGW22QNCA,AGC6NVLEXXVXAOMXP46RL2622EBA,AFMZPE7XRDTD4DOUAAMZOME6HG7A,AFOTHR4JPCQC4JXBR3WV4C6T5XHQ,AEJMCBDH3VXRL4SPYOC23J4OG6OA,AFE2254KL46HW7HEMQMQAGTC2LUA", "user_name": "Ranjitha Parida,Shubham Pawar,Arul,Lokesh K V,Nandita Talukdar,Sushma Pradhan,Amazon Customer,Datta Dhanwate", "review_id": "R3B5HP4PJ8JIOG,R2NS7Z2XUJL73H,R3DLYP0JW3PWDP,R3HWHOM95KCAZV,R2EVYBZOHRZ8NQ,R2U4UV55GHL0AB,R2E6IQWP86JIVZ,R225NQB3ASPXBV", "review_title": "Ranjitha,Good one,Best One!!!,Good and average usage,IT'S BEEN GOOD,Good,Overall good product,Nice", "review_content": "Battery life is low,Worth purchase,Good performance at this price range,A economical product to buy for average usage of checking time, heart monitoring, steps track, etc.Battery backup great single charge stands for min 3 days.Recommended only for simple use and show off.,First of all, this watch is budget friendly.watch faces - the app has a large number of watch faces step track - not that accurate but that fine• weather forecast:- 100% accuratesleep - pretty accurate information Overall, the experience is pretty good.But but but, The battery life is not that good only 4 days of battery backup.,Nice product,Overall good product to buy,Good product", "img_link": "https://m.media-amazon.com/images/I/412dSHwBHGL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Noise-ColorFit-Monitoring-Smartwatches-Electric/dp/B09NVPJ3P4/ref=sr_1_457?qid=1672895886&s=electronics&sr=1-457"}
{"product_id": "B0B3NDPCS9", "product_name": "Fire-Boltt Visionary 1.78\" AMOLED Bluetooth Calling Smartwatch with 368*448 Pixel Resolution 100+ Sports Mode, TWS Connection, Voice Assistance, SPO2 & Heart Rate Monitoring", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹3,999", "actual_price": "₹17,999", "discount_percentage": "78%", "rating": "4.3", "rating_count": "17,161", "about_product": "Fire-Boltt is India' No 1 Wearable Watch Brand Q122 by IDC Worldwide quarterly wearable device tracker Q122.【Bluetooth Calling Watch】- Fire-Boltt Visionary enables you to make and receive calls directly from your watch via the built-in speaker and microphone. This smartwatch features a dial pad option to access recent calls & sync your phone’s contacts.;|【Over 100 Sports Modes】 - Walking, Running to Tedious Workout modes we have covered it all. Fire-Boltt Visionary smartwatch does a wonderful tracking job to each sports mode the user carries out in the day or at the gym.;【Connect TWS On The Go】- This smartwatch has an internal storage memory of about 128MB to store your songs and listen to local music on your bluetooth headset|【AI Voice Assistance】- Command your watch and let the magic happen. This special technology is in the Fire-Boltt Visionary Smartwatch;【Smart 360 Health Tracking】 - The Fire-Boltt Visionary Smartwatch comes with a complete package of health tracking features. From SpO2 tracking to real time heart rate tracking stay fit always. With the breathing exercise and women health the smartwatch is fit for each use and purpose|【IP68 Water Resistant】 - The smartwatch is fit to withstand sweat, dust, dirt and sand and is resistant to submersion upto a maximum depth of 1m of freshwater for up to twenty minutes.;【Smart Notifications】 - Keeping you notified on every second of all activities through your social media connects. Do not miss out on any notification that you receive on smartphone.; 【Remote Controls】 - Click numerous pictures and listen to your favourite songs by just one touch. 【Basic Reminders】 - Don't drink water or walk in normal breaks we have got you covered in that too with the sedentary reminders you will alwasy stay hydrated and will walk good, a step to a healthy life|Included Components: 1 Smartwatch, 1 Manual, 1 Magnetic Charger, 1 Warranty Card; Compatible Devices: Smartphonetablet; Clasp Type: Tang Buckle; Case Material Type: Metal; Human Interface Input: Buttonstouch Screen; Color Name: Silver; Band Color: Silver; Band Material Type: Silicone|【1.78\" AMOLED Display】 - Fire-Boltt Visionary has a premium 368*448 Pixel Resolution and 1.78\" AMOLED Display which comes with the Always On feature. The AMOLED provides over the line performance. It is thinner, lighter, flexible and one of the safest display technologies ever developed..Band Width:20 millimeters.Water resistance depth:1 meters", "user_id": "AHQIYGWISGS2IQAQ3OM4IZHKIV4Q,AGXCRSJZ5RYOGMFVSLNRCILGSATQ,AE4MORXG46LGABI76KRVGV5BCLMQ,AHPN4Q3AZDX3HSUYDT7MHYDIL6QQ,AGBOBQFRZDOF5XPJRLHJYOGRFKNA", "user_name": "Vineet,shreyas,Amazon Customer,shaurya,Kartik Yadav", "review_id": "R2FY1Z66KZXJWD,R2HMU574902EOQ,R33J3X2N75IXU3,R3GGQG1U2KLAE3,R31AMOLX49DVF8", "review_title": "Nice watch but some cons,Great device for the budget !! And amazing amazon service!!,Good watch in this price,Watch faces could have been better,Amoled Screen & Touch, Average Wrist Band.", "review_content": "Today only i recieved this watch at first instance it win my heart ....I was using it a whole day and i found some pros and cons of this watchPros# Amoled Display is very bright and nice# Look and design is premium# Bluetooth calling is awesome, speaker is loud and clear . Even my voice is reaching to opposite party very clearly while calling with watch.# calculator features is useful# Multi Functional crown button is easy and useful .. Easily to change theme with just scroll the crown button# play music directly from the watch with the internal storage although its only 128 mb but sufficient to store around 10 songs approx.. song sound quality is also fine# strap quality is good and soft# TWS connecting features is also niceCons# sometimes i found watch is disconnected with my phone  ..not sure why its happened as i have checked only for one day# fingerprints are clearly visible on  Screen Glass .. i have attached the pic for it#Health Tracker are near to accurate but never rely on smartwatch at this price range.i have measure the bp with this watch and with bp machine both results are different... 70-80% accurate only..# AI Voice assistant is not very useful as it only work for mobile when i press the voice assistant button on watch .. like if i give command to set alarm on watch it set alarm on mobile so basically it just a button to wake up google assistant for mobile phone.#Sometimes when you pick call from your mobile phone call automatically transfer to watch and voice started coming from the watch speaker.. which is quite irritating..this must be correct by firmware updates i have purchased it for Rs.3420/- including bank offer . For this price range overall its a good & premium watch ..Its my experience with this watch for just a one dayRest how it work for long run that depends..,Recieved a damaged device at first... Slight gap between display and body from the left side.. but quickly recieved the replacement next day....The replacement was good...Amazon provided great service and delivered replacement in just 16 hours ...so great job amazon..also i live in bangalore.. so the experience might vary from place to place..ProsSmooth enough UIFairly accurate readings on all the sensorsHeartrate BP and spo2Call quality is great for the price.. good speakers and good mic..You can control spotify and soundcloud music too from the watch .and use tws to listen to spotify while controling with the watch... And it is seamless...Display is great ..colors are punchy and bezels are good enough... Not as narrow as crossbeats ignite s4 max but still good enough...Build quality is good but does not feel very premium.. it does feel like a below 5k watch...So you cannot trick anyone that this is a apple watch 😂Strap is not too long as every review mentions.. strap is good enough... Not too comfy..I ordered a metal strap from amazon for my watch and it is amazing...Ui looks much better in person than reviews.. UI is smooth and looks good... Not as good as realme watch 3 pro..But still good for the price..Overall its a good watch for the price of around 3.5k -3.9kAnymore and it is not worth the priceRealme watch 3pro is the best at around this price.. so if you get that in stock and for below 4k then get realme watch 3 pro..Or else for this price segment firebolt visionary is the overall best watch compared to all other watches under 4kConsCall when recieved on watch doesnt stay on tws it switches to watch for some reason..which is oneSteps are a little inaccurate and reads steps even if not walking..so dont rely on step counterBattery life is not great if youre using always on display and calling... Maybe around 3 daysBut otherwise battery stays for over 5 days.Blutooth range is not too good.. and varies from watch to watch.. and also phone to phone.. i get a decent bluetooth range of around 20 ft .. but this is more of a fact than a con..,I write this review after 1 week of using this watch, BP, BPM, SPO2 running and sleep tracking functions are working well, watch speaker is also loud and clear to you and the other callers. The only con is when you want to listen to songs through a watch from a mobile its Bluetooth disconnects automatically again and again, as this fund is not useful for me so ignore it, overall it's a good watch.,Everything is absolutely Greta in this smartwatch.But these things could have been better:. Watch faces- you should have the option to add upto 3-4 watch faces at once from the app rather than one at a time and 10 pre-installed ones. App ui could have been better. DND mode absent. No option to toggle Bluetooth (always on),Before review i would like to appreciate this great strategy to pour out honest reviews from users by giving them bookmyshow voucher.I loved the Touch Screen experience & Amoled screen of the watch, it gives a feel of premium watch. The band of the watch is average & doesn't look premium & i separately ordered a metal band. I am expecting Mobile App improvement from FireBoltt as I don't find it good enough if I compare it with Boat's App for its watches (As I own a Boat smartwatch). Rest Visionary is a good buy & worth the money the only thing which physically is not appealing is the average quality of the band.", "img_link": "https://m.media-amazon.com/images/I/41dtbrNRHdL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Fire-Boltt-Smartwatch-Resolution-Connection-Assistance/dp/B0B3NDPCS9/ref=sr_1_459?qid=1672895886&s=electronics&sr=1-459"}
{"product_id": "B09VGKFM7Y", "product_name": "Amazon Basics 2 Amp USB Wall Charger & Micro USB Cable (White)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|WallChargers", "discounted_price": "₹219", "actual_price": "₹499", "discount_percentage": "56%", "rating": "4.4", "rating_count": "14", "about_product": "Durable wall charger with fast charging ability|Flexible and long USB cable|Can transfer data at a speed of 480Mbps|Protects devices from short-circuits|Can be used to charge 2 devices simultaneously|Compatible with any Android device|Dimensions: 7 x 4 x 8 cm; Weight: 90 Grams|Package Contents: 2 Amp Dual USB + Data Cable (Colour: White)", "user_id": "AFQ7AUYJOIE2HH63KIUQK45ENQ2A,AHT7TTZ5JOTUL7CYSG5BBVPKD37A,AFB2AKARKRKHAB2PUCALX2GXOM3A", "user_name": "Prabhanjan,Chittiprolu Ramya,Litu prasada mahanty", "review_id": "R33M2Q7OES3GBK,R125QF7WMZW3NW,RMDVRDSEK73L8", "review_title": "Quality product,Excellent, it's fast charging,After 12 days not working 😔", "review_content": "Product works well and charges the devices in a quick mannerValue for money.,I like this product,Not working 😔 after 12 days", "img_link": "https://m.media-amazon.com/images/I/31poWDDorOL._SY300_SX300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Amazon-Basics-Charger-Micro-Cable/dp/B09VGKFM7Y/ref=sr_1_460?qid=1672895886&s=electronics&sr=1-460"}
{"product_id": "B07QCWY5XV", "product_name": "Mobilife Bluetooth Extendable Selfie Stick with Tripod Stand and Wireless Remote,3-in-1 Multifunctional Selfie Stick Tripod for iPhone Samsung Mi Realme Oppo Vivo Google More,Black", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Photo&VideoAccessories|SelfieSticks", "discounted_price": "₹599", "actual_price": "₹1,399", "discount_percentage": "57%", "rating": "4.1", "rating_count": "14,560", "about_product": "【HATE IT WHEN CARRY A HEAVY SELFIE STICK?】Yep, screwing a monopod selfie stick with a heavy tripod, is a pain. Our lightweight foldable selfie stick was designed to eliminate this to make a ordinary Selfie Stick lighter but more functional.|【HOW IS THE TRIPOD INTEGRATED AS ONE?】Gently slide the WIRELESS REMOTE from stick .It takes 3 seconds to make the TRIPOD appear just simply unfold the bottom part of the selfie stick. Ingenious design which makes the tripod open or close in one step. Fantastic way to start your selfie happiness.|【HOW DOES IT FIT VARIOUS OCCASIONS?】Extendable length from 10 inches to 23.6 inches so you can choose your desired length.Compact pocket size design, which is easy to carry. With 270°rotation, you simply twist the cradle head or phone holder to take photos, video call or live broadcasting , to meet your different needs, or situation|【Widely Compatible & Perfect Match 】The Selfie Stick is suitable for Most Smart Phone in Market, IPhone x 8 6 7 Plus Android Samsung Galaxy S7 S8 Blackberry Huawei etc. No Need to Worry About Incompatibility Issues. Fits 3.5-6.2'' screen devices like iOS & Android and Samsung.(no need to download extra APP.)|【Long Battery Life】Using With CR1632 (120mah) Replaceable Lithium Metal Cell for The Remote, Last Up 7500 photos can taken and Convenient Replace, also you can easily Buy This Battery in Market.", "user_id": "AHYXJP46LXOTLZ5FXX53OWHFNWXA,AGJH265WIJJRU5CH6R2T3KPDUHUA,AGURQUXEVAYTPSF26X64GZTYMTVA,AEDNDNSMKKRKDTTX67VVJMEQEPPA,AGCUQVPEVBIWQQBLSEKK2LSICLPA,AE3FZBDL2DKG5S23STYXDBEFCLFQ,AHSDXCJVYDH2MU3PQR7TRI5TA4LA,AETU3IBTWBZE4PUKESCCMCBU7FLA", "user_name": "Harshwardhan shinde,Amit,aamtech2,Apurv G.,Ram Gopal,Prime Customer,rajiv,DEEPESH SINGH", "review_id": "R3EUHZXX3UEYSH,R1UYMUD8SY2H9V,R1BQTJ4030NWYZ,R3MBTEU82OA7X1,R1R6MZFWPE1DN6,R295X0FTRQEG0P,R2XX9ZLGMLMN5L,R2ONSIR9B3OM3B", "review_title": "Best selfie stick,Decent product with one draw back,Best for Recording videos and photo shoot,Great Selfi stick using for 6months,Nice product in this rate,Overall ok but stability is not rock solid,Selfie stick,Nice", "review_content": "I really appreciate the build quality,Over all product quality is decent with only draw back that telecopic arm only extends less than 60 cm which in my view is little less..,I purchased and after one year of purchase my selfie stick working without any fault battery backup too good it is easy to connect and take photos and record YouTube video best for recording video self recording with tripod stand it is so good easier to stand at any place for more check my YouTube channel #aamtech2,I really like this stick and it's blutooth remote.Light weight and easy to carry and have multiple optionsOnly problem with this stick is you can't click vertical photos when in stand modeIf the 360 degree mode was available this would be best,,Overall good. But as the stability is not rock solid, you have to be a bit careful about placing the phone attached to this stand.,Bahut he aachha selfie stick hai. Bluetooth se connect ho raha hai. Jo ke bahut he aachha hai. Or eesame stand ve diye hai. Jis se mobile ko ek jagaha par rakha kar bluetooth remote ke madata se photo le sakte hai.,Go for it.. reasonable price and above average product.", "img_link": "https://m.media-amazon.com/images/I/41vCOAeGvSL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Hoteon-Mobilife-Bluetooth-Extendable-Wireless/dp/B07QCWY5XV/ref=sr_1_463?qid=1672895886&s=electronics&sr=1-463"}
{"product_id": "B098QXR9X2", "product_name": "Ambrane 27000mAh Power Bank, 20W Fast Charging, Triple Output, Type C PD (Input & Output), Quick Charge, Li-Polymer, Multi-Layer Protection for iPhone, Smartphones & Other Devices (Stylo Pro, Black)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|PowerBanks", "discounted_price": "₹2,499", "actual_price": "₹2,999", "discount_percentage": "17%", "rating": "4.1", "rating_count": "3,156", "about_product": "Robust 27000mAh - Lithium Polymer 27000mAh capacity allows you to flexibly charge your devices multiple times. It can charge iPhone 12 – 6.2 times, OnePlus Nord - 4.3 times.|20W Fast Charging Output – Thunderous 20 Watts PD and 3.0 QC output for boosted charging speed, so that you always thrive on high speed. It carries a substantial capacity to charge your mobile 50% in as quickly as 30 minutes on average.|20W Fast Charging Input – The powerbank itself can get charged in 12 to 13 hours as it has Power Delivery Technology which supports 20W fast charging input via Type C port.|Charge 3 Devices at once – With 2 USB ports and 1 Type C port for output, it can charge 3 devices at the same time.|Compact and Stylish - Supremely modern design makes it a style statement while its compact body makes it extremely travel-friendly at the same time.|Permitted in Flights - Keep on your in-flight entertainment by keeping your favourite gadgets well-charged with your easy-to-carry 27000mAh travel buddy.|Widely Compatible - Compatible with all devices that can be charged via USB or Type C port. (Fast charging output is subject to the cable and charging capabilities of the device being charged.)", "user_id": "AEI2GKBIJPYIB7KUV7EKAFN5P4IA,AGC2IANVZWHPGJS6KPCVASYQ5N2A,AEJSFU2MHQAGBDP2LWKW2KDEJHBQ,AFHCBV4DAEF7UL3EHVLA2VQ7R3OA,AERBFUQ2XX22U7LPZTRG6A2HUTAA,AFJJ6ZOQE2X5M5FZHRUGNGHXPS7A,AEHH6FPWXY4NFI63UAHKFRAGWICQ,AEITDY3ZQ4YK4EAX6QNI43CLAKPA", "user_name": "Neeraj Kumar,Deergha Arora,Krishnadevsinh S Gohil,T.Y.W...,Kapil Soni,devi dan singh,Rupesh Chaundkar,Aniket", "review_id": "RF8105HZQ4I7N,R1OVFYKWEJAVU4,R1U3VNQN5M4IED,R1YHYHQQN3NVED,RS5SSFIL1MWFD,RAMY81VZCIB2D,RDUL770GDRUAB,R1J7N8RPXX1S3X", "review_title": "The first light  Is not working idk why,Pretty device,Good product,A GOOD INVESTMENT,Too bulky,This power bank full charge at 12 hour and I phone 12 will be 4 time full charged not 6 time,VERY GOOD PRODUCT.☆☆☆☆☆,Its too bulky and I would say not good for travelling", "review_content": "-Packageing was fine- Haven't tested it working functionality yet.-just got the bank and the first light is not working idk why need to check and if it continues Ill return it ASAP,Good device for such cost,Good for fast charging,GOOD FOR  SMARTPHONE'BATTERY EXTENSIONS .,The product is very big and heavy.  Would have been better if it had Li-Ion batteries to save space and weight.  The product charges iphone about 50% in an hour, but rest charging is very slow.  It has a dedicated light (green) to depict fast charging mode.  The device helped me survive 2.5 days without charger, where it charged 3 phones.  I had 1 fast charger compatible Samsung phone (M30), 1 ordinary smart Samsung phone (J7 Prime) and one iphone SE, which it was able to keep afloat.  Please note, if try to charge multiple phones, then fast charging is NOT available on any port, USB and USB-C (PD).  Flights allow only in check-in baggage, so, keep in mind that you would have to carry this bulky device with yourself.  Dimensions: 6\"Lx3\"Bx1.1\"thick.  Not weight on scale, but seems like 1/2 kg and that is a lot of weight.,This power bank full charge at 12 hour and I phone 12 will be 4 time full charged not 6 time,,The charging is super goodI haven’t touched my phone charger for 2-3 days and completely used this power bank for charging and still it wasn’t dried outBut the problem is weight too heavy i must say", "img_link": "https://m.media-amazon.com/images/I/31zYqHExOPS._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Ambrane-Multi-Layer-Protection-Li-Polymer-Stylo/dp/B098QXR9X2/ref=sr_1_469?qid=1672895886&s=electronics&sr=1-469"}
{"product_id": "B07H1S7XW8", "product_name": "STRIFF Wall Mount Phone Holder Wall Mount with Adhesive Strips, Charging Holder Compatible with iPhone, Smartphone and Mini Tablet (Pack of 1) (White)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Mounts|Shower&WallMounts", "discounted_price": "₹89", "actual_price": "₹499", "discount_percentage": "82%", "rating": "4.1", "rating_count": "9,340", "about_product": "WALL MOUNT PHONE HOLDER: STRIFF smartphone wall holder can give your phone a safe dock while charging. With wide range of application, this wall mount for phone can be used on smooth and even wallpaper, lime wall, tile, stainless steel, glass, wooden and metal surface.|EASY MOUNT: The phone charging holder could be easily attached to your wall with smooth surface, such as ceramic wall, glass wall, Lime wall and wall with wallpaper. Please be kindly noted that it's okay to get it off the wall, but the holder is not reusable any more|COMPATIBLE MOBILE PHONE: The wall phone holder is compatible with virtually every smartphone and even some mini tablet (Note: Make sure the thickness of device with case is within 14mm) such as iPhone, most Android phones and mini tablets, and gives your device a safe dock while charging.|USER FRIENDLY DESIGN: Built-in non-slip pad for stable placement and charging cable organizing for no tangled mess. The phone charge holder is made of ABS plastic, non-toxic, no smell and heat-resisting. Sturdy, durable and environmentally-friendly.", "user_id": "AETBZL6TIGY24P3Y6WNN2BNIZIDA,AEM5NWHHVCMHY2LZH5CHNDXON3SQ,AGNOLV6ZQ6SYXOYLHBC4ORHEDL4A,AH5GPY4UE5MUMN6G5NV2BXMUUUZA,AGGCSIEZNAMED5ULILRMUMIZZ4QQ,AFN6SDYZHCOQKXW2WE4MBM3SUQ2Q,AGD6N3XPM2FBWJ5RWHLC5UDE55YA,AEMI7K7IYACRHQ4ULRGRW6JA23PA", "user_name": "Suresh jaat,Mahesh E,amaz vivid buyer,VINOTH KUMAR,Vishal Trivedi,Ravi Shanker,Kirubanand,Suman Kumar Das", "review_id": "RVNP5UR9UECQW,R10UNYZS2VXZ3G,R346UHG3CHA35Z,RDMK41H97ZT8M,RCRNFX4VMUPFM,R22C8ONFTU20FF,R1R7KPNEQCF7IS,R1JL2OE1X4IQ6V", "review_title": "Good,Good product,Small things looka zoomed out,GOOD PRODUCT,Good product,Good quality product,Little gap to hold the mobile. Struggling every time to keep the mobile in.,Excellent product", "review_content": "Good quality product,Good product and keeps my charging organized. Happy with my buy.,I was looking a the pics uploaded by seller and assumed them to be large enough to fit a 6.5 inch mobile. To my surprise they are very small. I am not sure how long it can carry the weight of my mobile before it fells down.The slit to put your mobile and charge is very narriw. If mobile has good cover then it will not fit into the slit.,MODEL AND PURPOSE WAS MEET BUT UNABLE TO PASTE IT IN WALL DUE TO GUM NOT ADEQUATE,The product is good.,A very good quality product but costly.,Arch gap should have been more to keep the mobile easily,does what it says. excellent product", "img_link": "https://m.media-amazon.com/images/I/31yQB88r8kL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/STRIFF-Mobile-Phone-Charging-Charger/dp/B07H1S7XW8/ref=sr_1_482?qid=1672895894&s=electronics&sr=1-482"}
{"product_id": "B0BNXFDTZ2", "product_name": "Fire-Boltt Tank 1.85\" Bluetooth Calling Smart Watch, 123 Sports Mode, 8 UI Interactions, Built in Speaker & Mic, 7 Days Battery & Fire-Boltt Health Suite", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹2,999", "actual_price": "₹11,999", "discount_percentage": "75%", "rating": "4.4", "rating_count": "768", "about_product": "Largest 1.85\" Display : View bigger on the screen with the industry’s largest 1.85\" display covering every edge possible and providing a crystal-clear resolution of 240*280 pixels|Bluetooth Calling On The Go - With Fire-Boltt Tank Smart watch, you have the freedom to access a quick dial pad and sync speed dial contacts on the watch. Make calls through the watch while you are in a traffic jam or a packed transport.|123 Massive Sports Modes - This watch is equipped with 123 kinds of sports to cover your health metrics at every inch of life.|Fire-Boltt Health Suite - Stay updated about your health with this fitness tracker, Monitor your blood oxygen levels at all times, 24/7 dynamic HR tracking available|Swift Smart Realistic Notifications Alert - Get timely alerts and reminders from all your social apps on that smartwatch. One click functioning enables you to a phone free life", "user_id": "AHBB6UBYHJ5FH2BUFQ2BCXHWQFJQ,AE4S7RU4C77FN2E57NMJIFAMH7RQ,AHAUWOVUAQX7D73DVER7HM3WKQZQ,AFVUKW5J3PRPHQ5ZIFK275YXQOPQ,AFXAQKHWVGXPXQ34RWZX3QER6MFA,AF3Q3H3ST2EQI2CBI5V2AZFGETRQ,AGI6BX5V7Y2QSCVLAAHXBHEHQ7VQ,AHVWARXU523WDIQTATHFC5NICFFA", "user_name": "Adwait Kulkarni,Sarvdeo Pandey,Dulal Roy,Amazon Customer,Sakthi,Ankit,Amarjit Sarma,Sahil Kamboj", "review_id": "R1TK3BJ0V4TTCW,R3CM92MP896BSQ,R1T1NCJKM7VXA6,RAYIW8N256R4Z,R17618VX40XGBR,R2UJBOPZHRAM66,R183JTRIE1NM6Z,R13S4RGKBN47XW", "review_title": "Perfect Value for money,Everything is great but you can increase battery backup,Worth the hype....simply good!,Ok product,I love tank so much . I bought it only before 10 days .i have charged it only once after buying .,Watch design is good,Overall Good Experience,Value for money.", "review_content": "Perfect buy for the price of 1999/-After use of 10days my overall rating is 8/10 following are my reviews.Pros:1.step counting accuracy 85-90%2.sleep monitor 95-100% accurate3.Notifications and bluetooth connection with IOS and android - 10/104.touch sensitivity 9.5/105.watch brightness in bright sunlight - 9/106.customisable watchface and easy interface - 9/107.call quality and speaker volume - 9.5/108.Sports modes 9.5/10Cons:-1.battery life 6/10 when fully connected for notifications and calls lasts 3/4 days only. Else if used optimally, can last 7-8 days with moderate use.2.less choice of inbuilt watch faces3.Watch strap could have been of better quality.4.Screen can catch scratches, need to buy a cut screen guard for the screen.Overall this Smart watch is a beast in this range (₹1999)P.s: I have used colorfit pro 2 earlier. Ratings and reviews are according to that.,Everything is great in this Watch it dose have calling , games , fin perfectly in all hands health tracking and etc, but after all watch is great but there is only one con - batter backup is less battery gets discharged in just 15 hours if you will keep it wear all day , i hope fire boltt will fix it. Overall best value to money product 👍👍👍,Many watches comes with the same features at the same cost so u may have a lot of varieties to get confused with,though i can say that this one i got here has stable ui,no lag even,feels premium (mainly the soft strap and the cool crown button adds up much)..the main reason I bought this because it brings all the features everyone needs today with out of the box looks.If someone feels that they have a thin wrist and it wouldn't fit them,don't worry.Even i thought it wouldn't fit me coz i have a thin wrist but it was just fine.,Got delivery in a day. Prompt service by Amazon. Package was sealed. Did not find any tampering. Watch body is plastic built. At this price point, could have been metal one. Detailed review will be shared in few days,Now after the battery gets fully charged it drains from 100 to 0 % in just 10 minutes .i don't know what happened to it .,Watch design is good. In picture shows dark grey color watch but i recived silver grey. Screen wakeup time is slow otherwise everything is good.,Using this watch for couple of days now. Overall I liked it. Readings are almost correct. Hope it'll be durable as well.,Value for money.Only con is that rise to wake up sensor works very slow.", "img_link": "https://m.media-amazon.com/images/I/41vQwUamFcL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Fire-Boltt-Bluetooth-Calling-Interactions-Speaker/dp/B0BNXFDTZ2/ref=sr_1_486?qid=1672895894&s=electronics&sr=1-486"}
{"product_id": "B088ZFJY82", "product_name": "Elv Aluminium Adjustable Mobile Phone Foldable Holder Tabletop Stand Dock Mount for All Smartphones, Tabs, Kindle, iPad (Moonlight Silver)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Stands", "discounted_price": "₹314", "actual_price": "₹1,499", "discount_percentage": "79%", "rating": "4.5", "rating_count": "28,978", "about_product": "Multi-angle adjustable stand: Free rotation of 270 degree viewing angle ensure the perfect angle of view and enhance the audio/video experience|Stylish design: Durable aluminum body, with a sturdy construction, can hold your phone steadily|Enjoy life: It's convenient to cook meals when you learn cooking through video teaching, without worrying about soiling the smartphones|Anti-slip pad: The anti-slip pad works perfect to keep your devices in place while in use and prevent from daily scratches and sliding|Fully foldable: ELV cell phone stand for desk can be fully folded to pocket-size, which will save you plenty of space and make it easy to carry anywhere; Very convenient for daily life|1 year warranty provided by the manufacturer from date of purchase", "user_id": "AGGXWYRLPMULBPR7OXPEV6SNOMIQ,AHBKNSJNHRF22KZYCFRN4CQJG3EA,AELCNLLIFS2RDDTYTLT4KXJRIG5A,AHHS23JALEPKBIT7NAIJDAW3U5NA,AE4ECIOVJONHQF4A4G4GYNVQNPZQ,AHRWF3BGXKDJ4HR7NMPSC4BBMM6Q,AFJ7OTPT4MWWC3XXZCYYKIXEXFGA,AHU2SCYTK66DFVXSMANJZRT2LPKA", "user_name": "Shaik John Saida,Nilay Kambli,Amazon Customer,Harsh Kumar Shrivastava,Tamzid Hasa Dipu,Yatin,Arty,Anoop Chandran", "review_id": "R35G82LMN1P1V4,R2R9TCZMPRU2,R2IJXSRMFCQGXD,R3AZ1FCTLW335M,RQR59DAFHW3WV,R1Z1QLVITW84J4,R2YQHZ0LLWV1HI,RSC0FWSR0TQTI", "review_title": "Good one,Almost perfect,Go for it,Good product,It's folding system is good,Very good product,Great stand sturdy and good quality,Good quality", "review_content": "Good quality. Can buy if it’s price is below 250,,Good product  but little expensive,Good product, holds mobile and mediumsize Tab.,A little costly,Very nicely designed mobile holder with good quality. The best that I have purchased so far.  Go for it.,The package arrived a days early and it is a great product for the price it’s is Very  sturdyAnd looks of good quality,Excellent product, good build quality, bigger compared to similar products.", "img_link": "https://m.media-amazon.com/images/I/41pmcRIe45L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Aluminium-Adjustable-Mobile-Foldable-Smartphones/dp/B088ZFJY82/ref=sr_1_493?qid=1672895894&s=electronics&sr=1-493"}
{"product_id": "B0B4F4QZ1H", "product_name": "Samsung Galaxy M13 5G (Stardust Brown, 6GB, 128GB Storage) | 5000mAh Battery | Upto 12GB RAM with RAM Plus", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹13,999", "actual_price": "₹19,499", "discount_percentage": "28%", "rating": "4.1", "rating_count": "18,998", "about_product": "Upto 12GB RAM with RAM Plus | 128GB internal memory expandable up to 1TB||Superfast 5G with 11 5G Bands, Powerful MTK D700 Octa Core 2.2GH with Android 12,One UI Core 4|50MP+2MP Dual camera setup- True 50MP (F1.8) main camera + 2MP (F2.4) | 5MP (F2.0) front came|16.55 centimeters (6.5-inch) LCD, HD+ resolution with 720 x 1600 pixels resolution, 269 PPI with 16M color|5000mAH lithium-ion battery, 1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "user_id": "AGAELRYPMTG5SADZPDYB343EASAA,AGFN4JODOM2NTFCJQOHDBQLVDJTQ,AG7EZVSAXIVGMNDLSA55K7URQCJA,AGGF75HIEMB67OU7J3RDALBSUKQQ,AHY5CI4SU6JBYPIZ5RLAGO6W3F4A,AE4KODNBVTDCZWZO4HZM4GTRERPA,AH6HFHSYOY2OHMODD7244DHG7FUQ,AHRW5JERWYAJCZO65PDKZSOEPR6Q", "user_name": "Satheesh Kadiam,Pritom Chakraborty,Vishwa,Simranpreet Singh,Saptarshi,Amazon Customer,D.RAGHUL,Dharmendra kumar", "review_id": "R2K5OD0MEEBTDL,RS1N6TNO33BOK,R6KWBGOKI1N9Y,R30SKUMYLSXXDN,R1EOYHZWCRSV7B,R13JBDK4SAAYFT,RJOU5K9ECNW7Y,R2APPRANV6IERZ", "review_title": "Phone, camera, heating - works for me, may not for all,Good Mobile,Good but not excellent under this budget,Worth the price at 9499,Ok type phone... but unable to make videocall within same service provider.,Phone review,Budget king,Battery backup is good", "review_content": "I am not big on camera usage, personally. I was even mentally prepared for a bad camera, based on some reviews here. But I was pleasantly surprised that camera clicks good photos. They are not awesome, but they are decent photos that can even be shared.Now coming to my biggest grouse; heating issue. The phone started heating up while charging, but it was just a little and so I could have ignored it. But then it started heating up more and got me very concerned. I even ordered a replacement thinking I got a defective piece. But then, after further tests, I found that it is heating more when I download huge amounts of data, for example, when I restore data of my old phone, from back up. This is ok with me as, I don't perform huge data loads regularly, definitely not on phone. Then I tested by running tasks I usually perform such as checking office mails, attending office meeting on phone, watching a video from Amazon Prime, and so on. The phone did not heat up even a little. Personally, this is good for me.At this price range, this is a good phone. But if you are camera heavy user and expect to perform heavy downloads frequently, this phone may not for you. I am personally satisfied with this phone as it works for my type of usage. I will not go into plus points of this phone as they are covered by other reviews already. I am only attempting to clarify about how this phone can suit you (or not) in terms of camera and heating. I had many questions about these aspects before buying. Perhaps this review will help you make an informed decision to buy (or avoid). Cheers.,Display - BeautyCamera - decentPerformance - AmazingBattery - ok (in 5000mah u expect more tbh)Overall good phone...Also after 1day of use, i found some network connectivity issue in my jiosim, which I'm using right now in this phone, but I'll keep update this review after 1month of usage!,It's a decent mobile under this price but few things worried me , weight of the phone, too many procedure to change some settings, no screen casting. Apart from that it has good touch, a decent camera for day light , battery life is good.,I bought this smartphone for my mom. Samusung interface is very handful for easy use. Battery is superb, last whole day. Camera is mediocre but provide original colour pictures. All in all satisfied with this smartphone that i got in sale for 9499.,Unable to do video call within same service provider as in VOLTE within same service provider video call feature is available.,Product is fine.  Nothing Fancy but for the budget it is a good phone.,BATTERY : more than enough for normal use  Not sure in gamingCAMERA : good in this segment , can record  videos in FHD 30fpsDISPLAY : since it's a LCD display the quality is  a bit less , but goodV RAM : you can add upto 2gb of virtual ram  but have to sacrifice your storage  Space to use it  OVERALL A GOOD BUDGET PHONE,Finger print is working speedy battery backup is good camera quality is also good", "img_link": "https://m.media-amazon.com/images/I/41Ims-JX0kL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Samsung-Stardust-Storage-5000mAh-Battery/dp/B0B4F4QZ1H/ref=sr_1_496?qid=1672895894&s=electronics&sr=1-496"}
{"product_id": "B09BCNQ9R2", "product_name": "DYAZO USB 3.0 Type C Female to USB A Male Connector/Converter/Adapter Compatible for Samsung Galaxy Note s 20 10 Plus Ultra,Google Pixel 4 5 3 2 & Other Type-c Devices", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Cables&Adapters|OTGAdapters", "discounted_price": "₹139", "actual_price": "₹499", "discount_percentage": "72%", "rating": "4.2", "rating_count": "4,971", "about_product": "Compatibility: The Dyazo OTG USB is universally compatible with multiple devices including laptops, tablets, and smartphones for as long as they have a USB Type-C few examples are Samsung Galaxy (Note 10/ S20 FE Plus ),Google Pixel (4 5 4a 3 3A ,S21 ,13)|Product LIMITATION: This is a USB-C female to USB-A male adapter is made for charging cell phone or data sync transfer and it will NOT support video signal transmission. also does not support apple magsafe wireless|Fast data transfer: The Dyazo OTG USB offers an exceptionally fast data transfer speed 480 mbps saving you a lot of time that you would have otherwise wasted waiting & charging speed is 2 amp|Mini USB C adapter: This provision by Dyazo OTG USB stands the smallest in existence so far that can perfectly click in place.|Durability: The durability of the Dyazo OTG is beyond reproach, credit to the high-quality aluminum components that make it last longer.", "user_id": "AFAYH4FG2MUZTFGDVONVIOV4W3KQ,AFXA26HZQUFUW7XEXH5GMEEZSPMQ,AHFDNDR53QEPY535GSA7C7ZDQ5DA,AGXTHFOTWKYIA6ES5PVGEF2IHWFA,AHCSJSWJF6TFP3YDLCRVCNWPZFTA,AELOYAHMYOGED3PPIMLJIHD7DHGQ,AGNX3V74DONZBBVE2CYREKRCKAQA,AEG6YPCCZCXOX53TAJ7RCARHGZ3Q", "user_name": "narsatya,Jose Amicattu,Amazon Customer,Amazon Customer,Vignesh Elango,Dheeraj jha,Asfal A.,Liyaqat Ali Diwan", "review_id": "RZN676INI7CXB,R3R7UHOVSK5HK6,RK4TT1MUA9PPK,R3SW1UZKGBAI70,R1QKN9JPJ1FWMZ,R208QSDKUOWNF6,R2426HG2VA66ZC,R1433K3KOBJMRY", "review_title": "Good,Good,Worth buying and easy to use,Good,Great product for Ipad Pro,Super,It was good to use and also its fasttt.,Best", "review_content": "Works the purpose of OTG for samsung galaxy A7 tab,It is little bit tight for my realme c type mobile. But works. No problems,Very useful. Easy to use. Reasonable price.,Nice one otg,After searching multiple products in the market for my ipad pro and ended up with unsupportable products and finally found this one. Those who are really looking for an otg for your ipad this is highly recommended,https://m.media-amazon.com/images/I/816nZ1C3DDL._SY88.jpg,It was good to use and also its fasttt.,Good product", "img_link": "https://m.media-amazon.com/images/I/4111qlSCaKL._SY300_SX300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Connector-Converter-Adapter-Compatible-Samsung/dp/B09BCNQ9R2/ref=sr_1_497?qid=1672895894&s=electronics&sr=1-497"}
{"product_id": "B0B9BD2YL4", "product_name": "KINGONE Wireless Charging Pencil (2nd Generation) for iPad with Magnetic and Tilt Sensitive, Palm Rejection, Compatible with Apple iPad Pro 11 inch 1/2/3/4, iPad Pro 12.9 Inch 3/4/5/6, iPad Air 4/5, mini6", "category": "Electronics|Mobiles&Accessories|MobileAccessories|StylusPens", "discounted_price": "₹2,599", "actual_price": "₹6,999", "discount_percentage": "63%", "rating": "4.5", "rating_count": "1,526", "about_product": "【2022 latest iPad Magnetic Charging】 The latest iPad pen developed by KINGONE provides true wireless charging without cables, just like Apple Pencil2. Automatic Bluetooth pairing and charging. You can keep charging your iPad while you carry it. It also perfectly solves the problems of obvious heating, slow charging, and sudden crash of the iPad when charging other wireless charging styluses. You can use it without any worries|【Ultra-High-Precision 0-delay】KINGONE's latest iPad pencil is equipped with the latest ultra-high-precision chip, which solves various problems such as slow response, disconnection, delay, and misalignment of other styluses. Whether you're drawing or taking notes, you can use it comfortably and have the same writing comfort as the Apple Pencil as if you were writing on real paper|【Excellent Easy of Use】This iPad stylus uses physical buttons. Compared with other touch switches, there will be no accidental power on/off, which greatly improves the ease of use and experience. 6 major functions such as quick screenshot, handwriting in the text box, shape correction, and return to the [home screen] with a single switch, enjoy iPad anytime, anywhere! Additionally, the nib is interchangeable with Apple Pencil 1st/2nd generation for a wide range of applications|【Tilt Sensing & Malfunction Prevention】KINGONE's latest iPad stylus is equipped with anti-palm touch and tilt sensing functions, allowing your hands to rest naturally on the iPad, just like drawing on paper. You can dynamically adjust the thickness of the lines according to the placement angle of the chip, and draw and write as you like. The perfect gift for parents, kids, friends, colleagues, and classmates!|【Compatible Models & Warranty】Pay attention to the applicable models! Please check your iPad model before purchasing. Compatible Models: iPad Pro 12.9-inch (3rd/4th/5th/6th generation), iPad Pro 11-inch, iPad Air (3rd/4th generation), iPad mini 6. If you have any questions during use, please don't hesitate to contact us", "user_id": "AEAX7BRPDS3NSYCZQBQDL5DGZDVA,AFI76LT4UP2L3SFJMDMH2C5SM6RQ,AFK4TVL4GOKGSKXKVD4ROM3NWE3Q,AFNAPG6Q3WJAMY4MYDEV2W7JSPLQ,AF645AUHJGIUD7JY2VHG5TBNYNQQ,AHZZFBL24XXVLW6H44MOB6LBHH5A,AEV5AKL64UCEJJJCSVVBLHHWU7SQ,AHCDJWUO4YVS63AGSZWF2QHS7QPA", "user_name": "Ak,Jitesh,anil,Umpo,G'DAS ENTERPRISES,Neetu,Vaibhav Adsul,Alok", "review_id": "R1HOV97NOJFX4W,R3BIRU7WH404ND,RAU26U2KP1OQH,R15BZZ2VBVMJ4V,R29G5QZ1EZB3KF,R3UFXXP9B7DVUJ,R1RVSNGA4SCXX4,R2HT0UTCAOMW1J", "review_title": "Quite Good,good pencil,Value for money,Brilliant,Value for moeny product,Must to buy this pencil,Problemsolver,It works as advertised", "review_content": "After 10 days of use bhaut acha chl rha ha and I will review again aapko bata dunga kessa ha Thoda time BaadBut Product acha ha Abhi tak kuch kharab nahi hua and mene bhe isska khayal rakha ha,pencil is good working good but build could be better,Excellent experienceWorks well with Ipad Pro 11 inch (2022)Good battery lifeNo need to buy overpriced apple pencil,Brilliant product. Adds value to the iPad. Thankfully the alternative to otherwise expensive brand pencil.,Really a great product by king one ❤️🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥. When i purchased the pencil I am doubt full about the quality of product but now a month I used it its amazing product by kingone and it's no doubt best alternative for the apple pencil , even it supports wireless charging that's make it amazing and battery is also to good . Osm product and I didn't faces any ancidental power off as other pencils it's cool and automatic swich off in it's idel time save battery it like all rounder I can made a note and draw the paintings and so many other things .I am a student it's saves moeny it's best in one forth price of original one Cool......,Great quality with noags,For all those who can not afford the Apple Pencil, this one is a real problem solver. Its a little hard to get used to the pencil but works like a charm. zero issues. Lovely product,Initially I was sceptical using this pencil, because it kept skipping lines and became unresponsive. But after a while it became as smooth as original. You must go for it if pressure sensitivity is not what you are looking for. With wireless charging and button shortcuts it’s the best budget pencil. I will update my review to 5 stars ⭐️⭐️⭐️⭐️⭐️ after using and testing it for a while if it passes all the criterion. Thankyou.", "img_link": "https://m.media-amazon.com/images/I/217Lv1D3bHL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Wireless-Generation-Sensitive-Rejection-Compatible/dp/B0B9BD2YL4/ref=sr_1_500?qid=1672895894&s=electronics&sr=1-500"}
{"product_id": "B071Z8M4KX", "product_name": "boAt BassHeads 100 in-Ear Wired Headphones with Mic (Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹365", "actual_price": "₹999", "discount_percentage": "63%", "rating": "4.1", "rating_count": "3,63,711", "about_product": "The perfect way to add some style and stand out from the crowd with the boAt BassHeads 100 \"Hawk\" inspired earphones. Impedance 16Ω, Sensitivity (dB) 92db ±3db, Frequency Response 20Hz-20KHz|The stylish BassHeads 100 superior coated wired earphones are a definite fashion statement - wear your attitude with its wide variety of collection|The powerful 10mm dynamic driver with the speaker resistance of 16 ohm enables the earphone to deliver a punchy, rhythmic response to the most demanding tracks|Features a HD microphone to make crystal clear calls - making life easier on the go, play/pause music or answer/end calls with one-click, track forward with two-clicks or back with 3 clicks make these earphones extremely user-friendly|With 1.2 meters perfect length cable now plug it in anywhere with ease - while the earphones are extremely user-friendly and stylish, extruding premium coating on the wire cable is a manufacturing process that we've been performing and refining since our company's inception|Its impeccable fit won't let you take these wonderfully amazing earphones off, fits you perfectly without hurting your ears and the perfect arc, with different size ear tips helps you in achieving superior comfort even with long listening hours.|1 year warranty from the date of purchase", "user_id": "AF4MVO4JNFDEPWFKZO62OAJKRIWA,AHVPAXEWPATRASBKHOBI2I3VRLGQ,AE47PRQCNT3YFSESBLAJOH6MSCFA,AGUOSXCR3PDNC2K4X7O7QNRGPAWQ,AH5L6KKTP5ZQSN6GVQB4ZGXOM2DA,AEP5OZFTG32NCC34GCOBFO24W6RA,AEQXLMRCT4ZS65M3ST5YV6AOZG7Q,AHZXKAGAJPIMZJD5XJ5QUIYR3ORA", "user_name": "tarun kumar,mahesh radheshyam tawari,Blackspade,Manoj Kumar,Kartik Sharma,Placeholder,Arun,Yuvashree", "review_id": "R2DD2M5YARW7R2,R2M9ZYNGGV1ZLN,RNWNTRNLSJWSB,R3BJBPNI2XP8HF,RI1FLXH6TFEAJ,R172WRCQLOW97V,R3721R2I1BFETF,R2DH3Z46FTCXQ8", "review_title": "Best value for money,HEAD PHONE POUCH NOT RECEIVED,Overall good in this pricerange,It's not working in my Phone properly Plz help me in exchange or return, I ll be thankful to you,Worth the money 🤑,Best,Nice sound,Wonderful product", "review_content": "The sound quality of this earphone are really good. The bass part was also good. I only found the noise cancellation was not what I expected. It could be much better. Finally, I can say its a good value for money.,At this purchase, i did'nt received head phone pouch to keep my head phones safe... it disappointed me,overall good and decent quality, I am writing this after two months, I dont use regularly but whenever I use my colleagues says that your voice is clear 😂,Pin that I do connect to the phone gets automatically to outside. It doesn't work. Plz amazon help me. I'm a regular customer of this company. I'll be really thankful to you.,Great sound quality and good bass. Decent noise cancellation. I couldn't have asked for  better earphones at this price.,Best for gaming,Good,Nice product", "img_link": "https://m.media-amazon.com/images/I/31IdiM9ZM8L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/boAt-BassHeads-100-Headphones-Black/dp/B071Z8M4KX/ref=sr_1_1?qid=1672902995&s=computers&sr=1-1"}
{"product_id": "B09N3ZNHTY", "product_name": "boAt Airdopes 141 Bluetooth Truly Wireless in Ear Earbuds with mic, 42H Playtime, Beast Mode(Low Latency Upto 80ms) for Gaming, ENx Tech, ASAP Charge, IWP, IPX4 Water Resistance (Bold Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹1,499", "actual_price": "₹4,490", "discount_percentage": "67%", "rating": "3.9", "rating_count": "1,36,954", "about_product": "Playback- Enjoy an extended break on weekends with your favourite episodes on stream, virtue of a playback time of up to 42 hours including the 6 hours nonstop playtime for earbuds. Frequency 20Hz-20KHz|Low Latency- Our BEAST mode makes these true wireless earbuds a partner in entertainment with real-time audio and low latency experience.|Clear Voice Calls- It dons built-in mic on each earbud along with our ENx Environmental Noise Cancellation tech that ensures a smooth delivery of your voice via voice calls.|boAt Signature Sound- Delve into your cherished boAt Immersive auditory time with Airdopes 141.|ASAP Charge- The earbuds are equipped with our ASAP Charge feature that offers up to 75 min of playtime in just 5 min of charge; while the carry case comes along with the Type C interface.|Instant Connect- Connect to your morning playlists without any hiccup via the Insta Wake N’ Pair technology that powers on these true wireless earbuds as soon as you open the case cover.|IP Rating- The earbuds' body comes protected with IPX4 rating for water and sweat resistance.", "user_id": "AGGDISUCB6COXRY7SCEYULDTYJSA,AETIHYK5L5TW5NKHBPOWXAKS4MBQ,AH77PFYHLOMFUSAQTGZKB3Y3GLRQ", "user_name": "Anindya,Jacob angami,Dillip", "review_id": "R3LJ3MMSH7Z1BT,RPYZX0CFFJI72,R358NYWUQLR163", "review_title": "Beast in budget!,Fake negative reviews.,great product under low price range", "review_content": "Bought it in January,posting it in August. So i've used it almost 6 months and giving honest review.In short if you are getting it during sale time @899-999,then it's a steal deal..also in regular price b/w 1299-1499 it's a good product..Sound quality is good. Enough loud at 50-60% volume. Bass is also ok. Whenever needed it produces punchy bass. Overall balanced.Mic quality is good in indoor condition,but in noisy environment you can't rely on this. Recevier can't clearly listen to you.You can do gaming as company claiming low latency,i myself didn't test it.Now about battery backup,company claim it will give battery backup of 42 hours with case. 6 hours in single charge+Additional 36 hours(6 times charge via case). But in practical use it gives total 35 hours playback. It will give around 5 hours backup on single charge of buds @ 50-60% volume(if you only listen to music or watching video,but no call or gaming) You can charge the earbuds full 6 times via case: so additional 30 hours.Just one issue with it's design,suit case type box & not easy to carry in pocket. I would say it's a personal preference. If you are into good looks,design then it's not for you.Now it's regular pricing varries between Rs 1299-1499. In this price range also it is one of the best tws under 1500. I will tell why.. now a days many brands are launching tws in the market under 1500. Most of them sound almost similar, difference is like 19/20!! They are just marketing their tws with huge hours of battery backup & by youtubers,reviewers. 48/50 hours of playtime is just myth. I've personally used Truke(Airbuds lite,Buds F1) which is by far the most false promising brand claiming 48 hours of battery in their every tws,but only give 21 hours. Even other tws of boat(Airdopes 121 pro) which claim 40-45 hours playback only give around 25 hours,Defy Gravity Z claiming 50 hours only give 28 hours. If you are impressed by their looks & huge battery backup and thinking to buy those,you will be disappointed after purchase. Instead go with this,you will not be disappointed.,I read the negative comments first and decided not to buy it because the comments said it gives high latency on gaming like PUBG and also it falls from ear while running. And that the difference between normal and beast mode slightly had differenceBut a PUBG youtuber Recommended me this so I decided to give it a try, after trying out myself.Let me provide the facts for youI have a boat rockerz 510 headphone which obviously should be better than this airdope but this airdope surprised me by doing 2x better in providing accurate sound in PUBG.It’s been 2-3 days I used it daily for 6-7 hours on full charge, it has no buttons and it works on touch sensor which was impressive for me and in PUBG it doesn’t give delay as written in the comments, it has a good latency better than what I had expected from the negative comments.Sometimes though I faced the issue where one side of the airdope stops working because it’s either on standby without detecting the user or a bug which is included in the faq/guide/help card in the box I’m satisfied in terms of gaming.For sports like running I wouldn’t recommend because it slips away however maybe u can tie the airdope with a thread attached to ur neck so that it’s safe from landing on the ground I’m gonna try that, please don’t use both the airdopes while running on the roads with vehicles running for your own safety keep one side of your ear free for hearing sounds from your environment.,Pros:1. The level of volume it gets to, is just awesome, it can get incredibly loud so if you're at the gym, these are perfect.2. Awesome Bass!3. Noise cancellation is just great, if you simply put them on without even any music playing, u won't be able to hear things around u very well, it's great for places like Gym.4. Lovely battery life, I've had them a week and only had to charge the case once, that too for just a few minutes. And the earbuds themselves, leave them in case for just five min and you'll be getting battery for a long long while.5. They are very comfortable, can be used for long periods of time.6. Affordable!7. The touch controls are very responsive, tap to pause, double tap right one for next song, double tap left one for either rewind or previous song. Can also pick up calls just by tapping.8. Multiple ear coverings are provided with it.9. Type C portCons:1. The sound quality is not bad or anything but it is slightly muffled as compared to good quality headphones etc. The bass is the highlight so it's great for music, but for movies or gaming, you won't get the most crisp audio.2. Some connectivity issues, sometimes i have to turn my Bluetooth on and off many times for it to work (this is occasional, not a daily or frequent occurrence) [Edit after 1 month use: it's now a very frequent issue]3. The mic quality is good if you are using your phone, but for some reason the quality is really bad if you are on PC4. Sometimes on WhatsApp, the mic will not be detected if you are on call with these earbuds, so you will end up having to take them off to accept a call sometimes. (Not an issue if you are the one dialing) i hope it's just a whatsapp issue rather than earbuds issue.Overall, I needed these for my gym since they play horrible music there (lol) so I'm very very happy with themHighly recommended for music and/or as a more affordable option as compared to JBL etc.", "img_link": "https://m.media-amazon.com/images/I/31GUbeFG3FL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Airdopes-141-Playtime-Resistance-Bluetooth/dp/B09N3ZNHTY/ref=sr_1_2?qid=1672902995&s=computers&sr=1-2"}
{"product_id": "B0B3RRWSF6", "product_name": "Fire-Boltt Phoenix Smart Watch with Bluetooth Calling 1.3\",120+ Sports Modes, 240*240 PX High Res with SpO2, Heart Rate Monitoring & IP67 Rating", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,998", "actual_price": "₹9,999", "discount_percentage": "80%", "rating": "4.3", "rating_count": "27,709", "about_product": "Fire-Boltt is India' No 1 Wearable Watch Brand Q122 by IDC Worldwide quarterly wearable device tracker Q122.【Bluetooth Calling Watch】- Fire-Boltt Phoenix enables you to make and receive calls directly from your watch via the built-in speaker and microphone. This smartwatch features a dial pad, option to access recent calls & sync your phone’s contacts.;【High Resolution Display】- Comes with a 1.3\" TFT Color Full Touch Screen and a 240*240 Pixel High Resolution this watch is covered to flaunt the sleek and stylish look always.|【120+ Sports Modes】- Track each activity effectively with this smartwatch & activity tracker. Track your calories, steps and much more while you are on your fitness journey. This fitness tracker has it all;【In Built Mic & Speaker】- Get HD calling experience with this power-packed watch. Enhance the look of your wrist with attractive colors and sleek finish|【Smart Health】- With the latest HRS3300 technology track your heart rate anytime of the day or even while you perform some activity. The optical sensors assure results so accurate. Monitor your blood oxygen levels to stay fit and healthy;【Smartphone Notifications】- Get all your mobile phone notifications on this 1.3\" Round Display Full touch smartwatch and never be late for a meeting, party or date.|【Gaming On Wrist】- Enjoy playing games on the wrist itself as you are on the go. 【Breathe Function】- Ensure your breathing exercise is fit and healthy with the breathing function.; 【Multiple Watch Faces】- Over 100 Cloud based watch faces to choose from and match your outfit and look each day everyday|Included Components: 1 Smartwatch, 1 Manual, 1 Magnetic Charger, 1 Warranty Card; Band Color: Black; Band Material Type: Silicone; Color Name: Black; Human Interface Input: Buttons touch Screen; Case Material Type: Stainless Steel; Clasp Type: Tang Buckle; Compatible Devices: Smartphone tablet iphone android, **Disclaimer** The charging USB needs to be connected to a 4.7V to 5V adapter only for best battery backup", "user_id": "AHUGCKS7YANTMDYINXQG2UDTU4JQ,AGHQ2VHXMPWZV5SV25S5N3OENXSQ,AH3GZWZM5RVOFCJCXRU7QFBAJ5NQ,AGQ2RWOECSEFEQMIGE7VTXP65OKQ,AEVUBEFT2MRH2PRVW53SJEL7H42A,AENY7L4XGCQMI627A27G3NVIBJNA,AHQISETKX3OXMZ4IX3YO7YV4UZ6Q,AGESGUTIYJQOZ7PU563DHLYSPRTQ", "user_name": "yogita ratre,Arun k.,Amol Basutkar,janarthanan,Naman,keshav Chelmeti,Hritik jain,Jatin Shah", "review_id": "R34816YEM3Y2VJ,R3P1QZDIWJJYVR,R2HXC35HKL6S3E,R2CUWR6SL0MMRR,R3PWLUFNP117X0,R2PK2034NVCPNH,R2YJZKVTCUJAVZ,R27X5G6UFUKCM9", "review_title": "7-8/10, Decent, good for day to day use,Good choice under budget of Rs2000,Average product.,Budget friendly,Overall it's a good watch,Good product,Best in design, accuracy and looks fancy. A must buy for every person who is watch enthusiast.,Having a great experience", "review_content": "2 months review- its been working fine, there's been no problem as of now.. some things-the whole step tracking thing, i bought it due to that reason, it didn't basically satisfy me to that level with that, but it does count steps accurately in the walking mode(activity)Its got some scratches in it.. but its not that noticeable at first glancethe backgrounds, I believe it could've been wayyyy better if we could change 4-5 backgrounds of 10, but we can only have 2, 1 customised and 1 download from the app(which has limited options)  the other backgrounds are just.. eh..the looks, I'll give it 9/10, it's good looking stylish differenttouch screen is goodthe sleep tracking too is kinda accurate(i still haven't understood it that well lol)battery life is muah, I use it without Bluetooth and it easily survives for 6-7 daysspo2 and heart rate, I just believe what it says as i can't check prove if that's correct.the water resistance, I haven't used it in water (ofc am scared) the calling feature works fine.. its got good sound overall its a decent watch and can be used in day to day activities, am quite satisfied with it as my first smart watch 😗,I've used this product for 4 days, and i'm going to rate the various features and different aspects of this smartwatch which could help the customers here -So, Bluetooth calling (4/5) - the in-built mic of this watch is excellent and the voice gets to the other side without any disturbance, watch connects smoothly with the mobile and don't get disconnected automatically until you do it yourself through watch or phone. Only con is you can't silent the incoming call which is annoying sometime, hope they fix it with an update.Built quality and looks (4.5/5) - metallic built which looks premium and straps are also quite smooth and comforting. Best thing is, it also looks good over skinny wrists(poor me, with 5.6 inch wrist). Only con is you can get scratches on display so protect with it some sort of screen guard.Touch screen (5/5) - it's almost buttery smooth without any lag which is pretty impressive for a smartwatch under 2k. I bet you will not get any laggy experience ever.Accuracy (3.5/5) - SpO2 and HR has fairly decent accuracies, it gives you a rough idea of your being, so its quite reasonable for a watch under 2k. Count steps with decent accuracy as well. Sleep accuracy is also just acceptable.To sum up, you should definitely go for this watch if you've a budget, constrained under 2000 rs,,I recently purchased the Fire Bolt Phoniex watch, which is quite stylish, and the Bluetooth calling is excellent. The voice gets to the other side without any disturbance.The build quality is good over the wrists, but you can get scratches on the display, so protect it with some screen guard. You should go for this watch if you want a budget-friendly smartwatch under 2000.,It's a good watch but i have faced two problems in it the first one is there is no feature of raise to wake and the second one is there is no option to silent it when someone calls you.....i think you should purchase it if in future company add these two features...,I recently purchased the Fire Boltt Phoenix Watch, and I am very happy with my purchase. The watch is quite stylish, and I get compliments every time I wear it. The watch is also quite comfortable to wear, and the strap is adjustable to fit any wrist size. The watch also has a great battery life, and I can go for days without having to charge it. The watch also has a number of features, including a step counter, heart rate monitor, and sleep tracker. All of these features are very useful and make it easy to track my activity and health. Overall, I am very pleased with my purchase and would highly recommend the Fire Boltt Phoenix Watch to anyone who is looking for a stylish and functional watch.,This watch is absolutely stunning and great value for money. Really pleased with the design and shape of watch, definitely a must buy for every person .loved the colour, durability and accuracy is super 👍. just go for it.,I liked the product it has so many features like sleep tracking, sp02, Heart rate measuring, music player, temperature checker my only nitpick would be that it only have 2 games and secondly it has good wallpapers but a Ben 10 Omnitrix wallpaper would give it an even more awesome look", "img_link": "https://m.media-amazon.com/images/I/41sHRWXCfvL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Fire-Boltt-Phoenix-Bluetooth-Calling-Monitoring/dp/B0B3RRWSF6/ref=sr_1_3?qid=1672902995&s=computers&sr=1-3"}
{"product_id": "B0B5B6PQCT", "product_name": "boAt Wave Call Smart Watch, Smart Talk with Advanced Dedicated Bluetooth Calling Chip, 1.69” HD Display with 550 NITS & 70% Color Gamut, 150+ Watch Faces, Multi-Sport Modes,HR,SpO2, IP68(Active Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,799", "actual_price": "₹7,990", "discount_percentage": "77%", "rating": "3.8", "rating_count": "17,833", "about_product": "Bluetooth Calling- Wave Call comes with a premium built-in speaker and bluetooth calling via which you can stay connected to your friends, family, and colleagues|Dial Pad- Its dial pad is super responsive and convenient. You can also save upto 10 contacts in this smart watch|Screen Size- Wave Call comes with a 1.69” HD Display that features a bold, bright, and highly responsive 2.5D curved touch interface|Resolution- With 550 nits of brightness get sharper color resolution that brightens your virtual world exponentially.|Design- The ultra slim and lightweight design of the watch is ideal to keep you surfing your wave all day!|Watch Faces- Wave Call comes with 150+ Cloud watchfaces for you to pick from, complementing your every mood and outfit|HR, SpO2 & Breathing- Monitor your heart rate and blood oxygen levels on-the-go with the heart rate and SpO2 monitor. It also comes with Guided Breathing to help you relax and embrace mindfulness.", "user_id": "AHPYDFW6Y3FIQGD2RJPBFF5QNVRQ,AG7DTVYZDY2NWU6V2G4KSIB67TDA,AHNQJPSI4I23HHMRHCCCI7QOBK7A,AHPOQQONRLZMHYLDKYP5SQOKRIEA,AGDD5ACY3AGTMTVBQOC3DMUR6REA,AFZV4ISJSNGDUD5TU3VYMTYQ5JGA,AGKPRGZCV5XK7ZNVLQWUGRB6CVVQ,AE7DX25DQCE7MXLEASO6I3YLWHRQ", "user_name": "AV,Mathan kumar,Amol Manjrekar,Suraj_nirmalkar,ASIF ANSARI,Jugalkishor yadav,Chinmayee Ninawe,Samba Shiva", "review_id": "R3EKLFGQGV02SG,R23WEMNZK46UV3,R1G2C7XV8CAM7W,R1O1T0NB6M5CU4,RY95PJLUIT03E,R2HMI9LDLJ1S2Y,R216CF66UYJR2A,R1XD0A6A2KGJZ6", "review_title": "Not Polished Enough. (Improving with updates),Best for the budget 👍,Value of money,nice product,Good product,Super value for money,Awesome product,Product itv", "review_content": "[Update: Sept 29] boAt seems to have heard the feedback 😀 and updated the watch faces. Now there are a few good ones to pick but a slight improvement over the ones the watch earlier had. Bit Impressed. Added one star for it.Not a very polished product. The fonts are tacky and look ugly in the watch for notification text and caller name text. The watch faces are a lazy design job. No point having 150 watch faces if only 10-20 are good or usable. Rest are useless.[UPDATE: Oct 11] boAt seems to be on a smartwatch launch spree. And thanks to that, they are constantly updating the phone app and the watch faces. Now you have many good looking watch faces to choose from. So overall, still the Smartwatch UI needs work. But atleast you have good watch faces.Good:- Screen quality- Battery life- Looks and the metallic frame- Call clarity- BT calling at the price- Reasonably accurate sensorsBad:- The UI, fonts - they are all very ugly and tacky. They could have tried to give the Chinese software some makeover. But it is a clearly lazy job by the tech team. A copy paste job to be precise of getting an outsourced software and plastering it with brand logos.- Restarts randomly when the call is going on on the watch even for 1 min or so.- Watch faces. Again a job of the design / tech / UI team. BoAt doesn't have a good team of designers and UI guys to really offer simple yet good software features like good watch faces and good watch UI.- No option to silence a call or reply with quick replies.Look for Noise Smart Watches in the Same Range. Noise Colorfit Pulse Go Buzz is cheaper and better alternative + has better watch faces and UI and quick reply to notifications and call silence and mute options for lower prices which this watch has clearly missed.You can go for boAt Wave Call also - It isn't an outright bad watch, but there are better options available for the price.boAt - If you have a team who reads and wants to improve, get some good UI and design folks in your team. Your products are good, but the UI and design is what the people see and that's what makes them feel good about your products. You have really average UI.,Boat wave call watch is best for budget.Call is too good and sound quality is also too good.Battery is good.Totally the watch is good for range.,It's good value for money smart watch.Light weight. Touch is smooth.All the features are 90-95% accurate.,a good product in this price range must buy itGOOD LOOKINGGOOD QUALITY,Good product is mst h,Average for calling good looking,I'm really happy to purchase this watch! It's very affordable having so many features. The calling feature works really well! Overall, if you're looking so good brand & good features, go for this ..,Product does not turn onPlease return the item. Please.", "img_link": "https://m.media-amazon.com/images/I/41d69zua5LL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/boAt-Wave-Call-Dedicated-Multi-Sport/dp/B0B5B6PQCT/ref=sr_1_4?qid=1672902995&s=computers&sr=1-4"}
{"product_id": "B005FYNT3G", "product_name": "SanDisk Cruzer Blade 32GB USB Flash Drive", "category": "Computers&Accessories|ExternalDevices&DataStorage|PenDrives", "discounted_price": "₹289", "actual_price": "₹650", "discount_percentage": "56%", "rating": "4.3", "rating_count": "2,53,105", "about_product": "Ultra-compact and portable USB flash drive,Capless design|Share your photos, videos, songs and other files between computers with ease,care number:18001205899/18004195592|Protect your private files with included SanDisk SecureAccess software|Includes added protection of secure online backup (up to 2GB optionally available) offered by YuuWaa|Password-protect your sensitive files. Customer care:IndiaSupport@sandisk.com|Importer Details:Rashi Peripherals Pvt. Ltd. Rashi Complex,A Building,Survey186,Dongaripada,Poman Village,Vasai Bhiwandi Road, Dist. Thane,Maharastra 401208, India|Share your work files between computers with ease", "user_id": "AFNMA3FQAONYMREOFLNYF2RV4AOA,AHAYDWCGM4QNXWBCRC5LADVNADTQ,AFQFYAWOQX6T6PE5UVBUEFNBZC5Q,AHCXVEDVUKHZFJY5GZOVEXXZ5FBQ,AEPAT7E6LUSVYZ6BFUYULMMKN6HQ,AE7Y6RN5W7UID7VMJJWVAIT55JAQ,AECBZRZ5INBTHZJJIGSQJNEEEUYA,AHON2KL4HI3A5EPJ4TZU2MQF5ACA", "user_name": "RAJIV D.,Antony Gruz,ajay,Praveen kumar,Sujoy Paul,Amazon Customer,Sanjeet Tudu,Kartik Pandey", "review_id": "R2XCI5KR2H8QEI,R3BNQCB05PYZMV,RVXXO15AGASNX,R1VU19BJMXT73J,R2LYRK8OS10K2Z,R1NOP9O1UWSJJC,RE6XTKYH9FSA,R1J5H4FDTO6GBX", "review_title": "Good product,Affordable,Good,Reding speed is only under 22mb/s,Good product 👍,good,Good product and value for money,All about it is very good product in suitable price.", "review_content": "Very chip very good,Really happy to buy this pen drive comparatively with low cost,Very good,Storage capacity is good,Like,good,Good product and value for money,It's all good , you can vo for it.", "img_link": "https://m.media-amazon.com/images/I/310mw9KTJvL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SanDisk-Cruzer-Blade-Flash-Drive/dp/B005FYNT3G/ref=sr_1_5?qid=1672902995&s=computers&sr=1-5"}
{"product_id": "B01J0XWYKQ", "product_name": "Logitech B170 Wireless Mouse, 2.4 GHz with USB Nano Receiver, Optical Tracking, 12-Months Battery Life, Ambidextrous, PC/Mac/Laptop - Black", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹599", "actual_price": "₹895", "discount_percentage": "33%", "rating": "4.4", "rating_count": "61,314", "about_product": "Reliable Wireless Connection : Enjoy a wireless connection up to 10m away thanks to a plug-and-forget USB mini-receiver|Optical Tracking : The advanced optical tracking features enable ultra precise moves on almost any surface. Required: available USB port, Windows 7, 8, 10 or later, macOS 10.5 or later, Chrome OS, Linux Kernel 2.6+|12-Month Battery Life : Don’t worry about constant battery changes as this wired Logitech mouse has a 12-month battery life.|Quality Assured : Logitech are experts you can trust, and for more than 30 years we have created high-quality corded, cordless and Bluetooth products that help you get the most out of your Windows computer, laptop, Mac or Macbook|Reliable Wireless Connection : Enjoy a wireless connection up to 10m away thanks to a plug-and-forget USB mini-receiver|Note : In case of Wireless mouse, the USB receiver will be provided inside or along with the mouse|Optical Tracking : The advanced optical tracking features enable ultra precise moves on almost any surface.", "user_id": "AF4AWOIIGQUD4IZ6QNWXVHL6OKTQ,AHGZNSZ5ECVXE3L5RCORYAQXCDAA,AGXKMOT2VJHSKVF2RGDS3WHGFBCA,AHACIJNM7YURLENNI7T2GIOMOQZA,AE3KVLQI3N4354HVJ5YAIHRJFQSQ,AHYCGGRP7XQVIYP6NRVZI6A7FH2A,AFWFAON3AFS63R4TZJ2DPHHB7KMQ,AFZ4LNRNW2PKH2TMZM6QH2KJNQCQ", "user_name": "Anand,Aditya,Shiva,Saleem Kumar,A Sinha,Arghya Roy,mohsin,Shashank S Tambe", "review_id": "R2Z4GQU0ZVOH1G,R3JRYRMKRD0BW0,R2C5DX0ZNNX7Y5,R25A5KZD14HHJC,R2TA6MY8NIL1ZP,RX492E2N9MM6W,R2PZJ7871P6D8D,R1I8UMWC4FQ0AX", "review_title": "Small, not too heavy, good looking.,Quality of material,Nice product,Good,One of the Best Mouse for the price,Good holding good dpi easy to use,Value for money,Nice mouse", "review_content": "Hi guys! Bought this yesterday, so haven’t used it much, so an early review. But the most detailed review so please read till the end. Very important points are mentioned.Looks are cute! It looks really nice and elegant. I am using it with a MacBook Air. So far it seems there are no problems using it. The scrolling is smooth, connection does not drop, and there is no lag. Connection is instant. There is no pairing required. It's plug and play along with the dongle provided with it.It sits low on the table, feels weighty but not in a wrong way. The battery adds to it's weight, but I have used heavier mice before, and this one feels just right. It has good grip. Nothing to complain about that.Buttons are nice and clicks are satisfactory, not too noisy; they are just right. Scroll wheel doesn't feel cheap at all, though I believe it could've been better quality. Body is matt finish and doesn't leave fingerprints on it, though if you're someone who eats and handles the mouse, then it'll show the oil prints and that's true with any peripherals. The mouse doesn't feel cheap overall, but it is definitely plasticky, though not in the bad sense. It is definitely not cheap looks wise.There is an on, off switch on the bottom which is helpful in saving the battery (which is included) when the mouse is not in use. There is no light on the bottom which is good if you have kids in the house who keep flipping the mouse and staring at the super bright light. So that's a good thing and a definite plus! The overall shape and size works in the favour of the mouse, and a variety of users with small and large palms will be satisfied with it.Now over to a major flaw. The mouse connects only though it's own usb dongle (which by the way comes tucked inside the body of the mouse itself, inside the battery door, which I found mighty impressive) and not through the laptop's bluetooth. Now this means two things- 1. You have to carry around the usb dongle with you everywhere you go, which means if you happen to forget it at home while traveling and carry just the mouse, then the mouse is pretty much useless in that scenario. And worse still, if you happen to carry it out of station with you and bring back only the mouse and forget to pack the dongle, then you're stuck and I don't think you get only the dongle (you'll have to check that with the seller), and  then the mouse is left useless in that case. 2. Now over to  the problem I am facing, which I did not see anyone else mention in their reviews. I use a MacBook, so it doesn't have USB-C inputs, which means you must buy a connector for it to connect the dongle. I actually had already bought a connector so that was not a problem for me, but you will have to factor in the cost of the connector, which is not cheap, because you want to buy only good quality connector for your expensive MacBook. Of course that is a problem with the MacBook and not with the mouse, but consider this point. It is very important. It will NOT connect over MacBook's Bluetooth. Otherwise, it works well with the MacBook. The only caveat I found is the tracking speed on level 2 is too slow and on level 3 is too fast. You'll have to get used to that thing. It doesn't feel very natural (as the trackpad on the MacBook feels) because of that speed problem, but otherwise, the pointer flows smoothly on screen and doesn't jump around, at least with my mouse. Also, the battery door does make a noise when landing the mouse on the pad, and I feel it could have been made better. But I guess at the cost, you really can't complain too much.Overall, I think a good buy, but the compulsion of having to use it with it's own dongle is a major drawback I feel. If that doesn't bother you, then nothing else should keep you from buying this product, especially since it is one of the cheapest wireless mice out there at less than 600 bucks, which is what it cost me.,The quality of power button is very low easily it can break,Nice Product, works as expected as of now no issues,Good,Very smooth, works on almost every surface, paper, table, cloth etc.There's a bit rattle sound of the plastic which is just above the buttons (right/left clicks)It will not bother most of you, I am a bit Obsessive with these kind of things, So...[Personally I opened the mouse and stuck a paper inside the plastic which presses the click button, resulting in no rattle sound. Now mouse only makes sound when you click the buttons, (click click click)]Battery life of Logitech is known to be very good.,Quality good, dpi good, good accuracy on off switch available, smooth, good deal at reasonable price.,good product on which you can use for long time,This is good mouse, thanks to Amazon for providing this product at reasonable price. Very sharp and correct working mouse.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31y-oJ1XnqL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Logitech-B170-Wireless-Mouse-Black/dp/B01J0XWYKQ/ref=sr_1_6?qid=1672902995&s=computers&sr=1-6"}
{"product_id": "B09CTRPSJR", "product_name": "Storio Kids Toys LCD Writing Tablet 8.5Inch E-Note Pad Best Birthday Gift for Girls Boys, Multicolor (SC1667)", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|GraphicTablets", "discounted_price": "₹217", "actual_price": "₹237", "discount_percentage": "8%", "rating": "3.8", "rating_count": "7,354", "about_product": "Toys and Games Portable Ruff Pad E-Writer, 8.5 inch LCD Display|One-touch Erase Button : Tablet displays your notes until you erase them with the touch of a button.One-touch button erases notes instantly.|Pressure-sensitive screen lets you create thick and thin lines. Durable case and recessed screen are safe for school, travel and home use.|Tablet displays your notes until you erase them with the touch of a button, One-touch button erases notes instantly.|Best Birthday Gift For Kids. Color may vary as per Availability", "user_id": "AGQ3YJHNFI6CFAOTHMHNA3BEH4AQ,AGIGNUSWYO2OQDTSK25NQWQYTKKA,AHIJZTKPBCAZCSUIZU3JPERUM55A,AFJQGE6TV2BR754CRHDMTKOCTHNQ,AGHD2OMQH2SJZ7PQONIDBG63ZBKQ,AGPBPLV5X666GMBRNJCVLJNNH64A,AHRBK243XJM2ALAIV4RQOYVTH54A,AHNZPDWG65TAYC72YLSK2DUCA6BQ", "user_name": "Udayakumar R.,Samson Sirla,Nitish Varshney,Bhuvana,kaaju,rakesh a.,Priti Sahu,Sumitha", "review_id": "R32QHTM45T5S7N,R1PWLZEPRIUF0B,R2ZPR72HXJDDTX,R1ERI9BP1ALOX3,R1BY1F45H961AX,R19ZEB8HMP8MQS,RO9GYYPV0QDRB,R1P6WSNKIOGFEN", "review_title": "Good Product,Good,Excellent Product!,Please check before replacing...,Save Trees,overall, a good buy,Save tree,Very nice product", "review_content": "The product is a good one, however once i received one with a small bump and I replaced it to receive one which won't erase one part of the screen.The product is very handy and easy to use. However you would have to replace a couple of times to receive a good condition product.,Easy to use and since we bought it a two weeks before .,..good experience until now.,..I will review more after using it for atleast two months!,It's fun with sustainable learning for kids. I ordered two tablets for my twins and both are liking it.,At first delete button was not worked so I thought the product Is damaged but there is lockscreen button on backside and its locked 🙃 overall good product thank you amazon,So far so good , a good alternative for paper  it works fine ... let's see how long it will last .,Nice for kids to play with,Nice,Awesome my son like it very much", "img_link": "https://m.media-amazon.com/images/I/51YTmlApiXL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Storio-Writing-Tablet-8-5Inch-Birthday/dp/B09CTRPSJR/ref=sr_1_7?qid=1672902995&s=computers&sr=1-7"}
{"product_id": "B08JQN8DGZ", "product_name": "boAt Airdopes 121v2 in-Ear True Wireless Earbuds with Upto 14 Hours Playback, 8MM Drivers, Battery Indicators, Lightweight Earbuds & Multifunction Controls (Active Black, with Mic)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹1,299", "actual_price": "₹2,990", "discount_percentage": "57%", "rating": "3.8", "rating_count": "1,80,998", "about_product": "Playback- Airdopes 121v2 offers a nonstop playback of up to 3.5H with each charge and an additional 10.5H playtime with the included charging case|Lightweight- With a dual tone finish on a lightweight ergonomic design weighing just around 4g per earbud, get ready to groove in full flow with Airdopes 121v2v2 TWS earbuds|Drivers- It possesses powerful 8mm drivers that pump out immersive auditory experience all day long|Battery Indicator- Its carry cum charge case also has the battery LED indicator that shows the remaining power for the case|Controls- The true wireless earbuds offer easy access multifunction button controls with stereo calling feature for an overall seamless user experience.|Bluetooth- These true wireless earbuds offer a true wireless experience for real time audio with Bluetooth v5.0.|Voice Assistant- You can access the instant voice assistant via just a single press of the Multifunction Button|1 year warranty from the date of purchase", "user_id": "AGGDISUCB6COXRY7SCEYULDTYJSA,AEHVGO7QNRXBJXCIN7ZS2IBKCMUQ,AGCTCXJXG6EKLF6ANAPIKPTAW75A,AGACS7BZV5ZPI2NOFQUC4S6LVZGA,AF4WE2MXXMQUPLKNPGCVP6N3K3FQ,AHX75KI55PFZY6J6PHO7A2AENXQA,AFT3ZU3OLRGDMPBARQP3BOKLGWSA,AFFB7SSARMFDEYKPBPVDII3AFIVQ", "user_name": "Anindya,Aditya Mondkar,Pawan Sharma,Vivek Prakash nakkeeran,Nishant Mridha,Rajlaxmi,babanna,Satish Golani", "review_id": "R2SIAIJ2R8203U,R2SLNJ664LBZS6,R2PJGCDX444YME,R39XDUIGQYNX0A,R25G45DJ52J2HV,R2WZN2M9J9EQUM,R1PTY9JK5PT866,R2KD1JU029JTLX", "review_title": "Good sound quality but not 40 hours backup!,Decent but not that impressive,Good purchase, good build and good sound quality,Good for cost.,Excellent,Like the product,Value for money,Call Disturbance", "review_content": "Sound quality is good,enough loud at 50-60% volume. Bass is also ok. Mic quality is also good in indoor condition. Receiver can clearly listen to you. I didn't use it in noisy environment or in outdoors. Company claims there is low latency while gaming,i don't know exactly if it works or not. Sound & call quality wise it's good one..But the problem is with battery backup. Company claim it will give battery backup of 40 hours with case. 8 hours in single charge+Additional 32 hours(4 times charge via case) This is misleading. It only gives total 25 hours playback. I've tested it myself.It will give around 7 hours backup on single charge of buds @ 50-60% volume(if you only listen to music or watching video,but no call or gaming) You can charge the earbuds full only 2.5 times via case: so additional 18 hours. If you try to charge after 2nd time it will only charge the buds around 60%,then it goes off. (After 1st charge the case has 48% battery left,2nd time it is down to 12%,then 3 rd time it goes to 0%)They mentioned earbuds have 40 mah battery each,380 mah battery in case. It is mentioned in product manual,but in boat website it is written 400 mah instead of 380.Technically 40 hours backup is also not possible.It has 380 mah battery in case,it acts like a 380mah powerbank. So let assume it's efficiency is 60%. So it will give output of 228 mah.(It is less than mentioned capacity due to energy loss  while energy transfer) Now each earbud has 40 mah,so total 80 mah. Now buds can be charged via case 228÷80=2.85 times.That's it.,Having bought this for roughly ₹1300, I must say that I'm not too satisfied with the product in many ways.1. Pairing is very simple and it connects very quickly.2. The build quality is actually very good. It's all plastic but it looks quite durable as long as you're not too rough with it.3. Audio is decent, not too impressive. My wired earphones (Boat Bassheads) are quite frankly much better.4. THIS IS NOT FOR GAMING. I play Call of Duty: Mobile and the latency is just painful. Even with \"Beast Mode\" turned on, I felt no difference as the the lag still persisted.5. The battery backup is actually great. The only positive thing I can think of is the battery backup. I got roughly 3 hours of playtime and the battery had drained from 100% to 80%. The quick charge is a cherry on top.Overall, I'd say it's performance is very average. Definitely not worth ₹1300 in my opinion.,,Not adaptive for every person's ear. My wife doesn't suit the ear airdopes.  Partially satisfied. 799/- rupees i bought. Don't bought more than 799 for this model.,The product was as good as i expected . The quality is good . Noise cancellation isnt quite high but overall good.,Battery lifespan i more, better audio. But calls are not audible properly some times.,It works best for the price. Sound quality is good, but plastic quality is average.,No clear sound on call. Creating disturbance during call", "img_link": "https://m.media-amazon.com/images/I/31KjuRb9oNL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Airdopes-121v2-Bluetooth-Immersive-Assistant/dp/B08JQN8DGZ/ref=sr_1_8?qid=1672902995&s=computers&sr=1-8"}
{"product_id": "B0B72BSW7K", "product_name": "SKE Bed Study Table Portable Wood Multifunction Laptop-Table Lapdesk for Children Bed Foldabe Table Work with Tablet Slot & Cup Holder Brown Black", "category": "Computers&Accessories|Accessories&Peripherals|LaptopAccessories|Lapdesks", "discounted_price": "₹263", "actual_price": "₹699", "discount_percentage": "62%", "rating": "3.5", "rating_count": "690", "about_product": "> ★ ★------->EASY TO FOLD OUT: Clever folding design allows the legs to fold flat so you can easily put it behind the door or the corner of home when not in use. No need to install everytime you use.|>★★------->LARGE, STABLE, PORTABLE FOLDING TABLE: The folding size of our laptop desk is about 60cm(L) * 39.5cm(W) * 27cm(H) such that it fits upto 11-17inch laptops and also a space for mouse. Built-in iPad stand groove for holding ipad or kindle. Our table comes with a table cup holder to keep your favorite drink within reach.|>★ ★------->MULTI-PURPOSE LAPTOP DESK: Laptop bed tray is perfect lap desks for work, games, reading, eating and school from the comfort of your bed, floor, sofa or couch. Great work from home gift & bed accessories!|> ★ ★------->NON-SLIP BOTTOM DESIGN: The steel feet are covered with black sponge for good anti-slip effect to keep your laptop safe without slipping when in tilted position. Also provides you a comfort and stability while using.|>★ ★------->ENVIRONMENTAL FRIENDLY MATERIALS: Laptop Bed Table is made of MDF solid wood particle board, safe and environmentally friendly. The surface is smooth, non-toxic, not easy to stretch, moisture-proof, scratch-resistant, high-temperature resistant. While the legs are made of aluminum alloy tube with powder coated finishing work, it is more strong, sturdy and curved ergonomic tabletop designed for sitting. This table will last for a lifetime and will remain corrosion-free", "user_id": "AECQPIQJEIF5ASVCNW43FEDLAATQ,AEO2Q72MKWA5DPWBFQQ63ALQW7AQ,AEW2N6ZN62QQ5C5RXHU4TSK2EYRA,AGLPUYATOE2KVD36DZ2VD4QAOZCQ,AFC5T42J2P6CMZQUXB4IVBEZSAFA,AEAFK6ITOXRVS34MTPODTIE4UWLQ,AGNXO5MSN4KKBGSQR3YT26CYYBQA,AGKMK57A4J54JG5OUHPMVGGPVUKQ", "user_name": "Amazon Customer,Tamanna K,P Janarthan,Ram Sai,Deema Khuraana,Shubu,KAMAL KUMAR,Gopinadh.P", "review_id": "R2TD3N245ZRZKA,R2I93780O12B86,R3VTLQFO4KMHHC,R1T0W8Y2RD3FQP,RUL4CK8TAFSM6,R10TVE5WRTUL6T,R1CT7PUFT9SH87,R119BACSU1D5W0", "review_title": "Good as per price,Good,Worthy for Price,Worth,Unstable on bed mattress - due to curved landing edges,RECOMMEND TO BUY.,Quality Wise It's Not Perfect But 👍 Good As Compared to Market Products,Totally is good 😊", "review_content": "It's light weight, good looking. Stability is moderate. I got it for 399/- I hope it the price to be less that i bought. Overall Nice experience to have this beautiful table.,It's a good product but ut has few marks on it which is not going away even after cleaning. It's okay for me. Overall It's good. Also because my laptop is 15.6\" display it takes up most of the space.,Table is of light weight and hope so its sturdy. Finishing is good with cup and mobile holder, will recommend this for kids writing purpose.,Worth for money. Useful for the one who wants to sit straight without bending spinal. For  WFH  perfect.,Keeps falling even at a slight push/touch. Unsafe to keep laptop. But very GOOD product if your base/floor is plain,Brought it for 399 rs, look wise its fab, very light weight,bottle doesn't fits in slot.received damaged at corner s, connectors material is foam , due to it stability decrease. Mobile stand is not adhered. And packaging is worst no bubble paper no plastic wrapping present.Its ok okish product at this point of price.You can buy coz in market you get this beyond 600 rs.,Good for 📝 Students & laptop 💻 work.But not enough strong to lift heavy-weight items. Stability is also well.,Product is good and quality of table.i like this....", "img_link": "https://m.media-amazon.com/images/I/41EbxurQIDL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SKE-Portable-Multifunction-Laptop-Table-Children/dp/B0B72BSW7K/ref=sr_1_9?qid=1672902995&s=computers&sr=1-9"}
{"product_id": "B0BDRVFDKP", "product_name": "SanDisk Ultra® microSDXC™ UHS-I Card, 64GB, 140MB/s R, 10 Y Warranty, for Smartphones", "category": "Electronics|Accessories|MemoryCards|MicroSD", "discounted_price": "₹569", "actual_price": "₹1,000", "discount_percentage": "43%", "rating": "4.4", "rating_count": "67,262", "about_product": "Ideal storage for Android smartphones and tablets|Up to 140MB/s transfer speeds to move up to 1000 photos per minute|Load apps faster with A1-rated performance|Class 10 for Full HD video recording and playback|Compatible with SanDisk MobileMate USB 3.0 microSD card reader", "user_id": "AG44HJB2AMIVHAGQZ2WGWONERKCA,AHL2FABQV6XAHZN547DN662X5RWA,AHJE6QFY5XEOZJJWOIOHHIDFWWFQ,AEDMSJ2CEQZID62NXPKEQLMBG2LQ,AHF7ZBKNBLCLFHGJG5KXKPI7QVCQ,AGD2S7EXXSXHBCJHTXUAV6FLXAZA,AHZRUY7MR4SVM3HFJ2SZDGHZJ56A,AHEHKOZPPOVYL75KDU52PSBYDEFQ", "user_name": "Prashant,Sumesh Sundararajan,Vijay Baitha,S.k nahak,Vikram Kumar,Manish,Jm,amit nayak", "review_id": "R2A7MIUNOW8DOE,R2FXP703540FR1,R37E7QJET0BYE8,R1NOL0GE16P06G,R48EN3ANVWEX9,R17WYXS17TYDER,R2BMYAH01K8EG8,R23IO3LHHG39H", "review_title": "Fake Product,Costly but excellent quality,Storage good but don't know how to Activate warantee??,Good for use,5 stas nahi diya kyuki capacity 477gb hi rahta hai,Speed not as advertise,Good one,It's ok", "review_content": "128GB SD Card is showing 134GBDon't buy this product,It was a bit costly but prouduct is of great quality. Could have been made little bit cheaper cost wise.,All good,Fast and smooth,Ab mujhe computer ki jarurat nahi padti,Speed is fast but not as advertise I get around read speed 70MB/s and write speed 30MB/s,Good one,Product is ok.", "img_link": "https://m.media-amazon.com/images/I/41ML8ZbPiiL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SanDisk-Ultra%C2%AE-microSDXCTM-Warranty-Smartphones/dp/B0BDRVFDKP/ref=sr_1_10?qid=1672902995&s=computers&sr=1-10"}
{"product_id": "B0B5LVS732", "product_name": "Noise Pulse Go Buzz Smart Watch Bluetooth Calling with 1.69\" Display, 550 NITS, 150+ Cloud Watch Face, SPo2, Heart Rate Tracking, 100 Sports Mode with Auto Detection, Longer Battery (Jet Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,999", "actual_price": "₹4,999", "discount_percentage": "60%", "rating": "4.1", "rating_count": "10,689", "about_product": "Sharp and bright display: The 1.69’’ TFT display with 240*280px and 550 nits brightness ensures visual treat every time you look at the watch.|Tru Sync: Experience fast and stable connectivity with low power consumption.|BT calling: Stay in touch with your friends - right from your wrist.|Utility features: Use the utility features at your disposal and become more productive - get hand wash reminders, idle alert and drink water reminder, weather forecast, set alarms and more.|Noise Health Suite: Lead a better life with the battery of wellness features available in Noise Health Suite.|150+ cloud-based & customised watch faces: Style your watch the way you like to – choose from 150 cloud-based & customised watch faces.|100 sports modes with auto sports detection: Stay active and track all that you are doing with auto sports detection mode.", "user_id": "AFGHRQK34D54OXQCRGX5K3XTR66Q,AHNRGHNIKN4JHV2RVCWX76B7ID6A,AGIBUP4ENAQTEYCKPWASWCUJ7YXA,AG5G6IU6RDTR24OHO3LSE24JCVEQ,AHWCNVY76F7IBUHM7EBJBMQV7KBQ,AHGYR3ZSYI6EPPK3N6SJPQIP53FA,AHT76IZRPXLMCNSF377LTR6CNIPQ,AGFHRUWQ7C3KCBL6IKJ4BC3JSZKQ", "user_name": "Sumit Nath,Aneesh Mohan,Yogesh Badekar,Manisha,Nishtha Goel,Sanjay,RAJINDER SINGH,Priyanka Chowdhury", "review_id": "R10I6UIAQIP9TN,R2XEWWLV1LH7KX,R3J0MEY15WI71Z,R3HJ0GBBBUGEJZ,R3TGTIJ54KHOL0,R21TUQZLYNGC0M,R1JSFOA0TD4S1A,R1KOD8YMT3FJ7I", "review_title": "Sumit Nath,For the price, it is a good purchase but can be better,Happy with product...,It's really smart with elegant design,Amazing,Noise,All good,Good", "review_content": "Touch screen functions well .step counting is not that much accurate, heart beat sensor is quite accurate but i think spo2 and stress measurement are not that much accurate,The watch is great for the price. Most things work great. Has great battery life. As a dailywear, there's not much to worry about. It detects activity but that happens only after a considerable amount of time (20 minutes). One cannot change the activity detection sensitivity or time.The watch is not very intuitive to use. It's usually great and most features can be accessed easily but certain things take more clicks and taps than should be required in a compact device. So all the features are there, but it takes a bit of time to find them.Sleep tracking is decent.Phone calls have good quality. People can hear your voice even if there is reasonable disturbance. If you answered through your phone and now want to switch to your watch, you cannot do that. And you can only save at most 10 contacts. You cannot dial numbers. But the mic and speaker of the watch is goodAlso, a confusing thing is, why does the watch not have audio alarms, when it is capable of producing sound?,What i need in watch is not available so don't need this...can get it in normal watch from other brands,Look and feel is awesome. This is great product suggestions from Amazon. Thanks,I like the step count and heart rate accuracy. Not sure about stress count sometimes it shows inaccurate.,Bluetooth connectivity needs to be improve and touch also,All ok, but anti scratch glass required in this watch,Good watch go for it", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41Peg4pz7fL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Noise-Bluetooth-Calling-Tracking-Detection/dp/B0B5LVS732/ref=sr_1_11?qid=1672902995&s=computers&sr=1-11"}
{"product_id": "B08TV2P1N8", "product_name": "boAt Rockerz 255 Pro+ in-Ear Bluetooth Neckband with Upto 40 Hours Playback, ASAP  Charge, IPX7, Dual Pairing, BT v5.0, with Mic (Active Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹1,399", "actual_price": "₹3,990", "discount_percentage": "65%", "rating": "4.1", "rating_count": "1,41,841", "about_product": "Playback- Leave all charging worries at bay as the Rockerz 255 Pro+ comes with a humongous battery back up of upto 40 hours(@50% volume|ASAP Charge- With a few minutes of ASAP Charge you can get upto 10 hours of audio time by charging them for only 10 mins. Charging Tme : 1.5 H|Drivers- The unbeatable boAt signature sound shines through no matter what are you playing courtesy its 10mm drivers.|IP Rating- Rockerz 255 Pro+ are perfect for the outdoors and daily workout as they are IPX7 rated.|Controls- Its multi-function Integrated controls lends an intuitive listening experience with volume increase and Decrease and Stop and Play buttons|Dual Pairing- This neckband features dual pairing so that you can connect 2 devices at once. Live a wireless life with advanced BT 5.0 technology.|Magnetic Earbuds- Live tangle- free life with its magnetic earbuds. Note: They do not support play/pause function", "user_id": "AHDTCW665XEPKY4WAUG3DREFCCYQ,AGPE4RKV5YRZPGLXQ46D7DMCFDLA,AHDKSXMFH5GRBJ6QJAPSEKXC6AYQ,AF7PR2PDWUSBNAQWPFIBW4J5OHBA,AGAWIQ7HOF4I2AFI7CD5ENI7BCDQ,AFF5TLCH4IYWCZK3FG64LZ4FHRHA,AFR53YXK7LLTSYXP3UALTFVDQCAA,AHO4LIQVYAUKT6MMF4Y7MN5Z57YQ", "user_name": "Punyabrata Mondal,ruma pal,Alam,Shaikh Raziya Irfan,Panmei,sharad Pathak,A.BASHEER,Amazon Customer", "review_id": "R1O3A2CX9YG69H,R1OPAHCYQF1OK4,R1N6RV1W0LKGWB,R1MXGMA3JKL1YI,RAHUCIL8N8IK5,RCYPHGHZYUAAE,R37WU40YNTLIYU,R2JHL897G4Y4LF", "review_title": "The rebel with a defect,Nice product,Really good product,Awesome charging backup 👍,Value for price,Value for money,Bluetooth service centre not available,good quality", "review_content": "Writing this review after 10 months of usage. First about the product itself.  It's sound quality is very good. Bass lovers will just love it. Average mids and high.  It lasts about 25-28 hrs with a full charge. Also tested on heavy rain while driving ( don't worry , earphones were not plugged in.. 😂). It was on my neck. But there was no water ingress.Now the major problem kicks in . After 10 months left speaker was not working. So , I registered a complaint on boat website. They picked my earphone for replacement.  But later it was replaced with \" rockerz 255 pro \" instead of \" rockerz 255 pro + \" . Why ? Even after a lot of conversations with boat support they didn't provide me my model . Now I've to stick with these low quality ear peace. Hence ,Try to avoid boat online support for warranty claim and better visit physical service entre. Good luck.Edit : After having conversation with higher authorities on Twitter, they replaced the same with my model .Edit 2 : from first day onwards after receiving the replacement product I was in doubt that the sound quality was decreased a lot. So, again I replaced with the authorized service centre for flat ( no/ very low bass)  sound.  But the 2nd replacement is also same. I thought I've some issues with my ear lol 😆 . But today when I listened to my friends rockerz 255 pro + (same as mine but the retail unit) I was surprised and thankful too . My ear was not damaged . It had the same punchy bass and that signature sound which was absent from my replacement unit.So, I can conclude by saying the replacement product will not have that signature sound as the retail unit.If anybody has experienced the same please comment.Thanks,I would recommend it very strongly if you want a budget friendly gaming earphone sometimes may feel a lag after purchasing but after some time it works very fine but it also has some cons like the build quality my earbuds gone worn off by normal daily use as well as there rubber quality is not that much good also mic it is not that good but it is okay so it is the best earphone under your budget....If aman gupta is watching this review you may gift me a earphone 😉😅,thanks to amazon for such good deliverance of the products,, i have been using amazon for long time and amazon have truely win the trust of the customer. Great product and once agian,, thanks to amazon,Charging back up is awesome25th December morning ko recive hua thn 30 December k night m charging finish huibut mene first time charge kiya to 2hrs se b zyada time m 100℅ charge hua,The product fits snugly in the ears. There is some pain after prolonged use for the first 2 weeks or so of using.Battery lasts over a day after full charge for an average user.Volume is strong, and so is the bass. Sound clarity is average.Product is sturdy enough to use comfortably without worry of damage.,Very good for sound, noise cancellation & battery backup. only fins have pain in ears sometimes, otherwise its really value for money.,Dear sir,I purchased this bluetooth on April 24th 2022.But from August 2022 onwards not working,also continuously iam trying to ask many shops for service at my place - Tiruchirapaalli,but no body doing blue tooth service.Also boat rockers blue tooth having very less number of days warranty only.Now what can I do? Please suggest.If possible, please collect my bluetooth from your delivery person and do the best.,compared to my previous neckband which was realme buds wireless neo. this is very good quality sound and form factor and finish also is nice", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31HCup1pqFL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/boAt-Rockerz-255-Pro-Earphones/dp/B08TV2P1N8/ref=sr_1_12?qid=1672902995&s=computers&sr=1-12"}
{"product_id": "B07XCM6T4N", "product_name": "STRIFF Adjustable Laptop Tabletop Stand Patented Riser Ventilated Portable Foldable Compatible with MacBook Notebook Tablet Tray Desk Table Book with Free Phone Stand (Black)", "category": "Computers&Accessories|Accessories&Peripherals|LaptopAccessories|NotebookComputerStands", "discounted_price": "₹349", "actual_price": "₹1,499", "discount_percentage": "77%", "rating": "4.3", "rating_count": "24,791", "about_product": "FOLDABLE, PORTABLE, LIGHTWEIGHT: The Carnation Laptop Stand has a thin, hard plastic frame. It can be easily folded and carried around. Durable enough to withstand the weight of up to 55 lbs (25kg).|OPTIMIZED FOR AIR VENTILATION: To prevent your computer from overheating, the laptop stand has large cut-out vents and adjustable height options that allow air to circulate from all sides. Well vented.|ADJUSTABLE HEIGHT 7 OPTIONS: Raise your laptop or tablet to any of seven adjustable heights from 2.7” to 6.7” so you can get a clearer, glare-free view while getting neck pain relief and preventing eye strain.|PHONE STAND, and PURE ERGONOMICS: Easily share the screen with those next to you. No constant reaching for your phone anymore. This means fewer distractions, better concentration. The new meaning of Ergonomic.", "user_id": "AHE52HKDGFCWSQO7STU7NRWWHTWQ,AHCBTTZL4LES5ZR54PCU6LSVKYPQ,AFZRZORHYQ6TSM25CRDS6UDSLUDA,AGWC4Q23F4DQ6TOMY2OBPZUB3W3A,AGGXWYRLPMULBPR7OXPEV6SNOMIQ,AGSMAA22LXXQD6VGCO3X5MMAT4RA,AFCTDH6RSQB5Q2F5E3ZXQL5I2RMA,AG4QFJXKZLMRSSLHOSL4XYGM6G6Q", "user_name": "G D PUKALE,KM,Sudip Kundu,venkatesh,Shaik John Saida,Ramgopal sharma,Abhishek chaudhary,Rohit", "review_id": "R1JKJ6JRX7SGEL,R25BSG945DF5FO,R4BFNUNWNX1R0,R2NPEFE8O89X67,R194PSSW507V7K,R1DT0RIGH4S3FB,R38ZWKA3FZLLH,R14TFXF7AOFJ1P", "review_title": "Product is very good , but delivery was not quite good,Overall good.,Average to good,Stability should have been better.,Price could be less,Best product in this price.,Mast,Value for money", "review_content": "The Product is useful and i use it daily. I gave a 1 star less because product had a small piece broken while delivery maybe. But that was not a functional part though.,The material can be bit more thick for durability. Overall a good buy.,The only issue is stability.... It do shakes,Stability should have been better.,Product is very fine in all aspects except in cost. Cost could have been less,Very good product in this price.,Nice product,Good", "img_link": "https://m.media-amazon.com/images/I/51aYKwgu-GL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/STRIFF-Adjustable-Patented-Ventilated-Compatible/dp/B07XCM6T4N/ref=sr_1_13?qid=1672902995&s=computers&sr=1-13"}
{"product_id": "B07T5DKR5D", "product_name": "ZEBRONICS Zeb-Bro in Ear Wired Earphones with Mic, 3.5mm Audio Jack, 10mm Drivers, Phone/Tablet Compatible(Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹149", "actual_price": "₹399", "discount_percentage": "63%", "rating": "3.5", "rating_count": "21,764", "about_product": "The earphone comes with a snug fit providing utmost comfort while wearing them regularly. Connect the 3.5mm jack to the phone and wait for a few seconds for the product to get sync with the phone. Water Resistant : Yes|The snug-fit also ensures a passive noise cancellation so that you can bask in the pure audio experience.|Impedance 16 Ω|Frequency response 20Hz-20kHz|Cable length 1.2m|Country of Origin: China", "user_id": "AGG35S7QJCAA7Y4FOAUY6IXKP75Q,AEFI7KCPVSZ2JTMHAZ7AXVWCZR7Q,AFCDH6KOUMXDXYT5J6RI66H6H4RQ,AF46JR3IL4FMLAHLNGPOCTPWWO4A,AFWFXXYDJSIBNGG573MZOZ5RW4UA,AEZTQHAUCPBSKVZ3RAZ7E52E4JWQ,AGB6S2IB6ENELR6KLDKCNQUGY6TA,AFE2763GMEXU4LL3TH6HPCL6FWYA", "user_name": "LAKSHMI NARAYANA HANUMANTHU,Shahrukh shaikh,satka,santosh ladkekar,Gvs G.,K.Sudhaakar Reddy,manikandan,Amazon Customer", "review_id": "R27GRSZF2YL5ZO,R1KXPKQ4SPO0PI,R1O4LXS46WUDK6,R1LDIIH0E88Q70,RGAH8BAUKGJ2N,R3MCAC061E19PA,R3B880ZLBUIBVP,R13XVC901RKGZP", "review_title": "Build quality material is not good. I feel it might last for a longer run.,Very good earphones at this price,not grate,More than average 👍,Ok,Best ear phones,Is ok,good wired earphone", "review_content": "When you are representing some product from a well known brand you must provide that well known build quality.This product is designed well to grab the good looks but not the quality of the material, it seems to be bad quality will not last in the longer run.Reason: I had just started using it to hear 3 or 4 songs with in that time 3MM Jack end rubber seems to be started braking.I feel that I can better quality on the platform vendors for this price.,Using this earphones almost for 6 months average sound quality performance is good bass quality average overall product is good 👍 and value for money 💰 if your looking for long term use go for it,just 150 buck i got it look wise fine. during a unboxing time i notice it broken and i try easily to fit it so i dont want to replace/ return it because only 150rs and easily fix.,Good product, Sound comes smoothly in 50- 70 volume level.,Ok,Super,Is better is not button,its very good at this price; ... I need one more, will plan to buy again, during offer @129/;", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31DYx7AhW6L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zebronics-Zeb-Bro-Wired-Earphone/dp/B07T5DKR5D/ref=sr_1_14?qid=1672902995&s=computers&sr=1-14"}
{"product_id": "B01DEWVZ2C", "product_name": "JBL C100SI Wired In Ear Headphones with Mic, JBL Pure Bass Sound, One Button Multi-function Remote, Angled Buds for Comfort fit (Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹599", "actual_price": "₹999", "discount_percentage": "40%", "rating": "4.1", "rating_count": "1,92,587", "about_product": "JBL Signature Sound|Lightweight and Comfortable : The 3 sizes of ear tips (S,M,L) that are included allow you to choose a size that gives you the most comfortable listening experience even for longer listening periods|JBL Signature Sound. Frequency range:20-20kHz,Driver sensitivity:100±3dBSPL, 1mW,Maximum SPL:5mW|Extra Deep Bass. Troubleshooting steps : Kindly ensure 3.5mm port on Host device is clean and dust free and 3.5mm jack of the earphone is adequately inserted inside the input device port|Noise Cancelling Microphone|One-Button Universal Remote with Mic|Quick Launch Access to Google Assistant / Siri", "user_id": "AFE54I72EV2YOL6POJCHHP3Q5NWA,AFKLES3QOCRLIMJWHPEJVGK4RX3Q,AFLBOY3G7HT3TAYCHSRFBXF7M2MQ,AF2NZ4L5OXBCMZZ742VSQGWU2F3A,AF6562TF5CHMMJIIAO2TQPNYVMBQ,AGO6LBIRJDSVR7FW4BD5JS4OGLZA,AHSO2XARBV6CWGPNXNBK3CJU7FBQ,AFNLIVIY3LPQ6FEX2UHW4WGNOUAA", "user_name": "Sunny J.,Praveen Pavitrhran,nitesh,Yadav,vansh gurjar,Krishna,Pantiphun Gonmei,Santosh Panhale", "review_id": "R2NB2K5XC70FKP,R3623Q21H3MKP6,R1XVC6NEYU3ZHV,RNFY9ZYM6195O,R3TUSIFSD4QCKJ,R22PD5EXXTFXP,R1LXC8W3AJAQ3I,R3U0OEWBKIO5Z3", "review_title": "Good maybe okay,Defective Product Delivered,Amazing Sound at Budget,Not for bass lover,Best one,Quality,Durability,Superb voice quality", "review_content": "The quality is not upto mark for the price paid. Other brands offer good quality earphones with lesser price. But per my experience none of my earphones have lasted more than 1-1.5 years.Given that this is JBL, lets see how long it lasts.Can someone build a earphone which lasts couple of years? I'll buy :),I had purchased two units of same headset of which one was found to be defective. Since I was on travel I couldn't check the items immediately and by time I found item to be defective the return/ replacement window has elapsed.,Build Quality is average considering JBL a global brand providing u an amazing sounding earphone under 700. Highly recommended if u r a music lover.,Sound quality is awesome but not bassMic is below averageIt come out from ears if you walk fastNot for game you can't hear footsteps of enemyReview after use of 4,5 earphones (c100si) 2 year experience,Awesome product....but resolve its tangling issue please otherwise nice product,Nice,After 8 months, left side speaker has no bass and not as loud as the right speaker.,Superb voice quality", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31NnmYempPL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/JBL-C100SI-Ear-Headphones-Black/dp/B01DEWVZ2C/ref=sr_1_15?qid=1672902995&s=computers&sr=1-15"}
{"product_id": "B07PR1CL3S", "product_name": "boAt Rockerz 450 Bluetooth On Ear Headphones with Mic, Upto 15 Hours Playback, 40MM Drivers, Padded Ear Cushions, Integrated Controls and Dual Modes(Luscious Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|On-Ear", "discounted_price": "₹1,220", "actual_price": "₹3,990", "discount_percentage": "69%", "rating": "4.1", "rating_count": "1,07,151", "about_product": "Playback- It provides a massive battery backup of upto 15 hours for a superior playback time. Charging Time : 3 Hours|Drivers- Its 40mm dynamic drivers help pump out immersive HD audio all day long.|Earcushions- It has been ergonomically designed and structured as an on-ear headphone to provide the best user experience with its comfortable padded earcushions and lightweight design|Controls- You can control your music without hiccups using the easy access controls, communicate seamlessly using the built-in mic, access voice assistant and always stay in the zone|Dual Modes- One can connect to boAt Rockerz 450 via not one but two modes, Bluetooth as well as AUX|1 year warranty from the date of purchase", "user_id": "AFU4JDUZDD6N5MUGLULCRLUQLHDQ,AGI4QJTBBCTTOJUOUV5X6ROZH4OQ,AGUKIFBPQ5LFT3NFKXAMUVEYNSQQ,AGVBFFFQVNSBYFKF5OKWVY4EPALA,AH4Q3Q5642PKPJSMYRWPYFL3TXEA,AGYUHTEK4JFB4XX5QUITAD2DWWXA,AFPBJHSPYTYE2YXNTCZYAXLQXKZQ,AEDMMOCM4OA7BFGRBDZP2RIROZFA", "user_name": "Deepanshu saini,Sunil S.,Aman,Aakash,Sushil Kumar,anil lokal,Furqana Angolkar,Shivam Bharti", "review_id": "RIRMEEQUWCCJK,R1E187080D8HAU,R1RPZJJNQM76M1,R1NM9CFXWMQWWF,R2E3PSSWPOJU6N,RTA5F8RZUBJ2D,R1SZB32SSCJBY5,R199WTHV00BUR4", "review_title": "Authentic review,Overall it's a good headset.,Not for me,Nice product,Best,Amazing product,It's a wonderful boat product,Good Product of boAt", "review_content": "Best budget headphones. I'm procured this headphones in 2021and now is 2023 when I'm writing. It has some prominent problems first is head adjustments get losse after 1 year and after one and half year cushions get also strat rip off thereof  third initally battery was awesome i remember that I used to use my headphone 2 week in singal charge even whereas It always left connected over the night and start useing after wake up. It's my  tendency, I don't endow rest to devices notwithstanding this it's is still alive and working as before but now it works 1 week in singal charge.,,It's a good product but now days many brands offer better than this at tha price range.,It's a nice product. Mic quality is also good. Battery back up is good.,Best part of the headphone is the battery backup..its huge.i love this product,but if it built to be a overhead,Thank you boult,https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/61D4cZxo9aL._SY88.jpg,Good Product of boAt", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/315vj6oj-FL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Rockerz-450-Wireless-Bluetooth-Headphone/dp/B07PR1CL3S/ref=sr_1_16?qid=1672902995&s=computers&sr=1-16"}