{"product_id": "B08JV91JTK", "product_name": "JM SELLER 180 W 2021 Edition Electric Beater High Speed Hand Mixer Egg Beater for Cake Making and Whipping Cream with 7 Speed Control (White) with Free Spatula and Oil Brush", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|HandMixers", "discounted_price": "₹474", "actual_price": "₹1,299", "discount_percentage": "64%", "rating": "4.1", "rating_count": "550", "about_product": "2 Stainless Steel Hooks For Mixing and Kneading. Beater for Mixing, Blending and Whisking Needs, Kneader for All Kneading Requirements|Air Vents to Avoid Clogging From Batters and Other Mixtures, 1 Meter Long 2 Pin Power Cord for Flexible Usage|180W, Over Load Protector for Motor Safety|Premium Stainless Steel Finish 7 Speed and Turbo Setting For Multiple Applications", "user_id": "AFGPSJTYN4E3AQJH23WKOKD2FZCA,AG62ALOQG5SNE6G6BINPN3PFATFA,AFM6X3COP5XS2MHBZ4FG7WI4J6FA,AFFFREUP3WNQF4G2XFGWEFUHIAFA,AHVX4ICC7N4CYLFRKYLA2EMIRS4Q,AHOBXQOMXSK25FW2L4UU47YQZKWA,AE2HYLZSTHIFFYG2VTQEUMEZJNWQ,AFEWFFV3VAMZVILMHJAN4GQRR4XA", "user_name": "S.Anbarasan,Nazimali,vijay shankar,Amazon Customer,Bhanuprakash,Anshika Pandey,GauravK,Passionate Buyer", "review_id": "R3OF7DKU80WNEX,R2D3JX3CMCDYQ7,R2NDSGQUOW1UFI,R39U97UD4PTKP0,R1R7Q9BYUN7EJM,R7PB9YYX02O1S,R407TEVC3CYBY,R1TQ2SCBEDK1NZ", "review_title": "Tools,Good product,Small yet powerful,Pretty good for the price,Good quality,More than price worthy,MUST BUY IT,Great product!", "review_content": "Ok,Badhiya h..,The attachments could have been a bit longer,This beater is less than half the price of regular branded ones but seems to do the job well.Not sure about heavy duty use but extremely handy for whisking eggs, ice cream, meringue, or light cake batters.This is the exact same beater that seems to be available under many names on this site with prices ranging between 430 to 599 (as of Dec 2022) so if buying pick the cheapest available price like I did.It doesn't come with any warranty, but I took a chance and seems to have paid off.,Ko,Have been using it for months and still it works smoothly. It's very easy to use and clean and is effective. Go for it,It’s one of the most Convenient product and multiple use. It’s durable and easy to use. I really like this product. 10/10.Must buy it.,Great product! Value for money. Go for it!", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41V4DpKc7sL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/JM-SELLER-Electric-Beater-180-Watt/dp/B08JV91JTK/ref=sr_1_215?qid=1672923601&s=kitchen&sr=1-215"}
{"product_id": "B0BQ3K23Y1", "product_name": "Oratech Coffee Frother electric, milk frother electric, coffee beater, cappuccino maker, Coffee Foamer, Mocktail Mixer, Coffee Foam Maker, coffee whisker electric, Froth Maker, coffee stirrers electric, coffee frothers, Coffee Blender, (6 Month Warranty) (Multicolour)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|HandBlenders", "discounted_price": "₹279", "actual_price": "₹499", "discount_percentage": "44%", "rating": "4.8", "rating_count": "28", "about_product": "-Make delicious milk foam creamer for your drinks at home without a trip to Starbucks, with your own coffee maker with milk frother. The benefits of having your own electric cold coffee maker are endless, you can make your own best coffee, you know yours tastes the best.|-Proven & Trusted Quality: We use only premium materials. Our milk frother for coffee will not rust or break, ever. Built to last.|-Easy to clean Coffee frother electric: The durable, convenient metal stand gives easy access for foaming milk in seconds. Cleanup for this portable coffee maker is even faster. To clean just put the coffee mixer blender in hot running water and briefly turn it on – instantly clean!|-Electric Coffee Frother Works better than a manual coffee hand blender for making matcha/tea and works far better than fork or Frother for coffee. It works very well to mix nutritious protein powder drinks with no extra container, blender or bottle shaker to wash. Use our mocktail mixer for your whisking and mixing needs.|-Design: our coffee beater comes with an elegant design to fit into any modern kitchen.|It requires two AA Double Batteries to start. Batteries are not INCLUDED.", "user_id": "AGRJZJKWKIE573KM5FWPOH4F7YCA,AEHV4VOLDQX5XYA42OZHALYA3USA,AHOZBF2VFWS62WO3XJT73NHAPQMA,AECYWFZ53SIMOPOKAILDW3VNGRRA,AHGAALVLOMKMYOG4JAJALWFSHLCA,AG6EGJADJ2KCEGGKRPKY2B4MAJMA,AGVVZWV4QHKHNWI7FT3ENKKKBCHA,AHIRZ7N53BSLWFWNEUWYKT6NH6OQ", "user_name": "Amazon Customer,Neha Mehta,Nischal Agarwal,tharangini reddy,Mohammad Salim,Ak,suyesh v.,Kiran ahuja", "review_id": "R3907SDNN9VR5Y,R1NNMXA39722T8,RXQNT49DKJ26S,R22MNVNS4IIKG3,R2CQDP0G85P8C0,RMJZ65KLW040B,R2M6EZZQ3RC4AX,RLWCOK6XMDAGC", "review_title": "Oratech Best Coffee Frother,Great,My review about Oratech Coffee Frother for milk,Good product,Easy to use 👍,Good product,best product,Easy to use", "review_content": "Overall, I love this Oratech Coffee frother and have used it soooo many times since purchasing it. I mostly use it to make whipped coffee but I've also used it for mixing protein powder in milk and frothing milk / creamer for coffee.It is incredible effective for exclusively liquid substances like milk and creamer; I realized this after over-frothing my creamer one morning to the point of pure foam lol. After that I kept it in mind and I know to only do it for a short amount of time. Super easy to use, versatile in what it can be used for (as far as liquids go), and tbh it just looks really cute on the coffee-making section of my counter. The stand is a hugeeee plus, I definitely wouldn't purchase an alternative option without one.It gets the job done for whipped coffee.I also use this product to blend my matcha powder and my turmeric-cinnamon-ginger-coconut milk powder lattes. This frother takes out all the lumps and bumps. Because the resulting blend is smooth, it does not waste the ingredients like stirring with a spoon. So, so great! It has made my favorites even more practical and delicious. I have not found anything about this product that I do not like. I would recommend this product to others and have already done so. Get it! You will be pleased. It is the best Coffee Beater.,I really liked this coffee frother. With its help I am making Cappuccino Latte at home easily. Easy to clean also.,This oratech coffee frother makes coffee game easier and fun.After using it for a week. I’m sharing its pros and consPros:1. Frothing milk for coffee is easier and fun with Oratech Coffee Beater.2. Material quality is good.3. It is portable so you can use it anywhere.4. It is small so you can keep it anywhere.Cons:1. Frothing heavy liquid is tough.My overall feeling about this product is it you are coffee lover and you want to make foamy coffee. It is best for you.,Best quality product. Easy to use and easy to clean. Best coffee frother and easy to coffee making. I loved this product.,This product is easy to use, durable and helps in blending quickly.,Such a good product and enjoying to make coffee and handy too.👍😊😊,Best milk frother for coffeeIt is easy to use.,Every coffee lover must try this electric coffee frother", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41t3WVUlRmL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Oratech-electric-cappuccino-Mocktail-Multicolour/dp/B0BQ3K23Y1/ref=sr_1_216?qid=1672923601&s=kitchen&sr=1-216"}
{"product_id": "B09MT94QLL", "product_name": "Havells Glaze 74W Pearl Ivory Gold Ceiling Fan, Sweep: 1200 Mm", "category": "Home&Kitchen|Heating,Cooling&AirQuality|Fans|CeilingFans", "discounted_price": "₹1,999", "actual_price": "₹4,775", "discount_percentage": "58%", "rating": "4.2", "rating_count": "1,353", "about_product": "Hplv Motor For Superior Air Delivery Even At A Low Voltage Of 180V|Colour: Pearl Ivory Gold|Voltage: 220-240 V|Speed: 390 Rpm", "user_id": "AHF4QZVKU6HOKT3PM4JVK5LGQAWQ,AHM535GPAPUDBMUOQBNMCK4ZSUVA,AFC2EEGVUB34NVHUXNS7YZDA7JDA,AE67YDKU344VENVLFVSPVZAG7AUQ,AHJ4FPXTAZFVCFSS6452K77MSNGQ,AHLPEYRZGYC6EPS5DFTS4GKZGTQA,AFFTNLRTAYIQKHV7UYHDHCA5X54A,AECO4Q5ZTTJ4UWRTXXESCF2BZD3Q", "user_name": "I am patel,ARAVIND RAJA R,deep,PATIL,sarfraz newaz,Md Shadab Eqbal,Akshay vijayvergiya,MR DEBABRATA GHOSH", "review_id": "R1DIZ1VVBM3XF3,R3RUTUF4VKRG87,R3BKZ1CNXYB14D,R3375SVOFCYTFF,R1EYL0456QZ6TD,R7Q0TY2ZGMMIN,R2TFE2JWK585DQ,ROSY5BMO160S8", "review_title": "Nice product in this range,After 3 month of using ,,observed decorative ,less noise upto medium speed ,overall OK .,Best product,need to improve on noise,Good fan,Good,Noisy,Value for money spent", "review_content": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/7147iYDvBTL._SY88.jpg,decorative ,less noise upto medium speed ,overall OK .,Nice and silent fan 👌,while running on low speed, heavy noise is coming, havells need to improve..,Good fan,Does the work,,Air delivery satisfactory but chrome color not matched.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/21SHZOWOynL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Havells-Glaze-Pearl-Ivory-Ceiling/dp/B09MT94QLL/ref=sr_1_217?qid=1672923601&s=kitchen&sr=1-217"}
{"product_id": "B07NKNBTT3", "product_name": "Pick Ur Needs® Lint Remover for Clothes High Range Rechargeable Lint Shaver for All Types of Clothes, Fabrics, Blanket with 1 Extra Blade Multicolor (Rechargeable)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|LintShavers", "discounted_price": "₹799", "actual_price": "₹1,230", "discount_percentage": "35%", "rating": "4.1", "rating_count": "2,138", "about_product": "ELEGANT & ERGONOMIC DESIGN Ergonomic design, the pilling remover for clothes has an easy-grip handle which offer users a comfortable experience. Fabric shaver fuzz remover, small and portable, a perfect garment care tool.|Good Housekeeping for Most Fabrics This Fabric shaver can easily remove Lint Balls, Pills and Fuzz. It's suitable with your sweaters, jerseys, blankets, bed sheets, upholstery, couch, curtains, drapery, duvets and more; Keep everything looking fresh.|Durable Blades & Larger Dust Container High-strength stainless steel blade provides a long working time for years, and the 1 extra blades can be easily used to replace the unsharp one. In addition, A large-capacity removable dust container is enough for a massive laundry clean and it is also easy to be emptied.|USB Charging Cord & Battery Available This Sweater Defuzzer not only works by plugging it in, but also by using batteries. External power ensures you can update clothing and furniture at home faster and continuously.|Easy to Use Small and portable handheld device. Removable collector bin for quick lint pick-up and disposal.", "user_id": "AGP7FT53TVZYTLYSU63C77AMNKRA,AFYO7NAUE7PLQZUFAXIANYIKNX6A,AHJ6VHL36QKYZYOZPWP5QD3H4DQQ,AHJI2MF55Q5TE6JR2TUNNJXTACHQ,AFJ5FUWKGY7XDPJOCMQ7EZQYHEFA,AFCWD3PO4G6GJVEEMXGD4B3XDC3Q,AGEUYI7ZTBU6QTOBHLOUNLD2XTSQ,AEXBFL4AVC5RWOOWW4X5J3RV5MQQ", "user_name": "Lipsy Mohapatra,Ajeet,Amazon Customer,Priya Sharma,Sarmistha Choudhury,Priyanka Gupta,Vandana Bhaskar,AMG", "review_id": "R1S5MM420VK5O,R256KIA5SVIYEY,R1G3NQY6VPZ0W2,R27PE0BR7AFI5K,R30IFO0Q1K73E9,R2AVU3XTD27ZHS,R2VKAANDZUB2TJ,R6GQW6RKQ9MK5", "review_title": "Worth the money,It’s goog,Nice & Easy to use product,Not good,Wonder Product!,Good product,Right product at right price,Value for money", "review_content": "It’s easy to use and is okay I guess, doesn’t clean the lint completely but enough to not be spotted from the viewers point of view,It’s good,Nice & Easy to use product,It’s very bad and within 2 -6 use it’s not working,If you have found this product, then please, do not go away without getting it. Its a wonderful product. You have to use it to know how great it is! If I could give 10 stars, I sure would have.,Everything is good except the lid which collects fibres from clothes does fit tightly.Overall good product. One time investment, better than roller lint removers.,Product is working as expected and handling is also easy. Good to have Product as some clothes develop lint and looks old very easy. After using this Product cloth is looking like new.,Had battery operated lint remover earlier but this is power plugged hence power is optimum at all times. Good fan size and great blade cutting.(extra blade also in the kit) Only used twice so durability cant be reviewed. Handling etc is fine. Totally worth it.", "img_link": "https://m.media-amazon.com/images/I/419vF7uEFEL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Ur-NeedsTM-Rocklight-Remover-Fabric/dp/B07NKNBTT3/ref=sr_1_218?qid=1672923601&s=kitchen&sr=1-218"}
{"product_id": "B09KPXTZXN", "product_name": "Rico Japanese Technology Rechargeable Wireless Electric Chopper with Replacement Warranty - Stainless Steel Blades, One Touch Operation, 10 Seconds Chopping, Mincing Vegetable, Meat - 250 ML, 30 Watts", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MiniFoodProcessors&Choppers", "discounted_price": "₹949", "actual_price": "₹1,999", "discount_percentage": "53%", "rating": "4", "rating_count": "1,679", "about_product": "1 YEAR WARRANTY & AFTER SALES SERVICE: Reliable Rico Warranty with the best after sales service in over 12,000 pin codes across India.|HIGH PERFORMANCE - this mini USB chopper comes with a powerful 30 Watt motor, very sharp 304 stainless steel blades ( 3 blades ), and will provide excellent performance. You can quickly process most of the ingredients in 10 to 30 seconds.|USB RECHARGEABLE - this mini Rico electric food chopper is rechargeable from any electric plug-point and has a long lasting 1300 MAH lithium ion battery. The food chopper electric can be fully charged in 3-4 hours. With one full charge you can use this device for up to 30 times.|EASY TO USE - this mini electric chopper is extremely easy to use. Just put the ingredients in the mini food processor, place the lid, and press the ON button for a few seconds to mince the food. That's it! No complicated procedures.|PORTABLE - this mini food chopper is compact, lightweight, and perfect for travel. You can carry this rechargeable chopper in your backpack or suitcase very easily.|EASY TO CLEAN - This mini rechargeable chopper's components are very easy to clean. The bowl and the blades are top-rack dishwasher safe. Moreover, it is straightforward to assemble and dismantle this mini chopper.", "user_id": "AHIJVXU2LMW6UBF6VPT4BGMBMYBA,AHFBBCPDGNSDA2ERIF6KEXOXR2GA,AF6CX2IKLSKGPKRPN6IPOSRFH3WQ,AH57KN6LIRGA4AESSXBDXN4IWTWQ,AEOON2BAPI6B52PB6LYJYVT2POFA,AHDV77DE22MRWM57ZJRUBXEH6TXQ,AGVD7QW2HRVYJ2J7LX4RXHRQKYWA,AFBWCVS4ZG4JQ7GII3KFL76SMBMA", "user_name": "sharad shedge,Srushti Mali,Srivv,Fernandes,Nishant yadav,Dhivya L.,SANDEEP JOGLEKAR,Amazon Customer", "review_id": "RAYWMRZPZ14X1,R3DDSZWJ24VK4Z,R3SLQOT4AZDXOJ,R1XNL0XA54KUAZ,R144WYY5PBRA6,R3QCRFDNP1RZM5,R36H099OCB985O,R32C98BJ9DRL79", "review_title": "Nice,👍,Very easy and useful, but too expensive compared to remaining company products,Grt,reviews,Good product.,Very Handy product,Warranty registration needs to be user friendly", "review_content": "Easy to use.,Worked so well..you can go for it💯,Easy to use and saves time in cooking. Good to buy good if cost is below 600.,Great product,Product is nice working properly and customer support services is very good specially behaviour of customer care executive is best,Value for money! good! long lasting.,Good for quick and small qty use,Warranty registration needs to be user friendly.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41JnGOKI2dL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Rico-Japanese-Technology-Rechargeable-Replacement/dp/B09KPXTZXN/ref=sr_1_220?qid=1672923601&s=kitchen&sr=1-220"}
{"product_id": "B078HG2ZPS", "product_name": "Butterfly Smart Wet Grinder, 2L (White) with Coconut Scrapper Attachment, Output - 150 W, Input 260 W", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Mills&Grinders|WetGrinders", "discounted_price": "₹3,657.66", "actual_price": "₹5,156", "discount_percentage": "29%", "rating": "3.9", "rating_count": "12,837", "about_product": "Wattage: 150 W; Voltage: 220-240V, 50-60Hz ; Revolution: 1300|No of Jars: 1; Jar Size: 2 Liters; Jar Material: Stainless Steel; Body Material: ABS body; Cord Material: 180 CM; Speed Control: 1 Speed Control|Read Manual Before Use|Powerful motor; Uniform grinding pressure and 4 way grinding system; Sturdy Single Phase High Torque Motor|Shock proof ABS body and detachable stainless steel drum; Unbreakable and transparent lids made of polycarbonate material|Note : Product doesn't come with Dough kneader /Atta kneader; Includes: Wet grinder, 2 Stones, Lid, Warranty card with User Manual", "user_id": "AHS7IMVVE56BINTOOQEC3ZDFCCRA,AEZD2VA4YOHTVUTQDMYQJPI4JGBA,AF6OFPEK4C4UGOSVFMGRQQOSZRJQ,AGSJ57EXX26AKQIQRG2I54BSZPPA,AF6ES4EHMPNTBDTKJ2RVAULV4QVQ,AE77S5GV4JXA37SULMC5CYORCK5Q,AGUT6T75HH2Z5NKTDDIO2KKBG3QQ,AFXQUHNNILJZMAN3G7SSUXP5DVLA", "user_name": "JAYAPRAKASH P,Avinash,V V R Rao,Abhijith Nair,Gopal krishna Reddy,RAJASEKAR,Kamalakannan,Matta leela krishna", "review_id": "R1TKOA0N93W0AF,RZSQX768Q8BRO,R38TTOMI01SZ0M,R2LTDUDDQF0HE0,R3DNOKYB0YB2DZ,R1FGO0SSUJD2TV,R35S3OO2N2ZEAK,R34JI2S82934EL", "review_title": "Good,Good product,Good,Good one from a renowned brand!!,Working fine..,Excellent to go for this Product,Product super,Nice product 👍", "review_content": "Rate required to reduce,Good product,Good,A good budget grinder from a renowned brand,Everything is fine with the product., doing it's best in this price range..,Looks Stunning and works good as expected,Okay good,But very bit slow but very nice", "img_link": "https://m.media-amazon.com/images/I/414JLnTlLnL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Butterfly-150-Watt-Grinder-Scrapper-Attachment/dp/B078HG2ZPS/ref=sr_1_221?qid=1672923601&s=kitchen&sr=1-221"}
{"product_id": "B07N2MGB3G", "product_name": "AGARO Marvel 9 Liters Oven Toaster Griller, Cake Baking OTG (Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|OvenToasterGrills", "discounted_price": "₹1,699", "actual_price": "₹1,999", "discount_percentage": "15%", "rating": "4.1", "rating_count": "8,873", "about_product": "Bake, Grill, Toast and more|1 Year Manufacturer's Warranty|Automatic Thermostat I Auto Shut Off I Ready Bell. Cavity Material: Stainless Steel|Heat resistant tempered glass window with Cool Touch Handle|Adjustable temperature from 100°C to 250°C", "user_id": "AH4WZKCWB4OVUG2LZUAFGWSVS4WQ,AGR2F7Q2IMX7SXVQ3FE6EKNYPPJA,AEJF5A6THJTEEMQ567QOL56EGM7Q,AF4U5DZT3ZHTXHRKEL57ZPBZFF2A,AFZ3VECWAVRV5NH6BCMVMAN3YO6A,AFTFOKKNZPW4QEUQGKTB65FF6ZAQ,AEK4UQMVF6PAOC7IYVVOF3SE7PYQ,AECOJHWYPDNQKUVPWJ5LW3W4WRXQ", "user_name": "Shubhajeet D.,Aswin Thomas,rakesh satyarthi,anu,Vara Prasad,Jain Suresh,SUBASH U L,manpreet", "review_id": "R1R0861UO92Z4S,R3TWKN96MA3YTC,RVNYJGF3TJ1HH,R3SO8N3OF4401O,R1349PEO0YF938,R2XTBG5BD9S04B,R242RHYD9YBYGQ,RT127W0ZQV4V6", "review_title": "Excellent OTG and even excellent price range👌👌👍👍👍,Good product,Very Good Product at its Price Range,Great to use and makes tasty food,Awesome,Packaging was good, received the product at the right time.,Value for money,Worth", "review_content": "Excellent Heat distribution, perfectly cooks, heats nd grills, great for cakes, pizzas, roasting..plus great price range👊🏼👊🏼👍👍👍,Very good products, simple controls and easy to use. At a time 3 to 4  six inch baking tin can be kept. Rotisserie work well with 1.5 to 2kg chicken easily. Since there is no crumb tray provided, wondershef 40l crumb perfectly fit. Which is available on Amazon. Packaging was not good no bubble wrap and only few pieces of thermoco, due to that some dents were there. Since we liked the product and don't want to wait again we kept it.,Agaro has provided a very Good Product at decent price range. Amazon has delivered the product in a very nice and safe package. Entire package did not had even a single mark. OTG is very easy to use and very useful for food lovers. I have however felt necessity of improvements on two things (1) It is very difficult to set exact time and temp in manual nob and (2) Power plug size is small and difficult to tight fit into 15 amp plug.,Don't go on its small size...it makes wonderful cakes and bread.,Though overall quality is Good.,Oven is great for making cakes and grilling too,Excellent product.. Value for money,A good product. Got more than what i expect", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41LKiR8QpwL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AGARO-Marvel-Litre-Toaster-Griller/dp/B07N2MGB3G/ref=sr_1_222?qid=1672923601&s=kitchen&sr=1-222"}
{"product_id": "B008LN8KDM", "product_name": "Philips GC1920/28 1440-Watt Non-Stick Soleplate Steam Iron", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|SteamIrons", "discounted_price": "₹1,849", "actual_price": "₹2,095", "discount_percentage": "12%", "rating": "4.3", "rating_count": "7,681", "about_product": "Turn the temperature dial to the appropriate position clockwise from minimum to maximum temperature to set the temperature according fabric type;To Prevent Water Leakage, keep the iron horizontal when not in use, do not fill water completely, leave some gap and wait for some time for the iron to heat up before using the iron|Warranty: 2 years on product, ;Knob should always be at no steam position when product is not in use. Second and third setting is used only when soleplate is hot. Otherwise leakage will happen.|A fine spray evenly moistens the fabric, Indicator Light: Yes;Please wait for some time for the iron to heat up. Only then you can use the steam function effectively. If the iron is not heated enough and steam function is used, it will lead to water leakage|Color Name: Pink; Material Type: Plastic; Size Name: Free Size", "user_id": "AHXO7SHNST675ORXUKNNHR2YKEKA,AEXCBFSVNHUJQOWGZSE7MC6RBHUQ,AFKM5QKOTWULFDXK6QVZZMMPOV5Q,AFB2W25SC4ZEMFT7JTVTW5L5RZCA,AEWGEZVFD5HWJUZME7IDIL6HCVVA,AGIX5B6SWYXE6XZKEJEK65LV7ZMQ,AF6HEKQ4VQN3LEYA35NQCEG6LAWQ,AHN3ZLP7PTR6WSQFI57Y5MXAOCWQ", "user_name": "Aditya Tapkir,Veee,rajesh,Rayhan Sk,akash sahu,Santhosh,Pratik,Neeraj", "review_id": "R1F0HJV54WA6Y1,R31EQO2072ECK1,R13WG12278YLU8,R3NE8OQ3WPJOT9,R3VLPV94UNTN7D,RB55IVR4IJ658,R25GNVDCF8MRK4,RITW7QXM8HJHT", "review_title": "Does the stated purpose,Good,Good,Steam Iron,Light weight and easy to use iron,Functional & hard to Use,Overall a good product,Using it for a month. So far it is working well.", "review_content": "Does the work,Good,Superb,All good.,Philips a trust worthy product. Very easy to use and light weight iron,Great product. Has many features. But using them is tricky. I tried to use the Steam and Spray for a few weeks and gave up. I wish the Product Owner had focused a little more on Easy of Use. There is no point in having great functionality, if end-user can't easily use it.,Overall it's good but after a month inside wire was disconnected it's stopped working it took me another 2 days to get it fixed by near by electrician.,Using it for a month. So far it is working well. Heats up quickly, like the quality of product and steam functions.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41sKyiPWzAL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Philips-GC1920-28-1440-Watt-Non-Stick/dp/B008LN8KDM/ref=sr_1_220?qid=1672923603&s=kitchen&sr=1-220"}
{"product_id": "B08MZNT7GP", "product_name": "Havells OFR 13 Wave Fin with PTC Fan Heater 2900 Watts (Black)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|FanHeaters", "discounted_price": "₹12,499", "actual_price": "₹19,825", "discount_percentage": "37%", "rating": "4.1", "rating_count": "322", "about_product": "HD32 grade oil for long lasting and better eating efficiency|3 Heat setting 1/15/25 Watt with additional 4 Watt (Heater+Fan)|Large surface wave fin for Faster Heating and Tilt over Switch for Extra Safety|Castor Wheels for easy mobility and Rear Safety cover|Quick heating with PTC fan and Over heat protection", "user_id": "AFQS7QOVM7KTUWEZSVZH4XTGNAYA,AHTXYVPQPUDA5MCBWOX3AVXH4QKQ,AHLCFOXSW7PKG6NWJAYZXJJBHCPQ,AFNCJZB5L3NOV4XSU3YAKVBNOESA,AGR543LEUIM5C7Q3GENHOCAPGEEA,AFISEMWSVQU4VQ6RZNXCUSE4UHBQ,AE7LEUVO5O6WMKYYJRLP4MUZDZ6A,AHOFRKUB2WPDHQ36EDTFQWON7WFA", "user_name": "Ajay,Amazon Customer,Shubham Gupta,praveen chander chopra,Anupam,Atul,Anuj,Amazon Customer", "review_id": "R27CJ1292FG4JG,R1M9SWXRIZJVWU,RVITAAYFIMZKT,RNQDSVULD4JIE,R2D1S7Q52J4VXW,R25IJXPUWT8LFK,R3RITYKX4MWYCK,RP43KMMRPV2Q3", "review_title": "Good heater but digital temperature display is missed,Use intelligently for maximum outcome,Good product,13 fin oil heater has only 11 fins, wrongly advertised to fool public,Excellent product,Wonderful Product thandi me Garmi ka Ehsaas,Very nice,Nice product", "review_content": "The product is delivered in 1st week of Feb, 2021 which is almost the end of winter.It is used by my parents.Ease of use: better as compared to many othersIt has got three level of heating that can be selected by simply rotating the knob of a switch.(Some other brands have two separate on/off switch for two heating elements to obtain different levels of heating. That operation is a little difficult to explain to an elderly person over phone)Improvement required: Temperature setting mechanism- digital display is badly missed!Currently, there is no mechanism to know the temperature which is being set by rotating the temperature setting knob. You simply have to guess initially and then wait and do trial and error as the temperature starts increasing slowly. It's a slow process and you can't get the right temperature in one go!Digital display of temperature setting may be added.This is a general problem- I didn't find digital display in any brand. This can easily become a differentiating feature.This will be particularly very useful for elderly people.In today's time when electronics is everywhere, missing out on implementing digital control of temperature appears to be sheer lack of initiative.Quick suggestion:slightly bigger size is better with oil based heaters.,Works good for me in Himachal. Consumes electricity but u getSilenceNo dry eyesComfortable environmentBuy it if u value ur comfort n silence.otherwise take any other blower which will dry ur eyes n throat and create a sound,I liked the fan mode and the amount of heat it generates,Wrong advertisement. Only 11 fins for a 13 fin oil heater.,Good product,https://m.media-amazon.com/images/I/61rppgjBjFL._SY88.jpg,Superb,Good value for money", "img_link": "https://m.media-amazon.com/images/I/41Dp3g8y8sL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Havells-OFR-13-Wave-Fin/dp/B08MZNT7GP/ref=sr_1_221?qid=1672923603&s=kitchen&sr=1-221"}
{"product_id": "B009P2L7CO", "product_name": "Bajaj DHX-9 1000W Heavy Weight Dry Iron with Advance Soleplate and Anti-Bacterial German Coating Technology, Ivory", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹1,099", "actual_price": "₹1,920", "discount_percentage": "43%", "rating": "4.2", "rating_count": "9,772", "about_product": "Heavy weight iron for easy ironing. Safety Plus: Thermal Fuse|Deluxe metal cover. Super clean surface finish with pleasant aesthetics|Multiple temprature levels|Non-stick coated sole plate|Temprature setting dial|Thermostatic pilot lamp|Warranty: 2 years on product", "user_id": "AFWJEGTWPLJFLEMNP6NHQWDEMR7A,AGV22RRF7Z7DKGS3NVGKRNEVDPFA,AHPNR55J5NQA5XXTTCGPUOLYWUWA,AHT3UUMHP2J4D5ED2J2TLSX3NLFQ,AFQ3EGHF7CJXP4Y34JIDWCOFQR6A,AEUAMC5SJIRMWLY4X62YAX4LFPLA,AE5JHZYLGZRTLGO7DJ7OGLD3NJZQ,AHNJTY4AOWAXORD6ELSDX6MCYHAQ", "user_name": "Tanveer,SARATHRAJ,Amazon Customer,Manivasagam K,G.bhaskara,Abhijeet Gonsalves,Monish,bhupinder singh", "review_id": "R2QBFLBABR9GF,R3IJW3DL5R0M17,RTLJ2SFPAH8LU,R2RYJL2TSW8T52,RC81G65D5P4SW,R3J5PW39AP2MFD,R21CUQNQ5BSFGH,R1XBT0HSF7NCKJ", "review_title": "Good one,Punchuality,Good product,Good quality,పర్వాలేదు,perfect for use,Good,👍", "review_content": "Good product. Weight is reduced a bit,Damage product deliveredTwo times,works fine even after 4 months as of now going good,Fine  good to use,లైట్ వెయిట్,perfect for use,Good,👍 👍 👍 👍 👍", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/411ZPXAMTlL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Bajaj-DHX-1000-Watt-Ivory-Color/dp/B009P2L7CO/ref=sr_1_222?qid=1672923603&s=kitchen&sr=1-222"}
{"product_id": "B07YC8JHMB", "product_name": "Aquasure From Aquaguard Amaze RO+UV+MTDS,7L storage water purifier,suitable for borewell,tanker,municipal water (Grey) from Eureka Forbes", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterFilters&Purifiers", "discounted_price": "₹8,199", "actual_price": "₹16,000", "discount_percentage": "49%", "rating": "3.9", "rating_count": "18,497", "about_product": "Product technology- RO+UV+Taste Adjuster (MTDS), RO is certified to remove new age contaminants like lead,mercury & arsenic from the water while eliminating all viruses & bacterias.UV-C Purification ensures that every drop of water is as healthy & safe as water boiled for 20 minutes. Taste Adjuster (MTDS) provides sweet tasting water by adjustment of taste depending upon the source of water|The product is suitable for all water sources (tanker, borewell, municipal water). This purifier can be used for TDS up to 2000 PPM (use a TDS meter to find out the correct TDS of your water source before buying a water purifier).|Convenient Features: a) High Storage Capacity b) LED indication alerts when tank is full, when service is due & when cartridges need replacement c) Transparent tank allows you to check water levels easily d) Purified stored water can be dispensed even without electricity e) Flexible Installation- The purifier can be easily wall mounted or kept on the counter top|7 Liters water purifier with 6 stages of purification|Warranty Description: 1 year comprehensive domestic warranty on all parts excluding consumables.|Included Components: Water Purifier, User Manual,plumbing kit", "user_id": "AEG4VIVKNFDYAV2FCBSOHWCVZSVQ,AHIBQJW27GSAIXAF67PPWDRPZVAQ,AHRFQ3PYMV7BBVTV3T4KRYULJT3Q,AEPAKIJPENJDKGUKTVAMOBK2ZG3A,AFZUVAVAWLFWHSJD7VW36OO2U5SA,AEW6PJ6XBMPUHS6XB4JBOQ4RBLMA,AH3VHCOFOAF2ECJSINLURTIOYRNQ,AFQLC466OW7RPNR5LJJMFSMK4LYQ", "user_name": "Sandesh,Sowmya,Madhu,NIKHIL BANSAL,Amar s.,megha deshpande,NIVAS MANOHARAN,Veeresh", "review_id": "R14L8SQPUEZAEJ,RGR9FMKB5LX06,R1R0YDAA1E3OBE,RYC3XH9C3EBWK,R12GSMU9X7QCRL,R3IQIN3KU0Q3XX,R1747LGCOQKZPN,R1IBV1QIKU5QG7", "review_title": "Decent product.,Aquasure from Aquaguard is a good product. I liked this product.,Product is good but the service is worst till i experienced  .,Poor service,MVP,Good,Ok,Nice product", "review_content": "This product is good, its only customer support and service that is pathetic. If not for that this product would have had real good rating. I received a slightly defective piece where indicators where not working. I initially raised an issue about it but there was no immediate support for that. As filter was working fine and we didn't require indicators, we didn't bother to follow up. After several days the service guy came and fixed it. First time when the service guy came there was no one. So he came again and got it fixed. For immediate support, its better to reach out to local authorised dealer or service , as going through the official support delays the process. So considering all these I feel product is decent.,Free services are limited. If we change the filter during the free services, we will be charged. Filter is not free of charge during the free services.,Product is good but the service is worst till i experienced  .if your staying in rural areas and your  planing to buy this than i will say don't prefer  because I have called minimum 20 times to the Custer care they always saying that they will send the service person but even no one is calling you to response .If your product is in service period the service person even don't lift your call and say the answer .Once the lady has called me and asked some details after she say it is not come under there area and she will forward it after i think five days has been completed and i called her back she replied rudely and saying i told you this is not come under there area and i asked her atleast give me my area service person number .She gave me atlast and i called the service person and he replied he didn't recieve any complaint id so raise a complaint on service request then he will come .I am frustrated and take my product and went to Guntur to repair it . Previously i done a service with the company servicemen he put a cap on the nozzle of the water pump so it stopped working and it all damaged. They told me you have to replace the pump it cost around 3000 . I have changed it and decided not to call the service person and write a review on Amazon so the people will know about the service centre.,Installation guy didn’t install propery, due to which water was not being purified for last one month. Poor service from eureka forbes,Most Value for Price from Aquaguard,Good,Ok,Tap leakage issue", "img_link": "https://m.media-amazon.com/images/I/31Gulp0B-0L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Eureka-Forbes-Amaze-RO-MTDS/dp/B07YC8JHMB/ref=sr_1_223?qid=1672923603&s=kitchen&sr=1-223"}
{"product_id": "B0BNQMF152", "product_name": "ROYAL STEP Portable Electric USB Juice Maker Juicer Bottle Blender Grinder Mixer,6 Blades Rechargeable Bottle with (MULTII) (MULTI COLOUR 6 BLED JUICER MIXER)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|JuicerMixerGrinders", "discounted_price": "₹499", "actual_price": "₹2,199", "discount_percentage": "77%", "rating": "3.7", "rating_count": "53", "about_product": "ROYAL STEP Portables & Convenient to Charge: This little body light weight design is easy for you carry it to school,office,parks,camping, anywhere you want to. and it also convenient for charge by power bank, laptop, computer, car or other usb devices.|Rechargeable&Portable - The USB juicer cup comes equipped with a built-in 2000mAh rechargeable battery that can be easily charged by power bank, laptop, computer, mobile phones or other USB devices .|Easy and Safe Cleaning - It has have smart safety protection device, magnetic sensing switch ultra safe to use and clean, the juicer cup's body and bottom can be separated, you can easy to clean it|Multi-function - With our juice blender mixing kinds of fruit and vegetables,you can make natural tasty juice,milkshake,smoothie and other baby food.It's very portable and great for traveling, outdoor.|Multi Functional : drink a protein shake, smoothie or healthy drink everyday, not only for making a protein shake, smoothie, juice, and it works well for vegetable and other baby food.", "user_id": "AFAVAR36WZOZ3TA3WC3KI2OKYJ2Q,AFG2M2SXTLVAQPPIADLDPE4FCLEA,AG4RNET5VB3G2D37WFEHZV764UYQ,AFNEINFKCBDEN7HOKXHHXVU4LDTA,AHGEURQ45YJNNNFH5RU3XS3HVOXQ,AH4IHZ6OEORKRRITBR3OU6LV2RSA,AF4K7PLAIOCYLKM6GPRXS43XTQRA,AEICD6CA4XTLZ2ZLKBJ2NQWSAGGQ", "user_name": "Naveen,SURIYA PRAKASH.D,Thanga harisha,Balam Singh Bhandari,Jyoti kharb,Khan Bawa,Mohamed ashik,Jayant Lokare", "review_id": "R188HVUJ3OC30R,R1FIJ9CPDW3WLE,R3NBFPDHO752C6,R1IL2YSPHL7Y9J,RRO3M2JQNUPLE,R3CNLHNBUYL7L8,R1GMZP3OAY2PQ4,R2JUW2AKU9TZVF", "review_title": "Don't buy this,Good product in this price range..,Good one,DO NOT BUY THIS PRODUCT,Great 👌👍,Such a beautiful product,Fantastic,Useless product. Poor quality material used. Could not give satisfaction of a singal Rupee.", "review_content": "Good,Easy to clean and use really a good one..,I try to grain orange yes it’s grain well I like the product,The blender being charge for 3 hours once the light become blue. After that it didn't run for 30 second for the banana shake even though didn't chop the banana properly.,I like this product . I will use this product for making  fruits shake.,Friendly to use, easy clean,easy to carry,This product is best use for the baby and essey to use I can sure buy this,Low quality product. Motor of the juicer don't have power to juice of cuttings of an 🍎.", "img_link": "https://m.media-amazon.com/images/I/519LLyO+jtL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/ROYAL-STEP-Portable-Electric-Rechargeable/dp/B0BNQMF152/ref=sr_1_224?qid=1672923603&s=kitchen&sr=1-224"}
{"product_id": "B08J7VCT12", "product_name": "KENT 16068 Zoom Vacuum Cleaner for Home and Car 130 W | Cordless, Hoseless, Rechargeable HEPA Filters Vacuum Cleaner with Cyclonic Technology | Bagless Design and Multi Nozzle Operation | Blue", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Vacuums&FloorCare|Vacuums|HandheldVacuums", "discounted_price": "₹6,999", "actual_price": "₹14,999", "discount_percentage": "53%", "rating": "4.1", "rating_count": "1,728", "about_product": "Cordless, Hoseless, and Rechargeable vacuum cleaner for efficient cleaning|High efficiency and washable HEPA filter arrests particulate matters & reduces air pollution|Advanced Force Technology can suck any size of dust particles|The bagless design eliminates any hassle with filtration bags|Gets fully charged in 4-5 hours and works for 30 minutes, continuously|Convenient and fast operation for more hygienic cleaning and sweeping|Multi-Nozzle Operation, Handy Fold Operation, and Motorized Floor Brush for cleaning various kinds of surfaces", "user_id": "AFUZ26ZD32I23WLX6MO6UUGYB6VQ,AHEDAEYXIZIPVLI6HSDRKIGYILCA,AGLZDJ2IQJQNA35JJLQ2VOEJAR3A,AECF2E7SAWWCGKCIE7DVMFMDT24Q,AHASPHQK4TSXX66FVFKWC4GWSUZQ,AE5W7W53GHU7VOQE7ITNRK2TS3WQ,AGGQUNYVRJSUMBI556ZU7NFVAV3A,AFDS6AED2AIE46CPX2A2QTGIH2VA", "user_name": "tamilarasi,shwetha murthy,Srilaxmi challa,Amazon Customer,ameya,sangeetha arun,Mansoor Ahmad,Mukhtar Ahmad", "review_id": "R2IC3MR8NSZXMB,R9DLK5R9IBY7H,R3QAFK08KOEM4X,RX0A7QAF3B8I7,R3DM3S7H8XLU0,R2ZXJGVOZAF18U,R13OM9G76N34OR,R2I7KZEBT2RJPK", "review_title": "Good,Nice,Good product 👌,Get's the job done.,Kent 16068 Zoom vacuum cleaner is very good to use and easy to clean and charge as well.,Less durable,Preety easy to use,Awesome product", "review_content": "Met expectations,Nice,Nice product..since it's cordless I can use it any where  easily. Its been 3 months I have been using it..no issues so far.,Deducted 1 star due to main pipe slightly dented and working time could have been a little more rather than 27 minutes.,NA,Wonderful product to use. But have some negative . reviews about durability.Easy handling. Easy charging. But getting repaired frequently . Its only one year after purchasing but the suction power was lessened twice by the time.,I been using vaccum cleaner for about some time now , does the job decent suction power , tools are great help1.cobwebs ✓2.dust ✓3.tiles ✓4. Light weight ✓Over all decent product. Go for it,10/10", "img_link": "https://m.media-amazon.com/images/I/31B24fjfiTL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Kent-Zoom-Vacuum-Cleaner-16068/dp/B08J7VCT12/ref=sr_1_225?qid=1672923603&s=kitchen&sr=1-225"}
{"product_id": "B0989W6J2F", "product_name": "ENEM Sealing Machine | 12 Inch (300 mm) | 1 Year Warranty | Full Customer Support | Beep Sound Function | Plastic Packing Machine | Plastic Bag Sealing Machine | Heat Sealer Machine | Plastic Sealing Machine | Blue | Made in India", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|VacuumSealers", "discounted_price": "₹1,595", "actual_price": "₹1,799", "discount_percentage": "11%", "rating": "4", "rating_count": "2,877", "about_product": "📞【UTMOST CUSTOMER SUPPORT: 】24 hours WhatsApp, at ENEM, we try our best to provide great experience to you. For any reason, if you are not completely satisfied with your purchase, you may return the machine for a service or exchange within 1 year of purchase. Providing lifetime manufacturer’s support, in case of any trouble just call/WhatsApp us on +91 9958404521.|⭐【MADE IN INDIA! IMPROVED SEALING MACHINE:】ENEM sealing machine is proudly Made in India! We have used high quality transformer + High Quality Plug + heavy gauge wire so ensures good performance and optimum safety.|⭐【SUPPORT ALL HEAT SEALABLE MATERIAL BAGS: 】This is a perfect sealer to seal foil, mylar, chip, cellophane, snack, kraft, tea, polyester, P.V.A., pliofilm, tivac, saran and all other heat sealable material bags, which is ideal for household, retail, produce, grocery stores, and industrial sealing. TOP INDIAN QUALITY - so you can buy with confidence and sealing happily ever after.|⭐【ADJUSTABLE TIMER SETTING:】Adjustable heat settings for the different materials being used. For most applications, using the impulse heat sealer at heat setting of 3 is sufficient. However, different temperature settings will be more suitable for certain materials of a higher or lower melting point or thickness. The adjustable timer makes it easy to seal a variety of packaging. For example: General Plastic Bags (0-2), Aluminium Foil Bags (2-3) & Plastic Paper Bags (2-3).|⭐【AUTO – POWER OFF PROTECTION:】ENEM Plastic Packing Machine remains in standby mode when not used, thereby not utilizing power. Only when same is used for sealing, power is consumed.|⭐【UPGRADED TRANSFORMER: 】The transformer used in machine is twice bigger than any others’ substitutes which can reduce heat and work loss, make sure this table top heat impulse sealer working life is double longer than normal sealing machine. Max seal thickness:10 mils. Sealing width: 2mm.", "user_id": "AFMIEGKNXXCMLWZFOBJ2D377PHVA,AGPUPI62IFNLHIAOE66RZ5FVZTIQ,AHZ5DVZ5VTJKMDTENJO4AZF7E4RQ,AFTQIPE7G3JCQMHJUU5FJBMP3MAQ,AEVLJEOZYZISEJ62IBSHVFIOVGHQ,AFOOAZDIA5NTHBNJ7SCIHUSR5WHQ,AHTOWZBM7RQHHVCMS3FQA7XBWSIA,AGQ2BGDKE2PWZ4Q27KVXUQQA67XA", "user_name": "Learning always,Saideepak,R P Singh,Rose,Saatu,Amit,Tony Antony,Kaavya Rekanar", "review_id": "R2K6SJH759C5FH,R32T8N4D11SFYS,R2AJIRID0O5M69,R3AFS0Z7NAVP9Y,R1ASKR3Y6EFO9Y,R18WQH7TYX092,R21411AL26C3MR,RW5XWAMBITKJR", "review_title": "Have bought 5 different sealing machines online by far this is the best,Hi,Good Value for money,Suited well for my purpose,Good,Great product. Made in india.really like it,Easy to use and economical,Very good", "review_content": "Have bought 5 different sealing machines online by far this is the best. And they have great support.,Hi,The machine works very well. Support is excellent. Had a issue after using it for more than 10 months, the support was great the issue was resolved immediately.,Got the product two days back.  My requirement was for  an unusual plastic, was a bit sceptical about the suitability..but with the help of timer adjustment, I could very well seal the plastic. Looks sturdy too, the durability will only be known with time.,Nice,purchased  few days back,It's really a great value for money.good customer support,Good product for the price tag 1329,Very good and easy to use", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/418ML1Yn1cL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Sealing-Machine-Warranty-Function-Plastic/dp/B0989W6J2F/ref=sr_1_226?qid=1672923603&s=kitchen&sr=1-226"}
{"product_id": "B0B84KSH3X", "product_name": "Wipro Vesta 1200 Watt GD203 Heavyweight Automatic Dry Iron| Quick Heat Up| Anti bacterial German Weilburger Double Coated Black Soleplate |2 Years Warranty", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹1,049", "actual_price": "₹1,950", "discount_percentage": "46%", "rating": "3.8", "rating_count": "250", "about_product": "Heavy performance dry iron - 1200 Watt to back up heavy weight performance with power|Soleplate with the double coating of Anti Bacterial Weiberger German Soleplate for wrinkle free smooth and crisp ironing|Stylish & Ergonomic design with a heavy soleplate ensuring class to your wardrobe and style|Five mode temprature dial that is customized for all your fabric in your wardrobe|Integrated with 1200 Watt superfast heating element that ensures faster heating and ironing", "user_id": "AH7OT4IUCAKFYCPJ3SVLAHV7E2YA,AGONNWZMRQZR2JDLNKFLAK4V62LA,AEDJK6VC42VWN3SJOPPI4V5HAQMA,AEPUEHEXXNFRXCCSK4F3VL5ZKDMA,AFJYPDELIA7MLTKDWYGQSYIGZWZQ,AFBKP77TRJAYCQFMO54ZJU6HRZOQ,AHW6RLKKGIEJSPBA5GGRWAX6Y2IA,AEE4RPNGOYPSBZXDRDNG5JR7KMTQ", "user_name": "S.saravanan,Mukesh,sanjay kumar,Khadar badha,Mahender,balvan singh,sathish annabathula,Ajmat", "review_id": "R2HFE6XNQS0UP8,R2BSCK1PAXQ5NH,RZPZS0APQWNRT,R1C19Z7Y860MKY,RZRHOS2N9ZVJM,RUC6VSV4LU9P4,RN8096LY7UFUJ,R355G76ECUQ7GN", "review_title": "Good,Seems to be good,Good,Fake replacement.they didn't come to receive the product.with out replacement.,Nice,Product is pretty good quality but taflon coating is not durable,It's work worthy,Amazing and good quality", "review_content": "New atavanc,Seems to be reasonable hot and heavy in weight as looking for.,Company improve heavy wait same thing 2 kg,No quality of box,Ok,Product is pretty good quality but taflon coating is not durable,I expected heavy weight but it is normal weight. Works normal.,I m not pic uploaded butThis iron looks amazing and good profomance", "img_link": "https://m.media-amazon.com/images/I/41+HYuF5ToL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Heavyweight-Automatic-bacterial-Weilburger-Soleplate/dp/B0B84KSH3X/ref=sr_1_227?qid=1672923603&s=kitchen&sr=1-227"}
{"product_id": "B08HLC7Z3G", "product_name": "Inalsa Electric Kettle Prism Inox - 1350 W with LED Illumination & Boro-Silicate Body, 1.8 L Capacity along with Cordless Base, 2 Year Warranty (Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Kettles&HotWaterDispensers|Kettle&ToasterSets", "discounted_price": "₹1,182", "actual_price": "₹2,995", "discount_percentage": "61%", "rating": "4.2", "rating_count": "5,178", "about_product": "1. QUICK BOIL: Prism Inox comes with 1350W power that boils water in just 5-10 minutes & prepares hot tea, delicious cocoa, or instant soup in short time. 2. SUPERIOR QUALITY: Made with the finest quality Borosilicate Glass which resists scratching and scuffing. 3. LED ILLUMINATION & WATER LEVEL INDICATION: Blue LED keeps you informed about your kettle being switch on. Fill the water tank easily and precisely with the water level indication. 4. LARGE CAPACITY: With large-capacity of 1.8 L you can make multiple cups of tea or coffee at the same time.", "user_id": "AHA4YQ5UYLOP7A7T2KRK6ULD7LJA,AFJ2JLBLHGYGNKRMGAKXPGKHFUOA,AG5EGPN7G64EYA3BQOZNNJI3EROQ,AEBCZJWGP66A67PNQTG6AIEZSJDA,AFFTDH4LXE4M5K6ZMJSFFPGBSQ7Q,AFYXCGFUYNSPE2MMMHPCDDG3MPKQ,AGL3XBRQVHEAAZH4M5E3ATNQV6AQ,AF7V57LV5NFKILFRLD7MPSVBKOAQ", "user_name": "Vikram das,SANJAY,Sanjeev,Neelu Srivastava,Amazon Customer,Flora.bebo.vidyarthi,Azhaan Khan,Amazon Customer", "review_id": "R21ZV0J85EQUOH,R2VSWW07HYJWQ8,R1EL7FF3GX730L,R1RT1L8WRAQY5D,R5KGDEFAJ5RVH,R3INXSK9AF574O,RVDYX9SNZJ6MQ,R169WUUXF4ZIUZ", "review_title": "An affordable electric kettle with stylish look,Elegant looks, glass finish awesome, starts heating quickly,Great product,After three months it stopped working,Not a quality product and bogus customer service,Ok ok,Switch to Inalsa after Borosil,Fantastic kettle, makes life so easy and convenient.", "review_content": "I liked the design and the built of kettle.The price is also affordable.,Easy to use, very useful product for winter, 1.8 ltr qty is sufficient for 4_5 members.,This is an excellent product and user friendly. Have used it for 4 years and still continuing .,Now I want my kettle to be repaired or exchange if needed reason after three months it stop heating… or you can say stop working . Thank you,After a month of use, the bottom plastic emits a charring smell, affecting the water's taste. Thru their app, I logged a complaint. The gentleman who is in contact with me is asking for an invoice I could not provide on time due to the mobile Amazon app did not support to download. I received a call from customer service about canceling the service ticket. Later I contacted the service engineer he said nothing worked. He ordered the part someone will visit to replace. No action. I raised another ticket still in open status with no effort. I may approach the national consumer helpline for action.,Easy to clean but not everyone can use. Kind of heavy.,The price is reasonable...water capacity is sufficient and boiling is fast used first time Inalsa electric kettle will update review after one month of usage.. best product,High quality product which is so convenient to use. The design is so nice and presentable that it can be used to serve directly to guests at home or office.", "img_link": "https://m.media-amazon.com/images/I/41FTyQVamFL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Inalsa-Electric-Kettle-Prism-Inox/dp/B08HLC7Z3G/ref=sr_1_229?qid=1672923603&s=kitchen&sr=1-229"}
{"product_id": "B0BN6M3TCM", "product_name": "VRPRIME Lint Roller Lint Remover for Clothes, Pet | 360 Sheets Reusable Sticky Easy-Tear Sheet Brush for Clothes, Furniture, Carpet, Dog Fur, Sweater, Dust & Dirt (4 Rolls - 90 Sheet Each Roll)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|LintShavers", "discounted_price": "₹499", "actual_price": "₹999", "discount_percentage": "50%", "rating": "4.6", "rating_count": "79", "about_product": "【CLEAN CLOTHES EVERY TIME】 : Our lint roller has an extra sticky formula that helps you easily collect fuzz, fluff, and bobble balls from your pants, clothes, and fabrics without damaging the material.|【2X EXTRA STICKINESS】: VRPRIME offers 200% more pick-up per strong adhesive sheet for a quick and effective way to remove annoying pet hair, lint, and debris. You will save time and effort in removing stubborn hair and fuzzy bits from your clothes, sofa, furniture, car, carpet, etc.|【TOTAL 360 SHEETS】 : VRPRIME lint rollers come with 1 reusable ergonomic grip handles that comfortably fit in your hand, four refills of 90 sticky easy peel off spiraled sheets. Total 360 sheets in one package with great value.|【MULTI FUNCTION】 : The fluff remover is not limited to just clothing and garments, it also is your perfect tool to remove dog hair, cat hair, pet fur, fluff, fuzz, and lint from furniture, upholstery, bedding, car seats, etc.|【EASY TO PEEL OFF DESIGN 】: New improvement on cutting makes peeling off sheets extremely easy, you can start a new sheet from the top or bottom freely and tear off the sheets easily after use.|【A MUST-HAVE CLEANING TOOL】: VRPRIME dog lint remover for clothes can help pick up any shards or dirts from small spaces that a vacuum cleaner can never reach. Adhesive remover is especially effective for removing pet hair. It’s great for keeping clothes and furniture like couches, carpets, and curtains clean from debris in everyday life.You will never regret having Lint Roller pet fur remover.", "user_id": "AG56BWR4QA24HMU37HCG7LXA5BIQ,AHPMTDLBF66SKRERYCJJ64OIT4RQ,AHSJSRYF6IDDAO3GFP2JDGW7AQPA,AFHFQZ4WRMY2BZ2M6EPZVRTWARHQ,AHLRT2VIZ5O7U6K7UG7P25P4S4UQ,AE6GNTASF4AF7GAW767UV2OON4EQ,AHNKJGN4LTDD3CFDIWZS5XNYZCGQ,AHWPHJR3F3WBWRACB5PHHTRKXYEQ", "user_name": "Kindle Customer,Naval Kishor Rustagi,Sudha,sajal,Prabhleen loyal,satyam bansal,Prabhjot,Rajesh Maurya", "review_id": "R2QT3QBL25HBTG,R3E449S1ZWR7F9,RLHERK8U1LREO,R1NHGLXW1QKLBC,R2MQH21SEZOIUM,R31ZE4UADPDRG4,R3B8J75DKKAPIZ,RYXRDTE7LINT1", "review_title": "Superb,Very helpful and great quality,Exactly what it says on the tin,A must product for pet parents,Must purchase if u have pet...,Totally worth it,Good product,Easy to use and usefull prody", "review_content": "Value for money,The quality of the tapes are as expected and they are really good. Value for money. This is the best rate I could find here for a lint roller.,Found this lint roller to be quite good. The adhesion is great. Needed this mainly to clean hair off of jackets and such and works really well. Gets all the hair and lint off without damaging the material of the jacket. The handle is sturdy although the rotating bit rattles a little but nothing that adversely impacts use. All in all would definitely recommend!,Its easy to use and value for money product... Can be stored and used easily...,It's very easy to use and good quality of the product 👌,I saw it first time on youtube , so thought of giving a try and it is totally worth it. Was suprised u get 4 of them with 90 sheet each . I use it not only for lint but to also remove tony dust particles from my desktop and mousepad. Must tey if u haven't used lint roller before.,Amazing product good quality Go for it….,If you have dog or cat in your home this product is must!! It is really usefull,  It works on almost all type of clothes and it can be used on bedsheets curtain or on sofa.. I ordered set of 4 and it has 90 layers on each so its budget friendly as well, go for itt!!!!", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51qZekzGLxL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/VRPRIME-Remover-Reusable-Easy-Tear-Furniture/dp/B0BN6M3TCM/ref=sr_1_230?qid=1672923603&s=kitchen&sr=1-230"}
{"product_id": "B01L6MT7E0", "product_name": "Philips AC1215/20 Air purifier, removes 99.97% airborne pollutants, 4-stage filtration with True HEPA filter (white)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|AirPurifiers|HEPAAirPurifiers", "discounted_price": "₹8,799", "actual_price": "₹11,995", "discount_percentage": "27%", "rating": "4.1", "rating_count": "4,157", "about_product": "Philips is the No.1 Brand in Air Purifiers in India (Source: Euromonitor International Limited; Consumer Appliances 2020ED)|VITASHIELD INTELLIGENT PURIFICATION: Automatically senses air quality and removes 99.97% airborne pollutants as small as 0.003 microns, 800 times smaller than PM 2.5|FAST PURIFICATION: Purifies a standard room in just 12 minutes with a CADR of 270 m3/hour (Standard room size is 18 ft by 12 ft with an 8 ft ceiling height). Recommended room area: up to 250 sq ft.|3 STAGE FILTRATION: Air Purifier processes the air through pre filter, activated carbon filter & TRUE HEPA Filter|REAL TIME AIR QUALITY FEEDBACK: It provides feedback through 4-color air quality indicator|AIRMID CERTIFICATION: Removes 99.9% bacteria and viruses, tested to remove airborne H1N1 virus|ECARF CERTIFICATION: Removes 99.99% pollen and house dust mites, Allergy friendly quality tested by ECARF|AUTO-AMBIENT LIGHTING : Adjusts the light levels of the device in according to the light in the room in Night Mode", "user_id": "AHLGRFI7QX34GNBZPPXAU3XDMUEA,AGJBEJ5UYM34YEAF3O66X6ZXMJ3Q,AGCNLEMAO7Y3K2HRVTJUR46ADX4A,AHF6WK7M75GMQD5UBU5KL3CYR3PA,AFUNWCVYZL6R7BTREUZR3HWRTULA,AGJZZHGM6QJ3Q2IZZAMN3QRM2YAQ,AHNE2UTXIV6QYFTLJCK7NJQ3UFQA,AH5PIM77X6TCBZ2GSUQO474JGLZQ", "user_name": "Tushar A.,Indu bala,Partho,T. SAIPRASAD,RVA,abhijeet kumar,Yogesh Sansanwal,Rajeshwari Dhanabalan", "review_id": "R34PWVCC9VENM9,R14WKFJ1BTMD1B,RZRUE1VLMP3QK,R12RV1CVRJOA3Y,R1UVYM31CNIFTO,R2R6FPO6X0GQO4,R7D2D2BOMAUTO,R16S2JKUS18GAB", "review_title": "Good Performing Air Purifier at a Decent Price,Value for money,Nothing earth shaking about this product!,It is good,Great product.,The product is working nicely and worth buying product.,Writing after 1.5 years pros cons solution and trics do read my reviews and vote,Works but no use", "review_content": "Here is a try at a review of this product after using it for an year now.Use Case :-I am a NCR resident and the air pollution is as we know one of the worst possible if not the worst. I have it installed in the bedroom, about 300 sq ft so well within the advertised max room space. While using the purifier the room is kept closed to minimize pollution addition.Build Quality :-The purifier is sturdy in its built and aesthetically pleasing. It has a large front grill that acts as the air inlet, and an arched back that has a larger grill for filtered air outlet. The arc helps the air to be released vertically upwards and hence does not add to direct cooling for anyone sitting in front. This helps the filters use in winter which is the main season where it is required. The top of the filter has a dark panel with touch sensitive buttons and a decent sized circular LED screen. The 4 buttons are - Power, Night Mode, Fan Speed, and Child Lock.Setup :-The air purifier is shipped with its parts packed separately. Thus on unboxing the same has to be setup for use. The setup is pretty straightforward. The main filter units front can be released and the individual filters aligned in order on the central space. The installation order of the filter is as followsFirst -> HEPA Filter. (The same has indication on top to correct installation. You can also go with keeping the Phillips Branding on the top left Corner)Second -> Active Carbon Filter. (The same has indication on top to correct installation. You can also go with keeping the Phillips Branding on the top left Corner)Third -> Pre Filter. This one actually clips in place and is used to filter out the larger dust / impurities so that it does not clog the other main filters.Thus the filtering order is Pre Filter -> Carbon Filter -> HEPA filterWorking :-The air purifier can be set to different modes. One of them being the automatic mode that automates the purifier working thanks to the inbuilt air quality sensor. The pollution level sensed regulates the fan speed accordingly. 4 levels are programmed and are indicated on the small circular LED screen by means of circular rings of different colors - Blue (Min), Violet, Pink, Red (Max). Red level would put the fan in maximum speed and blue would turn off the filter automatically.If you are not a fan of the automatic mode, you can use the fan speed button to move through the option of different fan speed/modes. They areFan Speed 1 - Indicated by 1 on the screenFan Speed 2 - Indicated by 2 on the screenFan Speed 3 - Indicated by 3 on the ScreenAutomatic Mode - Indicated by A on the ScreenAllergen Mode - This can be only added on top of Automatic Mode. It essentially bumps up the speed a bit on all the different color levels. This is to suit the sensitive people as this improves the air filtration rate.Turbo Mode - Indicated by T on the Screen. This puts the fan in the maximum speed possibleThats pretty much the major functioning of the air purifier. Additionally the filter has an automatic/forced night mode. The purifier automatically detects the lighting in the room and once it senses low to no light it automatically goes into night mode. The same can be forced by pressing the night mode button the purifier. What this does is that if the filter is in automatic mode, the fan speed is reduced on all the levels so as to minimize the noise.Summary :-So as to summarize my review and add my view here, the filter works pretty well for the use case i have. On regular winter pollution days its able to keep the air quality in control, even when working in automatic mode its able to go down from Red levels to Blue. Switching on an off intermittently as per the air quality levels. On drastic pollution days it has a tough time managing the air quality in automatic mode and i have to force it in turbo mode to get the air quality in control. If not too much of an air change is happening in the room throughout the filter is able to get the air quality to a much acceptable levels.The air quality indicator is a great value add on to the product. Much that is missing in similar priced competitors.I am little disappointed in the night mode working as it compensates air quality over noise. I believe the purifiers task is to ensure that the air quality in room is as good as possible. By reducing the fan speed to reduce noise works ok on normal pollution days, but is totally useless in any thing even a little worse (when i dont want to use turbo mode just yet)Durability of the filters has been decent. I have used it all through the winters last year and intermittently the summer this year but am yet to get an indication to change the HEPA or the Carbon Filter. On yes that reminds me the Air purifier would automatically sense and indicate when a filter needs to be replaced by displaying an error code on the screen. It even does that for the pre-filter which does not have to be replaced but just cleaned/washed. That i have received 3-4 times this past year.Overall i still strongly recommend this product- Good performance with a decent price which has been slashed a good amount from when it launched.,Good product,The product does not stand out notably, but it probably does the work it is supposed to. It is too late now to return this product and try another make.,Over all good product.bEasy to install,Well designed product. Yet, to experience filter replacement and, consequently, the recurring cost.,The product is working nicely and worth buying product.,Writing after almost 1.5 years all pros n cons Everything is good only problem is i live in delhi and hepa filter will cost you around 2000 and it took only 6-8 months it become totally black few advice1. Dont run it near kitchen it will catch all carbon n pores will b blocked.2. If you live in delhi check it after every month clean with vaccume cleaners.3. Seal your doors most dirt & mosquito come from there open windows only that too seal them and put anti dust and mosquito net on them.4. Run it all day as when u turn it iff after 1 hour your room will be as dirty as ut was.5. You can clean pre filter only don't clean carbon and hepa filter.6. Being and indian if your hepa filter become black get some jot water put some detergent and dip it inside all dust and carbon will come out and use it again haha its paper but its so hard you can wash it 4-5 times keep it under sun light for 4-5 hours.7. Sometimes u get error of FO clean all three filter with vaccume or brush (careful while cleaning with brush that dust is dangerous can cause problems so wear mask) after cleaning hold ur finger on child lock to reset and it will start working8. Bhai delhi m pollution bhot h so family k lie monthly 300rs padta h filter mother wife bachy pura din gher p rhty h so its a must buy to protect them.9. Update fan speed got slow down10. Power consumption- on 1st- 23 watt, 2nd- 33 watt, 3rd 40 watt, max 50 watt best is keep it on automatic mode when room will be clean power consumption will reduced to 23watt and whole night it work in power efficient mode11. Do not left your room door or window open it will continue to be red room should be closed,Room is still dusty not much functional", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41YlkgRwHVL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Philips-AC1215-20-Purifier-White/dp/B01L6MT7E0/ref=sr_1_231?qid=1672923603&s=kitchen&sr=1-231"}
{"product_id": "B0B9F9PT8R", "product_name": "Eopora PTC Ceramic Fast Heating Room Heater for Bedroom, 1500/1000 Watts Room Heater for Home, Electric Heater, Electric Fan Heater for Home Office Bedroom (White)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|ElectricHeaters", "discounted_price": "₹1,529", "actual_price": "₹2,999", "discount_percentage": "49%", "rating": "3.3", "rating_count": "29", "about_product": "🔥PTC CERAMIC CHIP HEATING TECHNOLOGY: The EOPORA heater is powered by PTC ceramic chip heating technology with 1 second instant heat, which can heat a room faster and quickly and efficiently heating can quickly cover your office or room in minutes.|🔥2 TEMPERATURE ADJUSTMENT MODES: High Heat (1500w) / Low Heat (1000w).The button on the back can control low temperature/off/high temperature, which is convenient to use.Our space heater features 2 different heat settings (LOW, HIGH).You can switch between different modes more flexibly according to different environments.|🔥TIP-OVER PROTECTION & OVER-HEAT PROTECTION: Room heater automatically turn off if they accidentally tip over, perfect for houses with kids and pets. When the heater overheats, the overheat protection will also automatically shut down the heater, making it safer for you to use.|🔥LOW NOISE TO USE: Room heaters have noise levels below 50 dB. Our room heater can provide warmth without interruption for the spaces you need to study, read, work and sleep.|🔥PERFECT FOR YOUR HOME OR OFFICE: The compact and portable design combined with the ergonomic built-in handle, will allow you to easily move your space heater to any room you want. Make sure your office, kitchen, bedroom, guest room, study or living room is nice and warm.|🔥1 YEAR WARRANTY: Eopora PTC Ceramic Fast Heating Room Heater has professional after -sales service and 12 -month warranty. If you have any questions or doubts, please contact us, we will solve your problems as soon as possible.", "user_id": "AFK6D62HRZSHP5W3DE5QGYUYJQEA,AEG62TH65UKTMBXY5MS2T7JD3YLA,AFE3JGTSN4WFROSWXKY5BS2E77CA,AF4O3IAKZFWV4LN6IOTADZX7OCLA,AHPA3OCFQE5RUJGCDKC535BV6YGQ,AG2AYRDUZHKLWJ3J2OL2K2UTOQUQ,AG3B6XNLKK4GGFYPW4JEYBG577CQ,AGPQHMB6XWAURLOJA57DPCU4HQ7A", "user_name": "alok tripathi,Ashish Thakur,Yash Gupta,Arun Sharma,Zoeena D.,Naveen Sharma,Dr. Kakati,DC TIWARI", "review_id": "RNFDIM9PF1C9U,R36YHQKR1456NC,R3SZ6SM72UXPT9,RZYOW4CYXKVOE,R12ZDG5WML5E1Z,RORVGP6V0EP21,RNHLZSPMRSBN3,R2R3PMS05CDPY4", "review_title": "Very beautiful heater but costly and less useful,Decent with some flaws,Good product.... Easy to handle...,I won't recommend it!!,Value for Money Product,Good Product,Low quality heater,Everything as per the description.", "review_content": "It is very beautiful looking and appears imported good for placing at one spot on office table etc. and not to be moved. It is very light so easily tumbles down. wire cord is very short. Heating is good. It is not strong and sturdy but made of plastic outerbody which will break if it falls down.,More than a week,im using this product.Pros:compact,easy to use,portable,good built quality.Cons:Light weight,No manual control over saftey switch,takes time to heat a small room,small cable length.Conclusion:If you are looking for a gud luking compact heater you can buy it.If you are expecting high skip it.,I like the product design & quality..I'm using in my room.. It takes 15 to20 min to reduce the room temperature... I will recommend this product..,The only positive about this device is its price. Otherwise, all it has is negative.The heater is very light weight, but that's a negative coz it's too light to trust it to work safely. A device working at such high temperature require some weight to have stability so that weay feel confident that it won't topple. The manufacture has given a safe switch at the bottom of the device, but the device remains at high temp for sometime even after being off.The material body material feels very cheap and doesn't give confidence that it would last long though the PTC heating element may last long.There is nothing to prevent entry of dust and fiber into the heater, that may lead to a fire in the long run if fibres accumuulate inside.Also, without any dust filter the heating plates will get blocked very very soon.The switch on the backside to switch off and on also appears to be of the cheapest quality.There is not temperature control in this heater....so once you start it it will run continuously so can't be used as overnight heater in your bedroom.So I would suggest, it would be better to go for slightly costly heaters which have temp control and better quality.,As abious amazon delivery service is awesome received this product in 2 days.Build - Built qiality is amazing dint expect this, Metal frame and smooth plastic finish, light weight to carry and portable.The best part I liked about it, it never took time to heat, just switch it on and it started blowing heat and it easily heats the room withing minutes. But bare oin mind it takes 220V power.All I can say is, its the best product in this price. You will not regret buying it.,The Heater is effective, easy to use , and very compact. Work is good, I like it very much.,Av very low quality heater without any temperature control. It burned my switchboard. It keeps drawing current without any control.,Great product for the price, considering it has ceramic element.", "img_link": "https://m.media-amazon.com/images/I/41C6ocE26pL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Eopora-Ceramic-Heating-Bedroom-Electric/dp/B0B9F9PT8R/ref=sr_1_235?qid=1672923603&s=kitchen&sr=1-235"}
{"product_id": "B0883LQJ6B", "product_name": "Usha Goliath GO1200WG Heavy Weight 1200-Watt Dry Iron, 1.8 Kg(Red)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹1,199", "actual_price": "₹1,690", "discount_percentage": "29%", "rating": "4.2", "rating_count": "4,580", "about_product": "Heavy 1.8 kg for effective ironing|power 1200 W for faster heating|Dual Coating Weilberger Gold soleplate for durability|1.8 m long cord length for better reach. Spray : No|360 deg swivel cord, Fully covered convenient plastic body|Overheat safety protection|Indicator light for readiness", "user_id": "AFQAXRM4XEA72PNIMWCW2F53ISWA,AE5VPGHORHY2ZU5RW6B3AEL4CFJQ,AGHHTIPESD2S56DORYF5DK7VWAVA,AGNUZ45QI5DHUL6EFTEDFWHH5TSA,AF265F7UPZDF6O6JA5OZNC4BMURQ,AH7ATUCWGGF2CFH6O2B6JAZLH3RA,AEIRF32A5JCOXLBOHRARCTNE6KPQ,AGOOI3OO3V3Q6GB74PMJ7HCTB2FA", "user_name": "Subanathan,Vaibhav.Vichare,Naveen Kumar,Prosanta Das,Sudarshan Singh Rawat,Periyasamy,Raju,Prashanth Gangula", "review_id": "R293AKJY0KAYU2,R1CKLC9EOIW0CO,R1SFNUH4BC29Q4,R23FF4AI11EGQG,R2ITLBT3D3QIFF,RZ2TK6IVJL936,R1ZCONBNFKG8ZC,R1OJUIJC0SV7DS", "review_title": "Nice,Heavy weight and good product.,Value for money,Looks good one but returned,I like it and good product,Super build quality,Nothing,Best iron box", "review_content": "Value for money, performance well,Review after 1 month. Good product. 4 stars.,Easy to use, comfort to handle nice product,I got this dry iron today and it looks really good and I think it should be the ideal one for dry pressing and weight is quite heavy of 1.8 kg and it's big one but weght might be a problem for week women. But unfortunately I have to return it as lot of  scraches are there on non sticky plate and that will follow a further damaged over there in future. UT here I want to inform you that many people have already got these scratches and they have returned it. So be very careful to verify before using it,I like it overall the best.,Heavy weight but I like it super build quality,Valuable money,Best iron box", "img_link": "https://m.media-amazon.com/images/I/31XPVmD8gUL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Goliath-GO1200WG-Weight-1200-Watt-Maroon/dp/B0883LQJ6B/ref=sr_1_236?qid=1672923603&s=kitchen&sr=1-236"}
{"product_id": "B099Z83VRC", "product_name": "Wipro Vesta Electric Egg Boiler, 360 Watts, 3 Boiling Modes, Stainless Steel Body and Heating Plate, Boils up to 7 Eggs at a time, Automatic Shut Down, White, Standard (VB021070)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|EggBoilers", "discounted_price": "₹1,052", "actual_price": "₹1,790", "discount_percentage": "41%", "rating": "4.3", "rating_count": "1,404", "about_product": "Wipro Vesta Electric Egg Boiler Machine boils 7 eggs at a time with easy and quick one-touch operation for a healthy and convenient breakfast in minutes|Wipro Vesta Egg Boiler comes with a stainless -steel heating plate, which evenly distributes heat to help you get perfectly boiled eggs within minutes|Boiling eggs in different modes is not easy as it soundsThis is the reason why Wipro Vesta Egg Boiler can easily boil eggs in three different modes- soft, hard and medium|Use the provided measuring cup to add water according to your preference and number of eggs you want|To avoid accidents or over boiling, Wipro Vesta Egg Boiler comes with a special feature which automatically shuts off after boiling eggs for the convenience of the users", "user_id": "AHBB6UBYHJ5FH2BUFQ2BCXHWQFJQ,AH2UMMYPAYXHX6PU4LADMKJEC6JA,AGCAHYB2PF6PZ6ADYFBM4IUMHEWA,AF6YTIKZWCOBJ5AI5DKRWFCSJWTQ,AF6PBVLOWTG4JSSUS3O2ADTEU2PA,AGKY5D26F5Z4S4EY7Q2FG7M4QRMQ,AEM3TDYU6QQQOU6MOR2LYJQMYOSA,AH7MUE7NGNKQPXN6GNFGRKRYBETQ", "user_name": "Adwait Kulkarni,Divya Singh,The Best Bike,Deepak Suryavanshi,Sonu kholiya,Likhitha,Mukesh Sharma,Maddy", "review_id": "RCZZ3OE0HNTMR,RKY1OFMHN5A3D,R143FGMXO612N1,R37QUY4LLQBPG3,R2D85FE1SVH9R7,R1JEMHPSAGZKDW,RS2R19WDEHUNL,R1UW9TNRNUY15B", "review_title": "Very easy and handy to use,Good to have for boiled eggs.,Superb,Effortless,Wanderful,Good,Not good,Can consider for purchase", "review_content": "It is a good product with easy to use functionality and easy to clean .Can accomodate and boil 7 eggs at a time, when water gets evaporated totally, it automatically cuts off the power supply and turns off the light .The bottom of water container can be used to make a hole in the eggs and hence eggs can be peeled off easily after boiled properly.We can also set the water level and how much to boil the eggs . According to the level of water we put in, the eggs are boiled . If we put in less water, eggs are boiled less and vice versa.Overall a nice and handy product, easy to use and easily portable. Comes with strong and good build quality.Must buy for gym lovers and frequent boiled egg eaters.Go for it !,I need boiled eggs daily and thats why I was looking something good and friendly to use and I purchased this egg boiler. This Wipro egg boiler made my life super easy.It comes with an auto cut system and this way I can get any 3 types of eggs whatever I want. Cord is short but manageable.,Nothing,It is easy to use .But it is only useful for only boil egg.It’s power cord is very short so it’s very difficult to connect.,Review,Ok,Better by a 300 wala,Overall it's good. We can get hard, medium or soft boiled eggs. Cleaning is an issue. Sometimes it gets very dirty and it looks like it is corroded.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31qZm3DyDhL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Wipro-Electric-Stainless-Automatic-VB021070/dp/B099Z83VRC/ref=sr_1_237?qid=1672923603&s=kitchen&sr=1-237"}
{"product_id": "B00S9BSJC8", "product_name": "Philips Viva Collection HR1832/00 1.5-Litre400-Watt Juicer (Ink Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Juicers", "discounted_price": "₹6,499", "actual_price": "₹8,995", "discount_percentage": "28%", "rating": "4.3", "rating_count": "2,810", "about_product": "This product does not require installation. please contact brand customer care for any product related queires. Please contact_us on: [1800-102-2929]|Material housing: ABS Plastic and Material jug: PP Plastic|Material pulp container and pusher: ABS, SAN|Drip stop, compact design, QuickClean technology, smooth and easy to clean, Frequency: 50/60 Hz|Direct serve, QuickClean sieve and can see-through pulp container|Make up to 1.5 litre in one go|Integrated pulp container", "user_id": "AG6N6OO4GIHAHRVNERRTV3FJA2BQ,AGUT3AOM4QV4CVXBGHHRMGYHB2IQ,AEQM4DMINJG5GCYEMHZBJESHCUYQ,AFOMBT36JVCMN5RXXPMIO23GE7QQ,AEQRYFSSX35ZFP64C2CHBDYS7WMA,AEKYBUI6YRXCCRTV4YZ3WJYPVRDQ,AHZGHAB5A4VIMHKF2QTICSYPMJHA,AEKJ4CW4KMMDYM2WT5PLCNTRBS4A", "user_name": "manian,surjeet,ANUPAM BHASIN,Capt Milind Kumar,SwordFish,kunal lalit kaistha,Vinay,Razat", "review_id": "R35S3FG2J2TJAM,R14JYWLSY6VOZW,R10TNWC8M5M8E9,R1YCJPR648EPXQ,R1ZR7S45YOQHKX,R23T81UVKR2YSW,R1YGKMW5AF14T9,R30ID8UXCDX35K", "review_title": "Beyond expected,Good,Perfect Juicer - Very User Friendly in usage,User friendly and convenient to use for fresh juice,Excellent Little Juicer! Fast and Easy to Clean. Produces Very Good Quality Juice,Premium juicer,Good however...,Most effective and convinient juicer i Ever had", "review_content": "First of all i wanted to buy one juicer to have juice instantly.. so i reviewed many juice blender and finally i bought this Philips HR1832.. i made carrot..apple... Orange.. promoganate..etc... All i did and had fantastic juice... Fruit pulp and waste all collected in one tray and it is easy to wash.. thanks for this instant juice blender.,Good deal,I find this Juicer amazing; end-to-end it takes me around 10-15mins to extract the juice, clean & pack it back. That easy it is to Use!,The product is very good and user friendly. Exactly as demonstrated in video,I used to have juicer many moons ago but it was a cheap model and never really produced the juice I wanted and I couldn't afford the mega posh ones which juiced fruit and veg to within and inch of its life so I was excited to be able to start using this new one. First off this is a nice compact design. It really doesn't take up much room and it has small suckers on the base to keep it in place on the kitchen surface.The juicer is simple to take apart and put together, instructions are not really needed, though there are some basic pictures provided on the box.The juicer spout where you put your fruit and veg in is quite small. I need to cut up my apples into quarters to fit them in and although this is not a huge flaw it is a shame as you wouldn't need it to be much bigger to get them in. So far my juicing attempts have all been successful - apples, raspberries, grapes, cucumbers, carrots have all yielded a fair amount of great tasting juice. I also unwittingly popped a chopped up mango in there without realizing it is one of the starchy fruits that is apparently doesn't work with - it seemed to work fine for me. I can see how a banana or avocado might not work, but the mango did produce juice so you may want to experiment. The pulp left at the end is still fairly damp and I found I could easily squeeze liquid out but it's in no way dripping and I would say a decent job had been done. I know that there is a lot of goodness left in the pulp so if you want to use this then just make sure you clean your fruit before juicing and remove anything you wouldn't want in the pulp. That way once you have finished juicing you can just scoop out the pulpy goodness and do whatever you want with it.Juicers produce different quality juices. There are really 2 key areas to judge a juicer on it's juice quality.#1 Some juicers produce a higher amount of juice per food item. You can tell by the drier pulp that is extracted.#2 Some juicers produce frothier juice and warmer temperature juice - 2 signs of lower quality because the air and heat are evidence of the oxidization of nutrients. A faster spinning juicer (centrifugal) will often produce more heat and froth, which is why the masticating style juicer (slower, chewing action) creates better quality juice.In terms of these 2 key areas, this Philips does an alright job producing dry pulp and an excellent job with low froth and low temperature juice. The slow masticating action is excellent and on par with other juicers.  To get more descriptive,  I like to run the pulp of the Philips through the juicer 1 time to get extra juice out of it. Running it a 2nd time and I get hardly any juice. One extra run of the pulp is sufficient.The specs for this juicer claim you can clean it in under 1 minute. I think this is a little optimistic but that said its not too far off. All the plastic parts rinse clean easily and quickly with warm water and the only part which takes a little more effort is the metal sieve and grater. This has teeny tiny holes in it to help separate juice and pulp and so it does get clogged up with stuff. That said I have found that using a soapy scourer sponge and gently rubbing with the green side does the trick pretty swiftly. It certainly does not take much elbow grease and I found it very easy to clean off - unlike my previous juicer where you needed to scrub for half an hour and you were still finding bits the next time you used it.I think this is a pretty decent juicer for the everyday user. Yes it could produce a little more liquid from the things it juices but it is certainly not bad and the stuff it produces is on the whole clear from bits. The anti drip spout is not quite anti-drip and you do need to watch out for juice on the fruit plunger when you put pieces in as I have whipped it out too quickly and splashed drops of fresh juice all over the place. For the current price I would say it is well worth it.,High quality premium juicer, with low noise and excellent ability to squeeze max (80 to 90%) juice out of fruits and veggies. The look and feel is outstanding and way above what other options are available,I have been using this for a month now.It is easy to use, and clean and assemble.But at times, I have seen that the pulp is also coming in the juice and sometimes it makes a different sound while it is grinding.I feel the carrot and beetroot pieces should be cut a bit smaller and not like a slice, cause if i cut like a slice/flat, one carrot slice got stuck within the blades and the machine made a different sound and it was not giving more juice but i could see the pulp.Try to cut the carrot pieces of atleast 1-2 inch size like a round one and not like a slicebut overall, good experience as i make carrot and beatroot juice and  it takes 15-20 minutes to cut, grind and clean.very easy to use and very easy to assemble.Thanks,Perfect home juicer , easy to clean, assemble and comparable i loves it", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31-jt474B1L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Philips-Viva-Collection-HR1832-1-5-Litre400-Watt/dp/B00S9BSJC8/ref=sr_1_238?qid=1672923603&s=kitchen&sr=1-238"}
{"product_id": "B0B4SJKRDF", "product_name": "Kitchenwell Multipurpose Portable Electronic Digital Weighing Scale Weight Machine | Weight Machine | 10 Kg", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|DigitalKitchenScales|DigitalScales", "discounted_price": "₹239", "actual_price": "₹239", "discount_percentage": "0%", "rating": "4.3", "rating_count": "7", "about_product": "Package : 1 Weighing Scale|Easy To Use|Durable to use .|Convenient weighing unit switch, data lock . Over load indication, auto power off after 120 seconds without any operation. Easy to Use.|LCD back light, easy to read value at day and night", "user_id": "AGP5YURZQ6W2GKYILORIGKB3NDUQ,AEPAZYTLJQKDOZBSNB35SQF6CMUQ,AHDSX7NV3NZQB2NZ4RLIOBKUOMYQ,AEDL37BWW4MEOIJFCGUXHFUQRXGQ,AFJN6RLNPLI6R42GH7IMYMMOXGMA,AERJQGP7X4KVPD26I4WOZDDP23KQ", "user_name": "Dinesh,Rajesh Thakur,Kiran chaudhary,Shyam Kotecha,bhupender,Evangeline Lydia", "review_id": "R1UQOSA7I0B6CT,R1JP6NH8K5NZU5,R2I5H53LBQO3LU,R2GHLGUZHUPKYI,R2LGD1DSKBGHES,R2TZD3HUFR98EF", "review_title": "Good quality scale but I got defective piece,Nice product....,Product is very good 👍,About product,Must buy,Great device for kitchen", "review_content": "This weighing scale is made of good quality material. Looks sturdy, weighs accurate but the scale I got has detective display. First 2 digits looks clear and then next digits are not clearly visible. I am returning this item and amazon accepted my return request.,Received on time... Product is very good in condition..,Better productI like,Very helpful product,Really best product use shop nd home ..Received it today and checked it's capacity.. it is coming around 10 kg. Overall looking is good.hope that performance will also be good,Received the weighing scale in good condition. Looks exactly the same as the product display. Working good at present. Happy with the purchase. Thanks to the seller and to Amazon", "img_link": "https://m.media-amazon.com/images/I/319gn5l2NSL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Kitchenwell-Multipurpose-Portable-Electronic-Scale/dp/B0B4SJKRDF/ref=sr_1_239?qid=1672923603&s=kitchen&sr=1-239"}
{"product_id": "B0BM4KTNL1", "product_name": "FIGMENT Handheld Milk Frother Rechargeable, 3-Speed Electric Frother for Coffee with 2 Whisks and Coffee Decoration Tool, Coffee Frother Mixer, CRESCENT ENTERPRISES VRW0.50BK (A1)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|HandBlenders", "discounted_price": "₹699", "actual_price": "₹1,599", "discount_percentage": "56%", "rating": "4.7", "rating_count": "1,729", "about_product": "【Rechargeable Multi-Function Milk Frother】The Milk Frother comes with two Whisk-Heads attached to the handle - the Spring Whisk-Head is for making milk&coffee foam, the Balloon Whisk-Head is for beating eggs|【High Quality】The product is made of food-grade 304 stainless steel and ABS; The rechargeable built-in Lithium Battery is powerful and can help you make things faster and more efficient - You can make a full cup of milk foam in about 15 seconds|【Detachable Design】The two whisk-heads are detachable, so it is easy for you to change, clean and store|【One-Touch Operation and Three-Staged Speed】It is very easy for you to operate our Milk Frother: Just push the switch button once for stage 1 - low speed, twice for stage 2 - medium speed and three times for stage 3 - high speed; If you push the switch button for 2 seconds, the power will be turned off", "user_id": "AGMHHTX7GPWHZAUTEYQOFEEDFMDQ,AEJJGJQCIEPL3ZBNULVUVLVKOYXQ,AE4OWRO7RHZKT3HIJCC6NFJLVADQ,AFNKAJQG5UVDCWBGEMKQPVUCML5A,AFPC2CK5YPZDPLO3ETPC5XMMYIGQ,AGYWGDEV2VA2GXFIOTTX545DCUMQ", "user_name": "123MovieTime,Ravneet S.,Akash,Mohd Amaan,Pankaj,Sajan", "review_id": "R1YXOQ6ZZI33LZ,R17FVMZGPYPOYZ,R23NCERA0R891T,R2UV8DYD8AD2EH,R3C4W7ZA3D6KJV,R1N02TVQHTIFVX", "review_title": "Nice product,Not as effective as claimed, just an average product..,Good Product,bribing people for 5 star rating,Most worst machine i have ever seen,Just wow", "review_content": "Value for money,Not as effective as claimed, just an average product, built quality medicore.,Good, very good product, very easily to use good working. But charger cable is very vary short. I lick this.,the product is that good as the rating show it to be and the reason for it is , that the seller is bribing people for 50 ruppee paytm cash and rating them 5 start , this is cheating .the quality of the product was not up to the mark and it didn't work after 2 days,Worst,Rechargeable....3 speed modes and it gives perfect and creamy froth..value for money 100 percent", "img_link": "https://m.media-amazon.com/images/I/51oN+8Zs5YL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/FIGMENT-Rechargeable-Decoration-ENTERPRISES-A1/dp/B0BM4KTNL1/ref=sr_1_240?qid=1672923603&s=kitchen&sr=1-240"}
{"product_id": "B08S6RKT4L", "product_name": "Balzano High Speed Nutri Blender/Mixer/Smoothie Maker - 500 Watt - Silver, 2 Jar", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances", "discounted_price": "₹2,599", "actual_price": "₹4,290", "discount_percentage": "39%", "rating": "4.4", "rating_count": "2,116", "about_product": "Engineered & Designed in Italy and Made in India: Authentic and superior juicer mixer grinder developed with Indian expertise by Balzano, a leader in commercial and consumer mixing, grinding and blending. The Balzano Nutri Blender 500W is designed in Italy and made in India.|Superior mixing and grinding: Expertly designed system lets you effortlessly mix and grind the toughest ingredients in Indian cooking both wet and dry from turmeric and coconut to idli batter, smoothies and much more.|Commercial-grade components: Powerful 500 watt rated motor with overload protection for continuous operation, BPA free Tritan Jars with Tritan material Imported from USA|Single Knob Operation: Get the perfect control of your Balzano Nutri Blender 500W with just one single knob. Easy twist operation allows you to pulse and blend or grind.|Double safety interlock system: Jar and lid must be securely in place before blade or coupler will spin for a Convenient hands-free grinding|Stainless Steel Blades – Specially designed blending blade and grinding blade makes it easy to get the finest results is very less time.|Leak-proof BPA Free Tritan Jars: Will not leak, crack or dent thanks to robust double ball bearing cutter assemblies, premium stainless steel, and shatterproof tritan lids and locking tabs", "user_id": "AH2AVPUOI6A3TMI5OK6YM4II7HXA,AFY65T5MLGBO4CIMHS2HQASXETHA,AGJ2H3TVS44UM24XPHEXER4AGBLQ,AG7TH75OM43KHSIXXCFBZF63MNAQ,AFQJOOGXRMN263F22QY4LZYCWALA,AGQXUBN7LJR2F4IMZYO6PGOAG3DQ,AHGOLGDHHDPHLQIXJCEWKUMBERUQ,AH2UU7LYVU4G6TLQCQZTE23V72DQ", "user_name": "Trusted User,Pardeep singh,Captain Retail,SIDDHARTHA GOEL,Basa SD,Srini,C R PRABU,Karthikeyan N", "review_id": "R3BIC1KGACDYI0,R1CCVQBZR4Q9VB,RZIRE8MUDAZ82,R1NRMX4OA3SKEO,R1MVQCC2Q3ABZ1,R33SSIWTU7O0HN,R1S3TX7C3GKBWE,R2JTNGSHLWKQHT", "review_title": "Good product  but has a misleading information about warranty,Value for money,4.5 ⭐ Small and Sturdy blender and versatile,Perfect for every kitchen,Awesome Product,Nice Product,Very nice blender,Worst product and service", "review_content": "Product is good, easy to use. But there is a misleading information on Amazon about warranty, In amazon they mentioned 2 Years of Warranty + 6 months of extended warranty. But when i contacted Customer care they told 1 Year of standard warranty + 1 year extended warranty(motor only) on Registering in thier website and only 6 months warranty on Jar blades,Very simple to use,,Easy to use, easy to clean.,The product is good..,Over all Very nice Blender. Easy and convenient to use. I can prepare varieties of juice and it can blend nuts as needed , It Works as expected , Recommended,Easy and quick to use especially in the mornings when there is time pressure,Within 6 months the motor stopped working,then after raised a compliant, they picked the product and checked then informed - technician confirmed that your blade is not in condition to function properly.the blade has 6 months warranty and according to the invoice its out of warranty so you have to purchase new blade from us.---- and they shared one video for checking the product, it's like one road side shop. So Balzano having road side shop as service center 😬", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41+pYgFJpBL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Balzano-Speed-Nutri-Blender-Smoothie/dp/B08S6RKT4L/ref=sr_1_241?qid=1672923603&s=kitchen&sr=1-241"}
{"product_id": "B09SZ5TWHW", "product_name": "Swiss Military VC03 Wireless Car Vacuum Cleaner | Wireless Vacuum Cleaner for Home, Car, Living Room | Wireless Vacuum Cleaner Dust Collection/Lighting Car Pet Hair Vacuum with Powerful Motor", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Vacuums&FloorCare|Vacuums|HandheldVacuums", "discounted_price": "₹1,547", "actual_price": "₹2,890", "discount_percentage": "46%", "rating": "3.9", "rating_count": "463", "about_product": "Small and portable, Dry wet amphibious and Strong suction|3 attachments can meet different needs, Can run for a long time and does not get heated|It can easily clean dust, debris, dog hair, cat hair and liquids|Equipped with a washable filter which has a longer life|Strong suction 120W high power motor with high efficiency dust vacuum", "user_id": "AGQB7NBV5YVA7UFL3TOP7HJ4YOWQ,AEMY4YVWA4HB2I27COY3GVPMIRRA,AGUNZGNJXOCN7LM2OWJY7ZH4EFHQ,AECLAPFHLKPUROW3OP3WUZDWVWIA,AGPSBG5VYA7MJYXUPP4KWCOGVUKA,AE532GAPNMVN65KBRQWSO2D7ALPA,AEWHTLRKEL4VW5AER3AN5FWUWOAQ,AE3USSWYJX32PTYGSCYTNTRCRTQQ", "user_name": "Axis Web Art Private Limited,Lily Shaw,madhab,NCR,Ganesh,Deb,Mona,Naveen", "review_id": "R2DY63XZUWM7SE,R1PZLXZL2ME6XT,R2VZRY72JJLPH3,R15RBOQE6F587T,R1ABQ9XJSD1B9N,RM0HKLK17HGWT,R6D68WWCYXIE6,R5Z1TDHJJTBCN", "review_title": "Not impressed with the purchase,👍,Good project,Gets small clean up jobs done efficiently,Does the job,Works okay,Warranty Card not found inside the Box.,Succetion time could be on the higher side", "review_content": "The vacuum claims to have a \"powerful motor,\" but it struggles to pick up even basic dirt and debris. I have tried using it on both carpet and hard surfaces with little success.Additionally, the dust collection feature is practically non-existent. Despite multiple uses, the dustbin remains almost completely full after each use. The lighting feature is also fairly useless, as it is not bright enough to be of much use in illuminating the areas being cleaned.Overall, I would not recommend the Swiss Military VC03 Wireless Car Vacuum Cleaner. It is a poor performer and does not live up to its claims. There are much better options available on the market for car vacuum cleaners.,👍 good,Good one. Go for it,Cleaning, suction power as claimed.,Suction power is not very impressiveDoes the jobStruggle for duct that sticks to the floor .Visible and easily removed duct is sucked,Works better than the previous ones I bought.,Product seems good but 6 months warranty Card not received inside box. Box was damaged from one side.,Easy to use and friendly", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/418x3St8EAL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Swiss-Military-VC03-Wireless-Collection/dp/B09SZ5TWHW/ref=sr_1_242?qid=1672923603&s=kitchen&sr=1-242"}
{"product_id": "B0BLC2BYPX", "product_name": "Zuvexa USB Rechargeable Electric Foam Maker - Handheld Milk Wand Mixer Frother for Hot Milk, Hand Blender Coffee, Egg Beater (Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|HandBlenders", "discounted_price": "₹499", "actual_price": "₹1,299", "discount_percentage": "62%", "rating": "4.7", "rating_count": "54", "about_product": "The food taste stainless steel whisking head is removable and simple to clean. The frother wand has an easy and pleasant grip and is constructed of food-grade ABS. The internal strong, low-noise motor increases rotation speed without upsetting your family, giving you a peaceful morning.|There are 2 interchangeable, Multipurpose Whisks available. To create the ideal milk foam for your morning and afternoon coffee, Use the spring whisking head. Additionally, the balloon whisking head aids in beating eggs and light whipped cream.|The Built-in 1200mAh Rechargeable lithium battery powers the portable Milk frother, Eliminating the need for additional Batteries and saving you Money. Additionally, a simple Android USB cable that takes 6 hours to completely charge is included.|To Activate the Blue light on the coffee frother, Press the on/off Switch. As you keep Pressing the on/off button, The speed will alternate between low, Medium and High. To get the best frother effect, You may pick from a variety of speeds. Due to the strong motor of the frother, Please put it in a tall bottle or deeper container to prevent coffee or milk splashes.|Advanced mixing pulse technology, Which is less noisy and more robust is used in this milk foam maker. Stylishly designed in black to blend with any kitchen and appear sophisticated. To turn on or off, simply push the button. Foam may be made for coffee all types of Milks, Cream, Cappuccinos, Matcha lattes and hot chocolate with Ease.", "user_id": "AG6AS2KLLZMPPPEKF5RIJXTMA4FA,AEW6BC4YLRYKI5OZGG2TFQSVNPCQ,AGJHYTYSBPEBX6DRHFDVKOPUG3RQ,AHDOOBJBPVJQCWTNVD4L5VIQBBWA,AGXWSSAGJWT437I6SEHW2DBHPAUQ,AHP75RDBGYFPLYD5NVTHZMNJUOAQ,AFBWWOUHEYFHDWJOE42DN5YWO2MQ,AHHRYTCXJYJCRHFUK2EPOG7I3CHQ", "user_name": "shammi,Rippy Mittal,Kabeer,Kush,Vani Prabha,neha,Reena Chahar,Rameshwar", "review_id": "R1M11VMLH6I3TN,R2OLOOGNHQ37ZA,R3PIVKT8BNMA4G,R3IEB79VMJ4KUB,R2FW55EB4WH4HM,RKHYI4QXIDG0B,RR30YFP5QKZZZ,R13ATADDWQX8CT", "review_title": "Little kitchen helper,An amazing product,Very good product nice to use,Handy gadget!,Easy to use and carry Great product 👌,Best product,Light weight,Will definitely save your time....", "review_content": "The first time I tried it send the eggs and the milk cream all over the kitchen. Big mess so i suggest that you try it with water in a cup or bowl to get the feel of it. Then you will fall in love with this gadget. Easy to clean just rinse under the tap. The charge holds up just about for a job so you don't burn or heat up the motor. Frothing for a cup of coffee or creaming eggs for a fluffy Omelette is easy peasy. Flimsy for ruff use but hey you can't complain for the price your paying.,This is nice for people who wishes for a durable device to blend and whisk their eggs , coffee, milk , etc for a luxurious vibe. Nice as it doesn't operate on battery but electric charge. I feel the price might look steep, but otherwise the product is a 10/10,Good product and easy to use and it very reasonable price I loved this product but it think that they have to increase the capacity of battery power except this all is good,It's a good handy product. Works well and is easy to use. It will definitely make your work in kitchen simpler.,The product was easy to use and reachable in few minutes,Useful product very good 😊,Easy to use excellent,Value for moneyNd easy to use", "img_link": "https://m.media-amazon.com/images/I/41714O1hnmS._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zuvexa-Rechargeable-Electric-Foam-Maker/dp/B0BLC2BYPX/ref=sr_1_243?qid=1672923603&s=kitchen&sr=1-243"}
{"product_id": "B00P0R95EA", "product_name": "Usha IH2415 1500-Watt Immersion Heater (Silver)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|ImmersionRods", "discounted_price": "₹510", "actual_price": "₹640", "discount_percentage": "20%", "rating": "4.1", "rating_count": "7,229", "about_product": "Immersion Water heater; Wattage: 1500 Watts; ISI Certified ; Heating Substances: Beverages, Water ; Power Requirement: 230 - 250 V, 50 - 60 hz ; Thermostat: Yes. 15 minutes of uninterrupted heating and you are set for a warm bath|Power Socket : 3 Pin plug , Inner Heating Element: Copper; Outer Body Material: Bakelite|Product Dimensions: 30.5 Cms X 9 Cms X 9 Cms|Warranty: 2 years on product.Country of Origin: India|Included in the box: 1 immersion Water heater|Copper tube element with long lasting nickel plating for longer element life|Specially designed heating element for quick heating", "user_id": "AECYTJD5MC5XGEX75UZY6T64WX5A,AH2XKE5NKEOBKOJRDJIPNYQRLCTQ,AEWVKFD6YXNBTHT7Q7CPKAPC4MKA,AGGDIBNZQHVRAJZXVXAHKBV2Y4RQ,AELBP2ICNLTZNQ7LRFSLDTGXC2IQ,AFGCWE3XJSFV3SHN5EU2N5VXWAZA,AH44PHVDPA7E2JJWAMVD7ZRPUFEQ,AFVYZFTM3SUEGYESW55OJNGUAJVA", "user_name": "Durgaprasad g.,S K Hazra,Niraj k.,Sapan,Amazon Customer,ulavappa s asundi,Hitesh Nayak,Lakshmi S", "review_id": "R2QFJ90TFMGE4S,R35KQ2BQ7TKJS8,RBD5L7F8BAR71,R1ZYMEO92ST8E2,R1DLFFF7N1G9JT,RYJAAGZ3I6ERK,R33ND5PEC4ILD9,R2N2T71KGYJX0", "review_title": "Good water heater,Good quality,Good products,Good,Good,Good product,Good product,Brand value", "review_content": "Nice product & good quality,Value for money, as per description.,Very easy useful,Good product,Product is good,Good,Good,Best to buy under 500. Comes with warranty card. Cable Quality is good", "img_link": "https://m.media-amazon.com/images/I/41a-huLVEIL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Usha-IH2415-1500-Watt-Immersion-Heater/dp/B00P0R95EA/ref=sr_1_244?qid=1672923603&s=kitchen&sr=1-244"}
{"product_id": "B07W4HTS8Q", "product_name": "ACTIVA Instant 3 LTR 3 KVA SPECIAL Anti Rust Coated Tank Geyser with Full ABS Body with 5 Year Warranty Premium (White)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹1,899", "actual_price": "₹3,790", "discount_percentage": "50%", "rating": "3.8", "rating_count": "3,842", "about_product": "Manufactured under the guidance of highly qualified engineers to ensure the life of product, Note: Self installation and product will be repaired in our service center.|High quality thermostat to prevent from over heating.|BIS approved ISI specification on element to ensure the long lasting life.|Extra heavy duty element for extra heating and durability, 1+5 year warranty on this geyser (1 year complete and 5 year warranty on tank)|Special anti rust coating on tank and geyser to save it from rust or corrosion. (for long lasting life)", "user_id": "AH4ZZLZF5JO74MJ3E6WURPHAOKVA,AE4IRBIAL6D4FWUJDI7G3TDMZEZQ,AESVEGOP7LNFGOWRU36WVYYSKKKA,AH2S7L7OVGU76T5ASFGR72DKZI4A,AFR7VQD5YGYX2A73CJ46ZKRNAKBA,AE5TFI4AZKIO5BARSWZQCPMUQMTA,AGEQFLTLLFRSOOMQH4DGWAPT4YWA,AE5ZOLUY3TPAUBD2KP2BEG2KKC7Q", "user_name": "Gajendra Kumar sharma,Gagan,Lavi,Priyesh,Suketu Bhatt,Krish,varsha pandey,PRABHAKAR DESAI", "review_id": "R371P01X49V8QV,R3MMP5A1MKKZZP,R1VI6TV1VNY0H6,R2MLAH3IBE9WB6,R2CGNL0P1F07CF,R1SLP1FDAIRDIA,RTCE1LHDI5MSC,R2U1JC1BKWWUFG", "review_title": "Value for money,Goods,Pipe is not dilevered with gysure,Product is good but warranty service follow up is hectic & customer care service is pathetic,Good cooling, Fit finish not up to mark.,Value for money,good one for small town , high wattage  creating problem in metro apartment,Working Good", "review_content": "Value for money,Like,Okk,Product is good but within 2 years stopped performing & customer care also not supportive,Cooling is very fast but overall fit finish not good. Plastic tank covers not locking and was in open condition.,Except customer support remaining all it's good. Value for money. Easy to install.,good one for small town , high wattage  creating problem in metro apartment,The capacity of the produ t is to low", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31RwSnyZZ+L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/ACTIVA-Instant-SPCEIAL-Warranty-Premium/dp/B07W4HTS8Q/ref=sr_1_245?qid=1672923603&s=kitchen&sr=1-245"}
{"product_id": "B078JBK4GX", "product_name": "Havells Instanio 1-Litre 3KW Instant Water Heater (Geyser), White Blue", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹2,599", "actual_price": "₹4,560", "discount_percentage": "43%", "rating": "4.4", "rating_count": "646", "about_product": "Type: Instant ; Capacity: 1 Litre; Wattage: 3000 Watts; Pressure: 6.5 Bars ;4 Level Safety : Thermostat, Automatic Thermal Cut-Out, Pressure Release Valve and Heating Indicator|LED : Temperature Sensing Color changing LED Indicator for real-time hotness of the water|Outer Body: Rust and shock proof Plastic outer body for long life|Heating Element : Copper heating element offers superior heating performance with its excellent resistance to both oxidation and carbonization at high temperature setting and resists corrosion against extreme and hard water conditions|Inner Tank : Extra thick Stainless Steel Inner tank of superior 304 Level grade​|Warranty: 5 years on inner container, 2 years on Heating Element, 2 years comprehensive warranty|Product Dimensions: 20.5 cms x 29.4 cms x 18.5 cms", "user_id": "AH6MHH7KNPHZPN7D5YSSWDQITIMQ,AGLWXRPJ6PGDPIN7URZP2525SAHQ,AHFGSNUXSEGQ4CW3BIGW2ZPZUC4Q,AFAGO45Q2ZA4UJ3XXHEWFROOKBRQ,AFS6ULEVQVU2PN6FWRWWBKKFJCLA,AGDMSEPDHPK3IT7Q737N6Y233LVQ,AGRGLAA6BU4VXMEYJWIDRM5WLNMQ,AEODRIKLIM5JTCDNMGSLTRSZFNVA", "user_name": "Dev Shah,Amazon Customer,nidhi sharma,Amazon Customer,Kushal,I wish i was,Ranjeet S.,Amazon Customer", "review_id": "RGW48SIV6YSO8,R3UPD9POT3K5MD,RRT9OUXNV4IJU,R3JP8EI4SKB6TT,R36P6ISAFGCWW9,R1M33EDRD5XY8P,R19ILBYMSDBQAC,R2GS46H4UYEI4U", "review_title": "Good product,Excellent product,Good pruduct as of now.. 👍,Best product,Happy with the product,Compact product,Must buy item.,Havell’s Instant Geyser", "review_content": "Havells water heater,Good product with reasonable price,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51QHUZvZxrL._SY88.jpg,Good product,Very excellent product. Nice compact and stylish. Coming to purpose it is meant for serves well as on it. Same day installation by havells technician. Works like charm so far.,Very compact and well designed product . Water flow is slow but good for a 1L tank .They give 1 year extra warranty if we write 5 star review, So giving only 4 stars .Maybe most of the 5 star reviews are only for extended warranty .Amazon should act on this kind of seller .,IT is excellent designed by Havells. Free installation was done by Havells on very next day of purchase. Used for kitchen, performance is outstanding. Value of money.,The product was delivered within a day and technician came the same day to install it. The product is very easy to use. Loving it!", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31991seDfcL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Havells-Instanio-1-Litre-Instant-Geyser/dp/B078JBK4GX/ref=sr_1_244?qid=1672923605&s=kitchen&sr=1-244"}
{"product_id": "B08S7V8YTN", "product_name": "Lifelong 2-in1 Egg Boiler and Poacher 500-Watt (Transparent and Silver Grey), Boil 8 eggs, Poach 4 eggs, Easy to clean| 3 Boiling Modes, Stainless Steel Body and Heating Plate, Automatic Turn-Off", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|EggBoilers", "discounted_price": "₹1,199", "actual_price": "₹3,500", "discount_percentage": "66%", "rating": "4.3", "rating_count": "1,802", "about_product": "It comes with stainless steel body and flat heating plate which helps in boiling up to 8 eggs at a time within minutes.|3 variety of eggs soft/middle/hard|Boils 8 eggs at one time|4 Food Grade PP material Poach egg cups/tray || Automatic off feature|Egg ready indicator and water dry cut off|Steaming rack for easy cleaning|3 water levels", "user_id": "AH3B5DMNZY5TWDFIRV76LBCK7BOA,AG2CU4JHAZYEWQCC7KV4KBLYDT4Q,AHT2V4MYATE6F4S62WMMNUAFTA6A,AHJU5CZJ7KQTPDEKA2URK6YC573A,AHVIOH2Z7CKWOZFK6ILKPPWOAUEQ,AFXJHAXEGOGYVUKP4HIERLJCGSRQ,AEATMWNUKI5O67DEVGKUJBZDATIA,AEJVMKYFUBDOVBR6ZEUPKQMWCV2Q", "user_name": "Virjesh,Manish Soni,MUKESH THAKUR,Abhijit Walvatkar,Indrajeet Chauhan,Ashok Abraham,Anushruti,Sravya", "review_id": "R1V0UIG80MWSGS,RZNM6HFXBWRJW,R1D9GBPIVP6Z8M,RL8HUBRTJ3LLL,R39RGFCIUFXU4H,R3S475ZLFA6K5C,R3RBBXW4E5LKWH,R1PZJRA2K6Y7HE", "review_title": "Easy to use, works really well.,Good experience so far,Good,Handy product,Looks great..,convenient and efficient to use,Time saving and effective.,Good", "review_content": "Works really well, perfectly boiled eggs without cracking eggs which happens in gas stove cooking and very easy to clean.,Build material is decent. Issue I found a little was with cleaning the heat pan. But it's so much better than the half price cheap ones we buy,Good product,Very easy and hassle free use. Works exactly as mentioned in the product description. Great for those who boil eggs regularly. This feedback is based on 2 months of use.,Liked the design...boils eggs effortlessly,compact and easy to use. Setting available for boiling eggs. Good product.,I love the ease with which I can boil eggs, without wasting much time or money on gas bills,Good.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41LLX-A7eTL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Lifelong-Boiler-Poacher-500-Watt-Transparent/dp/B08S7V8YTN/ref=sr_1_245?qid=1672923605&s=kitchen&sr=1-245"}
{"product_id": "B07H5PBN54", "product_name": "INDIAS®™ Electro-Instant Water Geyser A.B.S. Body Shock Proof Can be Used in Bathroom, Kitchen, wash Area, Hotels, Hospital etc.", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹999", "actual_price": "₹2,600", "discount_percentage": "62%", "rating": "3.4", "rating_count": "252", "about_product": "Just put it in the water tap and enjoy continuous flow of hot water. Get running hot water within 4 seconds of operation with it's 3 KV ISI marked heating element. Fills 20 Ltr of bucket within 5-10 minutes|This is portable, eazy to install, fit and compact. Can be used in bathroom, kitchen, wash area, hotels, hospital do-it-yourself instruction booklet it can be installed without addition plumbing and fitting|Specifications · Body - Poly polypropylene(Shock proof) · Heating element - Tubler type(3 KVs), ISI marked · Thermostat - Copper, ISI marked · Cable - White, 1 Meter, ISI marked · Pin-top - 16Amp, ISI marked · PVC pipe and nipple|Can be used in bathroom, kitchen, wash area, hotels, hospital", "user_id": "AFM3U2B3HNE4E5JV4Z6K7WD3LRUQ,AGQAYI2H5TL53UE55XVUIDAMSGLA,AE42BCXRYURRUEFT4LVAFCIOCDDA,AGIRPVIAHKBO5TNOXFX6RU5NFBUA,AEQUMN77VINPOKTGOIRX6PREJSNQ,AFWNCMMSDZDDVHVBKKDK4ZK4HILA,AHCXXOQVLFSHJOIKXMOHUSZJSDOQ,AGWU3MU6IYK77TJSYT5UIOD2IC3A", "user_name": "SATENDRA SAINI,AKSHAY KHOWAL,Daksh,amar,Veera,Nand Kishore Sharma,Tanvir,Rajesh Kumar", "review_id": "RCFFXI7HE5S1O,R3DIB02TOTSYSE,R2LUFMT90IY4QA,RXT32QTE7RUQ1,R2HOQ536IJUJM4,R1DSBS8TI7TATL,RWQ5WXJM5SYQM,R1QYJE3308FNC3", "review_title": "Current issue in output water,Value for money,Great Product for Kitchen,Bakara product please don't purches,Awesomee,It can be hanged any where it is a portable  water geser.,very bad product not ,work even 3 months, as well as seller is not supporting in warranty,Good equipment", "review_content": "Current problem in water,I would say not a bad purchase. As the size is small it can hot hold lot of hot water but still very handy for kitchen. If used with very moderate tap speed, it can give you moderate warm water continually which is a plus. Should give it a try if looking for cheaper and best option for kitchen use.,It's very easy to install & sufficient warm water for kitchen . Sufficient warm for bath also . Value for money. First day usage review.,The product was very bad because curent pass in body so don't purches this product,The portable geyser is awesome and i used today the whole day  and in 9 degree temperature if u get continous running hot water in kitchen nothing is best ,i really really loved it,must must purchase it,thank you so much for such a useful product👍👍😊😊,Easy to hang.It can be hanged at any place.,very bad product not ,work even 3 months, as well as seller is not supporting in warranty,I liked the size. It is light and easy to install.", "img_link": "https://m.media-amazon.com/images/I/41OXzplcjtL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Indias-Instant-Bathroom-Kitchen-Hospital/dp/B07H5PBN54/ref=sr_1_246?qid=1672923605&s=kitchen&sr=1-246"}
{"product_id": "B07YCBSCYB", "product_name": "AmazonBasics Induction Cooktop 1600 Watt (Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|InductionCooktop", "discounted_price": "₹1,999", "actual_price": "₹3,300", "discount_percentage": "39%", "rating": "4.2", "rating_count": "780", "about_product": "Easy to Use 1600 Watt Induction Cooktop with Micro Crystal Glass Induction surface;|Not suitable for cookware with curved, uneven or rounded bottoms or made from ceramics, glass copper bronze and aluminium. Only use flat bottomed cookware made of iron or steel with diameter between 14.5 to 16 cm and bottom thickness over 1.5mm|8 Stage power setting with push button control and LED display|Tested in an international lab with international quality standards for safety and performance reliability; ; Packaging tested by Amazon's international packaging ISTA-6A standards to ensure product reaches you safely|Comes loaded with 6 preset Indian options and timer for up to 3 hours|Comes with BIS certified plug and cable for extra reliability|Comes with enhanced safety features like \"Auto Standby\" in case no pan is kept, residual heat indicator and fan for auto cooling (fan continues working to cool down residual heat even after operation is stopped)", "user_id": "AE5DRZFQN56UNHWLA6RSKDLDXU3Q,AH7G7F5V6NZQTXGNBULKUK4X6UXQ,AEYISFG3PXSZTUJS67PADHKW55NQ,AFT2SBIE45E3P46X2VFYXXR7JTDA,AETRLDW2AUAQJPHLEUIYFEZBBU5Q,AGOXIKCKLMADHJXOXLKL2XKPA3BA,AHTDOMYCLQT2RTXY3HVZBMCDCI5A,AEUMGPKAO6GBV56NJMU4XM5S76EQ", "user_name": "Amazon Customer,Ishtiyaq Ahamd,Roy Tom,THANGAVELU,Gopinath Behera,Souravv Garnaik,NC Mistry,MOHAMMAD I.", "review_id": "R2PK3LURGV7XMK,R17NQ1RVQ187WB,RBRUS2N936FP7,R32Z3826SCWBZC,R3N8TTZEOCVIC9,R397WT8ZINS4R3,R38K7QGV2GYAXT,RL5X2D0KMAID9", "review_title": "So far so good,Good,Good quality product,Fully satisfied.,Product Is Nice ,And Easy To Use,poor longevity,A good induction cook top,Good.", "review_content": "Value for money,Good product and very good working,Finally, I got the right induction cooktop I am searching for. Amazon basic is the best in class. Fast heating, no words. Superfast delivery by Amazon.,I like the various temperature controlbuttons.,https://m.media-amazon.com/images/I/711QV0gr-vL._SY88.jpg,works fine only till warranty period... immediate poor functioning after that,This Amazone brand induction cook top is of good quality and easy to use. Price is very reasonable.,Good for light cooking..", "img_link": "https://m.media-amazon.com/images/I/4153SQc2VYL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AmazonBasics-Induction-Cooktop-1600-Watt/dp/B07YCBSCYB/ref=sr_1_247?qid=1672923605&s=kitchen&sr=1-247"}
{"product_id": "B098T9CJVQ", "product_name": "Sui Generis Electric Handheld Milk Wand Mixer Frother for Latte Coffee Hot Milk, Milk Frother, Electric Coffee Beater, Egg Beater, Latte Maker, Mini Hand Blender Cappuccino Maker (Multicolor)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|HandBlenders", "discounted_price": "₹210", "actual_price": "₹699", "discount_percentage": "70%", "rating": "3.7", "rating_count": "74", "about_product": "Multifunctional :- This portable espresso maker can be used to make a variety of drinks like latte, cappuccino, hot chocolate, Matchaetc.Not only that but it also can be used for making protein shakes,cocktails and beating eggs.|Quick and easy:- It is absolutely easy to operate this chargeable coffee beater electric makes your drink creamy and foamy in just a matter of a few seconds. The quality of your lather may depend on the kind of milk you’ve chosen. A low-fat milk wouldn’t create much of lather than a full fat milk would create. Therefore, to get the best results you are highly recommended for the usage of full fat milk.|Safe and healthy: The material used to manufacture the “blending head” and whisk of the machine is made out of good quality Food grade stainless steel which promises safe blending and longer durability.Built with a simple yet stylish body design makes the cleaning job a little more easier and faster for you. The method is simple. Once done with the blending this butter milk mixer can be washed away easily with warm water and left away to dry.|Handy and portable:- Builtwith good quality ABS plastic material, the handle gives you a good grip. This beater is handheld and portable from one place to another.|Long durability:- Present with the automatic shut down feature when over heated, this beater promises a longer durability.", "user_id": "AGCIDEDP2GEN4VHVU6CCSRL6RF6A,AEON6RS4RYLAMFJWOQSJWDJBIQMA,AFWWYJNRHXQTUZFSW3YGSFNG7AHA,AFPPBTAXYWSCAUMZ7HHCFMF4PHFA,AGOI7ZK5ZIOWDYNLON5YENWZNQDA,AHLUGCZZZXHB67SYPOESH2HT4J3A,AEAZGAS5S5WBPYJUXAAJLS6HILEA,AEXK5CI44U7BRRUHLFNCWA5DIZGQ", "user_name": "Syed sarfarazuddin,Chetanya Arora,Taniya Baidya,priyanka jaisal,Gagan,Govind Tyagi,Rahul,Manju Sharma", "review_id": "R3V76M88BH6XO4,R11F7S14S5Z1DR,R2K6M2964OJY62,RZQSRHICMZS4I,R3QJ8DYTSW3N7V,R6223NK3BQ0MR,R1Y2FUQ6U2C4TT,R3DARIZBJ8DE4P", "review_title": "A little weak but over all good,Value for money!,Not working,Nyc product,Good,Average quality product,Very good product,Affordable", "review_content": "It's good but it's a little weak at the end also, sometimes starts on its own with batteries without touching the button,I love it! So good for my go to morning coffee... It works just like milk frothed of a real coffee machine,Not working after some days,Good quality productNyc coffee beater and very easy to use.,Good quality product at this price,Easy to available in market at 150. Overpriced and average build quality.,Value for money product this product is quite good and effective I love it's quality,Mixes well, product quality is good at this price", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/21UJ6oKwnoL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Sui-Generis-Frother-Electric-Blender/dp/B098T9CJVQ/ref=sr_1_248?qid=1672923605&s=kitchen&sr=1-248"}
{"product_id": "B01KCSGBU2", "product_name": "Philips Air Purifier Ac2887/20,Vitashield Intelligent Purification,Long Hepa Filter Life Upto 17000 Hours,Removes 99.9% Airborne Viruses & Bacteria,99.97% Airborne Pollutants,Ideal For Master Bedroom", "category": "Home&Kitchen|Heating,Cooling&AirQuality|AirPurifiers|HEPAAirPurifiers", "discounted_price": "₹14,499", "actual_price": "₹23,559", "discount_percentage": "38%", "rating": "4.3", "rating_count": "2,026", "about_product": "Philips is the No.1 Brand in Air Purifiers in India (Source: Euromonitor International Limited; Consumer Appliances 2020ED)|VITASHIELD INTELLIGENT PURIFICATION: Automatically senses air quality and removes 99.97% airborne pollutants as small as 0.003 microns, 800 times smaller than PM 2.5|FAST PURIFICATON: Purifies a standard room in just 10 minutes with a CADR of 333 m3/hour (Standard room size is 18 ft by 12 ft with an 8 ft ceiling height)|IDEAL FOR MASTER BEDROOM: Air Purifier is recommended for an area 269-409 sq ft|WARRANTY: Comes with 2 years worldwide warranty & free home service*.|AIRMID CERTIFICATION: Removes 99.9% bacteria and viruses, tested to remove airborne H1N1 virus|ECARF CERTIFICATION: Removes 99.99% pollen and house dust mites, Allergy friendly quality tested by ECARF", "user_id": "AGJPGWOXW4667QJXNDCLUWWVZTBA,AE2MJ6XVIE6OPT647IMTCCL234MA,AETN24LLRWGF5EUGDS4FWN4E7REQ,AH7J22T7AJRXCFHZF7RUDX63Y45A,AHLIRBDDRJKUSNTL66OD3252EYZQ,AHGKNJU3CXZ5GCOAJA7JCXNZ5RCA,AEUDZWXMXFOP2BI5WVK4S524LYKQ,AGQTOEYC5PUD7R5RGXHRNFQ3BFMQ", "user_name": "Prasad Kulasekar,Griswold,Balasubramanyam,Akshay,Amazon Customer,Anup,Shekhar,Baldev Dudani", "review_id": "R18ZEYSRNCERR7,RZSF37HFFK0LN,R39D1A1FW10AMZ,R2KMCPSQCAAIEI,R31QEV79S8TQLC,R3CCT4DZ7PNCLT,RI7WWH1O32LTQ,RN9O9A0ARA83", "review_title": "Good choice,No noise and all clean air. Very effective and the family noticed an improvement right away,Good product and easy to install,Go for it!!,Happy to use,How can I contact the manufacturer,Good,Excellent product", "review_content": "After going through many reviews and checking multiple brands, decided to settle with Philips AC2887/20. Not sure how accurate is the PMI number it is displaying, but we can feel a noticeable difference after using it for over a month. Cleaning the filters also easy. Overall I'm happy with the product.,Highly recommend, so much so that i bought another one. It's been 1 month and just had to wash the first filter once and works very nicely....everyone in the house is breathing nicely and clearly,Monitors the pm level in the Air exactly. When I installed it in the kitchen, the pm level went up as soon as the cooking started and the purifier automatically switched to higher speed and brought it down. During KARTHIGY, when everyone was cracking crackers the PM level went up in the purifier indicating increase in air pollutants,Great product, no issues and work very efficiently,Easy to install, no noise. And air Clean quickly.,I did not receive an Invoice and there is no serial number marked on the product. I am unable to initiate any request with the Manufacturer.,It reduces pollution indoor but take time,Good purifier with almost no noise and Good display of impurities in air", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/317ja9m3iHL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Philips-AeraSense-AC2887-20-Purifier/dp/B01KCSGBU2/ref=sr_1_249?qid=1672923605&s=kitchen&sr=1-249"}
{"product_id": "B095XCRDQW", "product_name": "Esquire Laundry Basket Brown, 50 Ltr Capacity(Plastic)", "category": "Home&Kitchen|HomeStorage&Organization|LaundryOrganization|LaundryBaskets", "discounted_price": "₹950", "actual_price": "₹1,599", "discount_percentage": "41%", "rating": "4.3", "rating_count": "5,911", "about_product": "Crafted with care|It is designed keeping your choice and requirement in mind|Hassle-free usage", "user_id": "AHAAD3NPHK6M6MFXLOIIVQSQQBGA,AF3VI65IPCL746N6XDAW4FYVH7CA,AGG2SNNR26KGUIFF6ZH32A3WZ2AQ,AEOHEAX7CMT7YK37DNAOQVUAZZ6A,AHEBE2B3ZMN7PAIBT73AZT4IS32A,AFE5CGE2HOEQLDT4X763Y7SR2OCA,AHXWSKIC3GD2ZFTM5JW7ANXAVSIA,AHUQZSYH2QVXKCFOFZAEQ5XOJTVA", "user_name": "Vysh,Suryakanth raju,VP,Ashi,Amazon Customer,Nishu bharti,Aish,Sarita Verma", "review_id": "R35LX6CSWTNYSC,R1CUUHI7XOHG6J,R1GBNN50EN0PFS,R3NOMC4L51HI68,R1YMZK0C9NM9TJ,R17GMX3E73L0PD,R3T6DF21D1TVYC,R37MXBYQP6B9UG", "review_title": "I would have given it 5 stars.. but..,Quality product,Good product,Good,Good capacity but looks a bit cheap,Medium size,Affordable,Basket is good, problem is with the lid.", "review_content": "I was very impressed by the quality of this basket - I found it sturdier than Cello brand's laundry basket. I ordered one more basket in black but unfortunately the finish of the product on the inside wasn't smooth. I wanted to store washed laundry in the second one but the basket's interior didn't have a smooth finish - had scratches and plastic sticking out that could damage delicate clothes. I returned the second one. I am deducting a star because my second purchase experience wasn't good. I might buy the same product again in the hope that I get a product of the same quality as my first purchase.Update after ordering the basket for the third time - The third basket's rim was bent so I couldn't fit the lid but the baskets finish was perfect. I persevered and requested and exchange and on the fourth attempt, I finally got a good quality basket for storing washed laundry.,Plastic quality is good sturdy build overall good purchase reasonable pricing,Cover could be fit better,https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/613anWf4JBL._SY88.jpg,Good capacity but bad finishing and bit pricey. Cheap quality too.,Good but not any packing,It does the job. The capacity is huge and you can easily store 1 week's laundry. The top is detachable,The lid of the basket is not that strong and ite just comes out all the time and I have to fix it again and again.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41svI04SS1L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Esquire-Elite-Laundry-Basket-Colour/dp/B095XCRDQW/ref=sr_1_250?qid=1672923605&s=kitchen&sr=1-250"}
{"product_id": "B09CTWFV5W", "product_name": "PHILIPS Air Fryer HD9200/90, uses up to 90% less fat, 1400W, 4.1 Liter, with Rapid Air Technology (Black), Large", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|DeepFatFryers|AirFryers", "discounted_price": "₹7,199", "actual_price": "₹9,995", "discount_percentage": "28%", "rating": "4.4", "rating_count": "1,964", "about_product": "Philips Airfryer HD9200/90 (Large, 4.1 L) lets you cook great tasting food with up to 90% less fat*|Patented Rapid Air technology with unique starfish design pan ensures evenly fried results without flipping the food.|Fry. Bake. Grill. Roast. And even reheat!|60 minutes timer with auto off. Wide temperature control from 80°C to 200 °C.|Extra-long 1.8 m cord length for easy placement in your kitchen.|Dishwasher-safe and Easy-to-Clean.|Not just fries, now make aloo tikkis, roast chicken, grilled vegetables, chocolate cakes, muffins and many more dishes.", "user_id": "AFCPQ5WS6XHYA7PKRTOCC7TRJWHA,AF7NY3RD3X3ZTH7D5TZ74YPNJW4Q,AFLBPRZRXYFOHOTCHPTFLPZCQOWQ,AESL35HFDQN4QCKVN7DNGPTWU5XA,AGCKE42DFD6N3V5WX7A7XYTQ7Z2Q,AFNDA4W6XZFIIS5RLQWV27EYZIQA,AGOIFSKTNQK2PNBLRMNUWFSKXNEQ,AFQOJDCRZINCCHXU37K6DCIB6SYQ", "user_name": "Gopal Krishan,mubarak,Don Quixote,Aman Agarwal,gopalbhaduri,Neetesh Singh,RAJDEEP R.,k ramesh", "review_id": "R374MN6Y3HGVY6,R2TDXG58UA6LMS,R2KZ02C2SJ7WKJ,R2NOIFFPNAB8AD,R3JX5JS9CX0TLE,R3LZ0DBRARBRZO,R3DIAJAW70VG81,RMQ3KAMNNQ2X2", "review_title": "Not for people who prefer taste over health.,Good product use easy,Not for big families,Good Purchase,Definitely a buy,ONE OF THE BEST BUY EVER....,Cooking awesome...,Sleek and elegant.", "review_content": "You have to get used to changes in flavours as compared to fried foods. Device is easy to use and clean.,Best product for chicken roast,Good product but the capacity is sufficient only for nuclear families. And you will need to cook/ grill 2_3 times, can't do it at one go.Damaged packaging, so check thoroughly before use.The product us useful beyond  a doubt, needs very little oil.,Now, it's been 1 month for using this Airfyer and overall experience is good. Buy only when you are healthy diet specific and nonveg would be a plus as for veg , it could be limited dishes you can prepare.,Very good product👍,ONE OF THE BEST BUY EVER.... AND OF COURSE THE BRAND,Made by air fryer...awsome product.,Quick to use and worth the money.", "img_link": "https://m.media-amazon.com/images/I/31rniMTmdkL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/PHILIPS-Fryer-HD9200-90-Technology/dp/B09CTWFV5W/ref=sr_1_251?qid=1672923605&s=kitchen&sr=1-251"}
{"product_id": "B0B7NWGXS6", "product_name": "Havells Bero Quartz Heater Black 800w 2 Heat Settings 2 Year Product Warranty", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|ElectricHeaters", "discounted_price": "₹2,439", "actual_price": "₹2,545", "discount_percentage": "4%", "rating": "4.1", "rating_count": "25", "about_product": "Two quartz heating tubes|Carry Handle For Easy Portability|front grill for safety|power settings-400w/800w|safety tip over switch|rust free stainless steel reflector", "user_id": "AFM4A33L64TPLILW4OHTSKRZR3NQ,AH6NEABVASSTXS6RPML55O5X2L3Q,AEIPEUCNAW5ORUCK4KND5X5I3DUQ", "user_name": "Amit Sood,Tarun Mohan,Shravani Raj", "review_id": "R2TWO1XR7BGSHO,R1683BA4KIYFUI,R2BTLKVDN71QOW", "review_title": "Good product and budget price,I purchased this product from shop for Rs 1650 including everything so why to buy from Amazon,Worst product", "review_content": "Like and happy,,Please don't buy this heater, it stopped working in just 2 days.... And not able to return the product also... Waste of money", "img_link": "https://m.media-amazon.com/images/I/41EQwIB-rKL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Havells-Quartz-Settings-Product-Warranty/dp/B0B7NWGXS6/ref=sr_1_252?qid=1672923605&s=kitchen&sr=1-252"}
{"product_id": "B07DZ986Q2", "product_name": "Philips EasyTouch Plus Standing Garment Steamer GC523/60 - 1600 Watt, 5 Steam Settings, Up to 32 g/min steam, with Double Pole", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|SteamIrons", "discounted_price": "₹7,799", "actual_price": "₹8,995", "discount_percentage": "13%", "rating": "4", "rating_count": "3,160", "about_product": "Philips EasyTouch Plus 523/60 Standing Garment Steamer for easy crease removal from your special-occasion and difficult-to-iron garments|Helps to kill bacteria, easily de-wrinkles even intricately designed ethnic or formal-wear through its powerful 1600W wattage and continuous steam delivery of up to 32g/min|Ideal for use on many fabrics like heavily embroidered garments, versatile designer wear, occasion-wear, heavily layered or pleated attires, and also men’s jackets or kurtas|Steam settings help in crease removal from even thicker garments|Protect your cherished outfits as it guarantees no-burns due to its steam mechanism, quick and ready for use in <1 min|Comfortably hang garments like gowns, lehengas and kurta with its adjustable doubles poles that allow better stability and various height settings, GC523 comes with support mat for extra crisp results|Care for your clothes season after season, with easy de-calc feature of the large 1600ml, transparent water tank which prolongs the steamer’s lifetime", "user_id": "AEZPN2FXQGKONKQKDSREETOWTLGQ,AGHXXH2FWY3YF4MB2EKX6RFLFBUQ,AHNMAYXQ64DDKZWPIIHOFX7UM7YA,AG6QCT5IZMD5I4TMLCLTKM3LQU6A,AFIQ2NB5ZBTPFZ5JYIRHDLJGBQKQ,AFTCFSIJBGKG45IQBJ4Q6WUUYGRA,AGLB4RAINP47QIOGR6K3BVGB6PVQ,AGIMXHQLEPJG6FIWJMBJLC7MVK3Q", "user_name": "Q,VINU R.,Biswajit Choudhury,Nishi b.,Dr Kushal Mital,P Yadav,Kindle Customer,Umashankar", "review_id": "R34X9P95PZ5OX2,R2W61LLRNDPTLV,R1MD9WI5AP8ZQV,R37H76FMO5LQWM,RQ8LTTD9ZAD0U,R2EWX5R32OVIH5,RU43GXLFBAS8O,R1LF03KFL5GO3P", "review_title": "Takes space and not convenient if in a hurry,Not useful for Cotton, Linen and thick materiel fabrics,Received broken,Only for lighter fabric,There is a learning curve, it may take 2 people to do it,It looks like an imitation product , pieces don’t match properly and some look very weak,Excellent product and received in good condition,Not great", "review_content": "Takes space and not convenient if in a hurry. The handheld model would be better suited and more useful for frequent use.,I used this product once after reading the manual. The first impression after using it on 3 cotton shirts without starch and one pant is pathetic. None of the shirts got wrinkle free on full steam, hence you could guess what it would be in trousers.Later I found it is satisfactory on silk, nylon shirts, T shirts etc but none will get an iron effect. Wrinkle will be there in small amount and a slight wet feel when the steam cool down but it will go if fast.It is mainly useful for ladies who wear embroidered nylon, silk materials, stone work fabrics, etc etc men who use T shirts and nylon rich trousers. Otherwise, don't even think of buying it. In my case, I use cotton whites and white trousers mainly at office as I am a lawyer. Hence, for me, it is totally useless. No females at home and hence, it is another product that grab my home space.Regarding comfort while using it, I would say, I am totally disappointed as the board behind it is not much of use while using g shirt because of its size which is not that long. The last two button downwards will always hard to press it to board and we have to take the hanger hold high on one hand and thus another difficult part as the nylon material needs another hands to hold it firm. Secondly, the long full sleeves are totally difficult to do it though steam is applied, the wrinkles won't go easily add we are not pressing it to board and it will always go here and there. The top stand is a hanger shaped but the clips attached as useless as the board comes in between. For trousers, the product itself won't work good. So if we use the hanger it comes with, you need to put the switch off, place the handle in slot, take the shirt out and then only we can use the back side to steam after waiting again to steam up switch on etc otherwise steam will go on coming out of it.Any way, the product is more useful that those similar without a pressing board.The next negative thing is, manual says, for better lasting of product, and  to avoid decalcification, the water After use should be drained and cleaned. Hence, it means, you can't use it daily morning in rush while going to office. That needs little time. At the same time you can't press all dress in a stretch and can't fold it like we do with iron box. It won't work that away. So if you have long large cupboard with hangers as in mansions, you can try that.In effect, buy it if you find exceptions and usages apart from what I mentioned above.P.S :- I am seriously thinking of OLX 😒,Received a broked packedge. With broken item.,I thought it would make my task of ironing easy but it’s useless on cottons and silks . It’s great to use it on chiffon and polyester. Do not buy thinking you won’t need standard ironing anymore..,It is fantastic for marriages, where there are many dresses, net based where you can't use iron. Quick. Good for suits,It looks like an imitation product , pieces don’t match properly and some look very weak,valu Ed for money,It’s not effective and pressing clothes effectively seems to have an issue", "img_link": "https://m.media-amazon.com/images/I/318JzFxYqtL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Philips-Garment-Steamer-GC523-60/dp/B07DZ986Q2/ref=sr_1_253?qid=1672923605&s=kitchen&sr=1-253"}
{"product_id": "B07KKJPTWB", "product_name": "Brayden Chopro, Electric Vegetable Chopper for Kitchen with 500 ML Capacity, 400 Watts Copper Motor and 4 Bi-Level SS Blades (Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MiniFoodProcessors&Choppers", "discounted_price": "₹1,599", "actual_price": "₹1,999", "discount_percentage": "20%", "rating": "4.4", "rating_count": "1,558", "about_product": "FLAWLESS PROCESS: Chops meat, carrot, ginger, tomato, onion, Bell pepper, garlic, chilies, herbs, coconut slices, fruits, nuts, bread and Ice cubes. Also make puree, juices, mashes, smoothies, salads, and more with Chopro.|TOUCH TO TREND: Enjoy slicing! With Brayden Chopro; No need of searching lever or button, easy Top Press completes chopping drastically. Gives different textures for your cooking, serves to dine.|ULTIMATE POWER: Feels smooth functioning with Pepped up 400W motor, runs faster, and pulverizes the ingredients within a second. Encircled with safety copper, doesn’t generate much heat.|DUAL BLADE TECHNOLOGY: Bi-level AERO4 blades have sharp edges that cleave down chunky pieces like a nice one. Makes your work simple and spends lesser time in your kitchen area.|ENLARGE CAPACITY: Brayden’s 500ML high standard BPA-free chopping bowl holds chunky pieces, transparent appearance peeks us a clear vision of chopping veggies/fruits; perfect for a whole family.|RATED WATTAGE : Brayden Chopro has a rated wattage of 200W-400W, the peak performance comes into action depending on the load capacity. Lower the content, higher the wattage and higher the content, lower the wattage.", "user_id": "AHUR3WRNQOQ44GWIBTXRYLF6UTAA,AHW46KPBJ44BLDZYQTJH7QTN6FSQ,AEMR6MDZJREXTMBCB47HWPCXCW6Q,AHHLBBLNGWZWIX23N4AQKFS6XXAA,AFOBDH2OA23THZ46QVAYYN7IGF6Q,AHAGHWROWNW4HLHX42ZR5R6KWG5Q,AE3TDTXNYRURNBEATXHSUB52QUQA,AH6TJ2BWPQEIN7ZGCY7AC34W7EZA", "user_name": "Sri,Abhijith Prasanna,Sandeep,Amazon Customer,Amazon Customer,Tanvi,deepa,Tina suman", "review_id": "R1475ZJ873I5NE,R1IODQVRWH6ZY2,R2LZX8J3H6DOT5,R96JMMJFCJKL3,RW8C24FXP79KC,R1U7FGBOZ7LLXT,R1VVM3Y8P761OK,R3KYSOHRGRXD0Z", "review_title": "Very easy to chop veggies in a very short time,Super clean chopper,Nice product,Mom lives it!,“ LOSING A BATTLE”. Because of  a shoe nail.,Very good chopper,Wow what a beautiful product for cutting onions n other veggies . Why did i delay for so long,I like it", "review_content": "Very isedul to chop veggies in a very short time. Elders in family use it very easily to help cooking. Much time saving one,Good and sturdy,Very nice quality...got the same product as mentioned... Very much happy about the results I'm getting of it.. quality product. Must go for it...,I gifted it to mom, and she lives it. She only complain about cleaning. But plus point is it got nice sharp blade.,The plug provided with the machine for power connection is of poor quality. It is loose when plugged into an electric socket. One quality should be improved. As it is , it is NOT according to ISI or international standards. This is a ‘C’ class item and the poor quality reflects very poorly on the quality control system of the manufacturer.,Easy to use and super easy to clean,Just absolutely very good go for it,Best part easy to use.. chopped every vegetable very smoothly..", "img_link": "https://m.media-amazon.com/images/I/31GXpZTtghL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Brayden-Plastic-Express-Bi-Level-Stainless/dp/B07KKJPTWB/ref=sr_1_254?qid=1672923605&s=kitchen&sr=1-254"}
{"product_id": "B071R3LHFM", "product_name": "Wonderchef Nutri-blend Mixer, Grinder & Blender | Powerful 400W 22000 RPM motor | Stainless steel Blades | 3 unbreakable jars | 2 Years warranty | Online recipe book by Chef Sanjeev Kapoor | Black", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MixerGrinders", "discounted_price": "₹2,899", "actual_price": "₹5,500", "discount_percentage": "47%", "rating": "3.8", "rating_count": "8,958", "about_product": "Performance with Style:India's favourite Mixer-Grinder-Blender, Nutri - blend, is the perfect combination of superior performance and superb styling that adds beauty to your kitchen|Powerful Motor:The compact yet powerful machine grinds the toughest of chutneys and masalas, and ensures nutrition extraction from all fruits and veggies thanks to its incredibly high speed of 22,000 RPM, which is almost twice that of normal mixer-grinders|Hands-Free operation:Best thing is you don’t need to keep your hand on the lid during operation, for the fear of it flying off. This is because Nutri - blend has the unique inverted design that has the lid screwed safely at the bottom with zero chance of the food spattering out|Trademark Design:The attractive trademark flower design stands apart and is a symbol of health and quality. It’s a reflection of your refined taste in the kitchen|2 YEARS WARRANTY & AFTER SALES SERVICE: Reliable Wonderchef warranty with the best after sales service in over 12,000 pin codes across India.", "user_id": "AE5CXOIK2XJRKPRSKOXHICJHG3UQ,AEMURPMQFSRYZ5R7IKBPIGUEES2A,AHIV6ODNO4FNGOPKPP3HBN5O5X4Q,AGUOJUMISWCWPU7XMVMFQJKZ6OKA,AEXWFPDY7TBIL3CFRZO5BEHA76IA,AGR33RA3JZDOYDL7SJBWTHYKLZHA,AGKBZLURQIRK76CSDFFRHIZSUXOA,AHPJA5BHHKC6VNMIPWMB3R66LXGA", "user_name": "Rachna,KAILASH MANDAL,Jasmeen Syan,Amazon Customer,PERIASAMY,Balamurugan,Vipul Mori,Durga", "review_id": "R3INNJUH4JO9LK,R15QDC1Z7MA197,R1XO3PU241VKRL,RYERQXE72BWDZ,R1JHTSAJC61WZ3,R3P0PRTL84LY6I,R2Z85B5IROTGYA,R2EH4DVWTBAL9C", "review_title": "Handy and consumes so less space unlike other mixer grinder,THIRD CLASS PRODUCT,Not satisfactory,It is a wonderful  product,Super,n,Handy,One jar not working", "review_content": "Smoothies and dry grinding.Consumes less space.,most third class product.. motor is not able to take load and everytime smoke comes out..service is too bad..dont buy this product..its after 10 months feedback,I received the product and the rotor blade along with the washer came off the grinder jar in the demo itself. Exchanged the product and received a piece which had scratches on it (the lid of the big jar, the body of the big jar), the blender lid doesn't seem to quite be leakproof... Because of my first experience with wonderchef product, i definitely had high expectations about the quality, and I would say that it did not fulfill my expectations. I had bought it for dhanteras and the exchange and all delayed the plan, also was a lot disappointing for me. Now I am anxious to even use the exchanged one, already the scratches have put me off.,It is very easy to clean .,👌,there is no switch ,Its very difficult to use without switch in the mixi,Easy to use, easy to clean, space saver, handy,I used this product for making puree.Totally waste of purchase.One jar not working.", "img_link": "https://m.media-amazon.com/images/I/51i84+E-LgL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Wonderchef-Nutri-Blend-63152293-400-Watt-Grinder/dp/B071R3LHFM/ref=sr_1_255?qid=1672923605&s=kitchen&sr=1-255"}
{"product_id": "B086X18Q71", "product_name": "Usha Janome Dream Stitch Automatic Zig-Zag Electric Sewing Machine with 14 Stitch Function (White and Blue) with Free Sewing KIT Worth RS 500", "category": "Home&Kitchen|Kitchen&HomeAppliances|SewingMachines&Accessories|Sewing&EmbroideryMachines", "discounted_price": "₹9,799", "actual_price": "₹12,150", "discount_percentage": "19%", "rating": "4.3", "rating_count": "13,251", "about_product": "Free Sewing Kit Worth ₹500/- (contains 18 N Thread Spools, 12 N Buttons, 1 N Scissor, 5 N Needles and 1 N Measuring Tape)|Automatic zig-zag sewing machine with compact free arm. Pressure Adjustor : No|Thread Tension Control: Manual ; Stitch Pattern Selector: Dial Type|7 built-in stitches & 14 Stitch function including 4-step button holing; Seven applications including lace fixing, quilting, smocking and rolled hemming|Auto tripping bobbin system; drop feed for embroidery; manual needle threading; sewing light|Sewing speed: 550SPM (Stitches Per Minute); Stitch length control; Triple strength stitch|Warranty: 2 years manufacturers warranty", "user_id": "AGV6QTOYJLPJ64XHY7VR6NKFKHVA,AGBJOIF64YPNCYBN3MWABUMRS46Q,AG3RH7VYVL25QFOCSWTZLBLZIV2A,AGPNW3GNPQBPFFAZ5BREYIKQNFOQ,AG5G7QG722YPXMDLWSEQUVDKDXXQ,AFRXET3VPG5BJ5RK7GV7BNWOG5AQ,AGF4WOJV2GZTQSBHWSMDHUABDSIQ,AH5EDRMYEIINDSSSX37FROCR4NNA", "user_name": "S K THAKUR,Sritee Bharti,Mounika k,Kannan itz_sk,Shaikh Nadeem,Raviyathul basariya,Lathabaskaran,Reshma", "review_id": "RZXPK0F5S2VTS,RHQXPF9G54YP4,R3MQ0FZCHTDIXT,R2YQQJIT5CF1YI,RQFWTYF7ISOCK,R2WARTYO91TQ5U,R2ZQ5A84YMYF5L,R2EAC2MQLUOE2O", "review_title": "Good machine,Machine is very easy to use after watching the tutorial video,Good product but.....,Costly product only,Superb quality and handling,Usha janom super sewing machine,Worth to buy this,Didn't get warranty card and fabric is not moving", "review_content": "The product is quite small.. easy to learn and light weight.. working fine..the only sad thing is no warranty card given..Machine cover also for machine is good.. the free kit is also good..,Machine is excellent for beginners. However the package was missing the sewing kit. Many people have complained about a broken box but for me the entire sewing box is missing.,Little difficult to get bobbin thread out from the machine, saree pheeko is task, maximum of times saree get stuck in the bobbin area, used for basic stitching, company has not provided any demo at doorstep, as they are not serviceable for few pincodes. Need to learn on YouTube only. Ok ok product, need lot of patience initially for beginners,Only for the brand name we spent this much. Better buy a cheap one if you are a rarely user and beginner,Amazing product. Precise stitching and very handy. Loved it.,It's very useful to all .,Quality good,Didn't get warranty card and fabric is not moving", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/417iICYt3IL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Usha-Janome-Dream-Stitch-Automatic/dp/B086X18Q71/ref=sr_1_259?qid=1672923605&s=kitchen&sr=1-259"}
{"product_id": "B07WVQG8WZ", "product_name": "Black+Decker Handheld Portable Garment Steamer 1500 Watts with Anti Calc (Violet)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|SteamIrons", "discounted_price": "₹3,299", "actual_price": "₹4,995", "discount_percentage": "34%", "rating": "3.8", "rating_count": "1,393", "about_product": "On/Off and adjustable steam setting options for different fabrics|Lockable steam button for ease of use|21gm/min continuous steam output|Anti Calc for longer Product life|Large 260ml detachable water tank for longer use|Universal Bottle Adapter for ease of portability and travel|Warranty: 2 years warranty by the manufacturer", "user_id": "AFXYPYAOFDHWH4CXSBUVX2XXIOSA,AETDHNM3DCXJJ6K4AFAEHZQAVG2A,AGMOIWMV5LM33PKZWDSGNS5EZ6ZA,AG5FGOJE6CG3FHJTE2PNPHOGUJHA,AFUCLN7AM6VIDFUUQXMEYHHMJOTQ,AGHLLRQQL3VKZBE426YJLNV5UBDQ,AHPLUXRCABZUIN7AYXOQFSSBBYAQ,AFDJPDX5JZEXUIAHIPEIVN2QYMQQ", "user_name": "Nadeem,Viral,ankit agarwal,Amazon Customer,Vimala Vishwanath,Azra,Fouzia Kalim,SAMRAT KAR BHOWMIK", "review_id": "R11V5OCJYQY6WC,RIR8457ELA3D6,R2GWHK7KGBQ6DM,R1EV61F6P7A11I,R2DEONSP7S2QXE,R1ROPAJBYWFX3L,R3RP22I8F1KJ3G,RS323H3S7TUW3", "review_title": "Good product but not very useful.,Just OK,Good,Good for crepe fabric dresses & delicate clothing items,Here iam sharing my usage experience this garment steamer very handy to use I used it for 25 day's,Nice product,Awsome,Highly Recommended", "review_content": "Quality product but not very useful as far as ironing is concerned.,Delivery was on time as mentioned by amazon - so keep it up.The Product is kind of gift so not having much info or data in hand but whatever is shared I put it on here.The product is used twice so limited information at presentThe product is just OK.It is NOT a replacement to Iron and cannot be considered so. Yes, the steam is somewhat better than Philips as the user has used Philips also but as compared it should have been price competitive.Well - yes, it is able to remove crease from Jeans and even T-Shirt.We prefer stiff shirts for office wear so no good for Formals or Casual Shirts neither that good for pants.The water filler should have been round shape being a conical shape it does not give idea as to what level the water has been filled.Based on the water container it can steam 2 to 3 clothes at a time. Also, after 2 to 3 clothes the hand get pain. So, you cannot steam more garments.Also, you need some kind of support at the back - just hanging on the Hanger is not enough. The Manufacturer should have given a though on this and could have added an accessory either free of cost or at additional charge.Well so - If I get more information I will update, and change based on the same.,Good not best,I like the product but the only drawback i found is:A) according to the water capacity tank, in just about 5 min of usage you have to refill. So that way for each cloth you have to refill the tank.B) it's quite heavy. So i don't recommend this for long use. If you want to steam 1-2 clothes than its fine. Also the cloth must not be hung up above your height other wise it will be painful for you to hold this heavy steamer above causing more pain .My tip is that place the steamer on a table & after pressing on the steam button once the steam gets coming out you can hold your clothes & swiftly move in front of the steam (2 inches away) that way you will save yourself from the pain of holding it. Also pls use a plastic hanger & never steam over a metal surface :),https://m.media-amazon.com/images/I/81Cp+L1+vIL._SY88.jpg,It is a nice product but only reason I gave 4 star is that it becomes too heavy when it is held with water filled in the bottle.,It's only 2 days we used this product. However it's awsome and really a great worker when it comes to ironing. It's effortless and very quick.,If you want to purchase a steamer, go for it. It weights around 850gm without 250ml water, so the only concern is weight and how long u can hold it in your hand during steaming process. Otherwise performance wise this is by far the best machine available. Quality and finishing of the product are also very good. Certainly recommended.", "img_link": "https://m.media-amazon.com/images/I/41CsMm+ZCgL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/BXGS1501IN-Handheld-Portable-Garment-Steamer/dp/B07WVQG8WZ/ref=sr_1_260?qid=1672923605&s=kitchen&sr=1-260"}
{"product_id": "B0BFBNXS94", "product_name": "Personal Size Blender, Portable Blender, Battery Powered USB Blender, with Four Blades, Mini Blender Travel Bottle for Juice, Shakes, and Smoothies (Pink)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|HandBlenders", "discounted_price": "₹669", "actual_price": "₹1,499", "discount_percentage": "55%", "rating": "2.3", "rating_count": "13", "about_product": "✔【Easy to carry around】- This handheld blender is equipped with a travel cover for easy carrying. You can drink nutritious juices, milkshakes or smoothies wherever you want, such as home, office, gym, travel or any other outdoor activities. In addition, it can be taken on the plane.|✔【Portable design】: The unique design can separate the base and the cup body. The USB juicer cup is equipped with 1400mAh rechargeable high-quality batteries that can be recharged in a variety of ways, like charging by power bank, AC Adapter, and charging time is 3-5 hours; fully charged can produce 15-20 cups of juice.|✔【food grade material】- The portable blender is made by high-quality ABS and silicone, food-grade material. It has unique safety design including Silicone bottom, non-slip and shock absorption.This portable juicer is also a suitable gift for juice and travel enthusiasts.|✔【4 Blade design】- The portable blender for milkshakes and smoothies has a powerful motor base and 4 food-grade stainless steel 3D blades.The SUS304 Stainless Stell of cutter head made with food-grade electrolysis technology is durable and has excellent mixing ability, allowing the pulp to be quickl|✔【One button blending/cleaning】: simple button touch. 350ml capacity when cleaning, just put an appropriate amount of water in the cup and press the button to automatically clean. This can save you a lot of trouble.", "user_id": "AHRDA66XO63XYCBZJMW4EUJN3BFQ,AELE2SOO7LBNHXU7UK5F7TGQHA6Q,AHAVCLRCPYO2MFYPTURF33N7XH5A,AE762UDUDQPW4R4QHHTIL7TPTJUA,AEGZSJIUSKF2EKIKGLNKY2CU6WXA", "user_name": "Manya,Been,Podili Parasuram,Rejoy Jacob,Priya", "review_id": "R1WJ8T3U9P42IU,RM9RH8FX9U95D,R31M8UXT7NLOMY,R18Q7M2R00EW68,R11NHZQ8OKA9U0", "review_title": "Nice product i recommend to buy,Do not buy!! Defective product,Wast of money,Very very bad portable,Waste of money its not working properly", "review_content": "I liked that it is so convenient to carry,Waste of money. Defective product, cheap quality. doesn’t blend at all,https://m.media-amazon.com/images/I/71IVsjyZ13L._SY88.jpg,First charge problemSecond motor proble,https://m.media-amazon.com/images/I/61aXXxIxPwL._SY88.jpg", "img_link": "https://m.media-amazon.com/images/I/417TQs3uroL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Personal-Blender-Portable-Battery-Smoothies/dp/B0BFBNXS94/ref=sr_1_261_mod_primary_new?qid=1672923605&s=kitchen&sbo=RZvfv%2F%2FHxDF%2BO5021pAnSA%3D%3D&sr=1-261"}
{"product_id": "B071113J7M", "product_name": "Sujata Powermatic Plus 900 Watts Juicer Mixer Grinder", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|JuicerMixerGrinders", "discounted_price": "₹5,890", "actual_price": "₹7,506", "discount_percentage": "22%", "rating": "4.5", "rating_count": "7,241", "about_product": "Centrifugal Juicer|1 Year Warranty|Most powerful 900 watts motor with double ball bearings for efficiency, low maintenance and trouble free running for years|Juicer with unique honeycomb filter mesh for finer juice with higher yield|22000 rpm operation- retains original flavor and aroma of juices and food|90 mins. continuous running- suitable for longer usage|Transparent and unbreakable mixer jar", "user_id": "AHKRBVYCV4TUHOZIMGK4H55YGMFQ,AEDCUCVJEJKQWJPNYA4E5HMQ37TA,AGLUCMLVY27OWWYXIGYS2ANHQCTA,AEVH7CTRMGVDXTUSLCLNTRQHHIPQ,AEYMUCM7BPOU5UZ3M4KXIDZUZHHA,AEMIUWQVFEJISDZFQXUQCKHDZMRQ,AFAYV3BQLC3AXIEDILXRGIRHZWGA,AHMQOU4PLYHFMMN2PFQ27U5F6ABA", "user_name": "Nadia,Narinder Kumar,Rakesh Prasad Sah,Manidhar Sambhanu,Pankaj Pal,A,Ravi verma,Vineet Kumar Agarwal", "review_id": "R2WEI6XJR33OD9,R27A6L849E7GSZ,R1AEVMWF3LYR1W,R1HWDFBGDTAD8T,RW1MNAXV6W46C,R29GE7YKSLFUEI,RVPA011CN6KFC,R3RPSQIJV4SO8P", "review_title": "Need be careful,Excellent Product,Awesome Juicer with few issues,Best juicer ever , very strong and hard motor ,,Best mixer in India,Bang for the buck,Good product easy to use.,Best Juicer", "review_content": "disadvantages:- a transparent jar does not sit tightly.  even after replacing the first mixer.  The second replacement came exactly the same.does not seem to affect the work.Makes smoothies great! I hold the bowl with my hand, but without a hand it keeps fine.- There were scratches on the metal glass.  But after replacing , an undamaged product arrived. The metal glass sits tightly.  The kit has everything.  Juice has not yet been made.  I will add a review later.,Excellent Product....Very good Juicer machine for all fruits and vegetables.Easy to use and very helpful.,Waste collection portion is not fitting well. During use some of waste product of fruit is coming out....,Best juicer for carrot , beet root and other vegetables and fruits , best motor , don’t compare with other brands , this is the best product made in India , just go for it,900 watt motor really powerful...very good for jucie extraction.,A very good product, its better than any juicer and is multi purpose. The one with all three attachments is recommended as it will cater to more kitchen functions.,Best company or product,Very Like", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/413KQ6Ch61L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Sujata-Powermatic-Watts-Juicer-Grinder/dp/B071113J7M/ref=sr_1_262?qid=1672923605&s=kitchen&sr=1-262"}
{"product_id": "B09YLWT89W", "product_name": "Sure From Aquaguard Delight NXT RO+UV+UF+Taste Adjuster(MTDS),6L water purifier,8 stages purification,Suitable for borewell,tanker,municipal water(Black) from Eureka Forbes", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterFilters&Purifiers", "discounted_price": "₹9,199", "actual_price": "₹18,000", "discount_percentage": "49%", "rating": "4", "rating_count": "16,020", "about_product": "8 Stages of purification with large water storage capacity of 6 litres|UV e-boiling: Ensures that each drop of water is as pure & healthy as water boiled for 20+ minutes|Ultra-filtration: Imparts crystal clear clarity to drinking water in addition to making it safe from viral & bacterial contamination|Taste Adjuster: Enables to adjust the taste of water depending on water source|Suitable for all water sources: This water purifier is suitable for all water sources such as municipal, borewell and tanker water.|Flexible installation: The purifier can be easily wall mounted or kept on the counter top|Convenient Features: a) High Storage Capacity b) LED indication alerts when tank is full, when service is due & when cartridges need replacement c) Purified stored water can be dispensed even without electricity", "user_id": "AE5TYL3HV3PPD3BRG5C5HJO6Z2SA,AEEBGA5NPM4BZ2UVJYRWPZVHZTVA,AHCRBWWNGNOH5TPA67UMTUK7CSTQ,AELCFPVIRUQFTZXUH25AE3VI3EPQ,AFJYBPSS4S2VWIFDX3BWJQJ7OFNQ,AG72XDX4CZHFNILZCIKRN4AMP2DA,AG7OKZNOYUX3PEFWYNO3WLKVH6MA,AFVP7U6OD4IODWNS7TFARV6HS6DA", "user_name": "Sharfuddin Baba Mohammed,Rohit khuswaha,Mansi shelar,Anish Prasad,Backpack Nirvana,Nitin,Rajeev,Sajiedhi Bamon", "review_id": "R1FX2ZCKMJB7HV,RW80Q6XC18TR1,R388KPB8P0EVTW,RH57438QTA6TG,ROZVZWR5N5XFF,R32RTSWNYGFNT3,RHK4K6M2PFZCT,R21IS8D23018BF", "review_title": "VALUE FOR MONEY PRODUCT WITH WORST AFTER SALES SERVICE FROM EUREKA FORBES!,Water Taste and TDS level and Filter age,Good product but not good service after installation,Excellent Product for its price,Good product | Eureka Forbes took time for installation,Water wastage is ~220%.,Great product this RO purifier,Awesome product", "review_content": "Product and Service Review-Buying price 8999 during prime day sale with 10% discount from HDFC DEBIT CARD.PRODUCT REVIEW!RATING 4/5This is a new model launched during prime day from Eureka Forbes Aquaguard line of products named Aquasure delight.The product is pleasant to look and comes with a capacity of 7.5l on paper but holds only 7 liters of water, equipped with reverse osmosis, ultraviolet radiation lamp and manual adjustment for total dissolved solids(can be manually adjusted only by service engineer!), the 7 liter tank fills at about 30 mins but the water wastage is very high for every 1litre water purified there is a drainage of 1-1.5 litre from the drain pipe (please collect the water and reuse it for washing utensils or bathing, shaving or watering plants. The drained water is same as tank water just with higher TDS). The water taste varies according to the level of TDS you choose very low TDS will give a good taste to water but at a loss of the mineral content of water which I will not recommend. The default TDS after purification is set somewhere between 80-100 (drinking water should have TDS below 300)MANUFACTURER REVIEWRATING 2/51)The manufacturer of this product is Eureka Forbes I am giving a rate of 2/5 because the product that is now installed at my home is a replaced product because the first product that I received was a defective one. The drain pipe would not stop draining water even when the tank was full, I asked the technician to check it and he said the valve is defective so I received a DEFECTIVE PRODUCT OUT OF THE BOX! I ordered for a replacement on Amazon which they processed and I got another one in which the led lights were displaced I don't know it happened during transport or it is some manufacturing defect I would have been disappointed for the second time but I observed it and reported to the technician who replaced the led lights to their original position so that the led indicators were now visible outside. The replaced product's valve is functional and now operating without any hassle!SERVICE REVIEW0/5Don't expect to have a very comfortable installation experience its going to be a heartache. The reasons are1. The people Eureka Forbes has employed as technicians are thieves, I am saying this because Aquasure Delight comes with INTEGRATED DIVERTER VALVE, this is a stainless steel structure that is fitted to water outlet coming from the wall so that it can act as converter to be joined to the Aquaguard inlet! as I hadn't opened the package when it arrived! (because some or many of the companies void the warranty of you open the box containing the product, mostly electrical items that need installation like TV's Washing machines) Taking the precaution I didn't open the box so I was unaware that DIVERTER is included in the package! The technician after fitting the diverter charged Rs 200 saying that he fitted that from his side and diverter is not included in the package. i came to know this when I opened the package of the replaced product and found THE DIVERTER INCLUDED ALONG and confronted him but he defended saying some purifiers have diverter in them and some don't. I still have to confirm this with Eureka Forbes!2) The pre filter doesn't come included in the package so the technicians sell it to you at higher prices, My technician sold it to me at Rs 950 which is available at Amazon at Rs 750 but then if had ordered it from Amazon I have to install it by myself. I don't have a drill etc so I had to pay him Rs 950 so loss of Rs 400 on the technician. My opinion on this is that Eureka Forbes SHOULD SELL WATER PURIFIERA WITH PRE FILTER even though it raises the cost of the product by Rs 700 to Rs 800PLATFORM REVIEW!2/5The platform in which I bought is of course Amazon I am giving it a rating of 2/5 because I received a defective product the first time and Amazon refused to replace it because installation request was not raised by Amazon (Amazon never raises an installation request unlike Flipkart which raises an installation request from its side, which actually makes your life easy as in case if you receive a defective product which you notice after installation Flipkart directly consults with the technician and may even resend him to verify the authenticity of the problem) For installation you have to call the Eureka Forbes toll free number and raise an installation request, so Amazon representative was demanding an INSTALLATION REPORT, a video or photo proof of the problem, now how could I make that thief of a technician to write an installation report and about taking a photo or video I got the water purifier uninstalled as soon as I found it defective to put it up for replacement but I didn't know replacement request has these many hassles as it was my first time replacing an electronic product!SUMMARY1) PRODUCT IS GOOD FOR THE MENTIONED PRICE!2)AQUASURE COMES WITH \"INTEGRATED DIVERTER VALVE\" A STAINLESS STEEL DEVICE THAT IS ATTACHED TO YOUR WATER OUTLET AND THE AQUAGUARD, DON'T LET YOUR TECHNICIAN CHARGE YOU FOR IT.3) THE TECHNICIAN WILL OVERCHARGE YOU FOR PRE FILTER BE READY FOR THAT.4) TECHNICIANS ARE CUNNING AND MOSTLY THIEVES SO BE SHARP AROUND THEM.5) MAKE SURE PRODUCT IS NOT DEFECTIVE IF IT IS AMAZON IS GOING TO GIVE YOU A HARD TIME REPLACING IT.6) AMAZON WILL NOT RAISE AN INSTALLATION REQUEST YOU HAVE TO RAISE IT BY YOURSELF BY CALLING EUREKA FORBES CUSTOMER  CARE!OVERALL VERDICT- 2.5/5,if your family in 4 members you have choice eureka Forbes delight RO+UV+TDS this product is very effective and efficient. Agua guard provides installation with in 24 hours of delivery. before the installation had TDS level is  125, and after the installation had TDS level is 62. Nice product by Aquaguard, water taste is also sweet.,This is very good water purifier but I see service guy for installation seems in hurry. He just installed and went off. He did not show how much is TDS, how to adjust it. Don't buy this product on Amazon. Buy it from local stores if possible.,I purchased this product on a heavy Festival discount. There was problem initially after installation due to defective water holding knob. I reported this issue and immediately replacement was arranged. Although I had to wait for about two weeks. The Serviceman came and installed another piece. Since then it is working excellently. In all, the best part was that the services were good and responsive.,Amazon part of the business was smooth.Delivery done within timelines. Payments, exchange, cashback all done hassle free.Eureka Forbes another story.For installation I had to call them daily for 7 days.Finally on escalation and on hold with Eureka Forbes customer service for close to 90 minutes, installation was done.Eureka Forbes now calls me every other day to force this review.My main reason for writing this review.,I got the Purifier installed and before that I was having Bislery water (reason why I have so many bottles which thankful came handy). The Deliver and Installation was smooth. After installation the agent mentioned to let the filter fill up completely and then throw away all the 1st batch of filtered water since it's the 1st time filteration process so it will basically clense it overall.So I decided to let it full up and once it was full, I turned off the switch so no more whater comes in. I used the empty 2L Bislery bottles to fill up the 1st batch of filtered water which as shown in the image which is around 6L as Mentioned by the Company.After I emptied the Filter to its last drop, I turned on the filter with another set of Empty bottles at the waste pipe side. It took quite a while to fill up the tank fully but as it did it filled up almost 13.2 L worth of bottles as seen in the image. This is roughly 220% or more than twice the amount of filtered water.Now the company claims 60% water saved in comparison to other RO+UV filters and I have no knowledge of how much water wastage they do. But I think it's a bit much regardless.Fir every ~6L of purified water, it wastes ~13L.My tal water TDS is ~470Filtered water TDS is ~86And the waste water TDS is ~640Maybe it's because of the TDS levels due to which it wastes as much water ky does and it's possible that the amount might vary for different TDS levels at source.But I recommend to have the waste water collected and used for something else if possible rather than just letting it drain down. 13L almost everyday wasted is 390L per month and this is considering you only filter 6L of water per day.I'll redo this once more to see if there's any difference in values. This is juts to keep the potential buyers informed.,I like speed to fill water n less wastage. I like Tds adjuster and easy to install . I don’t like internal plastic body though I believe it’s steel.. need confirmation. Overall good product we are satisfied having it installed from 3-4 weeks,Deserve a 5 star on product. However, ran into a problem when it comes to installation. The technicians of the servicing centre at my local area gave me a huge problem by delaying the installation. At last one technician came forward.", "img_link": "https://m.media-amazon.com/images/I/31Anei7Di0L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Aquaguard-purification-municipal-Eureka-Forbes/dp/B09YLWT89W/ref=sr_1_263?qid=1672923605&s=kitchen&sr=1-263"}
{"product_id": "B0814LP6S9", "product_name": "PrettyKrafts Laundry Basket for clothes with Lid & Handles, Toys Organiser, 75 Ltr Grey", "category": "Home&Kitchen|HomeStorage&Organization|LaundryOrganization|LaundryBaskets", "discounted_price": "₹351", "actual_price": "₹1,099", "discount_percentage": "68%", "rating": "3.7", "rating_count": "1,470", "about_product": "MADE IN INDIA | Laundry baskets Combo of Lid & without Lid, which is a lightweight, water resistant & sturdy.|Durable and foldable laundry bags for organizing stuff in laundry room|Simple and elegant organizer to complement various interiors, Ideal for storing dirty laundry before cleaning, Clean using damp cloth; do not wash or dry|Sturdy structure stays upright even when empty, Foldable, lightweight and easy-to-store design|Dimension: Length(15)inch x Width(14)inch x Height(21.5)inch", "user_id": "AHGP46O5MO2FPEVAHZM6A7EZHAEA,AHEO6VCLJ4UDPSPS4TVOXU6I53RA,AH4EIYQSOUXMOZRLMOJQ2K2RUUXQ,AETKWJBAYZHLXKZO5UIVI3SZSLGA,AH25XUAOUMID775S3CGKTD4RMSRA,AFSZFJZYUT57KMK4OOFADUGFLKSQ,AHNNVMOSRRVE4357H7KC2YFDZCYQ,AGI6274XD65IINWKDRM324KZ3ZSQ", "user_name": "XYZ,Bhanu,Lalitha,Alex Christopher,Jeet,Wendy,Dkthr3,Vidya Bhandary", "review_id": "R1O4RWDUJDLH8G,R3BHQM50VHKHN1,RZZBLKLCKMBIO,R33B3888A0I1MF,R27C7F23ZUFG99,R3J5SC94G7LHOG,R31TAZ4NSJ9QJU,R2OO48A4CJ6ZWL", "review_title": "does it's job,Good,Chala bagundhe,Bottom is very thin woven and they provided carton for bottom,Good thing...,Not bad,Nice product,Good", "review_content": "been 2 months since i got these i can slowly see the fabric coming off and the bare cardboard peeking through. but it depends on how you handle it in my opinion. but they can be folded flat and stored in tiny spaces which is great!!,Cost high but good,Super,https://m.media-amazon.com/images/I/71Pr+tjoxEL._SY88.jpg,A very good thing to keep casual clothes.....,Ave been using it for a month now and this is the current condition,Very nice product :),Good to store items", "img_link": "https://m.media-amazon.com/images/I/31vN7I58EHL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/PrettyKrafts-Laundry-Basket-Clothes-Handles/dp/B0814LP6S9/ref=sr_1_264?qid=1672923605&s=kitchen&sr=1-264"}
{"product_id": "B07BKSSDR2", "product_name": "Dr Trust Electronic Kitchen Digital Scale Weighing Machine (Blue)", "category": "Health&PersonalCare|HomeMedicalSupplies&Equipment|HealthMonitors|WeighingScales|DigitalBathroomScales", "discounted_price": "₹899", "actual_price": "₹1,900", "discount_percentage": "53%", "rating": "4", "rating_count": "3,663", "about_product": "Tare function: It comes with tare function which allows you to measure the weight of all ingredients separately after adding one after another without having to remove the previous ingredients. It also allows user to cancel out the weight of the container in which the ingredients are measured ; NOTE: Place your weighing machine on flat surface to get an accurate results|Measure weight up to 5 kg: equipped with high precision measurement sensors (accu gauge), the device meets your precise weighing requirements every single time. its weighing capacity is 1g to 5kg with unit shuffling feature between g/lb: oz and ml/fl: oz|Comes with a bpa free bowl: it comes with a bpa free detachable and lightweight bowl which complements well with the machine. you can flip the bowl over on top of the scale to save space during storage. Product Weight: 406 gm|Measurement units can be converted: it can display weight in a lot of units of measurement. you can easily convert units between pounds (lb), ounces (oz) and grams (g). also it has two volume unit systems ml and fl’oz|Low battery indicator: dr trust electronic kitchen weighing scale comes with low battery indicators that allow the user to replace the battery before it shuts down|Auto off function: auto off function feature turns off the scale automatically when it is left idle for few minutes which helps to prevent the wastage of batteries|Easy to use and store: it is convenient to use and store. it is compact and can be easily placed on the kitchen counter. also it is easy to move from one place to another", "user_id": "AG22QSZIES6VEC3IVAGKQD4N7WHA,AHFGWOU2ANAHIK6VUKI267DZO5PQ,AE7JCA7MTQHV6XTNF2NQFH5DG6KQ,AHKW2FPVJKYDYZOTMPDW4CIXUHLA", "user_name": "Jagdeep,imtiaz dhalech,Simple Person,Neha Naik", "review_id": "R3KLZUQCUHHOAX,R2QQZX4QI5G707,R2PMOA0FRZQJH8,R1Z7A1FJINTOUW", "review_title": "Design Optimised for Functionality, Durability & Battery life!,Nice,**HIGHLY PRECISE IN MEASURING**ACCU GAUGE SENSORS**CONVERTS UNIT AFTER MEASURING ALSO**HAS TARE, AUTO-OFF, OVERLOAD INDICATOR**,It worked good for one year. Now only grams are shown.litres option is not operated.", "review_content": "This is aesthetically the most appealing Digital Kitchen scale out of the available choices. Though it is also by far the most expensive, it is value for money considering the followig pros:1. Functionality: It has only two touch buttons which integrate all the functions like Units of weight & volume, multiple tare & weigh with overload indication, and off/on; It can give volume idications for water and milk, two of the most frequently used liquids, while other liquids can be also measured if a glass of water is calibrated for a certain volume, say 100 ml ad same is marked on the glass; The plastic food grade bowl fits snugly on the scale and also doubles up as a cover when the scale is not in use2. Duraility: Because of its squat oblong shape and sure footing, the scale wont topple. Also, since bowl fits snugly on the scale upside down when the scale is not being used, it prevents dust from entering the display and buttons; material is tough plastic with a recessed top which seats the bowl firmly and there is no exposed space for ingress of any spilt liquid, With all this, theres a one year warranty extendable to two years, which speaks about the confidence of the manufacturers in their own design3. Battery Life: The device has an auto power off and a digital display which consumes very less power. Hence battery is likely to last longer.I only encountered two cons:1. Scale is very sensitive and takes some time to settle2. The display backlight goes away after some time and the lcd reading is difficult to read in bright ambient light.Overall, this device serves my purpose of practical diet management very efficiently and effectively and am sure it will grow on me. Recommended if you want to get much more utility and eficiency at a slightly higher price.,Litt to adjust all time,,Ok. Price wise it didn't last long", "img_link": "https://m.media-amazon.com/images/I/41csvHnDvES._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Dr-Trust-Electronic-Kitchen-Weighing/dp/B07BKSSDR2/ref=sr_1_265?qid=1672923605&s=kitchen&sr=1-265"}
{"product_id": "B09VGS66FV", "product_name": "Tesora - Inspired by you Large Premium Electric Kettle 1.8L, Stainless Steel Inner Body - Auto Power Cut, Boil Dry Protection & Cool Touch Double Wall, Portable | 1500 Watts |1 Year Warranty | (White)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Kettles&HotWaterDispensers|Kettle&ToasterSets", "discounted_price": "₹1,349", "actual_price": "₹1,850", "discount_percentage": "27%", "rating": "4.4", "rating_count": "638", "about_product": "✅ABOUT : This top performance kettle is part of the Fine Collection, featuring a premium textured finish, stainless steel inside & cool touch outer body for an attractive addition to your kitchen|✅SAVE TIME AND ENERGY: Made with double-wall construction . Stainless Steel Inside keeps your Stuff warm much longer and Cool to touch when heating. Enjoy quick boiling times so you can enjoy your coffee, tea, or boil eggs in no time.|✅CORDLESS SERVING - Pick up, pour, put back! You can set the Cordless kettle down on the 360° swivel base at any angle.|✅LARGE CAPACITY: It is perfect for frequent use with a capacity of 1.8 litre . Infact ! The wide mouth makes it easy to fill, pour, and clean and is designed to avoid spillage.|✅CONCEALED HEATING ELEMENT: Tesora’s Electric Kettle heating element is concealed , not exposed like many other kettles. So absolutely safe for Adults and children|✅OVERHEAT PROTECTION: For peace of mind while multi-tasking in the kitchen, the kettle automatically shuts off when water reaches a rolling boil or when there’s no water in the kettle.|✅1 YEAR WARRANTY AND PAN INDIA SERVICE: on all manufacturing defects And Pan India customer service as per the mentioned manufacturer details", "user_id": "AF4PTAVL6VZB5QTMNHLKUQ3LMZLA,AGI4BM5ZRGDD4KB3QH72FI37ZKRA,AE26ZTVZB6CB4VML6JSTYTL2QG6A,AGLRTBQ52OBASLMH3FAS7DJDB5TQ,AHKTDBCHIOLSIJYHGICL222OLCCQ,AHQ6EYMJ7JXCKR4O6EDJ7P7FW77Q,AG6ARD7AF2XBUTKPW35SH7ACMJOA,AHP7P3UVBYKC36AWMWNY6V7UTIQQ", "user_name": "Aliahmed Khan,Pankaj Tiwari,Placeholder,Tanmoy,Sumayya Shireen,Lovi Swu,Santosh,Deep raj", "review_id": "R3K8P7GKLOHOW3,R968YTI3QLHUU,R2WLXSMP9D425C,R3JQEX1BFY9D39,R3FG2NLHXHGVP,R3HUBJJJS3DO4T,R2661I4M86YGDU,R34YWIBFYLRQ7S", "review_title": "Good,Kind of too big.,Efficient one,good quality appliance,Nice product,Sturdy, well made,Fantastic product, I'm using it from last 10 days and it is working good. Value for money.,Quality product", "review_content": "Best,Only issue is that you might misjudge its size. It's kind of too big, especially if you're living in hostels, like me. Using it for anything other than boiling water usually turns out to be pretty inconvenient for that reason. Even washing it at times. But overall quality is really good. It's a good product, only suitable for specific use cases though. Good for homes.,The kettle is very handy to use and the capacity of it makes the work easier. I loved the new colour choices they are offering.,the size is sufficient and may be a bit large for single person usage. one suggestion is that a temperature control knob could have been provided in this price range. otherwise a very good product. finish is excellent.,Takes a little longer duration for boiling,The problem is the outer of kettle, which easily charms the dust - smudge, & no matter whatever available kitchen cleaning products u apply, the blotch stains are signified to be permanent. Go for other than white colour.,Very useful product and it is working good. Price is reasonable. Worth it.,Like the metal base.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31qaROshXhL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Tesora-Electric-Stainless-Protection-White/dp/B09VGS66FV/ref=sr_1_266?qid=1672923605&s=kitchen&sr=1-266"}
{"product_id": "B07RCGTZ4M", "product_name": "AGARO Ace 1600 Watts, 21.5 kPa Suction Power, 21 litres Wet & Dry Stainless Steel Vacuum Cleaner with Blower Function and Washable Dust Bag", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Vacuums&FloorCare|Vacuums|Wet-DryVacuums", "discounted_price": "₹6,236", "actual_price": "₹9,999", "discount_percentage": "38%", "rating": "4.1", "rating_count": "3,552", "about_product": "Suitable for Wet & Dry dual cleaning operations;Capacity: 21 Litres.|Powerful 1600W motor, Strong 21.5 kPa suction power;Equipped with blower function.|360 degree four Swivel Wheels for easily cleaning in any direction;Accessories: Main unit, hose pipe, telescopic metal tube, floor brush, crevice nozzle, multipurpose brush, absorbing brush..|5 Meters long power cord;1 Year manufacturer's warranty.|Material Type: Plastic; Color Name: Black; Power Source Type: Corded Electric", "user_id": "AF2CSPPKO2SSBDRBRGHC45BWIELQ,AGW4JUROHW7KRFM5ZCC2JNH4PAXA,AEW6W7DN3VIG44QTVU52ZBJOFH7A,AFU5NZ6LAHLUZ5OGIDR42FCDQAGA,AEYJ3DHU5M5R322RG6PCYUWWCXDA,AG4FCICECZZK5SGKS5PG2PLFSVPA,AEPQQCHQYPREFBONFIWGNSURTKCA,AGKQOL5HGTYAK4XZZA45NTA2UZQA", "user_name": "devadas,Dharmesh Soneta,Raghu HS,Buyer,Ankita,Lalit b.,shafeek,P Gourav Kumar Patro", "review_id": "R59S0ST3CRK72,R32DQPFQOKWAPF,R1LBZ0AGEZPCJS,RICD6CW1J29LM,RZCQSN74LHT1B,R39HW9DHHNXMZY,RKVFIWXJ28K5E,R6VPUQX7S0ZXK", "review_title": "Value for money,Nice product, comfortable to use.,nice one,Good product with some areas of improvement.,Good and easy to use.,Best Vaccum cleaner in this range,Best vacuum cleaner for house hold use,Nice", "review_content": "The decision to buy  this2)Purely on The cost of similar branded item  is around Rs16000 =002)I  use this Vacuum cleaner only occasionally and based on my need and I  feel floor requires vaccum cleaning.Under the above condition this item serves purposeConssMade In  China and they importing and marketing in India1) sound I feel not at my comfort zone but others also make similar noise2) lenth of power chord smaller compared to other brander ones3)  No demo was arranged .  YouTube video was their reply for my request for demo even in metro like Bangalore.4) No customer support or services in case instrument goes faulty  over time in Bangalore.I  donot know how they service the instrument over phone.who has to bear to the cost of transportation and how it will workoutProsWorks as per the specification.,Suction power is good, noise level ok, free movement. There can be an improvement in the sponge quality, since while using the blower the same gets sucked in the steel tub. Further if the company can provide a video on how to effectively use the product it would be great and also how to avoid pressure on the motor since the hose pipe bends while using the product.,nice product. i liked suction power but on right side  extra blowing out apart from blower side. i dont why ? and steel body build quality is too low. if small partical touch it ll get dent .its ok over all product is good.  ok ok,The suction power of the vaccum cleaner is really good only drawback is that after using it for some time I observed that the suction hose is leaking the air which is making a whistling sound. I tried reaching out the customer service and they informed me that the whistling sound when using the blower mode is quite normal. The outer container is made of steel and is of good quality. When I received the product I observed a dent in the body.,Bought recently and initial usage is quite good. It's convenient and easy to use. Performs well on floors, mattress and sofas. Blower function works as expected. A bit tough to clean mosquito mesh through grills.,I have been using this vaccume cleaner for the last 1 month. And I am very happy with the product ...I have been using it mostly for Sofa Cleaning....it's suction power is really good.,https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/61yO-rOjccL._SY88.jpg,Suction pipe should have more length, can't reach slabs, other wise nice", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41--5lc96UL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Ace-1600-Watt-21-Litre-Stainless-Function/dp/B07RCGTZ4M/ref=sr_1_268?qid=1672923605&s=kitchen&sr=1-268"}