{"product_id": "B07GQD4K6L", "product_name": "boAt Bassheads 100 in Ear Wired Earphones with Mic(Furious Red)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹379", "actual_price": "₹999", "discount_percentage": "62%", "rating": "4.1", "rating_count": "3,63,713", "about_product": "The perfect way to add some style and stand out from the crowd with the boAt BassHeads 100 \"Hawk\" inspired earphones. Impedance 16Ω, Sensitivity (dB) 92db ±3db, Frequency Response 20Hz-20KHz|The stylish BassHeads 100 superior coated wired earphones are a definite fashion statement - wear your attitude with its wide variety of collection|The powerful 10mm dynamic driver with the speaker resistance of 16 ohm enables the earphone to deliver a punchy, rhythmic response to the most demanding tracks|Features a HD microphone to make crystal clear calls - making life easier on the go, play/pause music or answer/end calls with one-click, track forward with two-clicks or back with 3 clicks make these earphones extremely user-friendly|With 1.2 meters perfect length cable now plug it in anywhere with ease - while the earphones are extremely user-friendly and stylish, extruding premium coating on the wire cable is a manufacturing process that we've been performing and refining since our company's inception|Its impeccable fit won't let you take these wonderfully amazing earphones off, fits you perfectly without hurting your ears and the perfect arc, with different size ear tips helps you in achieving superior comfort even with long listening hours.|1 year warranty from the date of purchase", "user_id": "AF4MVO4JNFDEPWFKZO62OAJKRIWA,AHVPAXEWPATRASBKHOBI2I3VRLGQ,AE47PRQCNT3YFSESBLAJOH6MSCFA,AGUOSXCR3PDNC2K4X7O7QNRGPAWQ,AH5L6KKTP5ZQSN6GVQB4ZGXOM2DA,AEP5OZFTG32NCC34GCOBFO24W6RA,AEQXLMRCT4ZS65M3ST5YV6AOZG7Q,AHZXKAGAJPIMZJD5XJ5QUIYR3ORA", "user_name": "tarun kumar,mahesh radheshyam tawari,Blackspade,Manoj Kumar,Kartik Sharma,Placeholder,Arun,Yuvashree", "review_id": "R2DD2M5YARW7R2,R2M9ZYNGGV1ZLN,RNWNTRNLSJWSB,R3BJBPNI2XP8HF,RI1FLXH6TFEAJ,R172WRCQLOW97V,R3721R2I1BFETF,R2DH3Z46FTCXQ8", "review_title": "Best value for money,HEAD PHONE POUCH NOT RECEIVED,Overall good in this pricerange,It's not working in my Phone properly Plz help me in exchange or return, I ll be thankful to you,Worth the money 🤑,Best,Nice sound,Wonderful product", "review_content": "The sound quality of this earphone are really good. The bass part was also good. I only found the noise cancellation was not what I expected. It could be much better. Finally, I can say its a good value for money.,At this purchase, i did'nt received head phone pouch to keep my head phones safe... it disappointed me,overall good and decent quality, I am writing this after two months, I dont use regularly but whenever I use my colleagues says that your voice is clear 😂,Pin that I do connect to the phone gets automatically to outside. It doesn't work. Plz amazon help me. I'm a regular customer of this company. I'll be really thankful to you.,Great sound quality and good bass. Decent noise cancellation. I couldn't have asked for  better earphones at this price.,Best for gaming,Good,Nice product", "img_link": "https://m.media-amazon.com/images/I/31qVddHyy5L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Boat-BassHeads-100-Inspired-Earphones/dp/B07GQD4K6L/ref=sr_1_69?qid=1672895762&s=electronics&sr=1-69"}
{"product_id": "B07WDKLRM4", "product_name": "iQOO Z6 44W by vivo (Lumina Blue, 4GB RAM, 128GB Storage) | 6.44\" FHD+ AMOLED Display | 50% Charge in just 27 mins | in-Display Fingerprint Scanning", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹13,999", "actual_price": "₹19,999", "discount_percentage": "30%", "rating": "4.1", "rating_count": "19,252", "about_product": "44W FlashCharge|Snapdragon 680 comes with octa-core architecture design that adopts the new 6nm process, CPU increased by 25% & GPU performance increased by 10% compared with Qualcomm Snapdragon 662.|Z6 is equipped with a FHD+ AMOLED dispaly to give a truly immersive display experience with true color contrast. The display provides a 180Hz Touch Sampling Rate in the gaming sessions for an enhanced touch response.|50MP AI rear camera comes with a variety of smart AI camera features and effects to capture wonderful moments with ease.|Cellular technology:lte, Form factor:bar, Human interface input:touch screen", "user_id": "AHWRZWPCTG6ICA7WTNLNNZXWFI5Q,AF2AASVYVSROFD7FXA6EFDS6N2LA,AG6YHIDBTRF4SWXLDWRVMRS56AMQ,AHELRKIGSIPF5VMAGPCPAUJYKOLQ,AH7HRG7P5VGMMU4PN7CEDU74Y2AA,AGPO4HV54G5JLGEZYJJ7NC63V6BQ,AHIMX6EL6H3CLBEVJCWLIQHSAA3A,AEITUHHOUWUNZPQDSHA2ZWQGJUMQ", "user_name": "siddharth patnaik,Dr Sunilkumar H,Krishna,K. S. Rao,vinayp,indhu,Jogi,DRISHTI VASHISTH GUPTA", "review_id": "R27MK332LTT5KS,R2TN6LNGD4FLYB,RVZJOLWLG5JZ9,R32Y3RXFGS0N8S,R1WG388SX6A8SS,R3FCO1GKVP9JHZ,REQQ0KOQUU7N5,RB48XNZD8P2Q4", "review_title": "Above average phone,Worth For The Money 💰,Okie,Phone is excellent,Purchased in good budget at 12k,It can fulfill basic needs in affordable price range,Nice,About features", "review_content": "I purchased the 6/128gb variant.To sum  it up in to pros and cons.Pros :-1.Good design in terms of look of the phone and it's build quality.2. Screen quality is good with little boosted colour tone.3. The new processor is very smooth and responsive.4. Speaker quality is good without too much treble.5. Camera is ok for selfie and main camera performance is above average with less noise.6. Camera in front is small so notch is not distracting while playing video.Cons :-1.Main camera struggles after 3x zoom.And video call performance of front camera  is inferior to stock selfie photo.2. 18 watt charger took 1hr30 mins to charge 80% of the phone.So charging speed is not time saving for this big battery.,Good one under This price..! One of the Best Android phone by Vivo 💚,Its super good for normal usage,Camera is ok for normal,It's working fine and no issuew. Iqoo providing quality devices compared to other brands,Camera quality is not that high,Value for money,Phone is very handy and battery is also good. Quality of phone is good.", "img_link": "https://m.media-amazon.com/images/I/41iVkyHeTUL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/iQOO-Lumina-Blue-128GB-Storage/dp/B07WDKLRM4/ref=sr_1_70?qid=1672895762&s=electronics&sr=1-70"}
{"product_id": "B0BP18W8TM", "product_name": "Fire-Boltt Gladiator 1.96\" Biggest Display Smart Watch with Bluetooth Calling, Voice Assistant &123 Sports Modes, 8 Unique UI Interactions, SpO2, 24/7 Heart Rate Tracking", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹3,999", "actual_price": "₹9,999", "discount_percentage": "60%", "rating": "4.4", "rating_count": "73", "about_product": "Largest 1.96\" Display : View bigger on the screen with the industry’s largest 1.96\" display covering every edge possible and providing a crystal-clear resolution of 240*282 pixels|Bluetooth Calling Smartwatch - Enjoy seamless connection and bluetooth calling through Fire-Boltt Gladiator Smart Watch|AI Voice Assistant - Now Wake Up Google/Siri Voice Assistant on your phone through the watch.|123 Sports Modes To Track - Track each activity in more detail and record the statistics everyday and compare the history of 7 days to know your best results.|8 Unique UI Modes - Now Switch your UI viewing method basis your mood and preference. Choose from over 8 different & stylish forms in the watch|In Built Speaker & Microphone - With Latest Technology and Chipset the speaker and microphone are very strong and clear for excellent quality calls, listen to music on the watch as well.|Multiple Notifications - Make sure you do not miss out important updates, birthdays or colleagues messages, enable all the social notifications on the watch to stay connected", "user_id": "AGRV2QBB6JEZZOFFU2SXQ6MD4FKQ,AE63YMXM3DHXLPTNVJHJ52BUA4KA,AGVIZXWQFUOANBYPMIQ6GY5XG2SA,AFOEZACEOW6XEVSVUCJEGHS6U2KQ,AE5JZKPJIR4HTZPWNC6ZPYMMGNBA,AHDF7YP2MU5KXG43ZVYWMMQNHJMQ,AEHGQC3G6B3IWI6OD7AGD353D6ZQ,AG44OTCJB3ZNRPLXK2KTM3R4RGRQ", "user_name": "Bhathresh,Rohit Bhambhani,Amazon Customer,NAVEEN G.,Yash,Ravi Prakash Jha,Abakash Nayak,Anil", "review_id": "R3LPK5GH31P4HW,R3E0GB12MWJZZX,R2CLET51I4B6OT,RHAXM6WBH7UXK,R192P7ADK9SGET,R1F57B71LOMGVR,R1TJUP2ZEUKJZF,R2QWZND34KWAUL", "review_title": "Good smart watch of the Year 2023,Value for money,Best product at the price group,Best smartwatch under Rs 4000,Amazing product under 3k,Best in segment smartwatch.,Need to update app,Worthy of money", "review_content": "Delivery: It is delivered on time as promisedReviewed on 03/Jan/23 after 1 day usageFire-Boltt Gladiator (black) is my first smart watch bought it for it’s beautiful look and all features like Heart rate, BP, Spo2, Stress measurements and 123 sports mode and IP67 water resistance and Bluetooth callingPros:>The watch looks premium and less weight while wearing for the whole day>Touch is smooth and accurate>The watch is visible during the sunny day outside>Measuring of heart rate, BP, Spo2, Stress seems accurate>iPhone pairing is very good no disconnect happened after pairing>Watch speaker is loud enough to hear and attend the calls>Yet to try training measures with running and exercise modes and battery 🔋>In built games (4) are good and seamlessCons:>Heart rate and other Measurement has to done manually by selecting its function.>wrist up auto wake up is not working as expected>not having many watch faces in the da fit app,Got this watch for Rs. 2499 and at this price it is an amazing deal. Good built quality, lag free interface, big screen size and good screen resolution are some of the key features of this watch.,Very happy with the purchase.Great job done by the Fireboltt.The display,UI and features are so good,special mention:build quality,top notch.A little disappointed with the less watch faces,i believe more watch faces will be adding soon.,The look of the smartwatch is amazing and is pretty heavy too. The screen is smooth but in the 360° movement in one of the menu view there can be a problem.The straps are deattachable which is an another drawback.,Bright displayNo laggingGood speaker and micNo issues with connectivityBest under 3k,perfectly satisfied.Crystal clear screen.,Over all good product,Best watch under 3000/-", "img_link": "https://m.media-amazon.com/images/I/51vHAEYKeWL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Fire-Boltt-Gladiator-Bluetooth-Assistant-Interactions/dp/B0BP18W8TM/ref=sr_1_71?qid=1672895762&s=electronics&sr=1-71"}
{"product_id": "B08Y1TFSP6", "product_name": "pTron Solero TB301 3A Type-C Data and Fast Charging Cable, Made in India, 480Mbps Data Sync, Strong and Durable 1.5-Meter Nylon Braided USB Cable for Type-C Devices for Charging Adapter (Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹149", "actual_price": "₹1,000", "discount_percentage": "85%", "rating": "3.9", "rating_count": "24,870", "about_product": "Fast Charging & Data Sync: Solero TB301 Type-C cable supports fast charge up to 5V/3A for devices and data syncing speed up to 480Mbps.|Universal Compatibility: This USB charging cable connects USB Type-C devices with standard USB devices like laptops, hard drives, power banks, wall and car chargers, etc..Connector One: Reversible Type C|Connector Two: USB A Type|Rough & Tough Type-C Cable: Charging cable with a double-braided exterior, premium aramid fiber core and metal plugs. It has passed 10,000 bending tests and can easily withstand daily use.|Extended Length: 1.5-meter long c-type cable uses nylon material to protect the wire and avoid knots.|Perfect Fit Connectors: pTron Soler USB-C has passed the 5KG load test, swing test, 5000+ times connect & disconnect to ensure that there are no loose connections.", "user_id": "AEQ2YMXSZWEOHK2EHTNLOS56YTZQ,AGRVINWECNY7323CWFXZYYIZOFTQ,AHBAT6VLOXWGYDL57KHCNCLPXAKA,AF7NDY2H6JVYTSQOZP76GCATQ34Q,AFV7ZA733ZLME4KNLZPMPCBUNPPA,AEP4MK3EKOBDKTGPJTRN5RBDIODA,AHFAAPSY2MJ5HYOU2VQDJ7AQY4NQ,AH2WGV2PEBUTICRPBEEVKF24G5LA", "user_name": "Jayesh,Rajesh k.,Soopy,amazon customer,Aman,Shankar,Ajaybabu.O.M,dinesh,Chitra", "review_id": "R7S8ANNSDPR40,R3CLZFLHVJU26P,RFF7U7MPQFUGR,R1MV1NKC23DWPI,R11D3U0V2XKDKF,R1XN72FU6Q37IH,R18MP1KLUE18PC,RWGJNVEH5ZQME", "review_title": "It's pretty good,Average quality,very good and useful usb cable,Good USB cable. My experience was very good it is long lasting,Good,Sturdy but does not support 33w charging,Nice product and useful,-", "review_content": "It's a good product.,Like,Very good item strong and useful USB cableValue for moneyThanks to amazon and producer,https://m.media-amazon.com/images/I/51112ZRE-1L._SY88.jpg,Good,Sturdy but does not support 33w charging,Nice product and useful product,-", "img_link": "https://m.media-amazon.com/images/I/31wOPjcSxlL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Solero-TB301-Charging-480Mbps-1-5-Meter/dp/B08Y1TFSP6/ref=sr_1_72?qid=1672895762&s=electronics&sr=1-72"}
{"product_id": "B07GXHC691", "product_name": "STRIFF PS2_01 Multi Angle Mobile/Tablet Tabletop Stand. Phone Holder for iPhone, Android, Samsung, OnePlus, Xiaomi. Portable, Foldable Cell Phone Stand. Perfect for Bed, Office, Home & Desktop (Black)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Stands", "discounted_price": "₹99", "actual_price": "₹499", "discount_percentage": "80%", "rating": "4.3", "rating_count": "42,641", "about_product": "[PORTABLE SIZE]- 98mm*96mm*19mm, STRIFF desk phone stand is foldable and easy to slip into your pocket suitable for bed,table and home|[MULTI ANGLE ADJUSTABLE] - Directly adjust to your preferred angle among 10 different viewing angles, from 0° to 100°.Hold your smartphone or mini tablet in portrait or landscape mode safe.|[USEFUL DESKTOP CELL PHONE STAND] - Hold your smartphone or mini tablet at a comfortable angle, ideal for watching video, reading, video recording or simply browsing the web, playing games, facetime and other handsfree operation at home, office and travel|[PREMIUM MATERIAL] - Superior ABS and rubber pads on the bottom to protect the stand from sliding and durable in usage.|[UNIVERSAL COMPATIBILITY] - Works with all 4- 7.9 Inch smartphones, mini tablets and e-readers including iPhone X 8 8 Plus 7 7Plus 6S 6S Plus 6Plus 5 iPad mini, Google Pixel Pixel 2 Pixel XL, Nexus 5X 6P 4 5 7, LG G2 G3 G4 G5 G6 V10 V20 V30 K10 K20, Samsung Galaxy S9 S9+ S8 S8 Plus S7 Edge S6 S5 S4 J7 J3 Galaxy Note 8, HTC, Moto, Nokia, Huawei android phones and more.", "user_id": "AE3SQVHSPJCIM3FT4MYLZOLX2ZSA,AGVJFS4QXURZUT34VBLXILIVA64A,AEC3CTKKV26PO32KOGUKKABJ4OAA,AFWLMSZPLJIABG6W6IFSFLEVHETA,AGZGIO6G2BKPLG4SN6O4ZRQOA54Q,AH3NLKVBUDIHF6LUVBM3CJI4WFXQ,AH43NCUTAEIE2WGCFN3DV6PM5LTQ,AE4CJM43GFS4KYQVZRKJSGM5MIPA", "user_name": "Syed Musaddiq Shazeb,Amazon Customer,Khushi singh,Mayur Pradhanadhan.,Anonymous,Sujeet Chandra patel,AARYAN,Chirojit", "review_id": "R2KLBZ0I1OK6U2,R38C18O8S9O2LM,R1PAUHTSKMIAIB,REREHUV2GTGYO,R2OJMVW8WOYD0M,R1S9ULEQ5XTNFO,R1Y6IA0PNODPA,RHMI8LH34RDXN", "review_title": "Good Stand For Mobiles !,Nice produt,Useful,Affordable and Nicee,Good for the price,Value for money, write product.,Best thing that you need to buy if you have Mobile or tablet...😃,Value for money", "review_content": "This is good mobile stand. Sturdy with mobiles but not sure about tablets. Looks good on the desk but not very much attractive as per its design.Unless you are not concerned more about look of the stand and want it for your mobile then, this will be good for you.,Nice product,This is very useful product..nd easy to use ..so I like it,https://m.media-amazon.com/images/I/61V3BAUrbiL._SY88.jpg,The stand is okay for the price. Doesn’t look very fine, in fact looks a bit old even when brand new. The band name is also not imprinted clearly. Looks cheap, but did it’s job okay. I got it for ₹89 in a deal.Sometimes the mic gets blocked and the phone has to be adjusted a little out of the stand. Overall worth the buy,Product Material - full PlasticQuality - 7 out of 10,Fantastic product,  affordable,  makes work more comfort  🙌 ....Really I'm using it since a month, no issues and complaints...It's quality is not reduced with time....  I think everyone need to buy....For the 1st time I'm giving a review of a product... after some 100s of products I bought here.... think how much I'm satisfies with this cute little thing.....,The product is not the best but a better option at that price range. Bought it for just 119 rupees", "img_link": "https://m.media-amazon.com/images/I/31iE517+NFL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/STRIFF-Mobile-Android-Samsung-OnePlus/dp/B07GXHC691/ref=sr_1_73?qid=1672895770&s=electronics&sr=1-73"}
{"product_id": "B08FN6WGDQ", "product_name": "Samsung Galaxy Buds Live Bluetooth Truly Wireless in Ear Earbuds with Mic, Upto 21 Hours Playtime, Mystic Black", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹4,790", "actual_price": "₹15,990", "discount_percentage": "70%", "rating": "4.0", "rating_count": "4,390", "about_product": "For any product related queries contact us at: 1800407267864|1 year warranty provided by the manufacturer from date of purchase.Note : If the size of the earbud tips does not match the size of your ear canals or the headset is not worn properly in your ears, you may not obtain the correct sound qualities or call performance. Change the earbud tips to ones that fit more snugly in your ears|Crystal clear voice & call quality with 3 mics & a Voice Pick Up unit|Deep & spacious sound tuned by AKG. Sensors: Accelerometer, Gyro, Proximity, Hall, Touch, Grip, VPU|Eye-catching design in a glossy finish that keeps you connected yet comfortable through the day", "user_id": "AHPK4PXDZS4FBECPMPFQOZRLDPAA,AFDZPGN3IBUCVS4QG4U5YCG4QZMA,AGXRKO2ZS34CPIT4HVKL4ZVP7UMA,AGAYLHB4FT5IE4A5NXOCGX6VDWUQ,AHXFVLYGYVEDJD4JY35L425PK5YQ,AHTHZGMRK6ZMTCCPSKOGS7GTFGPA,AFNZPK76SJ4OIOZUZPZUKEDOMJQA,AHDSEBUBYJQEKVHY277BC2ZKYPYA", "user_name": "Chinmoy Saikia,Zuber mutvalli,PARTHA,Bangre M,arjun Roy,dilip,praneet arora,Niraj Jain", "review_id": "RU8SZ6NFWFYV6,R1GQJT5423OND1,R2OJEFG3PL2ZVW,R31P2Q316FHLME,R1JH7M7L4615A2,R2851K7A34YYHT,R22I6M8QU55OWI,R2NCEGPNATUEXJ", "review_title": "Little above average Earbuds,Buds i love,Unique form factor,Best call quality ear buds,Good but is it worth it,Bluetooth range not that good,Excellent sounding pair of earbuds with one fatal flaw,Bluetooth connectivity is not upto the mark", "review_content": "The earphones have good clear sound quality. It lacks base. Battery backup is good. ANC is a myth in this earphone. It might hurt your ear if you wear it for longer duration depending on the shape of your ear,Eat easily fit in ears and light weight ,and sound quality is good too. Over all its worth to by this samsung buds ita connects well to the samsung mobile too.,Bought this solely due to its form factor - to try how samsung has made them to sound in this open bud style. To be true Samsung has managed excellently to give us an unique TWS.This is not an inear style TWS but resembles somewhat earbud style TWS, only of its kind in the market as far as my Knowledge goes.They are held very good in my ears, gives me a good seal and does not fall out (strange as I can't use earbuds because they fall out frequently). It seems that Samsung has finalised the shape after a good homework. However, it doesn't mean that it will fit everybody as there are many dissatisfied users around the globe.The finish, build and all such generic factors are top notch.  The size of the buds and the case is very small.Now about the sound. If the buds fit in one's ears with a good seal, the sound is full bodied but if the seal is not perfect, it may be tinny.The sound signature is very bassy for my taste and I have to eq it to my taste. The bass is so pounding that sometimes it becomes difficult to get a taste of the treble. I listen it in TREBLE BOOST mode adjusted through the app. ANC works strangely and noise reduction is not very decipherable. In contrary, ANC ON somewhat opens up the sound. Don't buy this for ANC.Strangely to me, these buds sound better on my iPhone 12mini than my Galaxy S22 (Spotify and Apple Music). The buds have app support for both Android (Galaxy wear) and iOS (Galaxy Buds Live) but the Android app is more feature packed and works better.  The iOS app couldn't update the firmware (although there is a Menu in the app) and always showed the device to be on latest firmware. However,  as soon as I connected with my S22, on pairing,  the first thing it did was to update the firmware.I love these buds solely for their form factor and they are pretty good for 4.4K against an MRP of 16K. The do sound very good but does not suit my taste.  Persons loving bass may love them. Don't get them for ANC. Battery consumption not yet fully tested but seems ok. It has wireless charging too. If your ears are too small or too large than normal - better not to buy as they may either not go in the ears or will fit loose giving a improper seal.,Best call quality. Noise cancelling could have been improved to best, but still wotks good.Descent battery life.Music is good. Not to that top notch, but good in this segment.Overall worth for buying with good call quality a very little to compromise but good.,I am using this for like 3 months it is a good and productive if you are in the samsung ecosystem if you are not a part then do not buy it its not worth its price.,Bluetooth range is not that good,The sound quality is extremely good for a tws and the sound signature is almost flat. I got these for Rs.5290, it almost felt like a steal deal for me until I faced one cardinal flaw in the design of these buds. The bluetooth antenna has an absymal performance. It feels like I am using bluetooth v3.0. The range is so poor that even if you put the phone in the pocket, the audio starts stuttering. The mic quality is a hit or miss, inside the house it works very well, but outside it performs poorly. I think it has more to do with poor antenna design than the microphone's quality. If you are thinking that maybe the faulty product is an exception, then do a google search about its range issue and you will find hundreds of people complaining about the same thing. Samsung has poorly implemented the design and is reluctant to admit its fault. I pity those who bought it at around 15k for such a flawed product. Even at Rs 5k it is not worth it because of the range issue. It is better to buy a wired IEM, atleast it will sound better than this.,In this price Samsung brand is goodEasy to wear and good battery backupHardly support the 2 meter Bluetooth connectivity", "img_link": "https://m.media-amazon.com/images/I/31Sx7+mu+vL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Samsung-Galaxy-SM-R180NZKAINU-Mystic-Black/dp/B08FN6WGDQ/ref=sr_1_74?qid=1672895770&s=electronics&sr=1-74"}
{"product_id": "B0B3D39RKV", "product_name": "OnePlus Nord 2T 5G (Jade Fog, 12GB RAM, 256GB Storage)", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹33,999", "actual_price": "₹33,999", "discount_percentage": "0%", "rating": "4.3", "rating_count": "17,415", "about_product": "Camera: 50MP Main Camera with Sony IMX766 and OIS, 8MP Ultrawide Camera with 120 degree FOV and 2MP mono lens with Dual LED Flash; 32MP Front (Selfie) Camera with Sony IMX615|Camera Features: AI Scene Enhancement, AI Highlight Video, Slow-motion captures, Dual-view Video, HDR, Nightscape, Portrait mode, Pano, Retouching and exciting filters|Display: 6.43 Inches; 90 Hz AMOLED Display with Corning Gorilla Glass 5; Resolution: 2400 X 1080 pixels; HDR 10+ Certified|Display Features: Ambient Display, AI colour enhancement and Dark mode|Operating System: OxygenOS based on Android 12|Processor: Mediatek Dimensity 1300|Battery & Charging: 4500 mAh with 80W SuperVOOC", "user_id": "AEREO7C5GLYYYV6YXK7X4UCCQTJQ,AHWISRUJUCJG6UH4FFVSPKDJS2BQ,AFIKGABHNR4JSITY4CNM6TMO54EA,AHTWYLMZUCB6QUCNPXWZ2PCKDGRQ,AGBIS5BRLLI652XO3V53YOJMZXXA,AFUT3A3MXCM4JN4XUGMFUMFDBACQ,AHNV3R7QZYE5QVEV7QEEBFO37HTA,AGSZW5C5GBRQXPA2MZ5XNZ7LCRQA", "user_name": "ASR,Amazon user,Rama Rao,Vinay,ANIKET,NAGA SHANKAR.K,pawan k.,Ravi", "review_id": "R128LZ0DN2NZBZ,R3LFQ7EDHZ6DKM,RUSJFUV64DPWM,RHNVN7WEES6ZV,R3LHNY1FJU5Z62,RYD25TMDIWVXF,R22G4CIX0JF8CT,R3KZ4E667WBY58", "review_title": "Really a Good Buy in this price range in 2022,Expected better Battery,Over-all a very balanced product.,Poor Battery life,Good,Temper glasses not istalle properly,It's 8 gb not working like 12gb,Apart from battery and sound quality, everything else is good.", "review_content": "Verdict : A Solid buy for this price segment in 2022 (and even for early 2023)There are 2 reviews in this section. Review 1 is 30 days after purchase (Typos in the Review 1 has rectified now) and Review 2 is 15 days post Android 13 beta update. These reviews are based on my own personal experience of the device purchased here in Amazon on 1 August 2022.Before OOS 13 update, 5G (only for Jio) was enabled via another update. 5G is still not available in my region. Hence, 5G related parameters are not covered in this review.Review 2: After about 15 days of Oxygen OS 13 Beta update (Android 13):(Update received on 1 Dec 2023).Note: After the beta update, no new issues popped up.i.e., there were;No Heating related issues.No fast battery drain.No change in the Charging time.No annoying bugs.No change in camera performance.Beta update is mostly like a Stable update.OOS 13 (Android 13) update review:Delighters:> No new apps added. Absolutely NOT.> System storage consumption remains the same (13.2 GB).> Animations are more fluidic.> More customization UI features added. (Scout widgets in home screen, Enlarged folder & lot more.)> Daily data usage is available in the notification panel and need not be reset daily unlike earlier.> Slight improvement in the Front Ambient light sensor.> Ability to play videos in the background & screen OFF as well (even for YouTube)  (Really a welcoming & longing feature, which other brand UIs have not or only with screen OFF)> Stand-by battery life has improved substantially.Disappointers:> Brightness at lowest level is brighter than before.> No improvement in Sound levels. Still initial 40% is too silent.> No Dolby Atomos (which was mentioned for OOS 13). Perhaps, to wait for Stable update.> Auto brightness latency is higher than earlier. Response time is tad increased.> Haptics have become tighter than earlier, but still not stronger.=======================================================================Review 1:Verdict - A Good Buy in this price range in 2022.Note:- This review is after a month's usage.- Received 2 updates during the course of time (Recent update was of 0.98 GB).- System consumes 13.2 GB space. 128 GB variant is pretty adequate for a normal usage.- N77 band is missing for 5G.- The unit I bought DOES NOT have any sort of heating issues or fast battery drain issue.- Shifting from a 120 Hz to this 90 Hz mobile. No noticeable difference observed. ( In Non-gaming aspect)- Nothing Great or Noting worse in the unmentioned parameters.Things that are delighting;> Exceptional signal reception (especially 4G+ carrier aggregation). Very fast download speeds.> Insane Fast charging (0 to 100% in 40 mins, 30 to 100 % in 20 mins, excluding trickle charge). No heating of the mobile (just slight warming) during charging.> Stand by charge and SoT is fantastic (Even more than 7.5 hrs, for Videos, YT and general tasks and calls, even in mobile data always ON and AOD set to Battery saver.> Oxygen OS = Color OS/Realme OS - Bloatware. The skin is really good & nothing to complain like other brands' UI.> Absolutely no 3rd party bloatware and no ads in the UI or any 2nd party apps. Even some 2nd party apps are \"un-installable\". No major bothering bugs noticed till date.> Yes, the \"Alert slider\" is included, unlike some premium OnePlus models.Things that are annoying;> Dual ambient light sensor (1 in rear and other in front) is not well calibrated. The brightness is always in the lower side and frequent manual increase in required.> Volume level is useless until 40% level (can be audible only in \"Pin-drop silence ambience). Audible enough only post 40% level. Stereo speakers output are 70% bottom and 30 % earpiece. But full volume doesn't distort & is loud enough.> Haptics are tight but not strong, even in higher levels. Effective only post 40% and best only @ 90% level)> Hotspot drains battery quickly (even a warning notification pops up). Also, Chrome and Google app eats away battery quickly. Parallel downloads makes the area near the camera module warm).> Though the in-hand feel is good, the buttons are of no close tolerances and wobbles a bit.> Data billing cycle to be reset daily to show the daily data usage in the notification panel.> The inbuild DAC (no 3.5 mm hole and only Type-C port) is not great. The Dirac equalizer is also not yielding best output. Perhaps, Dolby Atmos support in OOS 13 could improve the audio output.,Overall it's a good mobile phone. The speed and interface is all good but expect battery to last long. Not much, i always keep it in battery saving mode and work for about 18-20 hours on normal use.. not many themes available. Samsung is better in that sense.. there are many wallpapers and themes available. Display is clear and camera is also good! Overall okay.,I got this mobile (12Gb, 25Gb Ram variant)at 31k after 3k discount on icici credit card.For this price it's a must buy.I am using this product since last 2 weeks.The camera is pretty good and the screen and sterio speakers are also working very well.The only complaint I can say is the battery life could have been better, as a working professional it doesn't makes a lot difference for me but who is a heavy user they will need to charge it twice a day.If you have no issues with the battery section then just go for it.👍,Battery drains like any thing. Rest all good.I have to recharge twice a day, don't buy if you want a good battery backup.Even though phone is fast charge, I am disappointed with battery life.,I bought 12gb and 256 and it's working very smoothly, for normal regular use you can go for it.,There is problem with temper glass part , front Cemera area temper glass not installing,Good but not so fast as I think 12gb 256 it's ordinary like 8gb .,Apart from battery and sound quality, everything else is good.", "img_link": "https://m.media-amazon.com/images/I/41iEc0hf6TL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/OnePlus-Nord-Jade-256GB-Storage/dp/B0B3D39RKV/ref=sr_1_75?qid=1672895770&s=electronics&sr=1-75"}
{"product_id": "B085HY1DGR", "product_name": "Sounce Spiral Charger Cable Protector Data Cable Saver Charging Cord Protective Cable Cover Headphone MacBook Laptop Earphone Cell Phone Set of 3 (Cable Protector (12 Units))", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|CableConnectionProtectors", "discounted_price": "₹99", "actual_price": "₹999", "discount_percentage": "90%", "rating": "4.0", "rating_count": "1,396", "about_product": "Protect cables: The cable protector was designed with highly flexible silicone, which can be applied as phone charger saver and charger protector to completely protect cables for all devices|Protection Effect : These cable saver protectors can protect wires and power cords from dirt, frays, tangles and knots; Reduce the risk of fraying and breaking|Touch Comfortable: The wiring protector is made of good quality TPU material, soft and touch comfortable, which can be applied to protect your headphone cords, charger cables and so on|Prolong Life Of Cables:The charger cable saver will help to prolong the life of your cable even the cable has been damaged|Easy to Install: A detailed usage is provided; All you need to do is install according to the steps in the manual", "user_id": "AENDUJB5OZB6K4DYJJ6JCWFTSRCQ,AHRWY7ICLIT3SPBQFPD7V7C7NJDQ,AFSTHMXFUDYHM43NKFYVF5TM2DDA,AGVOU7UYLUAX4S7LCOYNNEXUCD3Q,AHARTLP3RPKXFY37PX5Z5T4JHUEQ,AHJQYBWVOKGBO6SND232KLREKCSA,AHJYRK56SVRBAQZMLOZWPBQU2FFQ,AF5ORZNIXXXLMFXXPZYZLTGPTQAA", "user_name": "Diamond heart,Amazon Customer,Pritish Biswas,Sriram Ramanathan,Srinivasan Subramanian,zubair,Amazon Customer,Amit Chotrani", "review_id": "R3TQ32UCRS81WR,R2QPXXMX0YH89H,R2NBUIKICW6ASD,R3KIQZ1W9FWK3P,R1R9QY3F8M6CXP,R2DNZV0AH311P1,R2ZAGKBTL8IEMI,RGMYTIRB3LWEA", "review_title": "Nice and soft product,IN PICTURE SHOWS AS 16 NOS BUT IN COVER ONLY 8 NOS,Usefull! Bought 3 packs in Rs 99 each containing 4 pieces,Quality Product at affordable price,It helps to hold the joints. But not from the USB level,Very third grade quality,Only two packs came,Cool Product", "review_content": "Very nice product and easy to use as well as very soft to cable.,IN PICTURE SHOWS AS 16 NOS BUT IN COVER ONLY 8 NOS,Easy to attach with usb cable. Bought total 12 pieces in Rs99. Loved it ❤️,Quality product,So far ok. Will hold the wire connecting after the USB joints. But couldn't stop it from bending,Don’t even think of buying this by just looking at the cheap price of this product as it has been made by cheap quality plastic which can not protect your cables as it is not at all sturdy so please don’t buy,Only two packs came,The product is cool. Value for money. Love it", "img_link": "https://m.media-amazon.com/images/I/41nf9n-v3pL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Sounce-Charger-Protector-Charging-Protective/dp/B085HY1DGR/ref=sr_1_76?qid=1672895770&s=electronics&sr=1-76"}
{"product_id": "B08D75R3Z1", "product_name": "PTron Boom Ultima 4D Dual Driver, in-Ear Gaming Wired Headphones with in-line Mic, Volume Control & Passive Noise Cancelling Boom 3 Earphones - (Dark Blue)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹299", "actual_price": "₹1,900", "discount_percentage": "84%", "rating": "3.6", "rating_count": "18,202", "about_product": "In-ear Dual Driver Wired Earphones with Stereo Sound & Bass|In-line Remote Control with Mic, Music & Call Control. Speaker Sensitivity: 101dB±3dB. Frequency Response: 20Hz~20KHz. Mic Sensitivity : -42dB±3dB|1 year manufacturer warranty|Dual Driver Ensures Better Sound Separation; Ergonomic Design; Passive noise cancellation|Comfort & Durable; Gold-plated 3.5mm Audio Jack; Widely compatible with 3.5mm Audio Port Devices; 1.2m Tangle-free Cable|On-the Cord Remote Control with Mic & Volume Control|Premium Design & Durable Material", "user_id": "AHDANFLZ6CRP3NUAFEG5KMPPZOFQ,AGP2HWARZOUPA3CD452G55XDOVCA,AFIXXDE6EGSPL7Z3V2HM2ONLKILQ,AHHC4X3NGUIXBDLGBNSGVCEBBWXA,AFMR2SQ4JJENHHZXWTUYOXFAFBDA,AFSN7XEYM3FYLA553HWSFJIWXNLQ,AFBFWTKCL3QGM752HHFGURNACKNA,AFH5MQTFGQYYKITYYBH5CFON3PEQ", "user_name": "Isfahan A,Anurag,Bhushan,Siddhesh Yadab,Rakesh,Sai,V S GUPTESWAR RAO,Amazon Customer", "review_id": "R2MHX3EGIJVMNQ,R1FHCHWONZZ0YJ,R216RLQKYB7TWS,R1LN12XSMIYTOW,R1TG4AO6RXHQNZ,R1FCJNCO47BBLU,REHOKLPMH5R8P,R34LHGI3NRQ0Y2", "review_title": "For the price tag it's really worth buying.,OK types,ONLY FOR GAMERS,Earphone case was not there,Budget gaming and music earphone,Ok good,Product is good but the accessories like the pouch is not provided as mentioned in the description,product is good but not for this price", "review_content": "So about the product Boom ultima, as it goes by the name it really got the ultimate bass effect. Wires are great built and tangle free. The audio jack is compatible with almost all devices and its gold plated as well. I just didn't find the case. It was missing from my product. Though they have given 2 pairs of extra buds with different sizes. Overall it's a great wired in mic earphones. Go ahead and add to your cart. You won't regret it.,So first, let's talk about the external-Bulid quality is awesome 9/10 even at such an affordable price.Looks-I have all 3 colours of these earphones and all colours looks coolWire-the wire quality is 9/10. I have these earphones from 4 months and these haven't tangled since. Also the rubber coating and the inside braided wires gives a nice  looking effect.But 1 thing I have seen is the middle piece which have a mic and buttons is 180 degree reversed. so, many times it's difficult to pick the right or left earphone without seeing. But it is mentioned on the earphones so that becomes easy.Now about the main part the internalsThe sound quality is so so nice. 😊As you can see in my title. Solid 8/10. You can listen any music like lofi or peacefull type and when it's time for a party you can listen rock, bass boosted songs with such a adorable quality its the true definition for true sound and at cheap prices.Bass quality is also good.perfect for the ears. And if u want high bass, I tried it with max bass it can produce and that's awesome. But don't listen high bass for long. Those can hurt ur ears really bad.But noice cancellation is 4/10.seems like there is no noice cancellation. Maybe its mentioned for the mic not for the earpiece.Obviously there are very high quality products then this product but those will alteast cost 2000. But I will choose this product instead of a 1500 one or less than 1500 because this cost less than 500 or sometimes less than 400(depends on sale) but quality and services of these products are not less than of a 2000 rs earphone.In past, 1 of my earphone died but the coustmer care is so generous, there services are so cool and quick. So those got replaced within 3 days. (it's 3 days because I forgot the eslip, if you mail them with everting ready it won't take more than 2 working days)It's an honest review by me and I will definitely suggest you to but these. ☺️🙃Edited:-Their services are slower now. Don't know why and it takes around 1. 5week to 2 weeks to get the refund. If something happens to ur earphones.Also its been like 1 year as of 1-9-21And I saw some trend with it. My brother earphones stop producing sound from one side evey 4 months or soBut mine earphones be with me for 5 months.It's not a problem though cause you can mail 'em regarding this. This happened with me even with extra proper care of the earphone.Still the best earphones, you can find at this price point,NOT FOR HIGH BASS LOVERS,Everything was OK but as shown in the picture that you will get a case along with earphones,which was not there inside it(only earphone and some earplucks were there),This range very good product.if your budget under- 400 definitely you can bye this product.,Nice product,Product is good but the accessories like the pouch is not provided as mentioned in the description in the second delivery also, despite the return of first delivery of the product  for REPLACEMENT with pouch,product is good but needs to work on noise cancellation", "img_link": "https://m.media-amazon.com/images/I/41EnFjIAoaL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Boom-Ultima-Headphones-Cancelling-Earphones/dp/B08D75R3Z1/ref=sr_1_77?qid=1672895770&s=electronics&sr=1-77"}
{"product_id": "B0B4F2TTTS", "product_name": "Samsung Galaxy M13 (Aqua Green, 4GB, 64GB Storage) | 6000mAh Battery | Upto 8GB RAM with RAM Plus", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹10,999", "actual_price": "₹14,999", "discount_percentage": "27%", "rating": "4.1", "rating_count": "18,998", "about_product": "6000mAh lithium-ion battery, 1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase|Upto 12GB RAM with RAM Plus | 64GB internal memory expandable up to 1TB| Dual Sim (Nano)|50MP+5MP+2MP Triple camera setup- True 50MP (F1.8) main camera +5MP(F2.2)+ 2MP (F2.4) | 8MP (F2.2) front cam|Android 12,One UI Core 4 with a powerful Octa Core Processor|16.72 centimeters (6.6-inch) FHD+ LCD - infinity O Display, FHD+ resolution with 1080 x 2408 pixels resolution, 401 PPI with 16M color", "user_id": "AGAELRYPMTG5SADZPDYB343EASAA,AGFN4JODOM2NTFCJQOHDBQLVDJTQ,AG7EZVSAXIVGMNDLSA55K7URQCJA,AGGF75HIEMB67OU7J3RDALBSUKQQ,AHY5CI4SU6JBYPIZ5RLAGO6W3F4A,AE4KODNBVTDCZWZO4HZM4GTRERPA,AH6HFHSYOY2OHMODD7244DHG7FUQ,AHRW5JERWYAJCZO65PDKZSOEPR6Q", "user_name": "Satheesh Kadiam,Pritom Chakraborty,Vishwa,Simranpreet Singh,Saptarshi,Amazon Customer,D.RAGHUL,Dharmendra kumar", "review_id": "R2K5OD0MEEBTDL,RS1N6TNO33BOK,R6KWBGOKI1N9Y,R30SKUMYLSXXDN,R1EOYHZWCRSV7B,R13JBDK4SAAYFT,RJOU5K9ECNW7Y,R2APPRANV6IERZ", "review_title": "Phone, camera, heating - works for me, may not for all,Good Mobile,Good but not excellent under this budget,Worth the price at 9499,Ok type phone... but unable to make videocall within same service provider.,Phone review,Budget king,Battery backup is good", "review_content": "I am not big on camera usage, personally. I was even mentally prepared for a bad camera, based on some reviews here. But I was pleasantly surprised that camera clicks good photos. They are not awesome, but they are decent photos that can even be shared.Now coming to my biggest grouse; heating issue. The phone started heating up while charging, but it was just a little and so I could have ignored it. But then it started heating up more and got me very concerned. I even ordered a replacement thinking I got a defective piece. But then, after further tests, I found that it is heating more when I download huge amounts of data, for example, when I restore data of my old phone, from back up. This is ok with me as, I don't perform huge data loads regularly, definitely not on phone. Then I tested by running tasks I usually perform such as checking office mails, attending office meeting on phone, watching a video from Amazon Prime, and so on. The phone did not heat up even a little. Personally, this is good for me.At this price range, this is a good phone. But if you are camera heavy user and expect to perform heavy downloads frequently, this phone may not for you. I am personally satisfied with this phone as it works for my type of usage. I will not go into plus points of this phone as they are covered by other reviews already. I am only attempting to clarify about how this phone can suit you (or not) in terms of camera and heating. I had many questions about these aspects before buying. Perhaps this review will help you make an informed decision to buy (or avoid). Cheers.,Display - BeautyCamera - decentPerformance - AmazingBattery - ok (in 5000mah u expect more tbh)Overall good phone...Also after 1day of use, i found some network connectivity issue in my jiosim, which I'm using right now in this phone, but I'll keep update this review after 1month of usage!,It's a decent mobile under this price but few things worried me , weight of the phone, too many procedure to change some settings, no screen casting. Apart from that it has good touch, a decent camera for day light , battery life is good.,I bought this smartphone for my mom. Samusung interface is very handful for easy use. Battery is superb, last whole day. Camera is mediocre but provide original colour pictures. All in all satisfied with this smartphone that i got in sale for 9499.,Unable to do video call within same service provider as in VOLTE within same service provider video call feature is available.,Product is fine.  Nothing Fancy but for the budget it is a good phone.,BATTERY : more than enough for normal use  Not sure in gamingCAMERA : good in this segment , can record  videos in FHD 30fpsDISPLAY : since it's a LCD display the quality is  a bit less , but goodV RAM : you can add upto 2gb of virtual ram  but have to sacrifice your storage  Space to use it  OVERALL A GOOD BUDGET PHONE,Finger print is working speedy battery backup is good camera quality is also good", "img_link": "https://m.media-amazon.com/images/I/41op1vdp-UL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Samsung-Galaxy-Storage-6000mAh-Battery/dp/B0B4F2TTTS/ref=sr_1_78?qid=1672895770&s=electronics&sr=1-78"}
{"product_id": "B09WRMNJ9G", "product_name": "OnePlus 10R 5G (Forest Green, 8GB RAM, 128GB Storage, 80W SuperVOOC)", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹34,999", "actual_price": "₹38,999", "discount_percentage": "10%", "rating": "4.2", "rating_count": "11,029", "about_product": "Camera: 50MP Main Camera with Sony IMX766 and 2MP Macro Camera with Dual LED Flash; 16MP Front (Selfie) Camera with Sony IMX471|Camera Features: Nightscape2.0, Super Macro, UltraShot HDR, Smart Scene Recognition, Portrait mode, Pro mode, Panorama, Tilt-shift mode, Focus Peaking, Filters, Video Nightscape, Video HDR, Video Portrait Timelapse, Hyperlapse Mode|Display: 6.7 Inches; 120 Hz IRIS Display; Resolution: 2400 X 1080 pixels 394 ppi; Aspect Ratio: 20:9|Display Features: Hyper Touch Mode, Reading Mode, Night Mode, Eye Comfort Mode, Auto brightness|Operating System: OxygenOS based on Android 12, Processor: MTK D8100 Max|Battery & Charging: 5000 mAh with 80W SuperVOOC. In-Display Fingerprint Sensor|Special Features: Hyperboost gaming engine", "user_id": "AHLYJKN3B45FGUXNLI7HBJRMQXBA,AGU3XNDQ5OIFEYL6W7FGAB4QNOPA,AFQQLWLDOYRTQWZETYX6CFXNEOJQ,AGJLSJO25FNAPTAMQITAMV2DTV7A,AGFXSW2YQHNS2ZPAMQHQLDH5QBZQ,AFNQRKRC76QTV3ANYGVIX3WGB7AQ,AGJU6F3B6JF6P3W5KKTWBRLGQFRA", "user_name": "Dinesh Kumar,Saurabh,BIDESH PATRA,Prateek H,SHREYANSH KAPADIA,Vinayak joshi,Zarafatima", "review_id": "RB90KDMXOCCPZ,R1OARKAJGLAKQ4,R1N33NHFCLHH1Z,R3JL5MHXQ8MCFN,R38ZGFRJN3GTNB,R1VN3PBKU8OEGA,R27ULMSJKIY5YD", "review_title": "Best option in 35k category.,Terrific purchase,A highly priced smart phone.,Can't get better at this cost. Review after one month of use.,Oxygen OS is providing poor experience, overall device is okay.,Ammazing Product,Okay", "review_content": "I am using OnePlus 10R 8GB 128GB more than one month. It is my first ever OnePlus phone. My personal review about this phone is as under:Pros:1. Boxy design looks nice but feels not so premium but if you use its cover it feels nice. Cover quality is very nice.2. Screen is bright even in sunlight if you select auto brightness. Also screen color and touch response feels premium.3. Battery life is very impressive with 1.5 day backup with normal use.4. 80 watt charger is very fast which charge your phone within 30 to 35 minutes.5. I am not a heavy gamer but I tried asfalt 9 which runs very smooth.I think it'll play heavy games smoothly. So it perform well.6. I am new to use Oxygen OS. I feels OS premium and smooth without adds.7. Rear camera shots very good pictures but selfie camera need some improvement which I think can be done via software update.8. No heating issue.9. Lightweight.Cons:1. If you use without case, it doesn't feel like premium phone.2. I don't like the sound quality although is has dual speaker. You can feel vibration on its back pannel which feels very bad.3. Selfie camera needs improvement.4. Zoom is very bad on rear camera.5. No IP certification.6. No expendable storage.7. Paid theme store.8. Should have some dot notch animations like samsung.  At last I can say it is a nice phone with some cons, if you want OnePlus smartphone within Rs. 35000/- you can go for it.,Terrific purchase at the price of 33k. Body I feel light htough it is not as usual OnePlus body as I had been the user of one plus in past also. Metallic sides could be a better option. Sometimes I feel lag in touch though it is for microseconds but it is there. Camera quality is good not awesome. Battery life is good i used to charge once and a day can be completed by itm Obviously, i bought it as it is one of the affordable option in terms of brand. Love to see metallic frames in coming phones. Storage is tremendous and speed is also good m Overall a good purchase a phone can be rated 4 out of 5.,This smart phone is good enough for daily normal use. But battery life is not good enough though is says 5000 mAh. Camera quality is not good enough in this price segment. Although it's Oxygen os, it is not well optimised. From the starting there will be some lagging issue with some apps. Another bad thing about this smart phone is its form factor. The company taking around 39k but giving just a plastic body which will looks like below 20k. If someone wants to buy this i suggest to buy another model don't go for this model because of the brand. One good thing is oneplus promised three major android update and four years security update. Another bad thing its primary camera design. One of the three camera is so big that it's embracing to say its price is 39k.,I would like to get directly to the pros and consPros.1) BATTERY - The first and the best thing about this phone is the damn battery life and how fast it charges. It's just amazing and I have been kind of spoilt by it now, I wont be able to adjust with a lesser battery performance and charging anymore!2.  CAMERA- The camera is amazing and takes some really amazing pictures. No complains.3. LOOKS - The phone looks really beautiful. I got the forest green colour and it looks simply awesome and is eye catching and premium looking.CONS1) The overall working of the phone is not as seamless as it should be provided the hardware it boasts of. Having said that, the factor cannot be a purchase deterrent. It's otherwise quite smooth2) The absence of an alert slider was a disappointed. I was used to it on my 6T3)Volume - Not too happy with the phone speakers. They somehow are not up to the mark.To sum it up- Just go for it if you have a tight budget but want a premium looking, good performing phone. It packs too much for a 43k phone - good battery, fastest charging in the segment, premium looks, good performance.,Using the phone after two days I have noticed weird experience with UI, tapping on grey or black areas screen flickers to that portion and according to service centre it's common issue across all phones and getting fixed by Oxygen 13 update as there were no issue with 10pro.So we have to do nothing but to wait for releasing the new OS update on the 10R and other models as well.Overall device working good so far I experienced average camera results,superb charging but not so extended battery life, touch sensor and speakers are fine and performance is good in my day to day tasks, hopefully UI and OS updates will help to deliver best of this phone.,Over all camera 📸 is just ammazing I am a youtuber purpuse behind choosing this device is it's processer dimencity 8100max it's a supersaft max performence not even capturing while gaming also it's runs very smoothly and it's my FIRST PREMIUM SMARTPHONE I'm the uploded photos20x zoom lg pic and I have uploded night and day liting pics to compareGood device from one plus,Its speaker is not really working well using it since 6months only plus it dosent comes with a warrenty plan it has to be brought separate camera quality is also okay not thattt good microphone is also been disturbing a lot while talking on the call other side person gets a lot of disturbance", "img_link": "https://m.media-amazon.com/images/I/41pQ4gJMwEL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/OnePlus-Forest-Green-Storage-SuperVOOC/dp/B09WRMNJ9G/ref=sr_1_79?qid=1672895770&s=electronics&sr=1-79"}
{"product_id": "B0B14MR9L1", "product_name": "Samsung Galaxy M33 5G (Emerald Brown, 6GB, 128GB Storage) | 6000mAh Battery | Upto 12GB RAM with RAM Plus | Travel Adapter to be Purchased Separately", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹16,999", "actual_price": "₹24,999", "discount_percentage": "32%", "rating": "4.1", "rating_count": "22,318", "about_product": "Exynos 1280 Octa Core 2.4GHz 5nm Processor with the 12 band support for a True 5G experience|16.72 centimeters (6.6-inch) LCD Display, FHD+ resolution, 1080x2400 pixels protected by Gorilla Glass 5|Versatile Quad camera setup-50MP (F1.8)+ 5MP (F2.2/UW- 123 FOV) + 2MP (F2.4/Depth) + 2MP (F2.4/Macro) QuadCamera| 8MP (F1.8) Front Camera|Massive 6000 mAh Battery | Memory, Storage & SIM: 6GB RAM | 128GB internal memory expandable up to 1TB| SIM 1 + SIM 2+ Micro SD|Latest Android v12.0, One UI 4 operating system.", "user_id": "AHJJY3GFDJFTDTX5536IMIXVNCNQ,AEYIVONPYGGVCE7K4Y3PNQPKVHSQ", "user_name": "Atulya Sinha,SujayZ™️☑️", "review_id": "R36UIGIQWYOKT,RISUCL5YV9EZN", "review_title": "THE PERFECT PHONE – FOR MY REQUIREMENTS,Galaxy M33 5G a mixed bag of Affordability", "review_content": "I would not consider buying an i-phone simply because my friend owns two of them – or blindly go for a new Android model suggested by my son or nephew (both of whom are more tech savvy than me) because their recommendations are obviously based on their own needs and expectations, which may differ from mine. I am an old-fashioned mechanical engineer with a basic understanding of parameters like millimetres, megapixels and megabytes – but I think of a cellphone as a utility item, not a status symbol. Applying a technocratic approach, I would not choose a costlier option unless I get additional features which suit my requirements.My foremost requirement – which is entirely non-negotiable – is that my handset must have provision for two SIM cards, since I do not want to carry two separate handsets for my CUG and personal numbers. My other requirements are not difficult to fulfil: a phonebook with at least 2000 contacts, basic net connectivity, a basic camera for photos and videos and scope for downloading a few apps such as the ubiquitous WhatsApp and my favourite word games (which do not need much memory or processing capacity). I would certainly appreciate practical features like high reliability, software and security updates and high battery capacity (sufficient for 24 hours or preferably 48 hours at my normal level of usage). Besides, I would like to use a new handset for at least two years.Apart from exigencies, I do not intend to use my cellphone for surfing the Internet, videoconferencing or sending e-mails as I prefer using a desktop or laptop for such activities.I am equally clear about what I do not need. I do not intend to use my cellphone for watching movies, reading books, listening to music or creating fancy social media posts. Nor do I want a device for taking high resolution photos during a vacation as I would prefer to use a camera. At the risk of sounding flippant, I would say that I do not want a device to unlock my car or count the strokes in a game of golf – primarily because I do not own a car and I do not play golf!Having used smartphones of Samsung and Motorola makes over the past few years, I vastly prefer the former. My last phone, which gave me over 30 months of good service, was a Samsung M30. Since that model is obsolete now, I focused on its upgraded cousins: M32, M33 and M52. The last was immediately ruled out as it does not support two SIM cards along with an SD card. After studying the relative specifications of M32 and M33, I concluded that the latter offers better value for money. Generally, it is worth going for the higher memory and higher RAM versions as these parameters affect the performance and the difference in cost is relatively small. With these considerations, I narrowed down my choice to M33 with 8GB RAM and 128GB storage (Just twenty years ago, I was using a desktop with 2GB memory!)As a confirmation for my choice, I compared the phone I had selected with OnePlus Nord CE 2 (8GB RAM, 128GB Storage) which my son had recommended. The specification of the Samsung phone was found to be equivalent or superior for the major parameters, except that the display screen technology was TFT instead of AMOLED. I also watched some Youtube videos about these handsets for a better appreciation of their competing features. The clinching factor was that the Samsung phone was priced substantially lower than the OnePlus product.As for body colour, my first choice was Emerald Brown, but I settled for the Mystique Green since the former was not available in my selected configuration. I was thinking this would be irrelevant since I use a case which completely encloses the handset, but it turned out that the body colour can be glimpsed through the cutout for the cameras on the rear of the phone.Despite a strong family resemblance with my old one (M30), the new phone (M33) offers decidedly superior specifications and it meets my requirements perfectly. It is a few millimetres longer and a few grams heavier than my old phone, but these differences are acceptable to me. Thanks to the 50MP front camera and 8MP selfie camera, the quality of photos and videos is above my expectations (see sample pic taken at night at a distance of about 30 metres from the stage).  This phone offers two years of android updates and four years of security patch updates, which reduces the worries on these fronts. Youtube reviewers complain that the M33 has plain looks, it is heavy, its audio does not offer an ‘immersive listening experience’ and its screen is plain old TFT instead of AMOLED. I am willing to live with these perceived shortcomings, so long as the M33 meets my requirements.I was glad to find that Samsung has taken an environmentally friendly step of offering many models of handsets without chargers – because old chargers, like old handsets, add to e-waste. However, it needs to be kept in mind that new handsets require higher capacity chargers. The recommended charger for M33 is 25 watts, but the chargers I had at home are rated at 5 or 10 watts.To cut a long story short, I ordered a 25-watt charger along with the phone to avoid compromising with the charging time. After using the new handset for a couple of weeks, I find that my phone is at 60-70% charge at the end of the day, and it takes 30-40 minutes for complete charging (one of the useful features of M33 is that it shows the time remaining for complete charging as soon as it is plugged in for charging). It turns out that I could have managed with the old 10-watt charger, except that it would have taken 60-90 minutes for full charging.I conclude by emphasizing that Samsung Galaxy M33 5g is the perfect phone – but for my requirements. A word of advice: if you are planning to buy a new phone, it would be helpful if you list out your requirements so that you do not end up paying for features that you do not intend to use.,With 5G connectivity, a 120Hz display and solid performance, the Galaxy M33 5G is Samsung’s best-value smartphone yet under 20K segmentPros Almost half the price of Galaxy A53Exynos 1280 is a solid performerExcellent 120Hz display with smooth experience across the boardHuge performance uplift over M32One UI 4.1 based on android 12 has tons of good features to love, none of the flagship grade features are skipped here (apart from dex mode and spen features), Zero lag or stuttering in 120 hz mode with ease of use and seemless switching of apps without any crash or reloading  of apps, makes using one ui pleasure to surf acrossYou get features like a screen recorder, video call effects, Game Launcher, Link to Windows, Dual Messenger, Quick Share, Music Share, and Secure Folder, along with many others. Some of the fancy Android 12 features, like the ability to change the color palette of icons and menus based on the wallpaper and dim the screen for easier reading in the dark, are also included.Voice focus for calls is excellent feature, phone call quality is really good even in nosiy and crowded areasI had no issues with GPS or connectivity while using Google maps to navigate,  signal stays strong even in rural areas, thats a positive point with good accuracy4g Volte with carrier aggregation works flawlesslyWifi connectivity on the Dual band 5ghz router is strong and performs  more than satisfactorily with low latency responseBluetooth 5.1 connectivity is strong and has good range  no worries of disconnection even as far as 15 metersAudio quality via 3.5 mm jack is excellent compared to Redmi note 10 pro, much more defined and well roundedFor media consumption widewine L1 support is present, Good AV experience on ott platforms, I have no serious complaints about color reproduction in videos considering TFT LCD this panel does a good enough job .Main Camera 50mp is on par and better than Redmi note 10 pro in almost all conditions, retains colors close to reality with good dynamic range and handling of exposure with HDR in photos as well as videos, it is able to handle extremely bright conditions wellEven in shadows during day time it was able to maintain good colorsGood Stable videos at 1080p4k video recording is available at 30 FPS is availableMany cool camera features , boasts AR fun mode, single Take, Object Eraser and Video TNR (Temporal Noise Reduction) which makes it fun to use cameraSelfie camera has good punchy colors, Samsung's way of boosted colour processing some may like it ,some may notExcellent battery life, got 9 hours of SOT despite the heavy usage. It takes around 1.5 hours to go from 0-100, and half an hour of charging can take the battery percentage to around 45% provided you have 25 watt Samsung’s chargerDespite summer time, phone has managed to stay relatively cool, 5nm architecture helping its cause here12 5G BandsDedicated SD card slot is a plus herePD 3.0 25 watt fast charging support reasonable for price segment but we have seen faster charging speeds with other OEMsPromised 2 major android OS updates and 4 years security updates is a huge plus above its competitors, making this device more value for money in long runCons Ultrawide camera is on softer side , lacks details compared to its primary sensor but manages to frame good shots that one can post on social media, macro camera is good with colors and edge detection but lacks depth of field and details , Note 10 pro which is brilliant in this caseNight shots are above average mostly grainy and muddled but better than most smartphones in its segmentLacks some stability in Video recording at 4k Amoled display could have made it unbeatableLacks stereo Speaker, but audio quality on single speaker is quite goodPre-installed bloatwares like Moj, dailyhunt, sharechat, byju's are mild and uninstallable but makes mature one UI experience looks immature out of the boxCurrently device is not tunned for high gaming performance as limited FPS in popular games like BGMI and COD deters it away from being a gamer friendly device, but we  can expect exynos 1280  to resolve over time and be more optimized for more games in future updatesSlightly cheap design , Chunky in size, carries some heft, Dated notch displayLack of charger in the box is a bummer, which adds up to the value cost proposition", "img_link": "https://m.media-amazon.com/images/I/419KF2t1nML._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Samsung-Emerald-Storage-Purchased-Separately/dp/B0B14MR9L1/ref=sr_1_80?qid=1672895770&s=electronics&sr=1-80"}
{"product_id": "B09ZPL5VYM", "product_name": "Ambrane Mobile Holding Stand, 180° Perfect View, Height Adjustment, Wide Compatibility, Multipurpose, Anti-Skid Design (Twistand, Black)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Stands", "discounted_price": "₹199", "actual_price": "₹499", "discount_percentage": "60%", "rating": "4.1", "rating_count": "1,786", "about_product": "Multipurpose Stand: It is a dynamic Mobile Stand for your ofﬁce desks and more. It can hold any type of smartphone easily.|Supreme Quality: Twistand is made up of premium metal with a water-repellant ceramic finish. It gives you a hassle-free and hands-free experience.|Telescopic Height Adjustment: It gives you freedom to adjust its height from 125mm to 164mm according to your needs.|Perfect View: It has an adjustable design which you can reshape according to your smartphone on the desks to give you perfect viewing angle.|Anti-skid Body: The anti-skid pads on the body prevents accidental slips and protection from scratches.", "user_id": "AF535RV7I3GDWBJZWB7HOLHYAUFA,AENGUPOM2EDK3DTX7BZUWYKZIDJA,AFDSO2WPP2FVD5GLVREORVV23VNA,AG36G3XPHERLKRDG7XYQ2IWJWPIQ,AFZYCNGGJWPEVKRYOBQCJFBFPF2A,AFRJUP6OCPKPDASMS3ZF4CXWXCXA,AEW2RGBB7GXPNUGFBMKMK4OKGE7Q,AEGZCGGDNS4ZRNPG3CDULRVB5Z5A", "user_name": "Rohan Kumar Gupta,Harshal Jadhav,Banishree b.,Amrut K.,Surajit,Rahul,Vishal,Jai kumar", "review_id": "R34U56TMQL8B9J,R2SPWOVTNO9SQP,R1D39QP2DCGN5D,RP84GJ5M88XI,R16V2OB7NBKY0L,R22NOAMYT0PYEE,R1QAI2QLFV2ST1,RMXN9V3YLV8Q9", "review_title": "Highly recommended,Very flexible,Good,Very good product,Good,It's worth every penny,Good,Mobile stand", "review_content": "The stand's quality is decent. Beacuse of its compact size and various folding angles it widens the usage according to the user. Highly recommended for students !,One side is slightly tilted,Good product ....,Good grip & sturdy product. Fullfill the need. Overall very good product. Given gift to friends.,Good,Quality is good,Built quality good,Excellent product", "img_link": "https://m.media-amazon.com/images/I/41-oxsVh7nL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Ambrane-Adjustment-Compatibility-Multipurpose-Anti-Skid/dp/B09ZPL5VYM/ref=sr_1_81?qid=1672895770&s=electronics&sr=1-81"}
{"product_id": "B0993BB11X", "product_name": "Ambrane 10000mAh Slim Power Bank, 20W Fast Charging, Dual Output, Type C PD (Input & Output), Quick Charge, Li-Polymer, Multi-Layer Protection for iPhone, Anrdoid & Other Devices (Stylo 10K, Black)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|PowerBanks", "discounted_price": "₹999", "actual_price": "₹1,599", "discount_percentage": "38%", "rating": "4.0", "rating_count": "7,222", "about_product": "Power-packed 10000mAh- Lithium Polymer 10000mAh capacity allows you to efficiently charge your devices multiple times. It can charge iPhone 12 – 2 times, OnePlus Nord - 1.5 times.|20W Fast Charging Output– Powerful 20 Watts PD and QC output for boosted charging speed, so that you always stay ahead in the league. It carries an extensive capacity to charge your mobile 50% in as quickly as 30 minutes on average.|20W Fast Charging Input – The powerbank itself can get charged in 4 to 5 hours as it has Power Delivery Technology which supports 20W fast charging input via Type C port|Charge Multiple Devices – With 1 USB port and 1 Type C port for output, it can charge 2 devices at the same time.|Sleek and Stylish- Supremely modish and handy design makes it a style statement while its compact body makes it extremely travel-friendly at the same time.", "user_id": "AFZRJWGYUFNULZQLL27PLZYMTYFA,AELUUSXPQUT3DD5LODET67QZYXVQ,AHN5GP2G4PSPXMVTCK3D7FJSUMFQ,AHXQK2APPFORQPV6E43FW2W6DVVQ,AGH3POHLPXABF3I4ASSGTRXAUPPA,AGUKWQ7OYGHXWZQYRBDSP2V77KDQ,AGRFG6LVUVOX5TDHEZULKHHKYK3Q,AGXBRUP77BK42TS3EE7MPBX2OBXQ", "user_name": "RAMKISAN,Pawan Kumar yadav,Nikhil,Drew Arsenic,nisar,kanishk,Amazon Customer,Kulveer Singh", "review_id": "R83JPRO9V52P,R3UTU1ETF9YL12,RSOL1K3LF3E2I,R377A8K2HZUIKP,R34U15DVK45JC1,RAI2NHXM94X69,R3IW1BTNA6GQJ4,R1VS6ME7USZQ76", "review_title": "Nice product,Good,Kaam sahi karta hai ji,Woks fine,Nice,good and portabe,Good for a single charge of 5000mah mobile.,Good product", "review_content": "I am very happy after using it.  This power bank is very good.  I have seen a video on YouTube with an amazing rating before buying it.  Enjoyed buying it.,Good product value for money.,Esme ek choti torch Jaisi light add Karke thoda price Badha Den to Mast Raho 10,Over all a great product but i have faced a problem while charging the power bank with my mi 120w charger it never accept quick charge and sometimes takes more than 12 hours to charge.While with macbook pro charger it accepts quick charge (that green light).I bought a separate charger for this power bank😭,Good I like it,Power bank is good the only issue was the cable which came with it broke after a day of use and also damaged power port of phone,Just good as expected, compact size, came with a premium good packing.... need see how it performance. With 10000mah u can charge 2 devices at a time. But good for a single charge of 5000mah mobile.  They have given one USB A type to C type cable, if you have another C type cable, with that u can charge another device. I like the carrying pouch they provided.,I didnt got any pouch with this power bank", "img_link": "https://m.media-amazon.com/images/I/21e5ZrIutKS._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Ambrane-Multi-Layer-Protection-Li-Polymer-Stylo-10k/dp/B0993BB11X/ref=sr_1_82?qid=1672895770&s=electronics&sr=1-82"}
{"product_id": "B09V2PZDX8", "product_name": "Nokia 105 Single SIM, Keypad Mobile Phone with Wireless FM Radio | Blue", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|BasicMobiles", "discounted_price": "₹1,299", "actual_price": "₹1,599", "discount_percentage": "19%", "rating": "4.0", "rating_count": "1,28,311", "about_product": "All-new redesigned Nokia mobile which is familiar and easy to use|Island style keypad phone with white key lettering|High quality 1.77” screen|Pre-loaded games including the classic keypad mobile phone game - Snake|Enjoy all-new wireless FM radio|Save 2,000 contacts and up to 500 SMS on your Nokia 105 mobile phone", "user_id": "AE27UOZENYSWCQVQRRUQIV2ZM7VA,AGMYSLV6NNOAYES25JDTJPCZY47A,AFHS33MWRQGSS64EETZJGCBWXXXA,AHYXZVXUY3QTBP7IBFIUBSZVH2XQ,AH2SHWYEWDAK6A5Y2ZBEMZ2KIG3A,AEYMOGP2CYRKYZ7TIDNLGR5QPZ4Q,AGPGDCCXPI3EACMNJKBCNT57DVFA,AFPBMRYRSMD3PP3CBKLFF7EKOCXA", "user_name": "virender malhotra,Vikas kabra,Das,Naveen,Amazon Customer,Adv. Manish kotwani,Vinod Jadhao,Priti tijare", "review_id": "R1BFOK13WV2QLM,R3H97FN1H50F7F,R1IY2IDRUJX5O5,R1N5UJPJ5YGBU5,R3BZ3W2KH0X1DQ,R3GPO2WYK6ABG,RCMFGYS1T27LL,R1D5OAMYO4526T", "review_title": "Centre key,Nice phone,Good for Exam preparing students,Center button is not good,Battery runs out quickly,Nokia trusted brand only needs to improve ringtone sound,best phone,..", "review_content": "Phone is ok except middle button it’s a headache.  rest all is good battery lyf is about 10-12 hrs when fully charged,Superb battery life for more then 3 days,I bought this phone to use as a replacement of my smartphone for calling, alarm, listening songs purposes.I didn't face any problem but the sound & its quality is somewhat low compared to normal smartphones. Song quality is not that good & not even bad but ok when listening through earphones.I only use it for receiving sms & calls & occassionally to listen songs & battery backup is very good that it lasts upto 7 days etc.. for 1 full charge.It would've been much better, if it included more alarm options than the limited 5 alarms, stopwatch & timer.Overall, it's a good replacement of smartphone for me till now.,Action button(center button) is not good, it takes more than 1 attempt sometimes to perform OK action.,Battery backup bad,Needs to improve ringtone sound,best phone hai. nokia is always best. price thodi kam karni chahiye.,I like this product", "img_link": "https://m.media-amazon.com/images/I/41w5fk8Vl6L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Nokia-105-Single-Keypad-Wireless/dp/B09V2PZDX8/ref=sr_1_83?qid=1672895770&s=electronics&sr=1-83"}
{"product_id": "B085W8CFLH", "product_name": "PTron Tangent Lite Bluetooth 5.0 Earphones with Mic, Hi-Fi Stereo Sound Neckband, 8Hrs Playtime, Lightweight Snug-fit in-Ear Headphones, IPX4 Water Resistant, Fast Charge & Voice Assistant (Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹599", "actual_price": "₹1,800", "discount_percentage": "67%", "rating": "3.5", "rating_count": "83,996", "about_product": "1 year manufacturer warranty|Immersive Audio with Deep Bass; Bluetooth 5.0; 8 Hours Music Time; 1.5 Hours Charging Time; 10m Wireless Range; Strong Connectivity; Passive Noise Cancelation; Fast Charging & IPX4 Water Resistant|In-line remote control allow calls & music control for a hands-free experience|Ergonomic Sports Design; 120mAh Li-Polymer Rechargeable Battery: 200Hrs Standby Time: Micro USB Charging (cable provided), Widely Compatible with All Bluetooth Enabled Smartphones & Tablets|Simple 3-button multi-function controls with HD mic and instant access to your phone's Voice Assistant", "user_id": "AHCZZTKJ5WN7WJSQU3HWL2LK6XQA,AE6OITGK4Q3JK2PM6CA7Q5YVED6Q,AFPXC62PG7UC6DQ7WET3HSXJQ5XA,AG2KPNJXAZXHKWUMAM3PTCO4T7RA,AFLB34EOC2F37MXTUPWYAUBFLXKQ,AGFSZ3NBVGWR5NBRNYIEBHLMSZGQ,AGQ3O74IZOTXX6NCRGUU5SSCAHVQ,AG62MXMQ7L2PI4B757FPQYANBH6Q", "user_name": "Chyanika,Suprit Sagar,Jindal,Kiran Kumar,K. prasanthkumar,Joney aheibam,Anand,Baby", "review_id": "R1Z1YO987IN6WA,RRW1QA494UE5V,R14EM7EM0MGBC5,RLPQ6DDNYDH9F,R1NX8T5TN04CZ1,R135SE2MJDL8AY,R2GLOHTJX5OYOQ,R3TYVHL507XB76", "review_title": "Worth every penny,Price,Amazing product,Nice,Just ok,Value for money, sound quality is good 👍, super fast delivery,But warrant needed,Good quality", "review_content": "Worth every penny compared to the cost. A basic Bluetooth band that support only single device at a time. Call voice us clear,  and microphone does a decent job of noise cancellation.Don't expect good base treble in this. The rubber ear piece is not tight enough even with the large ones and keeps slipping away. The magnet is also weak and doesn't connect smoothly,I had ordered my first ear phone from ptron only and to tell the truth, it is very difficult to get such a good quality earphone phone at such a low price.  Best earphones in such a low price. You will not regret the money you have spent if you buy this.,It is a good product,Y,Nice,Built quality is lil bit cheap, but sound quality is superp comparing to other grand companies like jbl, sony, Senheizer, bass is moderate, noise cancelling needs to be improved, my overall rating is 4star.,Good,Good quality", "img_link": "https://m.media-amazon.com/images/I/41qhEf58vbL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Tangent-Lite-Magnetic-Bluetooth-Headphones/dp/B085W8CFLH/ref=sr_1_84?qid=1672895770&s=electronics&sr=1-84"}
{"product_id": "B09MT6XSFW", "product_name": "Samsung EVO Plus 64GB microSDXC UHS-I U1 130MB/s Full HD & 4K UHD Memory Card with Adapter (MB-MC64KA), Blue", "category": "Electronics|Accessories|MemoryCards|MicroSD", "discounted_price": "₹599", "actual_price": "₹1,899", "discount_percentage": "68%", "rating": "4.3", "rating_count": "1,40,036", "about_product": "Up to 130MB/s read speed with UHS-I interface. Performance varies by capacity.|Works with cell phones, smartphones, Android tablets, tablet PCs, and more.|6-Proof protection: Waterproof, Temperature proof, X-ray proof, Magnet proof, Drop proof, Wearout proof|10-year limited warranty; For further queries, please contact us at 1800 30 7267864|Includes full size adapter for use in cameras, laptops, and desktop computers", "user_id": "AGKL2QQZYTI6LCC4CDJEGIV3EDUQ,AGFI73CMZKYLOYXJFEQBOGGVTTMA,AELXR5NQFM7D6VMAQLQ75LZKBRQA,AEOFVQUVTVP7AU7TM7IZBXJC3NOA,AHG33QRWJPAIDBY3URAHOVO67T5A,AEWCPYNJLQRK7UW54HDWPA45R6SA,AHLDP6L4GQIF7MJWWMNALXNQXYEQ,AG5TXJG5DJ554EJX2GMQL67ZCP2Q", "user_name": "Soumendra Pattanayak,Kumar.katukuri,RAJULAPATI MARUTHI VARA PRASAD RAO,Souvik,Mahendran G,It's Me Swaraj ...,Vijay prajapati,Dewang", "review_id": "R33U0ERE0GVMNJ,R1CQTXZAM4625F,R1YR920UPA7YH0,ROOP0SB30EBY3,R32BCBNUXTRTEL,R11PB4N9WB3VCS,RQ5FP6ADSIS6O,R91WZEICT9YIM", "review_title": "Good deal,Looking is fake product... Storage capacity 58gb.. Menstion64gb.,A nice gadget.,Nice and good,Trusted brand,with adapter!,I liked it's performance and quality.,Good quality,Worth it", "review_content": "It's a good deal to get the SD card in this price, but it was even less in Reliance digital. But as I needed in 1 day it's fine to order.,Looking or fake product...,Storage is perfect,Package quality not good,Installation was easy.i got it for my tablet.i had a confusion bw this and SanDisk and finalised this one coz mine is s6lite.free spce shown as 119 gb..it's been only two days.no problem faced.will update if any issues arise.,I have purchased this card 3 times. In first two times, they delivered fake sd card with the same samsung branding but thanks to Amazon for accepting return request. In third time I got this genuine Samsung Evo Plus SD Card 64gb. I purchased this card in Rs. 599. You can also get this at less price during offer season. The least price I have seen is Rs. 539.Performance is almost good as I expected.Write Speed is about 17 to 25 mbps and Reading speed is around 35 to 45 mbps. But I did not tested reading speed too much. May be you will get better reading speed. Adapter is also good quality and performing good.Thank You...🙂,Go for it ensure size,Best", "img_link": "https://m.media-amazon.com/images/I/31P2d7102lL._SY300_SX300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Samsung-microSDXC-Memory-Adapter-MB-MC64KA/dp/B09MT6XSFW/ref=sr_1_85?qid=1672895770&s=electronics&sr=1-85"}
{"product_id": "B07RD611Z8", "product_name": "Ambrane 20000mAh Power Bank with 20W Fast Charging, Triple Output, Power Delivery, Type C Input, Made in India, Multi-Layer Protection, Li-Polymer + Type C Cable (Stylo-20k, Black)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|PowerBanks", "discounted_price": "₹1,799", "actual_price": "₹2,499", "discount_percentage": "28%", "rating": "4.1", "rating_count": "18,678", "about_product": "Massive 20000mAh Lithium Polymer capacity allows you to charge your devices multiple times. It can charge iPhone 12 – 4.6 times, Samsung M11 – 2.6 times, iPad – 1.4 times|20W Fast charging output– Powerful 20 Watts PD and QC output for exhilarating charging speed, do you a great favour in an emergency. For instance, it can bring your new iPhone or android device back to 50% in as quickly as 30 minutes.|Can Charge iPhone 8 upto 50% in 30 minutes or Redmi Note 9 up to 30% in 30 minutes|20W Fast Charging Input – The powerbank itself can get charged in 7 to 8 hours as it has Power Delivery Technology that supports 20W fast charging input via Type C port.|Charge 3 devices – With 2 USB ports and 1 Type C port for output, it can charge 3 devices at the same time & It comes with a 6 months warranty against manufacturing defects.", "user_id": "AFAKEZV7KMVT2SGF4KYWXGQRIW4A,AE33MAZWYRVAAICGNACZAIWACK7Q,AGBITVO2DOMNZU6DB4QF2WXXELLA,AFNFUGSKHFEN7D2XJICFYQIK62VQ,AH3HGPTMWGF4FTGDEKIODKTU5RCA,AEMKH7NSGFU5YGYOC54RHG54WHXQ,AGUTBT3QDFUJECX3SI4FAX647CZA,AGZJITIDEQNYDGVCPZDNXLBYDYYA", "user_name": "Vikrant,Ganesh Gholap,⚡ Pushpendra Singh Patel ⚡,Gaurav,sumegh,Jigar,Dhruba Jyoti Das,Anjeela", "review_id": "R3C219XKJW9GI2,R7KGIU29C0TLL,R3S0UMZSM6FNWM,R3MODCWX8MEIFI,RGLPAU9M85OBG,RBOERVXC2919N,R1EYK2W81FR1YN,R2QUFMWF2JX8KR", "review_title": "Decent Product at about right price.,Seems good.,Good Quality & Durable Powerbank in 1k range | Review,This is the second power bank from Ambrane India, i am happy,It’s heavy but good,Good product,Good power bank,The power is bulkier", "review_content": "I bought this power-bank to use during my vacation with family. It is sturdy BUT a bit on HEAVIER side. Can charge three phones at a time if you use the two USB and third Type C port as well for charging. The speed of charging is alright and appropriate. The ONE and only drawback I experienced is the weight of the Power-Bank itself, without this limitation it could be really amazing product to buy.,Bit heavy but does it’s job. Takes tooooooo much time to charge. Whatever mention in the description is not correct at all with regards to the powerbank charging.,I needed an extra power bank with a larger capacity. So this time I thought to give Ambrane a try, as i already have Honor & MI power banks (10000mAh ones). Though it was not a perfect match for MI or Honor ones, iit did live up to my expectations for the 1k range.•••••••••••••••••••🎁 INSIDE BOX•••••••••••••••••••→ Powerbank→ MicroUSB cable→ Carry pouch (depends on which package you received, more below)→ User manual/Warranty card→ General leaflet→ Feedback leaflet••••••••••••••••••••••••📝 SOME DETAILS••••••••••••••••••••••••→ Mfg: October 2019→ Charging time: 9 Hrs 50 Min (via 10W charger, low battery indication to full charge)→ Backup: Was able to charge (5-100%) Redmi Note 5 pro's 4000Mah battery ~3.5 times with regular usage in between.••••••••••••➕ PROS••••••••••••1. High capacity power bank with dual input (micro USB or USB C).2. Dual output via 2 USB ports.3. Not a fast charge/quick charge device but has an output of 5V/2.4A (12W) which is good enough.4. Touch button for power checks or switch it on for charging device.5. It comes with a carry pouch. (more below on this part).6. Compact form factor & sturdy design with ABS body.•••••••••••••➖ CONS•••••••••••••1. It does not auto-start charging when the device is connected.2. Since it has a touch button instead of push-button, it activates accidentally switching it on every time during handling.3. There is a lot of conversion loss & backup is slightly less for a 20000mAh power bank.▶ Cons are significant enough to reduce 1 star. There is scope for improvement (points 1 & 2) in this product in the same range. So ★★★★ device.••••••••••••••••••••💡 LED STATUS••••••••••••••••••••→ 1st/2nd/3rd/4th LED blinking (while charging power bank): Status of charge in terms of no of LEDs blinking→ 1/2/3/4 LEDs solid white (while charging other devices): Status of remaining battery in terms of no of LEDs→ One blinking (while charging other devices): Low battery→ All 4 LED solid glow: Battery fully charged•••••••••••••••••••••••••••••••••••🔊 AMBRANE BOX DEBATE•••••••••••••••••••••••••••••••••••1. When i first received this power bank it came in a small box (approx 12x9x3cm, Mfg: Aug 2019) with everything forced in congested space. The issue i had in this one was that it came with open seal & no poly wrap around product box as if it was a used product or was tampered in between. So was skeptical about the authenticity of the product and ordered a replacement right away.→ This one had USB C cable but no carry pouch.2. When replacement came, it came in a poly-wrapped bigger box (22x10x4 cm, Mfg: Oct 2019) with an outer sleeve and main box inside with a hologram seal. Maybe Ambrane changed the packaging. The hologram seal here was intact but was also not applied properly to secure the opening. Looked like it was applied with an open box. So its presence was useless.→ This one came with Micro USB cable and a carry pouch.••••••••••••••••••••••••👜 CARRY POUCH••••••••••••••••••••••••→ As per my analysis carry pouch comes with the latest October lot which comes in a bigger box and was unavailable in earlier lot with a small box.→ Carry pouch size was appropriate for power bank and i had no trouble inserting power bank in it. (Some users reported it having a smaller opening but i had no trouble with it and found it to be a proper fit. Neither loose nor tight.→ Its soft nylon meshed pouch and is a nice addon.••••••••••••••••🏆 VERDICT••••••••••••••••▶ At the price point its not a bad deal. Its a midway path b/w low quality and high-quality ones. You can very well go for Ambrane, as it makes good quality & durable power banks. Rest, nothing is perfect in this world. For this thing only, 10 days replacement policy from Amazon and 1-year warranty from Ambrame is available.▶ If one can extend the budget by a few hundred, MI power bank will be a better option with a metallic body & better quality overall. I have MI, Honor & Ambrane power bank and their overall rating will be (from low to high) Ambrane → Honor → MI,I am putting up this review after 1 day of usage. This is the second power bank i have bought from Ambrane India overall third power bank for my family. Before to this i have bought their PP-30 30000 mah model and also has MI 2i 20000 mah power bank both were really good, here i am putting together all the pros and cons which i am able to find after 1 day of usage and also a little bit of comparison. My dad uses Redmi note 7, my mom has MI A1 and i am using Redmi note 3Pros:-- Dual Input Type C and Micro USB this is the foremost and primary reason of choosing this power bank over MI or other brands as you don't need to carry two cables if your phone has type c input which in my family 2 out of 3 has  the same- Easy to carry and hold as it is very compact is size i must say in comparison to MI or Ambrane PP-30- Solid and sturdy built- 20000 mah capacity with same lithium polymer batteries these are safer then lithium ion batteries, this i came to know while buying this product-  ₹200 cheaper price than MI- Touch button at the top to know the power status (this is something unique)-  It took less than 1 hour to charge my redmi note 3 from 13% to 100% at 2 cell battery indicator, which is pretty good and almost equivalent to my wall charger best part same time and charging speed in Delhi Metro- I don't know either it is pro or con, both of my other power banks supports Qualcomm Quick Charge 3.0 Technology while this power bank supports only fast charging at 2.4 Amp, but i feel this has charged my phone better and faster than MI power bank itself. I know a phone must also supports quick charge technology for fast charging but when i use quick charge on my dad's Redmi note 7 (which supports QC 4.0) either from MI power bank or Ambrane PP-30 power bank it kind of heats up the phone, also it fluctuates the power and automatically switches between Quick Charge and fast charging which affects your battery life, so it is safer to charge the phone at optimum current at 2.4 ampCons:-- Very stuffy packaging, it looks like the power bank has been forced fully stuffed inside the box- It has some adhesive tape at the top i don't know why ? which, when you remove it, puts scratches on the top, be careful while removing the same- No torch light, their PP-30 have it- only micro cable inside the box,Definitely heavy but I knew this. I will recommend this, as it has 2 slots so we can charge two phones.,Nice product,Power backup is good.. but the USB cable provided is very bad. It stopped working after few months of usage,Everything is good but the battery don’t last that long when use for charging two device.", "img_link": "https://m.media-amazon.com/images/I/31RktQKvhoL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Ambrane-20000mAh-Lithium-Polymer-Stylo-20K/dp/B07RD611Z8/ref=sr_1_86?qid=1672895770&s=electronics&sr=1-86"}
{"product_id": "B08WRWPM22", "product_name": "boAt Micro USB 55 Tangle-free, Sturdy Micro USB Cable with 3A Fast Charging & 480mbps Data Transmission (Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹176.63", "actual_price": "₹499", "discount_percentage": "65%", "rating": "4.1", "rating_count": "15,189", "about_product": "It Ensures High Speed Transmission And Charging By Offering 3A Fast Charging And Data Transmissions With Rapid Sync At 480 Mbps|The Braided Skin Makes It Durable And Invincible Against External Damage So You Can Have An Absolute Hassle-Free & Tangle Free Experience|Its Durable Pvc Housing And The Flexible Design Makes It Last 6 Times Longer Than Other Cables|Usb Cable Offers A Perfect 1.5 Meters In Length For Smooth & Hassle-Free User Experience For Superior Charging & Data Transfer Tasks|The Compact And Smooth Aluminium Connector Fits Most Cases Seamlessly And Resists Corrosion For Signal Purity|Micro Usb 55 Cable Offers Universal Compatibility As It Is Compatible With Most Android Smartphones, Tablets, Pc Peripherals, Bluetooth Speakers, Power Banks, Game Consoles & All Micro-Usb Enabled Devices|2 years warranty from the date of purchase", "user_id": "AG7C6DAADCTRQJG2BRS3RIKDT52Q,AFU7BOMPVJ7Q3TTA4G67RASTGYIQ,AER5ZGIXXVYG3AWZTRZT7M2BYCEA,AHE76XQSOLGOP5ZEKTIW6KUPDWBQ,AGXTMB2XHZBEWZ2UIX7ODZ4XTU6Q,AHNM2XVU745EDPNGUOAG74PTSNRA,AH5RWQ4S72IVLZD6O75OPCFIVDXQ,AG322TYKVPLPBDXE7ABEUK5QTALQ", "user_name": "Vivek kumar,Amazon Customer,SARTHAK,Chiranjeevi,V V GIRI KUMAR,Rajnandini,Akshay Talla,sudhanshu chaubey", "review_id": "R8E73K2KWJRDS,RSD0JTIIWQQL8,R64CRSTE9SLW1,R2FRTNIIUFJE1F,RWGNX3W7UOJ7W,R32TYHHODHTF5D,RQL9ZMQUTY7P2,R280XJ5VZUBOXV", "review_title": "Long durable.,good,Does not charge Lenovo m8 tab,Best charging cable,good,Boat,Product was good,1.5 m का केबल मेरे लिए बहुत ही लाभदायक है ।", "review_content": "Build quality is good and it is comes with 2 year warranty.,Good Product,Bought it for charging my mobile & tab but it doesn't work for Lenovo m8 tab,Guys this cable is is best compare of everyone over heat protection, quickly charging, but chance to shock circuit,good,Nice,Good quality,1.5एम का डाटा केबल मेरे लिए बहुत ही लाभदायक है ।  मैं इस केबल को लाइन में चार्ज करते समय फोन बहुत आराम से उपयोग  कर पा रहा हु । आप इस केबल से 15watt का  चार्जर उसे कर सकते है (इससे जड़ा नही) । लोकल बाजार में इसका दाम 150 है ,  अमेजन पे ये केबल मुझे 67 में मिला । गर्व से कहो हम हिंदू है , जय हिंद जय भारत ,", "img_link": "https://m.media-amazon.com/images/I/41jlwEZpa5L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/boAt-Micro-USB-Tangle-Free-Transmission/dp/B08WRWPM22/ref=sr_1_87?qid=1672895770&s=electronics&sr=1-87"}
{"product_id": "B0B4F52B5X", "product_name": "Samsung Galaxy M13 (Midnight Blue, 4GB, 64GB Storage) | 6000mAh Battery | Upto 8GB RAM with RAM Plus", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹10,999", "actual_price": "₹14,999", "discount_percentage": "27%", "rating": "4.1", "rating_count": "18,998", "about_product": "6000mAh lithium-ion battery, 1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase|Upto 12GB RAM with RAM Plus | 64GB internal memory expandable up to 1TB| Dual Sim (Nano)|50MP+5MP+2MP Triple camera setup- True 50MP (F1.8) main camera +5MP(F2.2)+ 2MP (F2.4) | 8MP (F2.2) front cam|Android 12,One UI Core 4 with a powerful Octa Core Processor|16.72 centimeters (6.6-inch) FHD+ LCD - infinity O Display, FHD+ resolution with 1080 x 2408 pixels resolution, 401 PPI with 16M color", "user_id": "AGAELRYPMTG5SADZPDYB343EASAA,AGFN4JODOM2NTFCJQOHDBQLVDJTQ,AG7EZVSAXIVGMNDLSA55K7URQCJA,AGGF75HIEMB67OU7J3RDALBSUKQQ,AHY5CI4SU6JBYPIZ5RLAGO6W3F4A,AE4KODNBVTDCZWZO4HZM4GTRERPA,AH6HFHSYOY2OHMODD7244DHG7FUQ,AHRW5JERWYAJCZO65PDKZSOEPR6Q", "user_name": "Satheesh Kadiam,Pritom Chakraborty,Vishwa,Simranpreet Singh,Saptarshi,Amazon Customer,D.RAGHUL,Dharmendra kumar", "review_id": "R2K5OD0MEEBTDL,RS1N6TNO33BOK,R6KWBGOKI1N9Y,R30SKUMYLSXXDN,R1EOYHZWCRSV7B,R13JBDK4SAAYFT,RJOU5K9ECNW7Y,R2APPRANV6IERZ", "review_title": "Phone, camera, heating - works for me, may not for all,Good Mobile,Good but not excellent under this budget,Worth the price at 9499,Ok type phone... but unable to make videocall within same service provider.,Phone review,Budget king,Battery backup is good", "review_content": "I am not big on camera usage, personally. I was even mentally prepared for a bad camera, based on some reviews here. But I was pleasantly surprised that camera clicks good photos. They are not awesome, but they are decent photos that can even be shared.Now coming to my biggest grouse; heating issue. The phone started heating up while charging, but it was just a little and so I could have ignored it. But then it started heating up more and got me very concerned. I even ordered a replacement thinking I got a defective piece. But then, after further tests, I found that it is heating more when I download huge amounts of data, for example, when I restore data of my old phone, from back up. This is ok with me as, I don't perform huge data loads regularly, definitely not on phone. Then I tested by running tasks I usually perform such as checking office mails, attending office meeting on phone, watching a video from Amazon Prime, and so on. The phone did not heat up even a little. Personally, this is good for me.At this price range, this is a good phone. But if you are camera heavy user and expect to perform heavy downloads frequently, this phone may not for you. I am personally satisfied with this phone as it works for my type of usage. I will not go into plus points of this phone as they are covered by other reviews already. I am only attempting to clarify about how this phone can suit you (or not) in terms of camera and heating. I had many questions about these aspects before buying. Perhaps this review will help you make an informed decision to buy (or avoid). Cheers.,Display - BeautyCamera - decentPerformance - AmazingBattery - ok (in 5000mah u expect more tbh)Overall good phone...Also after 1day of use, i found some network connectivity issue in my jiosim, which I'm using right now in this phone, but I'll keep update this review after 1month of usage!,It's a decent mobile under this price but few things worried me , weight of the phone, too many procedure to change some settings, no screen casting. Apart from that it has good touch, a decent camera for day light , battery life is good.,I bought this smartphone for my mom. Samusung interface is very handful for easy use. Battery is superb, last whole day. Camera is mediocre but provide original colour pictures. All in all satisfied with this smartphone that i got in sale for 9499.,Unable to do video call within same service provider as in VOLTE within same service provider video call feature is available.,Product is fine.  Nothing Fancy but for the budget it is a good phone.,BATTERY : more than enough for normal use  Not sure in gamingCAMERA : good in this segment , can record  videos in FHD 30fpsDISPLAY : since it's a LCD display the quality is  a bit less , but goodV RAM : you can add upto 2gb of virtual ram  but have to sacrifice your storage  Space to use it  OVERALL A GOOD BUDGET PHONE,Finger print is working speedy battery backup is good camera quality is also good", "img_link": "https://m.media-amazon.com/images/I/41Vj+8XWIQL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Samsung-Midnight-Storage-6000mAh-Battery/dp/B0B4F52B5X/ref=sr_1_88?qid=1672895770&s=electronics&sr=1-88"}
{"product_id": "B096VF5YYF", "product_name": "boAt Xtend Smartwatch with Alexa Built-in, 1.69” HD Display, Multiple Watch Faces, Stress Monitor, Heart & SpO2 Monitoring, 14 Sports Modes, Sleep Monitor, 5 ATM & 7 Days Battery(Pitch Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹2,999", "actual_price": "₹7,990", "discount_percentage": "62%", "rating": "4.1", "rating_count": "48,449", "about_product": "Alexa- Alexa built-in Voice Assistant that sets reminders, alarms and answers questions from weather forecasts to live cricket scores at your command!|Screen Size- ;1.69\" big square colour LCD display with a round dial features complete capacitive touch experience to let you take control, effortlessly.|Watch Faces- Multiple watch faces with customizable options to match your OOTD, every day!|Brightness- The ambient light display allows automatic adjustment of brightness on the watch, suited to your environment|HR & SpO2- The watch comes with a stress monitor that reads your HR to indicate stress levels.It also monitors your heart rate and SpO2 (blood oxygen levels) to keep a tab on your overall health.|Sleep Monitor- Track all stages of sleep every night and keep a tab on your sleep health with the sleep monitoring feature on the watch.|Sports Friendly- Its 14 sports mode and 5 ATM dust, splash and sweat resistance makes it the perfect fitness companion to have.", "user_id": "AE6CROVUGPHR7BRT5JASNRWSPBVQ,AHL5MROK5N63VXVBMKVZJ3GNB7ZQ,AFPCHRP52XCWFQ625WEACPUTXO7A,AHIUG7OVT3SRXSCNUZPNKHTQH57Q,AGVPDZ73B6LF5BBIZ3YGX2WRGJ2Q,AEQEIF23AAXTOBTLBICNMLFK662A,AGDPIWXL6XEBCXAGBYTER5S2JZ4Q,AFPDHMQW4AYII5KK7CLG4MMTIAHA", "user_name": "archit,Arjun Sen,Divya Devkar,User,Vaishnavi Sonker,Santhosh,Sai raj,Mohammed.afsar", "review_id": "R1ZQQKZCCG4KD2,R1OHAWNCB4K26S,R1A7EDRAMKIXJ6,R2H3UO33625F4U,R3UX0I4P6QYZDT,R2WBZ23WWYQWIS,R2VDCJG8SCEN6I,R1NEXD5T49KYP9", "review_title": "NOt worth the money,Good budget smart watch with Alexa,👍,Good product,I don't have flashlight function and speaker is not working,Nice,It's little cost,Wach not working", "review_content": "Review OverviewAverage2.7The Boat today launched the ‘ Boat Xtend ‘, the company’s latest budget smartwatch with a price tag of Rs. 2,999. The Boat Xtend Smartwatch comes with a stylish design resembling the Apple watch. Moreover, it has built-in Amazon Alexa support, SpO2 tracking, stress tracking, and much more. Coming in a budget segment, is it worth it? Should you buy this smartwatch? If you too have such queries, then there is nothing to worry about. It is a detailed review of Boat Xtend Smartwatch which will clear all your doubts about it.ContentsBox ContentDesign, Build & ComfortDisplayWatch UI And FeaturesAlexa SupportWatch FacesBoat Wave AppAccuracyBatteryFinal WordsBuy Now:Box ContentBoat Xtend box contentSmartwatch in black&gold colourCharging clipUser Manual and warranty cardDesign, Build & ComfortWhen buying a smartwatch, one always thinks about its design and look. Apart from features, design and build is another major aspect one should take care of when buying a smartwatch. The boat has worked on its design this time which brings it to a premium side in terms of look. The design is inspired by the Apple Watch 3, but it cannot be compared to that. Obviously, in every aspect, Apple Watch 3 would be much better than the Boat Xtend Smartwatch. Redmi Watch as well as Amazfit Bip U Pro has the same shape and design, but the build quality is much premium on this one.Boat Xtend design and buildI personally don’t like the color scheme of this Boat Xtend Smartwatch. The black color variant comes with a golden color metallic frame. I believe the gold color would fade away after some time. There are three other color variants, which also don’t look stylish as this one. However, that is my personal opinion on the color scheme, so maybe you might find the color scheme to be good.Boat Xtend designThe watch has 5ATM water resistance. It has silicon straps, which are quite comfortable. The straps are good quality straps which you will find comfortable with regular usage.DisplayComing to the display, the watch has a 42mm square shape display. What you see on this one is a TFT panel. The screen has big bezels, however, the good part is that the screen goes completely back when it is off, so you won’t notice the bezels, and the screen quality won’t feel cheap at all. It doesn’t have an always-on display, but we cannot complain about that. The watch offers a screen on time of up to 20 seconds and up to 12 levels of brightness control.Boat Xtend display qualityI find the display quality of the Boat Xtend Smartwatch to be better than the previous smartwatch from Boat. View angle is good on this one, and you can clearly see content on this smartwatch even in the sunlight. The color on this one is not very saturated, but this isn’t something that we can complain about in this price range.Watch UI And FeaturesThe UI of this smartwatch is clean and easy to use. There is a single button on the watch which works as the power/off button as well as the back button. Moreover, the display is a touchscreen display that works without any problem. There isn’t much animation on the bar menu, and the navigation is simple, so you won’t find it difficult to use. However, the watch may lag a bit. The company has done cost-cutting in terms of the processor, that’s why you may find it to lag a bit, but it is OK, and not a big deal at the price point you get it.Boat Xtend UiThe watch offers all the basic fitness features such as daily activity (which includes total steps walked, calories burnt, and time), heart rate, sleep tracking, stress tracking breath training, SpO2 training, meditation, find my phone, and music control. Apart from that, there are 14 different support modes on this watch. I tried a few of them, and they worked fine. The watch notifies you of the incoming calls, messages received, and various other notifications in detail.Boat Xtend smartwatch reviewAlexa SupportThe main highlight of the Boat Xtend is the Amazon Alexa Support. The watch has an in-built microphone, and you can access it by long-pressing the back button. Do note that you can only do some basic tasks with Alexa on the watch like setting an alarm, setting a timer, and such. Well, it is a good thing to have Alexa on a watch, but you won’t find it very useful. Probably you will use it for a day or two out of excitement, and then you won’t prefer using it because it only does some basic tasks. So, even if Boat missed this feature, it won’t be a problem.Boat Xtend Alexa supportWatch FacesThe next cool thing about this Boat Smartwatch is the watch faces you get on this one. You get more than 100 watch faces on the watch, and probably more watch faces will be added to it. Moreover, you can also set a custom watch face as well.Boat Xtend watch facesBoat Wave AppYou will have to download the Boat Wave App to use the watch. The app is available for both Android as well as iOS devices. You won’t be seeing bugs on the app, and it works perfectly. I haven’t noticed any problem with connectivity like frequent disconnection. The interface of the Boat Wave is clean and simple. You will get all the fitness-related options and all the watch settings on the app itself.Boat Xtend boat wave appAccuracyAccuracy is one of the important aspects that one should take care of when buying a smartwatch. So talking about the accuracy, I tested everything on this watch, from normal walking to running, sleeping, and much more, and I find the results to be accurate.Boat Xtend accuracy testCompared to Realme or Redmi Watch, the result was the same on all of them. So, there is no problem with the accuracy. I don’t find the results to be accurate on most of the budget fitness trackers, but yes, this smartwatch is accurate in terms of fitness tracking, sleep tracking, and everything it does.Boat Xtend accuracyComparing it to the Noise watch which we tried recently, the stress level as well as the SpO2 tracking is much more accurate on this one. It also has the option to track the menstrual cycle in women.Boat Xtend accuracyBatteryYou get to see a 300mAH battery on this one, which the company claims to last 7 days. However, if you use most of the features of the watch, then the battery will last about two and a half days. If you keep the brightness low, then the battery will last about 3-4 days. I find the battery life to be a downside of the watch. It comes with magnet hook charging support.Final WordsBoat Xtend Smartwatch is a decent smartwatch from the Boat. It offers all the basic fitness features you will find on a budget fitness tracker, a good display, Alexa support, good design and build, and much more. The smartwatch at this price is quite good. Personally, what I didn’t like about this smartwatch is its color scheme. However, if you like the color scheme, then I would recommend you to go for it. Overall the watch is good with nothing to dislike about it except for the battery life. The battery life on this one is quite low. The company claims it to have a battery life of 7 days, but with regular usage, it will last for 2-3 days. If you are looking for a good smartwatch under Rs.5000, and you can adjust with the battery life, and you like the color scheme, then I would recommend you to go for this smartwatch. It offers all the features that should be there in a smartwatch under Rs.5000.,Pros:1. Premium build quality with matte finishing- sturdy polycarbonate frame, good soft silicone straps that r absolutely flush with the body of the watch. Attractive, trendy colours.2. Heart Rate (except heart rate spikes in weight training), Pedometer(steps counter) are accurate but SPO2 is off by +/- 2% when compared to Pulse Oximeter readings. But most smart watches offer the same accuracy. Sleep tracking is accurate only for bed time & wake up time, duration but stages of sleep are inaccurate. Light, deep sleep, waking detected but no REM sleep detected. Sleep data from the watch synchronises smoothly with Boat Wave app. Issues warning msg if watch not worn on hand properly and does not detect data of surfaces.3. Large (1.69\"), clear bright, sharp LCD IPS display even in the sun.4. Touch not smooth, experienced jitters. UI also lags at times & after attaching the tempered glass sometimes some functions require 02-03 taps to work. But acceptable scrolling response if finger moved diagonally instead of vertically.5. In app GPS works superbly. Excellent route tracking on the map. This feature is not advertised in their description.6. Bluetooth 5.0 connectivity is good if mobile is kept in close proximity(7m). The Boat Wave app must remain running in the background at all times.7. Definitely splash proof though did'nt take the risk of submerging the watch.8. All notifications are working, no problem with call alerts or SMS msgs or social media app notifications. No lags at all though there is provision for a 3 sec lag which can be turned on.9. Alexa works superbly but since there is no speaker, info is displayed on the screen. My Wipro Smart Bulb, FireTV stick can be controlled easily using the inbuilt Alexa on the watch. Alexa can do mathematical calculations, currency conversions, even foreign language translations, apart from supplying info on anything under the sun. But ofcourse, Alexa cannot make calls. Alexa can set alarm, timer also.10. Sedentary alert, drinking water reminder, stress alert, menstrual cycle alert, alarms, timers function well.11. Boat Wave app connects easily & no lags observed. Data syncs smoothly with Google Fit app. Excellent health reports and motivational rewards system in the form of badges. But settings can be changed only through the app and the watch needs to be restarted for the new settings to be effective.12. Training, Sports modes r good.13. Guided Breathing mode is also good.14. Find my phone works well.15. Extremely stylish, light weight & comfortable for all day wear.16. 07 watch faces available in the device with 04 preset which cannot be deleted. The rest can be changed from the Boat Wave app.Cons:1. Lacks vibration intensity control.2. Lacks Camera control shutter. But can't figure out its use as my handset accepts both voice commands & gestures to click pics.3. No quick reply messages for notifications/call alerts.4. No call acceptance or silencing feature. A work around can be if bluetooth handset is connected at the same time.5. SPO2 is not accurate and sometimes freezes at 97%. But this is common in all smart watches.6. Battery does'nt last more than 03 days if continuous HR measurement is turned on. Otherwise easily lasts for 7 days.7. Watch faces are very childish. Expected better quality designs. Company can easily improve on this in their next update.8. Amazon Prime only replacement, no refund policy is not good. At least colour change should be allowed once.9. Music control feature does not display the title of the song.10. No BP monitoring or temperature monitoring feature. Smart watches usually do not provide reliable BP data.11. No calling feature. But it does'nt matter as most don't want conversations to be public.12. A bit large for narrow wrists, band @22 mm is a bit wide.13. Company should provide a tempered glass protector. No mention of protective glass on the display mentioned. Have attached a Scot tempered glass purchased separately.14. There are actually only 10 sports modes. Boat has bloated the list with Indoor-Outdoor combi of 4 sports (Walking, Running, Swimming, Cycling).15. There is no light sensor. Auto brightness is only time dependant but works well.Was a wedding anniversary gift for my wife who liked it very much even the colour- the evergreen, classic gold-black. Overall the best smart watch with Alexa built in, available at the budget price point of under Rs 3000. An excellent Fitness Tracker but average Health Monitor.,👍,Plz add calling feature with this,Otherwise it is ok,Good,It's little expensive but okkk,", "img_link": "https://m.media-amazon.com/images/I/41pfjyUPZLL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/boAt-Smartwatch-Multiple-Monitoring-Resistance/dp/B096VF5YYF/ref=sr_1_89?qid=1672895770&s=electronics&sr=1-89"}
{"product_id": "B0B5D39BCD", "product_name": "boAt Wave Call Smart Watch, Smart Talk with Advanced Dedicated Bluetooth Calling Chip, 1.69” HD Display with 550 NITS & 70% Color Gamut, 150+ Watch Faces, Multi-Sport Modes, HR, SpO2, IP68(Deep Blue)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,999", "actual_price": "₹7,990", "discount_percentage": "75%", "rating": "3.8", "rating_count": "17,831", "about_product": "Bluetooth Calling- Wave Call comes with a premium built-in speaker and bluetooth calling via which you can stay connected to your friends, family, and colleagues|Dial Pad- Its dial pad is super responsive and convenient. You can also save upto 10 contacts in this smart watch|Screen Size- Wave Call comes with a 1.69” HD Display that features a bold, bright, and highly responsive 2.5D curved touch interface|Resolution- With 550 nits of brightness get sharper color resolution that brightens your virtual world exponentially.|Design- The ultra slim and lightweight design of the watch is ideal to keep you surfing your wave all day!|Watch Faces- Wave Call comes with 150+ Cloud watchfaces for you to pick from, complementing your every mood and outfit|HR, SpO2 & Breathing- Monitor your heart rate and blood oxygen levels on-the-go with the heart rate and SpO2 monitor. It also comes with Guided Breathing to help you relax and embrace mindfulness.", "user_id": "AHPYDFW6Y3FIQGD2RJPBFF5QNVRQ,AG7DTVYZDY2NWU6V2G4KSIB67TDA,AHNQJPSI4I23HHMRHCCCI7QOBK7A,AHPOQQONRLZMHYLDKYP5SQOKRIEA,AGDD5ACY3AGTMTVBQOC3DMUR6REA,AFZV4ISJSNGDUD5TU3VYMTYQ5JGA,AGKPRGZCV5XK7ZNVLQWUGRB6CVVQ,AE7DX25DQCE7MXLEASO6I3YLWHRQ", "user_name": "AV,Mathan kumar,Amol Manjrekar,Suraj_nirmalkar,ASIF ANSARI,Jugalkishor yadav,Chinmayee Ninawe,Samba Shiva", "review_id": "R3EKLFGQGV02SG,R23WEMNZK46UV3,R1G2C7XV8CAM7W,R1O1T0NB6M5CU4,RY95PJLUIT03E,R2HMI9LDLJ1S2Y,R216CF66UYJR2A,R1XD0A6A2KGJZ6", "review_title": "Not Polished Enough. (Improving with updates),Best for the budget 👍,Value of money,nice product,Good product,Super value for money,Awesome product,Product itv", "review_content": "[Update: Sept 29] boAt seems to have heard the feedback 😀 and updated the watch faces. Now there are a few good ones to pick but a slight improvement over the ones the watch earlier had. Bit Impressed. Added one star for it.Not a very polished product. The fonts are tacky and look ugly in the watch for notification text and caller name text. The watch faces are a lazy design job. No point having 150 watch faces if only 10-20 are good or usable. Rest are useless.[UPDATE: Oct 11] boAt seems to be on a smartwatch launch spree. And thanks to that, they are constantly updating the phone app and the watch faces. Now you have many good looking watch faces to choose from. So overall, still the Smartwatch UI needs work. But atleast you have good watch faces.Good:- Screen quality- Battery life- Looks and the metallic frame- Call clarity- BT calling at the price- Reasonably accurate sensorsBad:- The UI, fonts - they are all very ugly and tacky. They could have tried to give the Chinese software some makeover. But it is a clearly lazy job by the tech team. A copy paste job to be precise of getting an outsourced software and plastering it with brand logos.- Restarts randomly when the call is going on on the watch even for 1 min or so.- Watch faces. Again a job of the design / tech / UI team. BoAt doesn't have a good team of designers and UI guys to really offer simple yet good software features like good watch faces and good watch UI.- No option to silence a call or reply with quick replies.Look for Noise Smart Watches in the Same Range. Noise Colorfit Pulse Go Buzz is cheaper and better alternative + has better watch faces and UI and quick reply to notifications and call silence and mute options for lower prices which this watch has clearly missed.You can go for boAt Wave Call also - It isn't an outright bad watch, but there are better options available for the price.boAt - If you have a team who reads and wants to improve, get some good UI and design folks in your team. Your products are good, but the UI and design is what the people see and that's what makes them feel good about your products. You have really average UI.,Boat wave call watch is best for budget.Call is too good and sound quality is also too good.Battery is good.Totally the watch is good for range.,It's good value for money smart watch.Light weight. Touch is smooth.All the features are 90-95% accurate.,a good product in this price range must buy itGOOD LOOKINGGOOD QUALITY,Good product is mst h,Average for calling good looking,I'm really happy to purchase this watch! It's very affordable having so many features. The calling feature works really well! Overall, if you're looking so good brand & good features, go for this ..,Product does not turn onPlease return the item. Please.", "img_link": "https://m.media-amazon.com/images/I/41R9fDKo6iL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/boAt-Wave-Call-Dedicated-Multi-Sport/dp/B0B5D39BCD/ref=sr_1_90?qid=1672895770&s=electronics&sr=1-90"}
{"product_id": "B08DDRGWTJ", "product_name": "MI Usb Type-C Cable Smartphone (Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹229", "actual_price": "₹299", "discount_percentage": "23%", "rating": "4.3", "rating_count": "30,411", "about_product": "1m long Type-C USB Cable|Sturdy and Durable. With USB cable you can transfer data with speeds of upto 480 Mbps|Upto 3A output|6months warranty|Sturdy and Durable. With USB cable you can transfer data with speeds of upto 480 Mbps|6months warranty|Up To 3A Output", "user_id": "AHW6E5LQ2BDYOIVLAJGDH45J5V5Q,AF74RSGCHPZITVFSZN76K6GKPICA,AHDD7ZNB47QA2JLYU53HD4ML3VNQ,AHV3ELGDSOWBYUQLXSPDCSHBQRHQ,AEJU4L3ZM2GTILSJZZSNSF6VUOIA,AFVD66VQMSHPDT3A6HBBBGKRXBZA,AELKHQXVSSG6NHXLFJLLNEFRQQUQ,AGYSMAC6V6RFJJOHG2FIRPOZ6CSQ", "user_name": "Pavan A H,Jayesh bagad,Shridhar,rajendran,karuppu k,Akshay wani,Abbimaniu Singh,VISHAL H BADSHE", "review_id": "R2X090D1YHACKR,R32ZCIH9AFNJ60,R3N57EVVG0EHAF,R3QWLE8JHROKC1,R2VTSDOOUTSQ5X,R3E6FZ75Q074KH,R1SYBQLTPFCW20,RYQT96J8HPIXE", "review_title": "Worth for money - suitable for Android auto,Good Product,Length,Nice,Original,Very good quay Cable support fast charging.,Original MI cable for charging upto 33 watt,I am veri happy with this product as it provide turbo charging.", "review_content": "Worth for money - suitable for Android auto... my purpose served in car....got it for Rs.150,Everything is Okay. But packaging is not good feeling like seller gave is used cable.,Good product,Good product but cost is more.,Original cable,I bought this cable at 129. Using this cable for Android auto in my car. Perfectly works without any glitch.,Original MI cable. Will charge upto 33 watts. Got it for Rs 150.  I have 67 watt charger and I want a cable for my car so I went for it. I checked the performance with battery charging app. The charging speed is exactly half of my 67 watt original cable. Go for it.,It provided me turbo charging. I recommend for all Redmi note 10s mobile phones. As it provide turbo charging. I am veri happy with this product.", "img_link": "https://m.media-amazon.com/images/I/31XO-wfGGGL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/MI-MTCY001IN-USB-Type-C-Cable/dp/B08DDRGWTJ/ref=sr_1_91?qid=1672895770&s=electronics&sr=1-91"}
{"product_id": "B082LZGK39", "product_name": "Ambrane Unbreakable 60W / 3A Fast Charging 1.5m Braided Micro USB Cable for Smartphones, Tablets, Laptops & Other Micro USB Devices, 480Mbps Data Sync, Quick Charge 3.0 (RCM15, Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹199", "actual_price": "₹299", "discount_percentage": "33%", "rating": "4.0", "rating_count": "43,994", "about_product": "Universal Compatibility – It is compatible with all Micro USB enabled devices, be it an android smartphone, tablet, PC peripheral or any other micro USB compatible device|Unbreakable – Made of special braided outer with rugged interior bindings, it is ultra-durable cable that won’t be affected by daily rough usage|Ideal Length – It has ideal length of 1.5 meters which is neither too short like your typical 1meter cable or too long like a 2meters cable|Supports maximum 3A fast charging and 480 Mbps data transfer speed|6 Months manufacturer warranty from the date of purchase.", "user_id": "AECPFYFQVRUWC3KGNLJIOREFP5LQ,AGYYVPDD7YG7FYNBXNGXZJT525AQ,AHONIZU3ICIEHQIGQ6R2VFRSBXOQ,AFPHD2CRPDZMWMBL7WXRSVYWS5JA,AEZ346GX3HJ4O4XNRPHCNHXQURMQ,AEPSWFPNECKO34PUC7I56ITGXR6Q,AHWVEHR5DYLVFTO2KF3IZATFQSWQ,AH4QT33M55677I7ISQOAKEQWACYQ", "user_name": "ArdKn,Nirbhay kumar,Sagar Viswanathan,Asp,Placeholder,BharanI,sonia,Niam", "review_id": "RGIQEG07R9HS2,R1SMWZQ86XIN8U,R2J3Y1WL29GWDE,RYGGS0M09S3KY,R17KQRUTAN5DKS,R3AAQGS6HP2QUK,R1HDNOG6TO2CCA,R3PHKXYA5AFEOU", "review_title": "A Good Braided Cable for Your Type C Device,Good quality product from ambrane,Super cable,As,Good quality,Good product,its good,Good quality for the price but one issue with my unit", "review_content": "I ordered this cable to connect my phone to Android Auto of car. The cable is really strong and the connection ports are really well made. I already has a Micro USB cable from Ambrane and it's still in good shape. I connected my phone to the car using the cable and it got connected well and no issues. I also connected it to the charging port and yes it has Fast Charging support.,It quality is good at this price and the main thing is that i didn't ever thought that this cable will be so long it's good one and charging power is too good and also supports fast charging,Value for money, with extra length👍,Good, working fine,Product quality is good,Good,very good,Bought for my daughter's old phone.Brand new cable it was not charging, I already repacked and requested for replacement.I checked again, and there was some green colour paste/fungus inside the micro USB connector. I cleaned with an alcoholic and starts working again.Checked the ampere of charging speed got around 1400ma-1500ma - not bad, came with braided 1.5m long cable, pretty impressive for the price.Can't blame the manufacturer.But quality issues by the distributor, they might have stored in very humid place.", "img_link": "https://m.media-amazon.com/images/I/31kj3q4SepL._SY445_SX342_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Ambrane-Unbreakable-Charging-Braided-Android/dp/B082LZGK39/ref=sr_1_92?qid=1672895770&s=electronics&sr=1-92"}
{"product_id": "B09XBJ1CTN", "product_name": "MI Xiaomi 22.5W Fast USB Type C Charger Combo for Tablets - White", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|WallChargers", "discounted_price": "₹649", "actual_price": "₹999", "discount_percentage": "35%", "rating": "4.2", "rating_count": "1,315", "about_product": "22.5W Universal Fast Charging", "user_id": "AGAPGK7QBUJDHYEHVEZIJSSU6RXQ,AHIFRP4LVADODLWKJGA7DHAIPUJQ,AGB3OGP22I23IZANKYBMKYK6XQRQ,AHJ7766YC7CZ4ORPCHZLOOCANFNA,AGMV2R3JWUMMQLCUPBCLXPWI6PPQ,AHFDXAEDNPG522UV55PCCVEILKOA,AG6VORBMIHPIVWWIAD64NXGEHWAA,AEKYO3V2A6SECGKKZYSRLHFMMA6A", "user_name": "Dongay Rajasekhar Panda,Harshit Rajoriya,shekar,Steve F.,Daipayan Mondal,Amazon Customer,Naveen Reddy,Prabhat Singh", "review_id": "RWVCDTLWJRC3M,R3MJ0JMWK80XK8,R9ZFKUH0FBRMX,R21NL80UATYBKB,R1CUCX33DRNLV3,R2FI0QR1J4J704,R3RKJLBB11FNIO,R25C9QT8WYDZG9", "review_title": "Item is good.  No issues at all.,Charging is good but cable quality not good,Good,It does the job,Decent and durable fast charger,very nice  product,Working as expected.,best value for money", "review_content": "Item is good.  No issues.  It supports mobile which have great charging inbuilt feature.,Charging is good but cable quality not good,Good,If your smartphone doesn't support more than 20w fast charging then this will cover it for you I would suggest getting a different cable if you want something with more length but the standard cable it comes with is pretty solid, no cheap feeling whatsoever,Pretty good charger for any mobile device provided that the device supports 18 w fast charging and USB type c port..(Ofcourse it is 22.5 w)I would like to suggest this to all of them who are subjected to irreparable in box charger especially redmi note 8 pro users😬,very good  product,Bought this to charge my Mi A1 mobile.Even though the Mi A1 has a lower amps and voltage rating than this charger, upon research, I found that a mobile communicates with the charger and only requests the required amps and voltage from it.And this has proven to be right as my mobile is perfectly charging with this charger.,you wont find this good of a charger and cable combo for this price 649.", "img_link": "https://m.media-amazon.com/images/I/21df1gnW1SL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Xiaomi-22-5W-Fast-Charger-Cable/dp/B09XBJ1CTN/ref=sr_1_93?qid=1672895770&s=electronics&sr=1-93"}
{"product_id": "B0B4F5L738", "product_name": "Samsung Galaxy M13 5G (Aqua Green, 6GB, 128GB Storage) | 5000mAh Battery | Upto 12GB RAM with RAM Plus", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹13,999", "actual_price": "₹19,499", "discount_percentage": "28%", "rating": "4.1", "rating_count": "18,998", "about_product": "Upto 12GB RAM with RAM Plus | 128GB internal memory expandable up to 1TB||Superfast 5G with 11 5G Bands, Powerful MTK D700 Octa Core 2.2GH with Android 12,One UI Core 4|50MP+2MP Dual camera setup- True 50MP (F1.8) main camera + 2MP (F2.4) | 5MP (F2.0) front came|16.55 centimeters (6.5-inch) LCD, HD+ resolution with 720 x 1600 pixels resolution, 269 PPI with 16M color|5000mAH lithium-ion battery, 1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "user_id": "AGAELRYPMTG5SADZPDYB343EASAA,AGFN4JODOM2NTFCJQOHDBQLVDJTQ,AG7EZVSAXIVGMNDLSA55K7URQCJA,AGGF75HIEMB67OU7J3RDALBSUKQQ,AHY5CI4SU6JBYPIZ5RLAGO6W3F4A,AE4KODNBVTDCZWZO4HZM4GTRERPA,AH6HFHSYOY2OHMODD7244DHG7FUQ,AHRW5JERWYAJCZO65PDKZSOEPR6Q", "user_name": "Satheesh Kadiam,Pritom Chakraborty,Vishwa,Simranpreet Singh,Saptarshi,Amazon Customer,D.RAGHUL,Dharmendra kumar", "review_id": "R2K5OD0MEEBTDL,RS1N6TNO33BOK,R6KWBGOKI1N9Y,R30SKUMYLSXXDN,R1EOYHZWCRSV7B,R13JBDK4SAAYFT,RJOU5K9ECNW7Y,R2APPRANV6IERZ", "review_title": "Phone, camera, heating - works for me, may not for all,Good Mobile,Good but not excellent under this budget,Worth the price at 9499,Ok type phone... but unable to make videocall within same service provider.,Phone review,Budget king,Battery backup is good", "review_content": "I am not big on camera usage, personally. I was even mentally prepared for a bad camera, based on some reviews here. But I was pleasantly surprised that camera clicks good photos. They are not awesome, but they are decent photos that can even be shared.Now coming to my biggest grouse; heating issue. The phone started heating up while charging, but it was just a little and so I could have ignored it. But then it started heating up more and got me very concerned. I even ordered a replacement thinking I got a defective piece. But then, after further tests, I found that it is heating more when I download huge amounts of data, for example, when I restore data of my old phone, from back up. This is ok with me as, I don't perform huge data loads regularly, definitely not on phone. Then I tested by running tasks I usually perform such as checking office mails, attending office meeting on phone, watching a video from Amazon Prime, and so on. The phone did not heat up even a little. Personally, this is good for me.At this price range, this is a good phone. But if you are camera heavy user and expect to perform heavy downloads frequently, this phone may not for you. I am personally satisfied with this phone as it works for my type of usage. I will not go into plus points of this phone as they are covered by other reviews already. I am only attempting to clarify about how this phone can suit you (or not) in terms of camera and heating. I had many questions about these aspects before buying. Perhaps this review will help you make an informed decision to buy (or avoid). Cheers.,Display - BeautyCamera - decentPerformance - AmazingBattery - ok (in 5000mah u expect more tbh)Overall good phone...Also after 1day of use, i found some network connectivity issue in my jiosim, which I'm using right now in this phone, but I'll keep update this review after 1month of usage!,It's a decent mobile under this price but few things worried me , weight of the phone, too many procedure to change some settings, no screen casting. Apart from that it has good touch, a decent camera for day light , battery life is good.,I bought this smartphone for my mom. Samusung interface is very handful for easy use. Battery is superb, last whole day. Camera is mediocre but provide original colour pictures. All in all satisfied with this smartphone that i got in sale for 9499.,Unable to do video call within same service provider as in VOLTE within same service provider video call feature is available.,Product is fine.  Nothing Fancy but for the budget it is a good phone.,BATTERY : more than enough for normal use  Not sure in gamingCAMERA : good in this segment , can record  videos in FHD 30fpsDISPLAY : since it's a LCD display the quality is  a bit less , but goodV RAM : you can add upto 2gb of virtual ram  but have to sacrifice your storage  Space to use it  OVERALL A GOOD BUDGET PHONE,Finger print is working speedy battery backup is good camera quality is also good", "img_link": "https://m.media-amazon.com/images/I/413sCRKobNL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Samsung-Midnight-Storage-5000mAh-Battery/dp/B0B4F5L738/ref=sr_1_94?qid=1672895770&s=electronics&sr=1-94"}
{"product_id": "B08MTCKDYN", "product_name": "Gizga Essentials Spiral Cable Protector Cord Saver for Mac Charger, iPhone Charger, Wire Protector, Lightweight Durable Flexible Wire Winder for Charging Cables, Data Cables, Earphones, Pack of 10", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Décor", "discounted_price": "₹119", "actual_price": "₹299", "discount_percentage": "60%", "rating": "4.1", "rating_count": "5,999", "about_product": "WIDELY USE - SPIRAL TUBE CHARGING CABLE PROTECTOR are designed with highly flexible silicone and can be used as phone charger cord protector and phone charger saver to completely protect cables for all devices including, cell phones, computers, laptops, apple / android watches, lightning cables, pc’s, the list goes on and on.|EASY INSTALL - Besides protecting all Your USB cables / cords, SPIRAL TUBE CHARGING CABLE PROTECTOR feels surprisingly nice and is fun to install on any wires end. Use it as your headphone cord protector or charger cable cover. Simply touching it can relieve your stress too! Yet, even better, the Lightning Cable Protector looks super cool. It doesn’t get any better than this!|DURABLE - Works with virtually all computer and cellphone cables. You can even use it in almost anything like as pet cable protector, chewsafe cord protector, cord protectors from pets, wire protector from pets and as a wire protector tubing for phone and computer cables. These cable protectors can protect wires and power cords from dirt, frays, tangles and knots.|PROTECT CABLES - Spiral Tube charging Cable protector is your permanent fix to all those damaged lightning cables. It perfectly works as a cable strain relief or a critter cord so you won't have to deal with cable repair or iphone cable repair and frayed wire repair. Wrap the cable protector onto Your preferred cable as an iphone charger end piece. SPIRAL TUBE CHARGING CABLE PROTECTOR will wrap around any wire just like a protective sleeve would but with more mobility.", "user_id": "AFLBLMPC4WUEDUWHLHBQVY5AKH2A,AE4ZXGSA2CQOGKH3N7GS7WNS67MQ,AHIQ7HT7HDEW67HOPSLTFF2TH2BA,AFWWWV4JHTQ4PJI5WUC73YTHBQCQ,AHPI2KLLZMZK5CGEZ6ILSIA4FHJQ,AFGQKKARKUCRSUEBE2EETDPNLTEA,AGCD3EP3GKDT4URL7GHQPM4Z7DFA,AEUZZSADD4LNC6NNCPAYMKDKGUKQ", "user_name": "Velir,Dileep Venigalla,chakrapani p,kuldip teli,Shanky,Rama,Saurabh Srivastava,Vineeth G", "review_id": "R10KEMT1N336ZD,RL01KZO95GX4F,R1Q721FI3A7XLK,R34MTIAB8IHAI,R1LG1DNA516T7L,RFH8DR3A2O8BG,RFA922H587JFN,R10BFD806POSOX", "review_title": "Awesome Product,Good product,Good quality,Good but overpriced,Gud quality but expansive,Not bad,Ok,Worth product", "review_content": "It is good for data cables...I liked it,https://m.media-amazon.com/images/I/81QHClS+4gL._SY88.jpg,Nice,So basically its good product with good quality, but this product is overpriced because same product from different brand are selling at 25% or more less money, still i bought this because of the brand name.,Gud quality and packaging but slightly expensive.,https://m.media-amazon.com/images/I/61W2kONTcaL._SY88.jpg,Ok,Using this for my mobile charging cable it’s useful for not to brake the cable", "img_link": "https://m.media-amazon.com/images/I/511g3fIVsqL._SY300_SX300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/GIZGA-Protector-Charging-Protective-G55/dp/B08MTCKDYN/ref=sr_1_95?qid=1672895770&s=electronics&sr=1-95"}
{"product_id": "B09QS8V5N8", "product_name": "Redmi Note 11 (Space Black, 4GB RAM, 64GB Storage)|90Hz FHD+ AMOLED Display | Qualcomm® Snapdragon™ 680-6nm | 33W Charger Included", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹12,999", "actual_price": "₹17,999", "discount_percentage": "28%", "rating": "4.1", "rating_count": "50,772", "about_product": "Display: 90Hz FHD+ (1080x2400) AMOLED display; 16.33 centimeters (6.43 inch); 20:9 aspect ratio|Camera: 50 MP Quad Rear camera with 8MP Ultra-wide, 2MP Macro and Portrait lens| 13 MP Front camera|Battery: 5000 mAh large battery with 33W Pro fast charger in-box and Type-C connectivity|Processor: Qualcomm Snapdragon 680 Octa-core; 6nm processor; Up to 2.4GHz clock speed|Memory, Storage & SIM: 4GB RAM | 64GB UFS 2.2 storage expandable up to 512GB with dedicated SD card slot | Dual SIM (nano+nano) dual standby (4G+4G)", "user_id": "AEJLOEHISUISLO2Z4RE2TO2V6NGA,AEJ4UYFD3M2WGB3WEQJOZ3GGJY7Q,AFJ3CVFC3MO2Z3MYQTCELWT4TTKQ,AEEBECR65JN34YC7NEJIFAQB67TQ,AE5XN2CICXIBA4IK6F4ONOJ6TOCA,AGUZQN2LWKQXLXBJO2NRTXGV7EUA,AHWQSD5JHCOHW7JYN7F52ABQCJQA", "user_name": "Meghnad,Partha Dey,JAIDEV CHOUDHARY,Mayank Singh,JeneZ,chetan kamerkar,Gangadhar", "review_id": "R1GQJYYLCFOXJ8,ROASRYCFUFCK0,R1M63KP70YH4TU,RV26OEPPLTVTZ,RAS4252SOW901,R1EQV38U53I993,RD4X602L8KNNS", "review_title": "Excellent Phone in the budget segment,Best value for money... But afraid of future MIUI updates.,Don't purchase it as camera phone 😤,Dependable & it's been a year.,Budget mobile,Good for basic use,Phone is nice , but software is not", "review_content": "I was looking for a phone below 10K. I am not a person who believes to burn money for phones. My requirement was a phone that has good network reception, good wifi reception, a balanced software, good battery life, good screen that don't strain eyes, a good hardware, 3.5 mm headphone jack, and a charger. i don't need 5G network because 5G drains battery a lot and 5G spends too much data. I don't watch movie or YT on mobile network and I wonder how many does watch FHD, 2K, 4K videos over mobile network. For downloading documents, social networks, banking apps 4G is more than enough.In my budget I found all phones have 4gb RAM. Realme Narzo 50 was 9999/- during GIF and had all those features along with a good processor and another one was Redmi note 11. But I found that if I can extend my budget a little more with all coupons and bank offer I can get a Redmi note 11 with 6gb RAM at 11749/- . 6gb RAM is always preferred over 4gb RAM because nobody knows whether with future updates the OS would demand more RAM or not, also the softwares may require more RAM as time passes away. So this was the only option I knew then available.Redmi note 11 has AMOLED Display, I am not bothered with 60Hz, 90Hz,120Hz. I keep the refresh rate at 60Hz and display works without zero lag or stutter. All my Desktop screen has 60Hz refresh rate and I am happy with them so why do I need a 90 Hz screen? I think this is all just gimmick marketed by companies and online reviewers. The display has excellent colour reproduction capability and colours look rich. You can adjust colour temperature to warm or cool but I think standard is fine for me. Also you can calibrate display colours in settings but I think you don't need that. Display size is 6.43 inch it could have been better if it were 6.7 inch. I prefer big display phone. Redmi note 12 has that big display. A plastic screen protector is pre applied on screen and I am happy with that. The screen protector feels smooth and fingerprints can be easily removed by wiping with a damp cloth. The screen has a punch hole camera which looks good.This phone duel speakers. One is more powerful at bottom and another on top. But i think the second speaker is actually earpiece which amplifies while watching movies or YT. Bottom speaker is louder than top speaker and volume is good. What more do you expect from such tiny speakers!The phone has excellent wifi and mobile network reception. Many have complained about poor wifi connectivity but from my experience I can say my phone and Wifi modem stays at different floor, still I get good signal, and never disconnected. Voice over mobile network sounds nice and clear and the other party can hear you well and clear. However because the second speaker is an extension of earphone piece the sound will leak if the other person is shouting over phone.The phone has 5000mAh battery and comes with 33W charger which is a bonus at this price point. The battery gives long backup. With good mobile network you can use it for 3 days without charging using basic features, like phone, sms, email, FB, WA etc. But I charge it regularly and battery charge never drops below 70%.The phone has SD680 processor which is more that enough for basic tasks and performs well without any lag. The experience is butter smooth. However the apps get automatically cleared from RAM which I like because I don't have to clear RAM manually. However after Android 12 update the RAM hold App for longer time but eventually cleared. SD 680 doesn't heat up and it is very energy efficient. Because of that battery drains very little and 33W charger charges phone within 30 mins for my usage. The cable is USB A to C and feels good.This phone has IR blaster so in your home office you can control AC or other supported gadgets with this phone when remote is unavailable.This phone has DDR4X RAM and UFS 2.2 storage. The RAM is 6GB and can be expanded additional 1 GB as virtual RAM by occupying storage. But I have disabled that option from settings because it increases SSD life. This has 2 Sim + SD card slot. Which is a great. Both SIM have VoLTE and carrier aggregation.The phone has beautiful back and colour is attractive. Some people may complain about plastic But remember plastic back phone has better network reception than metal or glass back phones. And I have no problem with plastic. I don't think plastic back makes your phone or you look cheap. I am happy with plastic back. The phone also gives a TPU cover and the cover however yellowing after i month. This is inherent chemistry of TPU, and no one can prevent this chemical degradation. How ever can be slowed by not exposing it to sunlight.The fingerprint scanner is excellent it works flawlessly. The touch screen is excellent too.However I dont like some of the preinstalled apps. Some can be uninstalled a few can't especially Mi pay and getapps from mi store. I don't like them. However I like the pre installed security app. There is no ad in notification  and all can be easily disabled. Camera at back is good and sufficient for me however the front camera is not good. Does not show pictures like 8MP camera. I have added some pictures clicked by Redmi note 11 back camera. MiUi is fluid and has many user friendliness like OneUI. MiUI is now free of Bugs and has an extremely polished version that will please the user.So I give Redmi 11 a score of 9.5/10. This is an excellent phone the I got at 11749/- during Great Indian festival. I recommend anyboy with basic usage to buy this phone. This phone is not for gamers or people who watch 2K, $k videos or shoot such things. This is not or those who are crazy for 5G. Otherwise this phone will fulfil your every requirement in this price segment.,50 days usage...1. Good battery LIFE. Bqest for day-day use. 33W charger also good.2. Best display but should've 120hz instead of 90.3. Sturdy in-hand feel4. Stereo speaker is loud and crisp(65-35 split).5. Camera above average... But good concerning the price.6. Buggy UI(minor) as expected. But ui13 all way better than bloody MIUI 12.5.7. 4G chipset SD 680, which is fine... 4G+ always available.8. Some minor issue with WiFi reception. Don't know may be they will fix it through OTA.*** THIS PHONE IS FOR PEOPLE WHO CLICKS PHOTOS HERE & THERE, CASUAL GAMER & BINGE WATCHERS OF WEB SHOWS/MOVIES... \"NOT INTENDED FOR HEAVY GAMING\"NOT FOR PUBG, COD LOVERS.,The first look of this starbust design is eye catchy...no word to express its design,in hand feel and and it's all physical dimension. the second this which impress me, it's battery backup.....even you playing game hardly for a long time....it gives you sufficient battey backup and charging speed also 33W, is also a good deal at this price. The third impressive factor is it's dual speaker....I have an another phone of 40k and the sound quality is almost same as it. Media playback experience is also enhanced by it's amoled display, very colour charming display...... literally the display quality is unbeatable. The camera notch and dual speaker increase the media playing experience. Other Performance like gaming is also good at this price point. Fingerprint button is also very responsive. All other things and features are good to the price point.Only one thing is very disappointing bcoz the hype of its camera that company shows is very up to the mark and professional photography but the camera is lower grade...even my old Redmi Y2 which I exchanged with this, had better camera than this ....So plz I request you to all .... don't buy this for camera....just don't. The images are shown of camera pictures on the website is illustration according to me......I don't recommend you to buy this phone as your camera phone.If you are non camera user then you will surely go for it.Pros- design, in-hand feel, battery and charging, amoled display,dual speakerCons- camera😤😤,Quite a smooth daily driver phone. The overall experience has been satisfactory, camera's good, durability also seems to be good, I've dropped it quite a few times & the gorilla glass 5 seems to be holding up. 120hz feels great. Charging speed is good too, nothing mind-blowing though. Battery life is decent. Lasts quite a bit, but since I keep it in the 120hz mode all the time, it's a little less for me. But I don't have any problem with battery life for now.,It does what the description says.Camera quality not upto the mark, compared to other redmi mobiles. Even A3 model clicks better pics.Finger print sensor is same as that of the lock  button. You need to press the lock button every time to get the fingerprint read.Volume is good for both call and streaming.Fast charging but charger gets heated soon.Battery back up is good, unless you don't do heavy gaming and all day video sreaming.Dual app and dual space option is missing.Light weight and good video resolution.Overall good for learning students for online sessions and persons with less need for photography & gaming.,I bought this for my dad and it's working good for him, if you are planning to give it to your parents or elderly people in your family just install third party launcher and hide unnecessary app aslo turn off spamming notification and lockscreen ads overall good Phone for elders or first time smartphone user.,Phone is good, but i facing weird bugs due to software issues. After that i manually installed latest global software then working fine.When i was using indian firmware, after the update the phone got into bootloop every 10 sec, but after manual installation its working fine", "img_link": "https://m.media-amazon.com/images/I/411yU+n3UkL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Redmi-Storage-Qualcomm%C2%AE-SnapdragonTM-Included/dp/B09QS8V5N8/ref=sr_1_96?qid=1672895770&s=electronics&sr=1-96"}
{"product_id": "B08CF3D7QR", "product_name": "Portronics Konnect L POR-1081 Fast Charging 3A Type-C Cable 1.2Meter with Charge & Sync Function for All Type-C Devices (Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹154", "actual_price": "₹339", "discount_percentage": "55%", "rating": "4.3", "rating_count": "13,391", "about_product": "[CHARGE & SYNC FUNCTION]- This cable comes with charging & Data sync function for smartphones|[HIGH QUALITY MATERIAL]- TPE + Nylon Material to make sure that the life of the cable is enhanced significantly|[LONG CORD]- The Cable is extra thick 1.2 meter long, optimized for an easy use for your comfort at home or office|[MORE DURABLE]-This cable is unique interms of design and multi-use and is positioned to provide the best comfort and performance while using|[UNIVERSAL COMPATIBILITY]-Charge for all Type C USB connectivity devices including MacBook 12 inch, Nexus 5x, Nexus 6p, OnePlus 2, pixel c, Lumia 950, Lumia 950 xl, Nokia n1, etc.", "user_id": "AGYLPKPZHVYKKZHOTHCTYVEDAJ4A,AGTTU64JMX722LYCN3SOWLFPKPAQ,AFWD4ZTM7473CDWARHCDQKK73MTA,AEXCQM3FDLX3YL3UJWWUIAIUJT4A,AHUKYUWRUVRTB3IQGISXWTSPAWLQ,AFWW4UEXAJH7EAB5LTMKMSGLUN2Q,AFM5JL37WY7G6MLQUI4WAXUJME7Q,AFECO24WYFOU2KL7C3DMHTEHRU7Q", "user_name": "Tanya,Anu,Akshay,Vishal Sagara Shetty,Swatilekha Sarkar,Jithindas,IBRAHIM S,Sundaram J.", "review_id": "R11MQS7WD9C3I0,R2AKH69XQY8BY4,R8GBOLYUN5UP6,R1AYVO4R25KJTA,R1HT6XM787V7FV,R339XJL1GMKHA3,R175VFSB2A32HG,R35T9LXYBSP09G", "review_title": "Good for fast charge but not for data transfer,Good cable compares to local the brand.,good but doesnt last,Good product,Good Product,Good and worth it,very good material quality charging speed is 15 watt,Not a fast charger", "review_content": "The cable is efficient in fast charging but in quick data transfer. Overall fine.,I like the usb c  L shape. Nylon Shielded core wire it improves the life of the cable.,i think i buy these every 6 months or so. fast charging stops working after a while. probbly something to do with the cable design. the cable gets twisted over time and I suspect that breaks the high capacity wires inside. but i keep buying it because there arent too many options in an L shaped design,Good and durable product. Sometime the charges doesn't work on few adapters. there might be few cut off or something but works fine on apple adapter, Car charger, USB,The product is really good at affordable price.,Good and fast charging, and value for money,பொருள் உடைய கடினத்தன்மையின் நன்றாக உள்ளது சார்ஜ் ஏறும் வேகம் 15wat,Not a fast charger.  Very slow charging with 65w.  L-shape pin is very useful.", "img_link": "https://m.media-amazon.com/images/I/31dJ+lXJq3L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Portronics-POR-1081-Charging-1-2Meter-Function/dp/B08CF3D7QR/ref=sr_1_100?qid=1672895777&s=electronics&sr=1-100"}
{"product_id": "B09T2WRLJJ", "product_name": "Redmi Note 11 Pro + 5G (Phantom White, 8GB RAM, 128GB Storage) | 67W Turbo Charge | 120Hz Super AMOLED Display | Additional Exchange Offers | Charger Included", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹20,999", "actual_price": "₹26,999", "discount_percentage": "22%", "rating": "3.9", "rating_count": "25,824", "about_product": "Superior performance with Snapdragon 695 5G. With 7 5G bands making the device future-ready.|16.94cm(6.67) Super AMOLED display with 120Hz Refresh Rate protected by Corning Gorilla Glass 5|67W in-box charger powers massive 5000mAh battery for full day’s charge in 15 minutes|108MP triple camera set up with 8MP ultra-wide and 2MP macro sensor for flawless photography|EVOL. Pro Design for perfect ergonomics and a beautiful glass back design|The phone also comes with dual stereo speaker and Alexa hands-free feature|Get 2 months of YouTube Premium free!", "user_id": "AHALPOEUQFGXEZR6NQ64ZI3EIYXA,AFJEOV652OA6P6CPXI6U34PC677A,AEMQXD272M5OGFOTZDB3PBM2KSWA,AHTNHTN3WQ3NHVW27TWJLRMQDG4A,AGXGWVE46AD3MXJRAA75U5VYV4VA,AEQIOSXDNEWT7VHJIRG5AVN2L7XA,AGZV3QEQWGL37PYNL6FF2FV25Z7A,AETFDFDDPV5V47KNM2ZNBXJ3BCJQ", "user_name": "Indro,Bhavesh Bodat,Amazon Customer,Ambalika Sarkar,Bhosale Techno Solution Pvt Ltd,Agnish Mallick,Radhika Arumugam,Krishna", "review_id": "R1S5FUVJK5BDKV,R10T102N4IHERO,R1QALRWVTEDXMH,R25MVXUNZDKPIY,RJ0CS41K876BR,RX87956266XU,R1HLEVV8WMVM3R,R1UBTZ9MAS7G8V", "review_title": "Solid phone, worth considering,Good Phone,Overall decent product,Apart from the camera everything is fine,Product is good,Honest Review after 14 days usage,Superb but need improvement in camera,Best camera", "review_content": "I bought this phone after tonnes of research and watching and reading several YouTube videos and blog reviews of multiple phones. My budget was around 20k max, and this one somehow fit in all ways. I had almost finalized one plus nord ce, but changed my mind at the last moment and I don't regret. I've used redmi phones before so I'm aware of the sturdiness and value for money they offer. Got this for 13k with close to 6k+ exchange on my one year old tecno spark 7 phone (one of the worst phones I've ever used, refer to my tecno spark 7 review for that). Here's my review of this phone based on 2 months of usage:Pros:1. Build quality is good. Finishing and lookwise it's sleek and quite comfortable in hand.2. Back camera is really good, better with the AI camera. The 108 MP gives good pictures, although not comparable to iPhone or Google pixel quality, but for the price range it's not bad. Portrait mode gives great pictures in well lit conditions, decent in low light with night mode.3. 67W charger is very efficient. Phone gets fully charged within 40-45 mins from below 10% battery levels. Battery backup is decent, with normal usage charge easily lasts for one and a half day or more.4. Dolby atmos dual speakers are really good! You could be watching movies on this and feel the surround sound through the speakers. Pretty loud too.5. No lagging and smooth touch, refresh rate is pretty good.6. Unlike some of the earlier Redmi phones or Chinese phones in general, there are negligible auto installing bloatwares. Android 11 performance so far has been satisfactory.7. Hasslefree usage in general, something that I struggled with a lot with my earlier Techno spark phone for basic functionalities.Cons:1. Front camera could've been a lot better. In daylight conditions, picture colors aren't vibrant enough, and in low light, pictures come grainy. Dissatisfied with that.2. Amoled display isn't as good as I had expected, especially becomes evident when light reflects on the screen while you're watching something.Nothing else worth mentioning that I can think of right now. May update this review if anything encountered.For people with 15-20k budget looking for a good overall usage phone having 5G, this phone  is worth a shot along with Nord CE 2 Lite.,Nice phone with good battery backup,fast charging, sturdy body and good process speed... camera quality is not good enough..but overall.. good budget phone..,1) Battery is decent2) Charging is very fast3) Camera is averagingOverall nice product,The phone is good from all aspects bug if ur looking for a good camera this is not the one.,The price of the product is higher at the time of launch. Within 1 month it dropped by 3k.The price qty is ok.Some features are missing which are available in Chinese make model.,Pros1. Display(super amoled)2. Battery life(24 hrs moderate usage)3. Fast charging4. 120 hz refresh rate work seamlesslyCons1. Miui(lots of unnecessary apps)2.processor(sd 695 is too old)3.main Camera not up to the markOverall I just want to say if you're looking for a phone to watch movies and series and casual gaming go for it.(pubg, cod feels fantastic in this without any lag)If looking for heavy gaming or looking for a camera phone this one is not for you brother.,Good phone need improvement in camera,This mobile has the best camera compared with other models", "img_link": "https://m.media-amazon.com/images/I/410TBgL2KXL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Redmi-Phantom-Additional-Exchange-Included/dp/B09T2WRLJJ/ref=sr_1_101?qid=1672895777&s=electronics&sr=1-101"}
{"product_id": "B089WB69Y1", "product_name": "USB Charger, Oraimo Elite Dual Port 5V/2.4A Wall Charger, USB Wall Charger Adapter for iPhone 11/Xs/XS Max/XR/X/8/7/6/Plus, iPad Pro/Air 2/Mini 3/Mini 4, Samsung S4/S5, and More", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|WallChargers", "discounted_price": "₹249", "actual_price": "₹649", "discount_percentage": "62%", "rating": "4.0", "rating_count": "14,404", "about_product": "【Dual Port USB Wall Charger Adapter】Oraimo USB Charger with dual ports allow you to charge 2 devices at the same time with the total output of 2.4A current. Single port allows Max 2.4A current when connecting only one device. Much more convenient and save your time effectively.|【Safe Charging】With the intelligent chip inside, dual USB wall charger matches the current as your device's need automatically. Over-current, over-voltage and short-circuit protection also effectively protect your smartphones from damage|【Multi-Protection】 Internal protection mechanisms offers multiple Protection against short-circuit, over-temperature, over-current, over-voltage and more|【Wide Compatibility】Wall charger works for all phones with USB-A Cables - iPhone 12/12 Mini/12 Pro/12 Pro Max/11/ 11 Pro/XR/X/Xs/8/8 Plus/7Plus/7/6/6S/5, iPad Air, iPad mini, iPad Pro, Samsung Galaxy M30s/A30s/A50s/A10s/A10e/M40/A20e/A10/S10+/S10/S10e/S9/S9+/S8/S8+/Note 9/8, Google Pixel, HTC, BLU, Xiaomi, LG Q70/K30/K20/K40S/K50S/G7/G6/G5, Blackberry, Nokia, Motorola, Sony, Huawei, and any other USB outlet devices|【Durable Design】 Robust textured casing and premium internal components ensure perfect performance regardless of scrapes, bumps, or drops.", "user_id": "AEKSR7FVH2XR55S47DZZLAFA4KHQ,AH2Z4CKZS7LRJGKNN7CBOZMQ5SNA,AGZOQA4S3KYQ5XWA2NNCVAPL5NAQ,AFAI2HVZTWZTAN4VOOOMVS5H55VA,AEQ2H25C6M6LFUM7FSHRKM7MMHOA,AE562XMNDX7ZSE5LXF3ML73JYBFQ,AFVF4DJMF7VPQN73T57F4CZT2HGA,AEN6F63NGBECRWCS3ZXU6TVDF2XQ", "user_name": "Samar Kumar Das,Jamshed,Jitendra Prajapati,Om Parkash Gagneja,Pavitra S,Dona Sreekumar,Souryajit Swain,Shreevathsa NC", "review_id": "R1DSLJ58BW45MG,RZF2IS7TK6MF4,RLAJSE9228SAA,RHZFWFPW57PEH,R5V3SEBXEYTV9,R3QW79LOKH6EDA,R15LLZLNGUHHTJ,R2NS5ZCYJFF5KE", "review_title": "Good,NICE 👍 IN VALUE.PARACASED ON TWO OLY,Working fine,Good product,Good one,Good one,Very good product,Decent product, worth every penny", "review_content": "Expect it will last long, price wise it's a good product. Till date it's working well.,One slot got out of order and one using now.value of money and second slot of the charger is average to use.🤪🤪🤪😂😂🇮🇳,Good quality no issues till now working fine with 5v 2ampAs it is 10 watt charger.,Fast charging,Yes it's very nice,https://m.media-amazon.com/images/I/61pgVx61I7L._SY88.jpg,Amazing product. Great charging power even two devices  connected with the charger. I charged my pixel 6a and wireless headphone together, both get charged quickly. But issue with the build quality. I once by mistake sat in the charger and the socket end of it broke from the edges and came out completely. I had to fix that with a fevi quick. Now working fine . Overall a very good product. Don't think, just go for it.,It's a good product for this price range. Works fine.", "img_link": "https://m.media-amazon.com/images/I/41v82KfCUuL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/oraimo-firefly-2s-charger-micro-usb-multi-protection/dp/B089WB69Y1/ref=sr_1_102?qid=1672895777&s=electronics&sr=1-102"}
{"product_id": "B0116MIKKC", "product_name": "Goldmedal Curve Plus 202042 Plastic Spice 3-Pin 240V Universal Travel Adaptor (White)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|WallChargers", "discounted_price": "₹99", "actual_price": "₹171", "discount_percentage": "42%", "rating": "4.5", "rating_count": "11,339", "about_product": "LED indicator|Trendy two colours|Compatible with worldwide plugs|Ergonomic product design", "user_id": "AFIC3QEUDEWLWIHED5B64254Q5QA,AEKAQEDPX7S73J5RW2YU5SZKTXGQ,AH5DWYIRRSDMRTEU3V224I2UCBUQ,AFIB4S4TTITWHDPKW5U3JISOCALQ,AGIE63Y7UCQUKSDR3PK6IUPRTX3A,AH62YA354G4U5AD2BG3YI5H7MXMQ,AEONKCD4VUEPQ3YEK5JMVPGLCDDQ,AHLBCSKY2R74QDIIG43AIMBG46NQ", "user_name": "paul,Amazon Customer,Atif,Amazon Customer,AISHWARYA,Deep,Amazon Customer,Amazon Customer", "review_id": "R3MQME1SHOPH91,R2NP5Z355ZHRS5,R31UEUZ7SSSMWI,R12LCASDHZOB5X,RLBAK5CT8NA03,R3RU9Y16IO9WEC,RWDHPQP1486KE,R38QX86OPW8QSV", "review_title": "Good product at a affordable price point,Nice!,Very good n useful product..,Value for Money.!,It's great,Good 3 pin plug,Useful product,Works as expected.", "review_content": "Product is just as described and does what it has been described to do. Durability and other features may have to wait while we use the product more to state justifiedly,Helpful for charging multiple devices at a time.,Very good handy product,Build quality is really nice. Happy with packaging and timely delivery.,Nice one,This is a very good plan, it fits comfortably in any switch board and a red indicator lights up inside it,Good product,Good value for money.", "img_link": "https://m.media-amazon.com/images/I/31MmkM8HTiL._SY300_SX300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Goldmedal-202042-Plastic-Universal-Adaptor/dp/B0116MIKKC/ref=sr_1_103?qid=1672895777&s=electronics&sr=1-103"}
{"product_id": "B09P858DK8", "product_name": "WeCool C1 Car Mobile Holder with One Click Technology,360° Rotational, Strong Suction Cup,Compatible with 4 to 6 Inch Devices, Wildshield and Dashboard Mobile Holder for Car, and Use", "category": "Electronics|Mobiles&Accessories|MobileAccessories|AutomobileAccessories|Cradles", "discounted_price": "₹489", "actual_price": "₹1,999", "discount_percentage": "76%", "rating": "4.0", "rating_count": "3,626", "about_product": "One Click Release : Inserting or releasing your phone to the Mobile holder for Car Dashboard is made very simple with this WeCool Smart Gadget. Just use a single hand to lock or unlock the phone in your Car|360° FULLY ROTATIONAL Mobile Holder : WeCool Mobile holder with a 360° rational body so that you can watch from your preferred angle after fixing the Mobile Phone holder car. Find the viewing angle that does not hamper your driving or GPS navigation|Mobile Phone Holder Car C1 can easily accommodate smartphones with screen sizes of 4 to 6 inches. It is also designed intelligently to connect any cables from the space below the charging port. Also you can view your phone notifications better.|Anti Scratch and Shake Proof Mobile stand for Car Dashboard. The Super Power grip from double shift locking and super strong sticky Gel Pad and Premium ABS Body saves your phone in every situation|Car Mobile holder for dashboard or Windshield is designed for fixing on WindShield or Dashboard of your car. Firm Grip on plain surface as well Textured Surface ensuring maximum safety to your phone|This WeCool Gadget is covered with 1 Year Brand Warranty. To avail the Warranty, register your product in the brand website with in 10 days of purchase. Reach the Customer support team at 9036228529 for Technical support or any other Query.", "user_id": "AFLKEO2K6COQHU2DXPFV54VSZYDQ,AE7CRGIWRNSZMTVAHR3SWOUQVFUQ,AG67CGR3C43TNGHCXQDEHUMT5QSA,AF3ZXSDNA4OBYAYA7DKTZ6QOZOZQ,AFD5PNXQHWWDULY26SXS7SIYRG2A,AFNOEGQW7O3AHVLS6EBSUQP3VBXA,AFYHQLI23FMT3VQTHL6MTDZUMRVA,AGRKUDIXVSUQBXB2VMMCZZZ7QPPA", "user_name": "Santosh Verma,Saravanan,Dr Sandeep Rana,Bal singh,Ashokrajan,Anirudh,NIL,MaGe", "review_id": "R1P673FG5GG9AO,R3ROYQ6BV3RM5T,R3ETCBWLMH5U7J,RL03M79RJEZYY,R38671IDIYF3KV,R20KDGMHU5A66W,R1H428OSIRK1PP,RC0FSCHN4TB9A", "review_title": "I like the product,Best product with good customer care,Best suction and decent plastic quality,Good product with good quality,Good solution,Good cup adhesion. Overall satisfied.,Overall nice product,Nice One", "review_content": "Look good,The product is good, does what it says especially to mention about their customer service and replacement policy which is too good with 1 year warrenty. Kudos to the team!,Overall a great product I had this fear before buying that how good it will adhere but it's doing fantastic the only field where they had a scope of improvement is the plastic quality it's decent but could have been better,Good,Except minor noise, rest all good,Stayed well overall through a rough drive of 1000km and seems sturdy enough to last long. However, the nuts at the joints needed tightening 3 -4 times during the trip and there are a few rattles too.,Quality product with affordable price.,I Used this for swift Dizre 2018 Model Working Good condition  and specially it has the lower hook. so it hold Good .Nice one . if you looking for buget segement just buy it .", "img_link": "https://m.media-amazon.com/images/I/41fkuZKjGCL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/WeCool-C1-Technology-Windshield-Extendable/dp/B09P858DK8/ref=sr_1_104?qid=1672895777&s=electronics&sr=1-104"}
{"product_id": "B07DJLFMPS", "product_name": "HP 32GB Class 10 MicroSD Memory Card (U1 TF Card 32GB)", "category": "Electronics|Accessories|MemoryCards|MicroSD", "discounted_price": "₹369", "actual_price": "₹1,600", "discount_percentage": "77%", "rating": "4.0", "rating_count": "32,625", "about_product": "HP 32GB Class 10 MicroSD Memory Card (U1 TF Card 32GB)|Class 10, UHS-I, U1 Memory Card with Adapter|Perfect for storing and transferring more mobile content across your devices, including photos, music and movies for entertainment or apps and e-books for school or work|Ideal for the latest tablets, PCs, smartphones and mobile devices|16-128GB: Read speed up to 80MB/s, write minumum 30MB/s|Importer Details: Fortune marketing Pvt Ltd D1/2 -Okhla Industrial Area Phase -II New Delhi 110020|Country of Origin: Taiwan", "user_id": "AE2OFVZSIE6KSBAPG6GMKCER35LA,AFEOAY5PB4XEYIOL6DY5WJBOYSKQ,AEJTETVJ7NY3GMARSTJNPOG3AY3A,AFMQHAPYUAV7ZSPABOAVTNZVESWA,AEGYHN3DWMVH2RZLTP2H2A2U6EHA,AFIWP2JBBUU6SH3MK355UEG4TZGA,AF7XGOMQWMA2ITB72BPIVHL23EJA,AHBTDCFI4HA6ONMJZRTYUXAEP46A", "user_name": "Ajit Kumar Rai,chetan tandel,Tanankirambabu,Mohammed amaan,ashish bajaj,SUMIT KUJUR,Yajnesh,Raj Kishor Singh", "review_id": "RPA8V1051ERUL,R2M7ENP70GK5P4,R3PA1IDUY9QNC8,R1QVT2JWXS2Y8Q,R2D2Z6QVL2FXNO,R2W3Y5HX9WED9J,R2TUAIDPW255N6,RWLGI93AXFKRD", "review_title": "Best,genuine,Nice product,Good product,Value for money,Good,worth of purchase,Good 👍", "review_content": "Best wishes,brought it online as cautious about buying offline coz of fake and overpriced products. using it for my wifi camera. working fine,Nice product,Nice quality product easy to use. Thanks amazon,Well known brand ..Nice product.,Good,worth product,Bahut achcha laga Raha hai", "img_link": "https://m.media-amazon.com/images/I/41z7FRqEerL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/HP-MicroSD-U1-TF-Card-32GB/dp/B07DJLFMPS/ref=sr_1_106?qid=1672895777&s=electronics&sr=1-106"}
{"product_id": "B07WHQWXL7", "product_name": "iQOO Z6 44W by vivo (Lumina Blue, 6GB RAM, 128GB Storage) | 6.44\" FHD+ AMOLED Display | 50% Charge in just 27 mins | in-Display Fingerprint Scanning", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹15,499", "actual_price": "₹20,999", "discount_percentage": "26%", "rating": "4.1", "rating_count": "19,252", "about_product": "44W FlashCharge|Snapdragon 680 comes with octa-core architecture design that adopts the new 6nm process, CPU increased by 25% & GPU performance increased by 10% compared with Qualcomm Snapdragon 662.|Z6 is equipped with a FHD+ AMOLED dispaly to give a truly immersive display experience with true color contrast. The display provides a 180Hz Touch Sampling Rate in the gaming sessions for an enhanced touch response.|50MP AI rear camera comes with a variety of smart AI camera features and effects to capture wonderful moments with ease.", "user_id": "AHWRZWPCTG6ICA7WTNLNNZXWFI5Q,AF2AASVYVSROFD7FXA6EFDS6N2LA,AG6YHIDBTRF4SWXLDWRVMRS56AMQ,AHELRKIGSIPF5VMAGPCPAUJYKOLQ,AH7HRG7P5VGMMU4PN7CEDU74Y2AA,AGPO4HV54G5JLGEZYJJ7NC63V6BQ,AHIMX6EL6H3CLBEVJCWLIQHSAA3A,AEITUHHOUWUNZPQDSHA2ZWQGJUMQ", "user_name": "siddharth patnaik,Dr Sunilkumar H,Krishna,K. S. Rao,vinayp,indhu,Jogi,DRISHTI VASHISTH GUPTA", "review_id": "R27MK332LTT5KS,R2TN6LNGD4FLYB,RVZJOLWLG5JZ9,R32Y3RXFGS0N8S,R1WG388SX6A8SS,R3FCO1GKVP9JHZ,REQQ0KOQUU7N5,RB48XNZD8P2Q4", "review_title": "Above average phone,Worth For The Money 💰,Okie,Phone is excellent,Purchased in good budget at 12k,It can fulfill basic needs in affordable price range,Nice,About features", "review_content": "I purchased the 6/128gb variant.To sum  it up in to pros and cons.Pros :-1.Good design in terms of look of the phone and it's build quality.2. Screen quality is good with little boosted colour tone.3. The new processor is very smooth and responsive.4. Speaker quality is good without too much treble.5. Camera is ok for selfie and main camera performance is above average with less noise.6. Camera in front is small so notch is not distracting while playing video.Cons :-1.Main camera struggles after 3x zoom.And video call performance of front camera  is inferior to stock selfie photo.2. 18 watt charger took 1hr30 mins to charge 80% of the phone.So charging speed is not time saving for this big battery.,Good one under This price..! One of the Best Android phone by Vivo 💚,Its super good for normal usage,Camera is ok for normal,It's working fine and no issuew. Iqoo providing quality devices compared to other brands,Camera quality is not that high,Value for money,Phone is very handy and battery is also good. Quality of phone is good.", "img_link": "https://m.media-amazon.com/images/I/41iVkyHeTUL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/iQOO-Lumina-Blue-128GB-Storage/dp/B07WHQWXL7/ref=sr_1_107?qid=1672895777&s=electronics&sr=1-107"}
{"product_id": "B07WDK3ZS6", "product_name": "iQOO Z6 Lite 5G by vivo (Mystic Night, 6GB RAM, 128GB Storage) | World's First Snapdragon 4 Gen 1 | 120Hz Refresh Rate | 5000mAh Battery | Travel Adapter to be Purchased Separately", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹15,499", "actual_price": "₹18,999", "discount_percentage": "18%", "rating": "4.1", "rating_count": "19,252", "about_product": "World's First Snapdragon 4 Gen 1 Processor, that allows you to level up your performance with confidence through its efficient 6nm Process.|Best In-Segment 120Hz Screen Refresh Rate: Which comes with lagfree & nimble scrolling. The FHD+ display lets you enjoy to the fullest with every game you play and every content you watch with its crisp detailing of colours.|5000mAh Battery: Keeps iQOO Z6 Lite 5G to a longer usage, for a more enjoyable gaming and video experience, which offers Music Playback Time of 127 Hours, Social Media of 21.6 hours, OTT Streaming of 14.5 hours and Gaming of 8.3 hours.|50MP Eye Autofocus main camera, is designed to address the out-of-focus issues. The feature performs fast Eye Autofocus at a high refresh rate, allowing the camera to maintain a stable and clear focus on the subjects in movement.|Stylish & Slim Design: 8.25mm Thin & 194g Weight, with All new 2.5D flat frame design with Matt finish", "user_id": "AHWRZWPCTG6ICA7WTNLNNZXWFI5Q,AF2AASVYVSROFD7FXA6EFDS6N2LA,AG6YHIDBTRF4SWXLDWRVMRS56AMQ,AHELRKIGSIPF5VMAGPCPAUJYKOLQ,AH7HRG7P5VGMMU4PN7CEDU74Y2AA,AGPO4HV54G5JLGEZYJJ7NC63V6BQ,AHIMX6EL6H3CLBEVJCWLIQHSAA3A,AEITUHHOUWUNZPQDSHA2ZWQGJUMQ", "user_name": "siddharth patnaik,Dr Sunilkumar H,Krishna,K. S. Rao,vinayp,indhu,Jogi,DRISHTI VASHISTH GUPTA", "review_id": "R27MK332LTT5KS,R2TN6LNGD4FLYB,RVZJOLWLG5JZ9,R32Y3RXFGS0N8S,R1WG388SX6A8SS,R3FCO1GKVP9JHZ,REQQ0KOQUU7N5,RB48XNZD8P2Q4", "review_title": "Above average phone,Worth For The Money 💰,Okie,Phone is excellent,Purchased in good budget at 12k,It can fulfill basic needs in affordable price range,Nice,About features", "review_content": "I purchased the 6/128gb variant.To sum  it up in to pros and cons.Pros :-1.Good design in terms of look of the phone and it's build quality.2. Screen quality is good with little boosted colour tone.3. The new processor is very smooth and responsive.4. Speaker quality is good without too much treble.5. Camera is ok for selfie and main camera performance is above average with less noise.6. Camera in front is small so notch is not distracting while playing video.Cons :-1.Main camera struggles after 3x zoom.And video call performance of front camera  is inferior to stock selfie photo.2. 18 watt charger took 1hr30 mins to charge 80% of the phone.So charging speed is not time saving for this big battery.,Good one under This price..! One of the Best Android phone by Vivo 💚,Its super good for normal usage,Camera is ok for normal,It's working fine and no issuew. Iqoo providing quality devices compared to other brands,Camera quality is not that high,Value for money,Phone is very handy and battery is also good. Quality of phone is good.", "img_link": "https://m.media-amazon.com/images/I/41Yylo75u7L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/iQOO-Storage-Snapdragon-Purchased-Separately/dp/B07WDK3ZS6/ref=sr_1_108?qid=1672895777&s=electronics&sr=1-108"}
{"product_id": "B09T2S8X9C", "product_name": "Redmi Note 11 Pro + 5G (Stealth Black, 8GB RAM, 256GB Storage) | 67W Turbo Charge | 120Hz Super AMOLED Display | Additional Exchange Offers | Charger Included", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹22,999", "actual_price": "₹28,999", "discount_percentage": "21%", "rating": "3.9", "rating_count": "25,824", "about_product": "Superior performance with Snapdragon 695 5G. With 7 5G bands making the device future-ready.|16.94cm(6.67) Super AMOLED display with 120Hz Refresh Rate protected by Corning Gorilla Glass 5|67W in-box charger powers massive 5000mAh battery for full day’s charge in 15 minutes|108MP triple camera set up with 8MP ultra-wide and 2MP macro sensor for flawless photography|EVOL. Pro Design for perfect ergonomics and a beautiful glass back design", "user_id": "AHALPOEUQFGXEZR6NQ64ZI3EIYXA,AFJEOV652OA6P6CPXI6U34PC677A,AEMQXD272M5OGFOTZDB3PBM2KSWA,AHTNHTN3WQ3NHVW27TWJLRMQDG4A,AGXGWVE46AD3MXJRAA75U5VYV4VA,AEQIOSXDNEWT7VHJIRG5AVN2L7XA,AGZV3QEQWGL37PYNL6FF2FV25Z7A,AETFDFDDPV5V47KNM2ZNBXJ3BCJQ", "user_name": "Indro,Bhavesh Bodat,Amazon Customer,Ambalika Sarkar,Bhosale Techno Solution Pvt Ltd,Agnish Mallick,Radhika Arumugam,Krishna", "review_id": "R1S5FUVJK5BDKV,R10T102N4IHERO,R1QALRWVTEDXMH,R25MVXUNZDKPIY,RJ0CS41K876BR,RX87956266XU,R1HLEVV8WMVM3R,R1UBTZ9MAS7G8V", "review_title": "Solid phone, worth considering,Good Phone,Overall decent product,Apart from the camera everything is fine,Product is good,Honest Review after 14 days usage,Superb but need improvement in camera,Best camera", "review_content": "I bought this phone after tonnes of research and watching and reading several YouTube videos and blog reviews of multiple phones. My budget was around 20k max, and this one somehow fit in all ways. I had almost finalized one plus nord ce, but changed my mind at the last moment and I don't regret. I've used redmi phones before so I'm aware of the sturdiness and value for money they offer. Got this for 13k with close to 6k+ exchange on my one year old tecno spark 7 phone (one of the worst phones I've ever used, refer to my tecno spark 7 review for that). Here's my review of this phone based on 2 months of usage:Pros:1. Build quality is good. Finishing and lookwise it's sleek and quite comfortable in hand.2. Back camera is really good, better with the AI camera. The 108 MP gives good pictures, although not comparable to iPhone or Google pixel quality, but for the price range it's not bad. Portrait mode gives great pictures in well lit conditions, decent in low light with night mode.3. 67W charger is very efficient. Phone gets fully charged within 40-45 mins from below 10% battery levels. Battery backup is decent, with normal usage charge easily lasts for one and a half day or more.4. Dolby atmos dual speakers are really good! You could be watching movies on this and feel the surround sound through the speakers. Pretty loud too.5. No lagging and smooth touch, refresh rate is pretty good.6. Unlike some of the earlier Redmi phones or Chinese phones in general, there are negligible auto installing bloatwares. Android 11 performance so far has been satisfactory.7. Hasslefree usage in general, something that I struggled with a lot with my earlier Techno spark phone for basic functionalities.Cons:1. Front camera could've been a lot better. In daylight conditions, picture colors aren't vibrant enough, and in low light, pictures come grainy. Dissatisfied with that.2. Amoled display isn't as good as I had expected, especially becomes evident when light reflects on the screen while you're watching something.Nothing else worth mentioning that I can think of right now. May update this review if anything encountered.For people with 15-20k budget looking for a good overall usage phone having 5G, this phone  is worth a shot along with Nord CE 2 Lite.,Nice phone with good battery backup,fast charging, sturdy body and good process speed... camera quality is not good enough..but overall.. good budget phone..,1) Battery is decent2) Charging is very fast3) Camera is averagingOverall nice product,The phone is good from all aspects bug if ur looking for a good camera this is not the one.,The price of the product is higher at the time of launch. Within 1 month it dropped by 3k.The price qty is ok.Some features are missing which are available in Chinese make model.,Pros1. Display(super amoled)2. Battery life(24 hrs moderate usage)3. Fast charging4. 120 hz refresh rate work seamlesslyCons1. Miui(lots of unnecessary apps)2.processor(sd 695 is too old)3.main Camera not up to the markOverall I just want to say if you're looking for a phone to watch movies and series and casual gaming go for it.(pubg, cod feels fantastic in this without any lag)If looking for heavy gaming or looking for a camera phone this one is not for you brother.,Good phone need improvement in camera,This mobile has the best camera compared with other models", "img_link": "https://m.media-amazon.com/images/I/41iEZV6nKbL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Redmi-Stealth-Additional-Exchange-Included/dp/B09T2S8X9C/ref=sr_1_109?qid=1672895777&s=electronics&sr=1-109"}
{"product_id": "B07S9S86BF", "product_name": "boAt Bassheads 242 in Ear Wired Earphones with Mic(Active Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹599", "actual_price": "₹1,490", "discount_percentage": "60%", "rating": "4.1", "rating_count": "1,61,679", "about_product": "Fly into your workouts with precise tones that inspire and energize your system with its HD sound, all the time. Impedance 32Ω, Sensitivity (dB) 101db ±3db, Frequency Response 20Hz-20KHz|Find a balanced audio sound set pumped through 10 mm dynamic drivers that can get real loud! Propped up by a banging bass, push your flow to higher limits|Get the sound in and sweat out with IPX 4 Water and Sweat Resistance here to elevate your game as crush those repetitions or a rigorous run|Coolly crafted midway down the cable to endorse practicality mixed with an aesthetic design that allows for communication and music playlist control|Move with unrestrained dynamic freedom via shape adaptive secure fit ear hooks made for you to lose yourself in your workouts and your music|Fashionable with a loose freestyle, yet made to sustain through twisting, contorting and tangling so that you can carry your style and music with you everywhere|Bassheads 242 are compatible with almost every device that carries a 3.5mm slot|1 year warranty from the date of purchase", "user_id": "AFG3EU556AXTCQXSTGYD2ACM5H6Q,AF65DDTW2IWXZ4TJJ7ZMVMH7J35A,AEVPRYZLGHNMEZA5BYGIX36LYZXA,AF2YGWDQLV72RCMMOSU2FVQCMVTQ,AGGMCQ2FU6ORE3JKL6VUTHPQKZZA,AGJK54UTZLRAIC27TJYRC2FITPNQ,AECA5GYEXI5PM7SREQZXQQBLP5PA,AGVJCBYEOVBLWDFZ42IPRVYU25RQ", "user_name": "Tanu,THENNARASU,Gatij saini,uday,Rohit,Akshat Sharma,pramod b.,deepank Sonwal", "review_id": "R2WQHYFXQ5BCCA,R3BU0MFK2ORFS6,R2A3HU0CB8SUQ4,R28DOVGVW1QZXZ,R26XU8W37JQI55,R2S12HQMGEON44,R2NVYGBTVG3FJR,R3VG49O0264FQ9", "review_title": "Good Sound,Not bad,Best gaming earphone,Some what satisfied with the boat 242--- 4.5/5,Outstanding fantastic,Good purchase,Nice product,Good quality", "review_content": "sound of song are good its really good or i am still using almost maybe 2 or 3 month maybe more but they still good,Product is in good quality and comfortably fixed in our ears but the major issue is when we were buds for few minutes, it will start hurting our ears,Gaming -niceSound-osm😎Disyan-nice and value for moneyThank you amezon ♥️,Iam satisfied with the sound quality, 4.7/5Ok with the noise cancellation performance.But when it comes to bass quality it is some what less than the boat 225. Not too much low, clarity in the bass is some what Missing, light weight when compared to boat 225. Finally boat 242 is good at. Its price range.,Mic, sound quality crystal clear , bass is also good and the wiring quality is very good overall earphone is very good in this range. Worth hai product me,Bought them 2 months ago... No other complains so far.... Everything going great...But are little overpriced for 550,Nice,Bast", "img_link": "https://m.media-amazon.com/images/I/41OVH5kIQhL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Boat-Bassheads-242-Earphones-Resistance/dp/B07S9S86BF/ref=sr_1_110?qid=1672895777&s=electronics&sr=1-110"}
{"product_id": "B07N8RQ6W7", "product_name": "Portronics MODESK POR-122 Universal Mobile Tabletop Holder (Black)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Stands", "discounted_price": "₹134", "actual_price": "₹699", "discount_percentage": "81%", "rating": "4.1", "rating_count": "16,685", "about_product": "MoDesk - a Premium Quality Mobile Holders for your Ofﬁce Desks. It can hold, on your work desk, any type of smartphone & tablets with size up to 7 inches easily|MoDesk is a Aluminum + ABS metallic body desk mobile holders which is rust and corrosion proof|It has angular design which gives perfect viewing angle of your smartphone on the desk so you can easily and privately see incoming calls, respond to messages without the risk of prying eyes|The antiskid silicon pads on the body prevents accidental slips and protection from scratches|For any issue Email customer support help@portronics.com", "user_id": "AE55KTFVNXYFD5FPYWP2OUPEYNPQ,AE7UFVGPV7KYAP74UQJAQYE5PEDQ,AGCMESD262GPMVIP77LD57FWCOSQ,AGHNDMYRUJOLLYU3ZCO7FZJOFJUA,AFARAZP3IF343NCQTLZA27FJNIQQ,AEGGIMWBMF527D35B4MPSIRF7I3A,AFXYNRL37KVTOBVKIVMSHZPZWBCQ,AF7Z6AXMT4QMKJNV6CH6XRIVGVPQ", "user_name": "Sethu madhav,Prajwala,Amazon Customer,Manikandan,Abdul Kadhar,Anil Verma,Mahesh kumar,SATBIR SINGH", "review_id": "R23YK9FCYDZ8D5,R2FHT8TJPYXUVB,R2775SLGU24T7V,R3M6CEWXVKNB4E,R17T0PBEN71P6E,R4P7D5FJZ86K4,R3V035V0E672U2,R331A15NMMC2WR", "review_title": "Good one,Cannot set tha 90° vertical angle,Best,Nice to use,Avarage,Value for money.,IT DOES WHAT IT IS SUPPOSED TO,Good 👍", "review_content": "Strong enough, good one to hold.,It's serves the simple purpose of holding phone..But it's not possible to make a phone sit in 90° ..phone slants back little.. (i use pen adjusted at back to keep phone in 90 angle).. worth for simple use,Best,Nice,Avarage,Sturdy product.,EFFECTIVE PRODUCT FOR THIS PRICE RANGE,Good 👍", "img_link": "https://m.media-amazon.com/images/I/31mbyi7ocJL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Portronics-POR-122-MODESK-Universal-Mobile/dp/B07N8RQ6W7/ref=sr_1_111?qid=1672895777&s=electronics&sr=1-111"}
{"product_id": "B09FKDH6FS", "product_name": "realme narzo 50i (Mint Green, 2GB RAM+32GB Storage) Octa Core Processor | 6.5\" inch Large Display", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹7,499", "actual_price": "₹7,999", "discount_percentage": "6%", "rating": "4.0", "rating_count": "30,907", "about_product": "2 GB RAM | 32 GB ROM | Expandable Upto 256 GB|16.51 cm (6.5 inch) HD+ Display | 88.7% Screen-to-body Ratio | LCD Multi-touch Display | 1600-by-720-pixel Resolution | 400 nits Max Brightness (Typical)|8MP Primary Camera (f/2.0 Aperture,4P Lens,4x, Digital Zoom Panoramic View, Portrait Mode, Expert, Timelapse, HDR, Beauty, Filter | 5MP AI Selfie Camera (f/2.2 aperture, portrait Mode, AI Beauty, HDR, Face-Recognition, Filter)|5000 mAh Massive Battery | Supports Ultra Saving Mode|Powerful Octa-core Processor | CPU: Octa-core CPU, up to 1.6GHz | GPU: IMG 8322", "user_id": "AFFOR2CVZKO4LFXRBJ2WEQXRHDKA,AEE5DT5BRBCBX27LOGB5EIX3GVHQ,AHCHD46P252E5T27D26CGOAVD4PQ,AEMUIOWHXS3X7TCLNOURVJFTE2BA,AGWO67H5CHGZF5AAAUAD5QQCZODQ,AGFY3ZBTCRZXSPRR4NXXE7N2SKQQ,AFFVMKWXROYV7F5GCRX72SOBBEUQ,AEKAEWCGDYUP75CGK24GI3RWCBQQ", "user_name": "Aditya Jha,Aman dhiman,RAMLAL Khadav,Jagan,Meherunnesha Sarkar,Karthikeyan.T,Amazon Customer,B Suersh", "review_id": "R36T09OX35WPH0,R1SPKNBAZ5I7N1,R2H32V6C3AL47P,R3V0GQV599E046,R1K3DKKD38K4YV,R3GLFGKDB9OSU6,R19K03O5BUU15B,R3LHO7E66T27P9", "review_title": "Budget Phone,Good product at this price,Good prodect,Good,Good,Value for Money!,Not bad,Nice", "review_content": "If your budget is low and you are looking for a good phone then you can buy this realme narzo 50i,The product is very nice and good quality . after using so many days ithe product is not warm and also phone is not hang .so the is good at this price,Average preform,Good,Good,Ok for normal use, build quality and battery is good..,Battery life is ok maximum working 12hrs after 100% charge,Ok", "img_link": "https://m.media-amazon.com/images/I/4147W6koDNL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/realme-narzo-Mint-Green-Storage/dp/B09FKDH6FS/ref=sr_1_115?qid=1672895777&s=electronics&sr=1-115"}
{"product_id": "B08HVJCW95", "product_name": "MI 10000mAh 3i Lithium Polymer Power Bank Dual Input(Micro-USB and Type C) and Output Ports 18W Fast Charging (Metallic Blue)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|PowerBanks", "discounted_price": "₹1,149", "actual_price": "₹2,199", "discount_percentage": "48%", "rating": "4.3", "rating_count": "1,78,912", "about_product": "10000mAh Lithium Polymer battery|18W Fast Charging|Dual output and input ports|Advanced 12 Layer chip protection|Smart power management|Micro-USB and Type C input port|6 months domestic warranty", "user_id": "AG3SQH676VN5EH4NDNGVVLML6RZQ,AFOCDYODRNB2UUBOTDLWKH76GP2A,AE2EO67O5G5BPFX5QGUUBOF22LQQ,AG2W2BFO5CKP4J66NZOAEIBQODVQ,AF7GDUMJMOA6YGT4OT7X2KWFRH4A,AF4VQ3FUD2OLAGRSLKACCEMSMJCQ,AHVGJKIR6HAOI5KIYL2BC52ROWEA,AGUJFMAHKPIMDPBVFWG3LBGVLF4Q", "user_name": "Mahesh Paryani,Tejas Panchal,SUBHASH,Kushagra Saxena,Masthan,Dipak Sutrdhar,Nitin,pushkraj_4_ever", "review_id": "R31BXRU0GAOB26,R120Q9PAHZEIEM,R3MSIMI8U7QZXJ,R3MLNPNLSYH11T,R339F0FNSVUUP1,R1X6T4WG7148OB,R1Y9VHIT18ERYP,R32RBHMK1ESFTN", "review_title": "Ok product to buy,Better than any other power banks,👍,Nice product,Performance is OK,Very Slim & easy to carry,Decent product,GOAT", "review_content": "I haven’t used any other battery pack so will not be able to provide the exact expected performance. Simply put it is not 20,000 divide by the battery size of your phone will be the expected cycle times. If I consider this as a measure then I would say that the battery capacity is around 15000 mah,Happy with the product,👍,But it’s very heavy,Day by day battery life is reducing. Remaining parameters are good.,Slim & easy to carry for Travelling & very good looking, I'm very satisfied with this product overall Good, But it takes 4 to 5 hours to charge.,Very heavy. Must be about 1-1.5kg.Very quick charge. Takes ages (almost 8-10hrs) to fully charge. Charged my Samsung m53 twice once full charged.,I recently purchased the MI Power Bank 3i 20000mAh and have been extremely impressed with its performance. I have personally tested it with laboratory equipment and have found that it has a capacity of around 19000mAh, which is very good compared to other power banks on the market.One of the things that I appreciate about the MI Power Bank 3i is that it is able to hold its charge for a long period of time. I have not had to recharge it as frequently as I have had to with other power banks.In terms of durability, the MI Power Bank 3i has held up well over time. The construction is solid and the power bank has not suffered any damage despite being carried around in my bag on a daily basis.Overall, I am extremely satisfied with my purchase of the MI Power Bank 3i 20000mAh and would highly recommend it to others. It is a reliable and high-quality power bank that delivers on its advertised capacity.", "img_link": "https://m.media-amazon.com/images/I/31YFSh7g63L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Power-10000mAh-Metallic-Output-Charging/dp/B08HVJCW95/ref=sr_1_116?qid=1672895777&s=electronics&sr=1-116"}
{"product_id": "B09YDFDVNS", "product_name": "Nokia 105 Plus Single SIM, Keypad Mobile Phone with Wireless FM Radio, Memory Card Slot and MP3 Player | Red", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|BasicMobiles", "discounted_price": "₹1,324", "actual_price": "₹1,699", "discount_percentage": "22%", "rating": "4.0", "rating_count": "1,28,311", "about_product": "All-new redesigned Nokia mobile which is familiar and easy to use|Island style keypad phone with white key lettering|High quality 1.77” screen|Pre-loaded games including the classic keypad mobile phone game - Snake|Enjoy all-new wireless FM radio|Listen to music on the MP3 Player and save your favourite songs on the built in memory card slot|Save 2,000 contacts and up to 500 SMS on your Nokia 105 Plus mobile phone", "user_id": "AE27UOZENYSWCQVQRRUQIV2ZM7VA,AGMYSLV6NNOAYES25JDTJPCZY47A,AFHS33MWRQGSS64EETZJGCBWXXXA,AHYXZVXUY3QTBP7IBFIUBSZVH2XQ,AH2SHWYEWDAK6A5Y2ZBEMZ2KIG3A,AEYMOGP2CYRKYZ7TIDNLGR5QPZ4Q,AGPGDCCXPI3EACMNJKBCNT57DVFA,AFPBMRYRSMD3PP3CBKLFF7EKOCXA", "user_name": "virender malhotra,Vikas kabra,Das,Naveen,Amazon Customer,Adv. Manish kotwani,Vinod Jadhao,Priti tijare", "review_id": "R1BFOK13WV2QLM,R3H97FN1H50F7F,R1IY2IDRUJX5O5,R1N5UJPJ5YGBU5,R3BZ3W2KH0X1DQ,R3GPO2WYK6ABG,RCMFGYS1T27LL,R1D5OAMYO4526T", "review_title": "Centre key,Nice phone,Good for Exam preparing students,Center button is not good,Battery runs out quickly,Nokia trusted brand only needs to improve ringtone sound,best phone,..", "review_content": "Phone is ok except middle button it’s a headache.  rest all is good battery lyf is about 10-12 hrs when fully charged,Superb battery life for more then 3 days,I bought this phone to use as a replacement of my smartphone for calling, alarm, listening songs purposes.I didn't face any problem but the sound & its quality is somewhat low compared to normal smartphones. Song quality is not that good & not even bad but ok when listening through earphones.I only use it for receiving sms & calls & occassionally to listen songs & battery backup is very good that it lasts upto 7 days etc.. for 1 full charge.It would've been much better, if it included more alarm options than the limited 5 alarms, stopwatch & timer.Overall, it's a good replacement of smartphone for me till now.,Action button(center button) is not good, it takes more than 1 attempt sometimes to perform OK action.,Battery backup bad,Needs to improve ringtone sound,best phone hai. nokia is always best. price thodi kam karni chahiye.,I like this product", "img_link": "https://m.media-amazon.com/images/I/41o7qy-j6KL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Nokia-105-Single-Keypad-Wireless/dp/B09YDFDVNS/ref=sr_1_117?qid=1672895777&s=electronics&sr=1-117"}
{"product_id": "B07WGPKTS4", "product_name": "iQOO Z6 44W by vivo (Raven Black, 4GB RAM, 128GB Storage) | 6.44\" FHD+ AMOLED Display | 50% Charge in just 27 mins | in-Display Fingerprint Scanning", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹13,999", "actual_price": "₹19,999", "discount_percentage": "30%", "rating": "4.1", "rating_count": "19,252", "about_product": "44W FlashCharge|Snapdragon 680 comes with octa-core architecture design that adopts the new 6nm process, CPU increased by 25% & GPU performance increased by 10% compared with Qualcomm Snapdragon 662.|Z6 is equipped with a FHD+ AMOLED dispaly to give a truly immersive display experience with true color contrast. The display provides a 180Hz Touch Sampling Rate in the gaming sessions for an enhanced touch response.|50MP AI rear camera comes with a variety of smart AI camera features and effects to capture wonderful moments with ease.", "user_id": "AHWRZWPCTG6ICA7WTNLNNZXWFI5Q,AF2AASVYVSROFD7FXA6EFDS6N2LA,AG6YHIDBTRF4SWXLDWRVMRS56AMQ,AHELRKIGSIPF5VMAGPCPAUJYKOLQ,AH7HRG7P5VGMMU4PN7CEDU74Y2AA,AGPO4HV54G5JLGEZYJJ7NC63V6BQ,AHIMX6EL6H3CLBEVJCWLIQHSAA3A,AEITUHHOUWUNZPQDSHA2ZWQGJUMQ", "user_name": "siddharth patnaik,Dr Sunilkumar H,Krishna,K. S. Rao,vinayp,indhu,Jogi,DRISHTI VASHISTH GUPTA", "review_id": "R27MK332LTT5KS,R2TN6LNGD4FLYB,RVZJOLWLG5JZ9,R32Y3RXFGS0N8S,R1WG388SX6A8SS,R3FCO1GKVP9JHZ,REQQ0KOQUU7N5,RB48XNZD8P2Q4", "review_title": "Above average phone,Worth For The Money 💰,Okie,Phone is excellent,Purchased in good budget at 12k,It can fulfill basic needs in affordable price range,Nice,About features", "review_content": "I purchased the 6/128gb variant.To sum  it up in to pros and cons.Pros :-1.Good design in terms of look of the phone and it's build quality.2. Screen quality is good with little boosted colour tone.3. The new processor is very smooth and responsive.4. Speaker quality is good without too much treble.5. Camera is ok for selfie and main camera performance is above average with less noise.6. Camera in front is small so notch is not distracting while playing video.Cons :-1.Main camera struggles after 3x zoom.And video call performance of front camera  is inferior to stock selfie photo.2. 18 watt charger took 1hr30 mins to charge 80% of the phone.So charging speed is not time saving for this big battery.,Good one under This price..! One of the Best Android phone by Vivo 💚,Its super good for normal usage,Camera is ok for normal,It's working fine and no issuew. Iqoo providing quality devices compared to other brands,Camera quality is not that high,Value for money,Phone is very handy and battery is also good. Quality of phone is good.", "img_link": "https://m.media-amazon.com/images/I/41Lif4YWC2L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/iQOO-Raven-Black-128GB-Storage/dp/B07WGPKTS4/ref=sr_1_118?qid=1672895777&s=electronics&sr=1-118"}
{"product_id": "B0789LZTCJ", "product_name": "boAt Rugged v3 Extra Tough Unbreakable Braided Micro USB Cable 1.5 Meter (Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹299", "actual_price": "₹799", "discount_percentage": "63%", "rating": "4.2", "rating_count": "94,364", "about_product": "The boAt rugged cable features our special toughest polyethylene braided jacket and this unique jacket provides greater protection than anything else you have seen in its class. Round Cable|Extra tough polyethylene terephthalate cable skin ensures 10000 plus bend lifespan, stress and stretch resistance|The boAt rugged Micro USB cable is compatible with most android smartphones, windows phone, tablets, PC peripherals and other micro USB compatible devices|2.4A rapid charge, fast data transmission and rapid speed to sync your device at the speed up to 480mbps|boAt rugged micro USB cable offers a perfect 1.5 meters in length, optimized for an easy use for your comfort at home or office|2 years warranty from the date of purchase", "user_id": "AEWAZDZZJLQUYVOVGBEUKSLXHQ5A,AG5HTSFRRE6NL3M5SGCUQBP7YSCA,AH725ST5NW2Y4JZPKUNTIJCUK2BA,AHV3TXIFCJPMS4D5JATCEUR266MQ,AGWIGDEMFIIUAOXYY2QATNBSUGHA,AFSTSLQUV4EVEXWKBOLEFHL2H5YQ,AGAKDNBHY2FKX7I4ACRGILU7QL7A,AFNWJUWJRHCC6HN52KMG5AKZY37Q", "user_name": "Omkar dhale,JD,HEMALATHA,Ajwadh a.,amar singh chouhan,Ravi Siddan,Himanshu Goel,Udaykumar", "review_id": "R3EEUZKKK9J36I,R3HJVYCLYOY554,REDECAZ7AMPQC,R1CLH2ULIVG5U3,R2DMKIBGFKBD6R,RC89B5IAJUTR5,R3B3DDON5FH8DS,R13WAEJDI5RS36", "review_title": "Good product,Good one,Nice,Really nice product,Very first time change,Good,Fine product but could be better,Very nice it's charging like jet", "review_content": "Good product,long wire,Charges good,Nice,I bought this cable for Rs.339 worthy product for this price, i tested it in various charger adapters 33w and 18w it supports fast charging as well.,Good,Ok,I had got this at good price on sale on Amazon and product is useful with warranty but for warranty you need to go very far not practical for such a cost and mine micro to type c connector stopped working after few days only.,I like this product", "img_link": "https://m.media-amazon.com/images/I/41SDfuK7L2L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Rugged-Extra-Tough-Unbreakable-Braided/dp/B0789LZTCJ/ref=sr_1_119?qid=1672895777&s=electronics&sr=1-119"}
{"product_id": "B09MZCQYHZ", "product_name": "Ambrane 10000mAh Slim Power Bank, 20W Fast Charging, Dual Output, Type C PD (Input & Output), Quick Charge, Li-Polymer, Multi-Layer Protection for iPhone, Anrdoid & Other Devices (Stylo 10K, Green)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|PowerBanks", "discounted_price": "₹999", "actual_price": "₹1,599", "discount_percentage": "38%", "rating": "4.0", "rating_count": "7,222", "about_product": "Power-packed 10000mAh- Lithium Polymer 10000mAh capacity allows you to efficiently charge your devices multiple times. It can charge iPhone 12 – 2 times, OnePlus Nord - 1.5 times.|20W Fast Charging Output– Powerful 20 Watts PD and QC output for boosted charging speed, so that you always stay ahead in the league. It carries an extensive capacity to charge your mobile 50% in as quickly as 30 minutes on average.|20W Fast Charging Input – The powerbank itself can get charged in 4 to 5 hours as it has Power Delivery Technology which supports 20W fast charging input via Type C port.|Charge Multiple Devices – With 1 USB port and 1 Type C port for output, it can charge 2 devices at the same time.|Sleek and Stylish- Supremely modish and handy design makes it a style statement while its compact body makes it extremely travel-friendly at the same time.", "user_id": "AFZRJWGYUFNULZQLL27PLZYMTYFA,AELUUSXPQUT3DD5LODET67QZYXVQ,AHN5GP2G4PSPXMVTCK3D7FJSUMFQ,AHXQK2APPFORQPV6E43FW2W6DVVQ,AGH3POHLPXABF3I4ASSGTRXAUPPA,AGUKWQ7OYGHXWZQYRBDSP2V77KDQ,AGRFG6LVUVOX5TDHEZULKHHKYK3Q,AGXBRUP77BK42TS3EE7MPBX2OBXQ", "user_name": "RAMKISAN,Pawan Kumar yadav,Nikhil,Drew Arsenic,nisar,kanishk,Amazon Customer,Kulveer Singh", "review_id": "R83JPRO9V52P,R3UTU1ETF9YL12,RSOL1K3LF3E2I,R377A8K2HZUIKP,R34U15DVK45JC1,RAI2NHXM94X69,R3IW1BTNA6GQJ4,R1VS6ME7USZQ76", "review_title": "Nice product,Good,Kaam sahi karta hai ji,Woks fine,Nice,good and portabe,Good for a single charge of 5000mah mobile.,Good product", "review_content": "I am very happy after using it.  This power bank is very good.  I have seen a video on YouTube with an amazing rating before buying it.  Enjoyed buying it.,Good product value for money.,Esme ek choti torch Jaisi light add Karke thoda price Badha Den to Mast Raho 10,Over all a great product but i have faced a problem while charging the power bank with my mi 120w charger it never accept quick charge and sometimes takes more than 12 hours to charge.While with macbook pro charger it accepts quick charge (that green light).I bought a separate charger for this power bank😭,Good I like it,Power bank is good the only issue was the cable which came with it broke after a day of use and also damaged power port of phone,Just good as expected, compact size, came with a premium good packing.... need see how it performance. With 10000mah u can charge 2 devices at a time. But good for a single charge of 5000mah mobile.  They have given one USB A type to C type cable, if you have another C type cable, with that u can charge another device. I like the carrying pouch they provided.,I didnt got any pouch with this power bank", "img_link": "https://m.media-amazon.com/images/I/31oA0-q5UzL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Ambrane-Multi-Layer-Protection-Li-Polymer-Stylo-10k/dp/B09MZCQYHZ/ref=sr_1_120?qid=1672895777&s=electronics&sr=1-120"}
{"product_id": "B0B4F2ZWL3", "product_name": "Samsung Galaxy M13 (Stardust Brown, 6GB, 128GB Storage) | 6000mAh Battery | Upto 12GB RAM with RAM Plus", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹12,999", "actual_price": "₹17,999", "discount_percentage": "28%", "rating": "4.1", "rating_count": "18,998", "about_product": "6000mAh lithium-ion battery, 1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase|Upto 12GB RAM with RAM Plus | 128GB internal memory expandable up to 1TB| Dual Sim (Nano)|50MP+5MP+2MP Triple camera setup- True 50MP (F1.8) main camera +5MP(F2.2)+ 2MP (F2.4) | 8MP (F2.2) front cam|Android 12,One UI Core 4 with a powerful Octa Core Processor|16.72 centimeters (6.6-inch) FHD+ LCD - infinity O Display, FHD+ resolution with 1080 x 2408 pixels resolution, 401 PPI with 16M color", "user_id": "AGAELRYPMTG5SADZPDYB343EASAA,AGFN4JODOM2NTFCJQOHDBQLVDJTQ,AG7EZVSAXIVGMNDLSA55K7URQCJA,AGGF75HIEMB67OU7J3RDALBSUKQQ,AHY5CI4SU6JBYPIZ5RLAGO6W3F4A,AE4KODNBVTDCZWZO4HZM4GTRERPA,AH6HFHSYOY2OHMODD7244DHG7FUQ,AHRW5JERWYAJCZO65PDKZSOEPR6Q", "user_name": "Satheesh Kadiam,Pritom Chakraborty,Vishwa,Simranpreet Singh,Saptarshi,Amazon Customer,D.RAGHUL,Dharmendra kumar", "review_id": "R2K5OD0MEEBTDL,RS1N6TNO33BOK,R6KWBGOKI1N9Y,R30SKUMYLSXXDN,R1EOYHZWCRSV7B,R13JBDK4SAAYFT,RJOU5K9ECNW7Y,R2APPRANV6IERZ", "review_title": "Phone, camera, heating - works for me, may not for all,Good Mobile,Good but not excellent under this budget,Worth the price at 9499,Ok type phone... but unable to make videocall within same service provider.,Phone review,Budget king,Battery backup is good", "review_content": "I am not big on camera usage, personally. I was even mentally prepared for a bad camera, based on some reviews here. But I was pleasantly surprised that camera clicks good photos. They are not awesome, but they are decent photos that can even be shared.Now coming to my biggest grouse; heating issue. The phone started heating up while charging, but it was just a little and so I could have ignored it. But then it started heating up more and got me very concerned. I even ordered a replacement thinking I got a defective piece. But then, after further tests, I found that it is heating more when I download huge amounts of data, for example, when I restore data of my old phone, from back up. This is ok with me as, I don't perform huge data loads regularly, definitely not on phone. Then I tested by running tasks I usually perform such as checking office mails, attending office meeting on phone, watching a video from Amazon Prime, and so on. The phone did not heat up even a little. Personally, this is good for me.At this price range, this is a good phone. But if you are camera heavy user and expect to perform heavy downloads frequently, this phone may not for you. I am personally satisfied with this phone as it works for my type of usage. I will not go into plus points of this phone as they are covered by other reviews already. I am only attempting to clarify about how this phone can suit you (or not) in terms of camera and heating. I had many questions about these aspects before buying. Perhaps this review will help you make an informed decision to buy (or avoid). Cheers.,Display - BeautyCamera - decentPerformance - AmazingBattery - ok (in 5000mah u expect more tbh)Overall good phone...Also after 1day of use, i found some network connectivity issue in my jiosim, which I'm using right now in this phone, but I'll keep update this review after 1month of usage!,It's a decent mobile under this price but few things worried me , weight of the phone, too many procedure to change some settings, no screen casting. Apart from that it has good touch, a decent camera for day light , battery life is good.,I bought this smartphone for my mom. Samusung interface is very handful for easy use. Battery is superb, last whole day. Camera is mediocre but provide original colour pictures. All in all satisfied with this smartphone that i got in sale for 9499.,Unable to do video call within same service provider as in VOLTE within same service provider video call feature is available.,Product is fine.  Nothing Fancy but for the budget it is a good phone.,BATTERY : more than enough for normal use  Not sure in gamingCAMERA : good in this segment , can record  videos in FHD 30fpsDISPLAY : since it's a LCD display the quality is  a bit less , but goodV RAM : you can add upto 2gb of virtual ram  but have to sacrifice your storage  Space to use it  OVERALL A GOOD BUDGET PHONE,Finger print is working speedy battery backup is good camera quality is also good", "img_link": "https://m.media-amazon.com/images/I/41fNkwj-vnL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Samsung-Stardust-Storage-6000mAh-Battery/dp/B0B4F2ZWL3/ref=sr_1_121?qid=1672895777&s=electronics&sr=1-121"}
{"product_id": "B08VB2CMR3", "product_name": "OPPO A74 5G (Fluid Black, 6GB RAM, 128GB Storage) with No Cost EMI/Additional Exchange Offers", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹15,490", "actual_price": "₹20,990", "discount_percentage": "26%", "rating": "4.2", "rating_count": "32,916", "about_product": "6.49\" Inch (16.5cm) FHD+ Punch-hole Display with 2400x1080 pixels. Larger screen to body ratio of 90.5%.|Side Fingerprint Sensor. Bluetooth Audio Codec: SBC, AAC, APTX HD, LDAC|Qualcomm Snapdragon 480 5G GPU 619 at 650 MHz Support 5G sim| Powerful 2 GHz Octa-core processor, support LPDDR4X memory and latest UFS 2.1 gear 3 storage|5000 mAh lithium polymer battery|48MP Quad Camera ( 48MP Main + 2MP Macro + 2MP Depth Lens) | 8MP Front Camera.|Memory, Storage & SIM: 6GB RAM | 128GB internal memory expandable up to 256GB | Dual SIM (nano+nano) dual-standby (5G+5G).| Color OS 11.1 based on Android v11.0 operating system.|Connector type: USB Type C", "user_id": "AEW3QDKETJO6JJTGK5JI2ZW2PA3Q,AFKWBZELRCG57S5TPMOTZNE5KANQ,AEGUNYKUOOKYLZ5EVFG2RZ3IL5NQ,AF4R7KKPJVNKJC5D3CWKKX2JZAHQ,AEMRQAGETOHECPURDR3UBRHG33FA,AEI5XMVBEE4RLXD3B5VKGLNLH2JA,AEXU4Y3XLSP7AIYF33J3A7YN6O6Q,AFTK27OS7TXVU5CISEGTE75PPGEQ", "user_name": "Chandra.g,Shan Mohd,Suvajit Thakura,Radhe,Jyoti,Amazon Customer,kajal Kiran,Arun", "review_id": "R2P0CRDHOMUX,R1JGV8KAD50B2H,R3TYY9FVH4FCHC,R1QB481QG82BJO,R3C5I5PQSUB7L,RPNGVTBER1EP8,RTD8NH880GNXH,R3H70A536HFEGG", "review_title": "Good,Amazing phone,Nice mobile ... But Amazon very low service.. every product,Value for money,Good prpduct,Good,Overal a good product,Best phone in this range", "review_content": "I like it,Great phone in smaller amount these camera amazing and display very smoothly play,Mobile is good.. but Amazon very low service very product..,Value for money,https://m.media-amazon.com/images/I/61BpP86A3rL._SY88.jpg,Good product very nice,Sometimes fingerprint sensor is not working properly, camera quality is good, battery life is best ... overall it is a good product.. review added after 1month of use,Best phone in this range except battery life.", "img_link": "https://m.media-amazon.com/images/I/41iHN9Y07cS._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/OPPO-Fluid-Black-128GB-Storage/dp/B08VB2CMR3/ref=sr_1_122?qid=1672895777&s=electronics&sr=1-122"}
{"product_id": "B095RTJH1M", "product_name": "Spigen EZ Fit Tempered Glass Screen Protector Guard for iPhone 14/13/13 Pro - 2 Pack", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Maintenance,Upkeep&Repairs|ScreenProtectors", "discounted_price": "₹999", "actual_price": "₹2,899", "discount_percentage": "66%", "rating": "4.6", "rating_count": "26,603", "about_product": "Compatibility ; Glass Screen Protector Compatible with iPhone 14 / 13 / 13 Pro|9H Hardness ; Tempered glass durability rated at 9H hardness to protect from everyday scratches|Case friendly ; Made case compatible with Spigen case|Oil-free ; Oleophobic coating for daily fingerprint resistance|Edge to Edge Protection ; All-around adhesive covers the screen with no lifting", "user_id": "AFDITJCB5D4EOPYZKGP5RGRJFVLA,AHFCEAPRZ44PZ2EVRAJ5SBCDGSBA,AFXDLSR7SKWLB4PKF5SSF5Q27WIQ,AHHBQDFH6KWPFVI3SBXHZNTYK3XQ,AFLRNKKT3DOOAGGWGYWTKEQMGZXA,AGYKT5FSJDBCXWNU74MA2M4OGXKA,AHPYSN2CUNOSXL6BZG6G2LFLV27A,AFJXJVGLO27UBT2KSFMXD2QDKGZA", "user_name": "Abdul Moiz,Rupesh Patil,Devashis,Amruth Ramesh,ALOK NATH,Santosh Bharathan,Hemant W,Abner F.", "review_id": "RE1RVB3YIBPKD,R41RLIIPI7UUH,R232FT7DXDWX1C,R1V3MB7YGA2UND,R2TELVLYX3JH8E,RKUQAQZUBEG5P,R14GNLBYKUA03S,R3KGBGD8RQ7BH7", "review_title": "Easy to install but a bit slippery,Very good product, value for money,Expensive but for a reason,Best Screen Protector!,Best tempered glass to buy for your mobile,Clarity and adhesion is good,Perfect product,Great product and genuinely easy to install", "review_content": "I used my 13 pro without a screen guard for a year now this screen guard was easy to apply but is a bit slippery and when you do the long press (ex. when you long press on WhatsApp for reaction or other options it automatically takes random press) also a bit shiny when you use it near lights.,Very good product, value for money,I have tried many screen guards and many types for my iphone 13This one takes the cake- The application was a smooth process- The screen guard is so smooth for some reason compared to ones i have used before- I have use many screen guards that say they don’t dont catch fingerprint but always end up. But this is does not catch fingerprint at allIf u pay 500 INr higher u will get the spigen ones which protects the front sensors tooHappy with my purchase and moving forward will be applying spigen screen guards for all my products,This is hands down THE BEST screen protector for iPhones. I got the iPhone 13 one and it’s excellent. So easy to install, anybody can do it! It’s so smooth and soft to touch and fits perfectly on my iPhone. Highly recommended. Maybe bit pricey but you get 2 in the box. Fingerprint free and smudge free.,Very nice product to buy.This tempered glass is easy to install no need to worry about airbubbles while installing tempered glass.it is very easy to install on any mobiles as it designed for.worth for your money.,The quality and adhesion is good. Instalation was pretty easy.What i would have liked1. Had it had a black bezel so it blends well with the phone so that no one could make out that a protective tempered glass is stuck.2. Had it also covered the front camera like the ESR protective glass does, it would have been better.3. Would have appreciated a price around 500, definitely overpriced.,Super easy to install. The screen guard got attached without any hassles and was perfect fit. The EZ fit tray works like magic.,I used this product for my iPhone 13 Pro with a peak design phone case. The quality of the screen protector is excellent and the engineering concept used for the installation is the best I’ve ever seen. They even include useful tools and guidelines to minimise the possibility of error.", "img_link": "https://m.media-amazon.com/images/I/41Usew0lrWL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Spigen-Tempered-Screen-Protector-iPhone/dp/B095RTJH1M/ref=sr_1_123?qid=1672895777&s=electronics&sr=1-123"}
{"product_id": "B097R25DP7", "product_name": "Noise ColorFit Pulse Smartwatch with 3.56 cm (1.4\") Full Touch HD Display, SpO2, Heart Rate, Sleep Monitors & 10-Day Battery - Jet Black", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,599", "actual_price": "₹4,999", "discount_percentage": "68%", "rating": "4.0", "rating_count": "67,950", "about_product": "[10-day battery]: With a battery backup of 10 days, just concentrate on your game without stopping.|[Noise Health Suite]: Automatically monitor your blood oxygen (Spo2 levels), real-time heart rate, and provide comprehensive analysis of your sleep quality (deep sleep,light sleep and wake up time) on this smart watch.|[Personalise your look]: Choose from 60+ cloud-based watch faces or customise them as per your preference.|[1.4’’ Full Touch HD display]: Get the perfect viewing experience on the 1.4’’ display with 240*240 pixels.|8 sports modes: Choose from 8 sports modes and give it your best.", "user_id": "AHECNVXSW6REC5TOGBH6OJXIBL4A,AFWAX2O5B5I36ESHPOWZKN25BYPA,AHSDH2Q4Q2QSUYUGEAGPIR22MT7Q,AFSJOIQSSLDDJPOWX3DDKXDA6T5A,AGUXZXNTCLWNP7Y5QA2KYEJLBMKA,AHOZLLUCMPI33IIR3Z5Y7UT2LCLQ,AGBT7W456GGMVOR73SNSIGLSK5DQ,AGYF2BCD5W756VOY2V5HJQCX4H4A", "user_name": "Ankita Dwivedi,Malathi Alunkar,Shubham♎,Oishi Basak,Dhananjay Sevalkar,User,Manohar salave,Kareti Naveen", "review_id": "R1NARG7VJ59AD3,R6BEKBJDZAEX5,R36J5LRZNMMZXL,R2AHCTVOGP0T6P,R3HDBTGLJJ34YO,R2Q8HE3RM7HW5L,R1K6IPHKQQ03AJ,ROANI9ZPECRM0", "review_title": "Noise smartwatch,The product is good overall,Good Battery backup,Okayish product,Satisfied.,Good,It's great watch,Noise", "review_content": "Good fit, nice smart watch in this price range, especially for  those who need only basic features . I bought grey color,It's been long I'm using this now. It has no issues. The battery, touch screen, bluetooth connection every thing works fine. I was looking for something simple and I got this.,Nice design and functionsCan't connect to Whatsapp and other social media app 👎,The modes in the watch are good. The UI sucks. Responsiveness could have been better. Battery life is moderately upto 3-4 days if worn constantly. Colour of the band is a bit faded too.,Activity Record, sleep tracking is Good.,Good product,I bought it for my wife and she was very glad.,Good", "img_link": "https://m.media-amazon.com/images/I/41XH-IpxCQL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Noise-ColorFit-Smartwatch-Monitoring-Waterproof/dp/B097R25DP7/ref=sr_1_124?qid=1672895777&s=electronics&sr=1-124"}
{"product_id": "B09YDFKJF8", "product_name": "Nokia 105 Plus Single SIM, Keypad Mobile Phone with Wireless FM Radio, Memory Card Slot and MP3 Player | Charcoal", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|BasicMobiles", "discounted_price": "₹1,324", "actual_price": "₹1,699", "discount_percentage": "22%", "rating": "4.0", "rating_count": "1,28,311", "about_product": "All-new redesigned Nokia mobile which is familiar and easy to use|Island style keypad phone with white key lettering|High quality 1.77” screen|Pre-loaded games including the classic keypad mobile phone game - Snake|Enjoy all-new wireless FM radio|Listen to music on the MP3 Player and save your favourite songs on the built in memory card slot|Save 2,000 contacts and up to 500 SMS on your Nokia 105 Plus mobile phone", "user_id": "AE27UOZENYSWCQVQRRUQIV2ZM7VA,AGMYSLV6NNOAYES25JDTJPCZY47A,AFHS33MWRQGSS64EETZJGCBWXXXA,AHYXZVXUY3QTBP7IBFIUBSZVH2XQ,AH2SHWYEWDAK6A5Y2ZBEMZ2KIG3A,AEYMOGP2CYRKYZ7TIDNLGR5QPZ4Q,AGPGDCCXPI3EACMNJKBCNT57DVFA,AFPBMRYRSMD3PP3CBKLFF7EKOCXA", "user_name": "virender malhotra,Vikas kabra,Das,Naveen,Amazon Customer,Adv. Manish kotwani,Vinod Jadhao,Priti tijare", "review_id": "R1BFOK13WV2QLM,R3H97FN1H50F7F,R1IY2IDRUJX5O5,R1N5UJPJ5YGBU5,R3BZ3W2KH0X1DQ,R3GPO2WYK6ABG,RCMFGYS1T27LL,R1D5OAMYO4526T", "review_title": "Centre key,Nice phone,Good for Exam preparing students,Center button is not good,Battery runs out quickly,Nokia trusted brand only needs to improve ringtone sound,best phone,..", "review_content": "Phone is ok except middle button it’s a headache.  rest all is good battery lyf is about 10-12 hrs when fully charged,Superb battery life for more then 3 days,I bought this phone to use as a replacement of my smartphone for calling, alarm, listening songs purposes.I didn't face any problem but the sound & its quality is somewhat low compared to normal smartphones. Song quality is not that good & not even bad but ok when listening through earphones.I only use it for receiving sms & calls & occassionally to listen songs & battery backup is very good that it lasts upto 7 days etc.. for 1 full charge.It would've been much better, if it included more alarm options than the limited 5 alarms, stopwatch & timer.Overall, it's a good replacement of smartphone for me till now.,Action button(center button) is not good, it takes more than 1 attempt sometimes to perform OK action.,Battery backup bad,Needs to improve ringtone sound,best phone hai. nokia is always best. price thodi kam karni chahiye.,I like this product", "img_link": "https://m.media-amazon.com/images/I/31-hWNXDxiL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Nokia-105-Single-Wireless-Charcoal/dp/B09YDFKJF8/ref=sr_1_125?qid=1672895777&s=electronics&sr=1-125"}