{"product_id": "B0747VDH9L", "product_name": "INALSA Hand Blender 1000 Watt with Chopper, Whisker, 600 ml Multipurpose Jar|Variable Speed And Turbo Speed Function |100% Copper Motor |Low Noise |ANTI-SPLASH TECHNOLOGY|2 Year Warranty", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|HandBlenders", "discounted_price": "₹2,742", "actual_price": "₹3,995", "discount_percentage": "31%", "rating": "4.4", "rating_count": "11,148", "about_product": "HANDHELD BLENDING POWER-> With power of 1000W, Input Supply: 220 - 230V, AC, this appliance performs all of your cooking tasks proficiently. It ensures powerful processing every time. Save meal prep-time with Robot Inox 1000 Hand Blender. DC Motor|FOR INSTANT MOUTH-WATERING DISHES-> Want solutions to simplify hectic life!! Reduce kitchen prep time & make healthy, delicious food & drinks with our durable & versatile blender Robot Inox 1000. Inalsa provides you with the right kitchen appliance.|YOUR PERFECT KITCHEN ASSISTANT-> This multi-functional appliance comes with a Powerful Chopper, Detachable Stainless-Steel Blending Wand, Multi-Purpose 600ml Jar & Whisker. Chop, Blend, Puree, Whisk, Mix with whatever ingredients you have!!|GET THE TEXTURE YOU WANT-> Dual-Speed Setting allows you to control your hand blender just the way you like it. Variable Speed helps you get the right texture you want of your ingredients.|SOPHISTICATED DESIGN & EXCEPTIONAL QUALITY-> Robot Inox 1000 has an anti-slip design & comfortable grip. This blender is the right choice with Stainless-Steel finish, power indicator light which exhibit its working situation for your convenience.|ANTI-SPLASH TECHNOLOGY-> The stem is made from quality food-graded stainless steel. With blade-shield design, this hand blender ensures splash-free blending.|LOCK & PRESS OPERATION-> On the press of a button, attach chopper, blending wand & whisker according to your cooking requirements. Quickly blend endless ingredients with Robot Inox 1000.", "user_id": "AF7QK5FHWPIIYYCVERDUJEZYTSXQ,AERRAASKR2QOMQ2YNIKRDQHAQGMQ,AH5S5HEUKPD2ZLHBH5XQFJRLLRCA,AHB4T3IC5YTSPMCDPFBABXVV34HA,AFR42H36VEYD3J2M5QXO2MV5B4KQ,AHKTL6AK4OY3ENQXT4IEV7SBIJ6A,AESQ6MV2NLTB3NJ73LIP763MMOCQ,AEAKZZZKAZKLEAAUUXG7QOL3XCQQ", "user_name": "Angel👼,Neha Faizee,Amazon Customer,vipin v.,Kanwal Jit Singh,Alpa Dwivedi,suman sarkar,Virendra Kumar Dube", "review_id": "RF9Y5B4XM5YZ6,R24N6TZUI4NUAR,RMMHFQPA8C5FJ,RTE5VGSY9115Z,RRPKO7B62TUN8,RMW15G5GM7HKY,R3PNOFAB5MTZMN,R3L5QGDIMQZJ0F", "review_title": "Heats up,I just bought this product and my review based on my previous purchases are my in laws home,Easy to use,Nicee,Good product,Nice product..,Very Easy to use,Powerful Blender with 3in1 attachments", "review_content": "It's very easy to use. And easy to clean. It does it's jób as described. Only drawback is that, the motor unit heats up v very quickly🥵, even with very little use. I have only used this product twice so far, so I can't speak for its durability. Also the price has been dropping steadily on this product.  Wondering why🤔.Only time will tell, how long this product will last.,Awesome built quality with perfect packaging,Blender is working good.,Working good till now,Easy to use,https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71prBn8iSuL._SY88.jpg,Easy to clean n all .,I make a lot of sauces, purees, and dressings. I use my blender almost every day. But the construction of the blender is such that the food often falls below the blades and I am constantly readjusting the ingredients to get the ingredients blended. It can take a considerable amount of time and a lot of patience. But this immersion blender can puree fruits and vegetables in less than 2 minutes and do it evenly and consistently. It is easy to use and lightweight. Cleaning consists of removing the shaft with the blades and handwashing it. You can wipe off the handle with a damp cloth and stick both in a drawer. My standard blender requires thorough washing of the various parts (pitcher, blades, screw on attachment, and lid). So I am moving the standard blender from the counter to storage. If I need it I have it. I highly recommend this Powerful blender, go for it.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41QEK7WRJbL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Inalsa-Robot-1000-800-Watt-Blender/dp/B0747VDH9L/ref=sr_1_269?qid=1672923605&s=kitchen&sr=1-269"}
{"product_id": "B08XLR6DSB", "product_name": "akiara - Makes life easy Electric Handy Sewing/Stitch Handheld Cordless Portable White Sewing Machine for Home Tailoring, Hand Machine | Mini Silai | White Hand Machine with Adapter", "category": "Home&Kitchen|Kitchen&HomeAppliances|SewingMachines&Accessories|Sewing&EmbroideryMachines", "discounted_price": "₹721", "actual_price": "₹1,499", "discount_percentage": "52%", "rating": "3.1", "rating_count": "2,449", "about_product": "Mini hand Sewing Machine Stapler style is quick and easy to use. This mini stapler style sewing machine helps you hem your clothes with ease and is ideal for small, emergency repairs.|This electric hand held single stitch sewing machine makes it so much faster and easier than using a needle, saving you time and money.|60 Sewing Speed : DIY Sewing: The crafting machine is easy to use and carry, beginner or master can make some DIY handkerchief, Cloth toys, patchwork, simple embroidery or arts crafts with terry, master can operate it to handkerchief, Cloth toys, patchwork. Good handheld sewing machine for home use.Power Requires in this Hand Stitching Machine: DC 6v power Adaptor (Included) or 4 AA batteries (Not included). Power Adapter saves cost of 4 Batteries.|Compact and lightweight, Durable and long-lasting use. Stapler Style Machine for stitching saree blouse.|Item Dimension: 22 X 14.5 X 5.5cm, Sewing Machine Stapler is One Hand Operation.", "user_id": "AHXNEJ47QV434CJ2CITRIYTIZFDQ,AHT3RLKKTOW7PESASK7CIHLSVNQQ,AHHUO6DFK2PMMQW22NZIN5A5YSYA,AERLNQYOTBYWZCP7AR3TNWATIFHQ,AGWXF7WOR6H5UC3A5PLXE3FXJQEA,AHXKOJKX2Y62E42WWVLND5YDZARA,AH6OEO7KA4AJEWCVSRGJAP6CGANQ,AGNMKLX5ADDTNPRKL77V54XNL5NQ", "user_name": "Kavya jain,Divya,Anushree,User,rahul raghav,Raj,Abhijit E.,Revs", "review_id": "RYO77QIQ3J77O,RTT5VLIVBXJ9G,RDVYDNR6YE0P9,R2N4W7YVIYXMD4,R1DZ7H2MK3UDMT,R23LLGX9FMWWT3,R39UMH72QKWB0W,R67UM0U4KH8C0", "review_title": "Easy to keep and use,Good for quick fixes,Average product,It's a good Machine,Ok,Make it some more easier,Not so easy,It was a perfect tool for beginners", "review_content": "It's good product you can face challenge in starting but once you learn this is easy you can sew clothes from anywhere you want.,The product works well. We can use for quick fixes. Option to use power adapter is very useful.Cons: Can't change direction of stitchCant stich fabric in middle if it's big.. only edges can be stitched comfortably.Add ons, especially the threader, given are very flimsy,Its an ok ok product easy to use but you have to put knot to hold the stitches together. Portable and good for emergency purpose,It's good overall just it need to be tied everytime u sew it's really smooth working and good quality of the thread....,Ok,Nice product... Budget friendly... worth it,Not so easy to use,Easy to use", "img_link": "https://m.media-amazon.com/images/I/519Sexv76CL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Akiara-Electric-Handheld-Cordless-Tailoring/dp/B08XLR6DSB/ref=sr_1_270?qid=1672923605&s=kitchen&sr=1-270"}
{"product_id": "B08H6CZSHT", "product_name": "Philips EasySpeed Plus Steam Iron GC2145/20-2200W, Quick Heat Up with up to 30 g/min steam, 110 g steam Boost, Scratch Resistant Ceramic Soleplate, Vertical steam & Drip-Stop", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|SteamIrons", "discounted_price": "₹2,903", "actual_price": "₹3,295", "discount_percentage": "12%", "rating": "4.3", "rating_count": "2,299", "about_product": "Triple Precision Tip and 360 degree swivel cord make ironing strokes comfortable, effortless and quick|Even distribution of steam for quick ironing in less number of strokes, powerful steam kills bacteria and removes odour|Includes: Steam Iron, User Manual, Warranty; Quick Heat-Up with Powerful 2200 Watt Philips GC2145/20 Steam Iron|Drip-Stop feature to prevent leakage even at low temperatures|Color Name: Blue; Material Type: Plastic; Size Name: Medium", "user_id": "AEBZ2HAXFK35IM72RWPADC7VH3EA,AFYJKU3CYIDTCWXSROBNCJYVGDVA,AEJY6YKEUDBOG6TW6F47ZHY4SRPA,AHOOFKHRAB2AOMAVEHT36C2N2ULA,AERTQHHQOMTDNYMD22NPY3GBBM4A,AEYA5Z6OAFIGPU5MHDGOJRJFWIBA,AEPVJ654JP5LWKT3REYOYCIROB3Q,AFLE4CBGWA423HZGZY3AYGMCR2AQ", "user_name": "M L.,SIVAKUMAR,Sriram,Kalpana singh,Shaikh Noorulain,Divya Seshan,Nikunj Mehta,Padmanabha Lingaiah", "review_id": "RK56D57RLGNG7,R3SZTBONWK6EEB,RW0XZ8GFEVSHT,R1ONWKUQ97UR0Z,R31QLHY7PDUZ58,R3PN59YSGTFQA4,R313IF9FNSCCXG,RGABQNB8MCJIV", "review_title": "Steam irom,Good,Value for money,Amazing product😁😁,Very nice product.,Good product,Good product,It comes with 16Amps Plug", "review_content": "Light weight steam iron is very useful,Very good,Very good quality. Light weight, Fantastic product and it matches the product description and features that was shown in the review.,Best product,It's very useful and easy to handle. It gives fine finish.,Ease of use,Great,Buyers, pl. note, this iron comes with 16Amps plug, which won't fit in many homes. I had to return due to this reason. Other-wise, product looks pretty good.", "img_link": "https://m.media-amazon.com/images/I/41iBNm2ivFL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/EasySpeed-GC2145-Resistant-Soleplate-Drip-Stop/dp/B08H6CZSHT/ref=sr_1_268?qid=1672923606&s=kitchen&sr=1-268"}
{"product_id": "B07CVR2L5K", "product_name": "INALSA Electric Chopper Bullet- 400 Watts with 100% Pure Copper Motor| Chop, Mince, Puree, Dice | Twin Blade Technology| 900 ml Capacity| One Touch Operation, 1.30mtr Long Power Cord (Black/Silver)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MiniFoodProcessors&Choppers", "discounted_price": "₹1,656", "actual_price": "₹2,695", "discount_percentage": "39%", "rating": "4.4", "rating_count": "6,027", "about_product": "Reduce Prep Time: Inalsa Bullet is one powerful & noiseless chopper of 400Watts efficient motor with 100% pure copper winding that can work continuously for 3 minutes to chop, mince and puree and giving excellent professional results ; Power Consumption (Watt): 400 ; Input Supply: 230V, AC ; Time Rating: 1mins contineous (max.) ; RPM (at No Load): 3000 ; Speed Setting: 1 ; Cord Plug / Length: 2 Pins, 1.5 m|Simple in use, Extraordinary In Functionality: Twin blade technology, detachable double layer stainless steel system provides quick & efficient chopping & dicing operation. Be it coarse, medium or fine, the chopper does it all!!.Frequency 50 Hz|Outstanding In Quality & Conveneint: Bullet has a stainless-steel finish in front which enhances the look of the appliance.Easy press down button & anti-slip base facilitates fast & convenient operation.Chop in one go,No extra buttons or switches!!|Satisfy Home Need: The bowl of Inalsa Bullet is dishwasher safe, extra durable and provides visibility to chopping levels.With 0.9L (Total Capacity)/0.5L (Processing Capacity) bowl, chop veggies,dice fruits,prepare salad & create bread crumbs|Sturdy, Strong & Safe Appliance: Made from unbreakable ABS plastic for long-lasting & hassle-free use, this appliance takes care of your chopping needs. Multi-Splash Guard bowl lid is used as a cover of processing bowl after chopping, Time Rating: 1 mins continuous (max.)|2 Years Warranty: We sincerely provide with product warranty and genuine customer service. If you have any needs or questions,", "user_id": "AGYUFQB6WUOMBYRLWNULRLC4GQ3A,AGREWD4V5XIIO7ZZSLOOF5PPW4RA,AEDTSPMMJN5UL33AYZXSBOVGMRLA,AECEPMMYOPFBE6SIVWQUSUHHAC2Q,AHO4TPXF2JLVKWJRV2IDP3OD3D6Q,AFWU3N2B6R66Q23QYZUC527E2BBA,AFEF4DGU3HTWTOL5DUN2XDYHMCVQ,AHVMXVNSDIZJWJFWWFU5EXRN77SQ", "user_name": "ajaydreamer,Tinu Ravi Abraham,niteesh,Niraj Agrawal,Gopi,Sammy,Anshul,Amazon customer", "review_id": "R2O8A01MW8OG45,R17SZCFHFXSBJ4,R15YIPPTFN5V7W,RVMI19H090GN5,R1UQMESC400YOE,R3N9DZ2JDGIAWQ,R2SYKE16W886JJ,R2YD92F7BXAMZH", "review_title": "A must have addition to the kitchen.,Easy to use,Superb,Fast and sharp blades...quick work,Good product,Quality of motor is good, just doubt on jar, it's not so much strong,Inalsa Bullet Chopper,Very handy and good chopper", "review_content": "After about a month of usage this is an over all a good product from Inalsa, here are the key highlights:1.  Has dual speed options to chop onions/tomatoes for tadka and also make purees/chutnies etc. Does both effortlessly.2. Powerful 400 watt motor cuts through onions like a hot knife through butter.3. Easy to clean as the blades can be separated from the main jar.Thanks,Very useful and handy for daily kitchen needs.Reasonable price.,Excellent product. Love u,Good product,The product works good, and powerful too. The box arrived damaged. But product ain’t. Good value for the money.,Good product, motor quality is heavy, just concerned about jar, I request company to make it available on Amazon.,Excellent product with heavy bowl powerful motor makes it easier to chop vegetables in few seconds,This is a very good kitchen accessory for every household's needs. helps to chop and cut vegetables quickly. I have used other choppers in the past; this has a much better cut performance.", "img_link": "https://m.media-amazon.com/images/I/413w7idJYKL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Inalsa-Bullet-400-Watt-Technology-Chopper/dp/B07CVR2L5K/ref=sr_1_269?qid=1672923606&s=kitchen&sr=1-269"}
{"product_id": "B09J4YQYX3", "product_name": "Borosil Electric Egg Boiler, 8 Egg Capacity, For Hard, Soft, Medium Boiled Eggs, Steamed Vegetables, Transparent Lid, Stainless Steel Exterior (500 Watts)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|EggBoilers", "discounted_price": "₹1,399", "actual_price": "₹2,290", "discount_percentage": "39%", "rating": "4.4", "rating_count": "461", "about_product": "BOIL & STEAM - For 'Egg'cellent results everytime use our Borosil ELectric Egg Cooker, a multipurpose appliance that helps you to get breakfast ready in a matter of minutes. You can have your eggs exactly how you like them, every morning - boiled (soft, medium hard) You can also use it to steam vegetables.|COOKS UP TO 8 EGGS AT A TIME - No more waiting! Now you and your loved ones can all sit down to eat together as the egg boiler can accommodate up to 8 eggs at a time.|CHOOSE FROM 3 BOILING MODES - Prepare your eggs just the way you like them. Soft and runny, hard boiled, medium consistency - the egg boiler can do it all!|MEASURING CUP WITH PIERCING PIN & POACHING TRAY INCLUDED - You can use the measuring cup to add the exact quantity of water that is required for a particular mode. The measuring cup comes with a piercing pin. Piercing your eggs with the pin prevents eggs from cracking.The result - perfect yellow yolks, everytime.|EASY TO OPERATE & CLEAN- The single press operation makes it incredibly simple to use. All you need to do is put the eggs in the boiler, add appropriate quantity of water and select the desired mode.", "user_id": "AFZESR4UNHIMTL2SQMFA3FJYKHAQ,AF2KW5BVHOC5TMH3ZBVCRSG4CCBA,AH5A5LHF3QDSOP2C5YV5RI5SFY7Q,AFJUTJ2OOOMAALQVWF4NJHMWWTLA,AFBO7V4C5TDYJ4VCEZTNK3JUAL4A,AFEUD4GVTU2JV2PXCSYQE34CM6FQ,AHFCHZTGIW3H765BOG5UQ4CS5B6Q,AGD3DH2YTXYUU3D2AHBH2FOW5BDQ", "user_name": "Renu,matthew thomas,Chandrakanth Ksheersagar,Amazon Customer,Unnikrishnan Pillai,shreyoshi halder,Vijeta,Amit Mukhedkar", "review_id": "R2UIJV14OIMCZV,R1458J40NJSVIT,RXW8PLIUVJ2OE,R9A1OF3EW7MGN,R28WD8ETADFIKR,R1PELVV3KOBO73,R3P3AYLYQSCIHC,R218TWEQR99LCG", "review_title": "Over all good,Good product, but power switch,Good product,Quality product by Borosil!,Awesome 👌,Easy to use,Excellent,Its a very user friendly product.", "review_content": "Over all good, Easy to use.*But do remember there is no existing button to set Hard, medium and soft boil. Its totally depend on how much you have fill water level.Like 50ml for Hard boil,It just different way to fool people to show up Soft, Medium and Hard boil facility.,Good product and does the job as advertised. Autocut off is there, but the power switch doesn't turn off automatically. it should be done manually which we can forget. Once cooled down, this will turn on even water is not there. so switching off is mandatory. i have kept a smart plug with 20mins count down to overcome this issue.,Overall it is a good equipment to boil eggs. But there should have been 1 change in button. It says automatic off, but machine is not really off... It will restart again when machine cools down because power button was kept on.. Button should turned off automatically to avoid restart. Hence 1 star less.,,Used three times so far, boiled 8 eggs each time, and perfect results each time.  Very happy with the product.  Will provide long term review after couple months.  Thanks Amazon.  Thanks Borosil.,Easy to use product,Eggs r clocked perfectly. Follow the manual properly then it will be easy to use.,A very user friendly products. Makes boiled eggs very quickly. Also the feature of making poached eggs is useful.Overall a very good product.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41MJ2hsq4LL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Borosil-Electric-Vegetables-Transparent-Stainless/dp/B09J4YQYX3/ref=sr_1_270?qid=1672923606&s=kitchen&sr=1-270"}
{"product_id": "B0B2DD8BQ8", "product_name": "Wipro Vesta Grill 1000 Watt Sandwich Maker |Dual function-SW Maker&Griller|Non stick Coat -BPA&PTFE Free |Auto Temp Cut-off| Height Control -180ᶿ&105ᶿ |2 year warranty|SS Finish|Standard size", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|SandwichMakers", "discounted_price": "₹2,079", "actual_price": "₹3,099", "discount_percentage": "33%", "rating": "4.1", "rating_count": "282", "about_product": "Truly multifunctional Grill Sandwich Maker which could used to make a sandwich maker to panini ,toast & Roast and also operate as a smokeless indoor Grill|Sandwich Maker – Big size non stick plate (230mm*145 mm) opens upto 105ᶿ (Extra 15ᶿ) for easy operation and usage|Grill – With Huge plates can also be used to grill with plated opening upto 180ᶿ|Auto cut off feature to avoid excessive burning of food and stress free operation|Cool touch handle for safety and easy usage|Easy to clean non stick grill with quick heat up enabled by 1000 Watt function (2 years warranty)", "user_id": "AGT6US6YWB52FSW73Z6GUN4YKLMA,AHNK645M7U3NYPVYHTVX7LVQAVLA,AGNLKKB5BQFDZ2VIJJFRUROTMQMA,AFNV7NMTHTVCQTNUZEDQVTJEXU2Q,AFPXQFK4SWJN6QWFRHOJ6DWMEVVA,AHPQHJVDA6JHFNRN7OBYTBTJXBYQ,AERYOOEJHPM6LGMKD2LIKMGODTHQ,AEWJA5C73VCGFR4HX5TOUINZ425Q", "user_name": "Vaibhav G.,Archana A.,Tech & IoT savvy,SM Hussain,Varinder Singh,Amazon Customer,Ayushi Jain Bansal,NIKHIL H SWADAS", "review_id": "R21NO0SUPFUAO5,R2GPXUN1O93HXF,R1DWVFYYKKIK74,R3I6NJUB4QS3U6,RBQO4ZTLRXA60,R7ESCSWWQ9CMY,R2XS80YVEE2VLG,R20M9438YP7Z2E", "review_title": "Good!!,Came with a small scratch on the casing and box was not sealed,Heat fast, cut off once a while,Small sized griller which is not so bad,Size issues,Works fine. No issues, cord could have been longer,A must buy,Its good.", "review_content": "A great product of convenience. The only drawback being the heating or grilling time seems to be a little more after regular use than it was when brand new. But otherwise a great product to reduce all the hustle!!,Came with a small scratch on the casing and box was not sealed. Otherwise it's OK,Pros:1. Good brand value2. Two year warranty3. Easy operation4 . Evenly cooked food.5. Decently priced.Cons:1. Weight distribution is not even. Tumble when press on handle.2. Cut off time is confusing, mostly power cut before food is fully cooked.3. There is no locking for griller4. No power regulatorOver all it's a good buy for domestic use.,,The product is great but its size isn't good. I'm not able to cook even 1 jumbo bread sandwich in it. The bread comes out of the griller, and some part of sandwich is left uncooked.,Works fine. No issues.,I am in love with this Griller toaster! It is so sleek and compact in design with complete ss finish for safety use. Food is cooked in minutes because of 1000 watt. It is so good! I frequently grill my veggies, paneer, etc on this . Comes with auto cut feature to avoid food from burning,Good in griling its 1000 w so fast griling.but one problem power cord lenght is too short.", "img_link": "https://m.media-amazon.com/images/I/31nbqS8FhKL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Wipro-Sandwich-function-SW-warranty-Standard/dp/B0B2DD8BQ8/ref=sr_1_271?qid=1672923606&s=kitchen&sr=1-271"}
{"product_id": "B0123P3PWE", "product_name": "Rico IRPRO 1500 Watt Japanese Technology Electric Water Heater Immersion Rod Shockproof Protection & Stainless Steel Heating Element for Instant Heating| ISI Certified 1 Year Replacement Warranty", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|ImmersionRods", "discounted_price": "₹999", "actual_price": "₹1,075", "discount_percentage": "7%", "rating": "4.1", "rating_count": "9,275", "about_product": "High Class Premium No 1 Quality compare to any brand|Free Replacement with in warranty period no company gives except Rico|1500 watts Immersion rod with Super fast heating Copper Element with Nickel plating for efficient performance and long life|Convenient Bucket handle for easy grip and easy usage,heater rod water water heater water heaters heater rod water heater rod water heater rods water heaters rod|Best alternative to all other water heating options as per Highest European Standard 100% Copper Rod", "user_id": "AGB3FQ7523INWDNY3MAHJWA5ZGIQ,AFOLHTLOEWQQPINOVOOJ4LKDV2WQ,AEUF4QR7MJKENC3HLTNYAFOHZKXA,AHMB26HGLHBPKSOH3OUNWCBIQCFQ,AFSLUKKF3K7FMWODWA6LZ2ZVTWWA,AF7GR2MYNSFD4CNYGBK3FANOGQ5A,AF3WQWGNYVESH32NWB4I25WPG3SA,AFWXZ2W37J27GZLU6RBZZRVJYQ3Q", "user_name": "MANEESH Jaggari,Vishal dhan,K. Chandrababu,md javeed,Suyash phapale,amit garg,Kiran Nelakuditi,Rajasekaran", "review_id": "R2700E7W1TZOD3,RJYAUT0FRKDMB,RL8FH0EY6MYW2,R3LQZ1MVHYQ0AH,RA44P2P2I6OAT,R1RY147GD1ET8M,RYTQA3YC8EVSL,R2UK87WTHHEQLI", "review_title": "Excellent to Use, Adequate Cord length but Too Expensive compared with other & Hope for Durability.,Easy to handle, hassle free,Good,Nice product 👍,Good product,Overall good product,Product not working more than 6months. At that time 797 rs now 999 rs. Too much,Not Shock proof at all", "review_content": "1) Cord Length could be increased little more (~5cm-10cm) because Medium Bucket size is adequate for Covering of Cord length for water up to 60% of water in bucket2) Excellently Easy to Use for old people (above age of 75) also3) Hope, Durability is Good for the Price4) Price is Too Expensive when Compared with other Top Brands (So, Hope will not come to Repair easily as compared to other brands),I mean it's a water heating rod right.?? So obviously I'm gonna use it to heat water for bathing,Good,Shoke proof,Good product,Ok,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71IMDaS7AaL._SY88.jpg,They are saying it is shock proof. but in user manual they said don't put your hand in water while heating. i don't understand what how they are claiming it as shock proof.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51mvimcd7EL._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Rico-1500-W-immersion-water-heater/dp/B0123P3PWE/ref=sr_1_272?qid=1672923606&s=kitchen&sr=1-272"}
{"product_id": "B08HDCWDXD", "product_name": "Eureka Forbes Active Clean 700 Watts Powerful Suction & Blower Vacuum Cleaner with Washable HEPA Filter & 6 Accessories,1 Year Warranty,Compact,Light Weight & Easy to use (Red & Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Vacuums&FloorCare|Vacuums|HandheldVacuums", "discounted_price": "₹3,179", "actual_price": "₹6,999", "discount_percentage": "55%", "rating": "4", "rating_count": "743", "about_product": "Note-This vacuum cleaner comes with an auto shut off technology that automatically shuts off the vacuum cleaner to protect from overheating|Post Purchase virtual Demo is provided on this product .A dedicated customer service executive is assigned to give live demo of the product over a video call|Best in class 700 Watts motor delivering powerful suction of 15.5 KPA and blower function that helps to tackle dirt, dust and dust mites.|Compact comes with Washable HEPA Filter which traps in minute dust particles up to 0.3 microns and ensures that the expelled air is ultra Clean. Please wash and dry the filter before use. Kindly ensure there are no traces of moisture or water before use.|The bagless design features a dust cup that collects all the dust, making it easy for you to simply tip it over and dispose the contents|4 meter long cord to ensure easy movement around the home to clean in one go, without worrying about switching sockets.|This vacuum cleaner comes with a wide range of accessories for different cleaning needs. It provides solution for efficient and hassle-free cleaning. The accessories provided are easy to use and convenient to store.", "user_id": "AHFILHSL3P3VABTMFUYKAWTNUWVQ,AHLGS6FCOG5AUP23U6ZJRXES7DCQ,AF5LVMOSEJ52KWFQDNEI2XXPAMJA,AHCJSKRROLBCRT5CA6NDKVJMWSOA,AGDRSRFFX2RVEHUZJXQTXGRZ3NWQ,AHMLLF7BJZGHT4BUAPH6OBOSQNEQ,AETGK22TGIAO4WZO4G3NPOBRLXCQ,AF3WRE2HEDELD4RT5IV3W3OUIAPA", "user_name": "shiny,Placeholder,Karunakar,Veena rastogi,Chetan Lad,E v krishana reddy,Amazon Customer,Nishant R.", "review_id": "R1EOXYGHBYOOB9,R2MQLUR661FKOA,R235YDZ5Q9LII7,R26GBAZJ5NKP2J,R170382TYOYO5I,RJHX6V54VZFP4,R5YSMPE1H316Q,R3021SP9CQ8U4W", "review_title": "Ok but not for deep cleaning,Just ok. Trips frequently,It’s good product, however it’s getting heated up very fast.,It is very helpful,heat and stop after 10 minutes use,Good,Handy and good quality vacuum cleaner,Deep cleaning", "review_content": "Handy but no carpet cleaning. Stops in 10-15 min of continuous use..takes another 10 min to cool and restart...ok for cars  may be. The filter cleaning is difficult. I returned my product.,The equipment trips very frequently due to overheat. It's happening almost every 5 minutes, and takes Upton 30 mins to cool down. Not a good product.,It’s mostly used for cleaning sofa and bed corners. It’s getting hot very fast and getting tripped.,This product is very helpful in cleaning.,Easily operate and many function so easy clean every corner and whole place,Hi Heat,Liked,Helpful", "img_link": "https://m.media-amazon.com/images/I/41zqeckaQtS._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Eureka-Forbes-Active-Cleaner-washable/dp/B08HDCWDXD/ref=sr_1_273?qid=1672923606&s=kitchen&sr=1-273"}
{"product_id": "B0836JGZ74", "product_name": "CSI INTERNATIONAL® Instant Water Geyser, Water Heater, Portable Water Heater, Geyser Made of First Class ABS Plastic 3KW (White)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹1,049", "actual_price": "₹2,499", "discount_percentage": "58%", "rating": "3.6", "rating_count": "328", "about_product": "Instant water heater: Now comes with unbreakable First Class ABS (Acrylonitrile butadiene styrene) body and comes with water inlet and outlet Thread type. It is more convenient for usage and it will avoid water leakages. Our geyser is portable, instant, and compact, less power consumption Up to 20% saves electricity compare to other storage geyser|Auto cut off feature: It is available when the user forget to switch off it will going to automatically cut it off. (Manual reset models are only going to Standby Mode, Other Auto reset models are going to restart automatically after 10 minutes If this is not noticed, the same process keeps repeating it will increase your electricity and geyser life time also decrease.|Compact size: It provides Non-stop (247) hot water from 10 seconds onwards, just put it in the water tap and get hot water continuously it does not required additional plumbing. Ideal to use in Houses, Beauty salons, Hotels, Schools, bathroom, Kitchen, Wash area, Hospitals, Mansion and factories where there is an instant need of Warm/Hot water supply. (Strictly we are not recommended for drinking purpose)|Specifications: ABS (Acrylonitrile butadiene styrene) Shock proof and Heat resistant, Copper Heating Element Tubular type(3Kw.) , Indicators Neon Green and Red light, Thermostat Copper ISI marked, 1.5 square mm 3Core cable ISI marked 1.15Mtrs, 16Amp. Plug Pin-top ISI marked, coming with Guaranty card and user manual, with 2 No s Connecting nipple, 1 No Royal union, 1.5 m connecting hose and 2 No s Screw with wall sleeve and excellent packing|Easy to carry and safe to use: The instant water heater can be carried easily and the compact size to make things easier. It is safe to use.", "user_id": "AFEJIT5UQ3HEOL3DZC6L6KYRV3DQ,AH2J64YFD3HW5OV56YJNQLBQ7XIA,AEPVJN4BS557OWQY7AGNBVHR2H4Q,AEPI6CAH4T4LF32FXJI33XSGKVXQ,AHOVCDT2KUT7CNKNFGBXKUMKXRWQ,AEGORIFOSXK3ZKHWQYU6C7D5XKRA,AFHCZWXABRKQE6YBEDF2G5OEYQXQ,AGWLDQYVEJM4TCX2OZILNDABY7UA", "user_name": "Customer,Krishnendu halder,product user,Seena Geetha,veerendra sahu,Ajeet singh,Philip Alat,Ranvir Singh", "review_id": "R1EHLWVCNS1GYC,R12TMIZDRWREBE,R77IQG19KY16L,R3V9KCNAJ0PXQ,R2MAC7AI6X08LW,R17D4S6KU2SOBU,R1QO6EVD5EQ2MJ,R3FUW4VZQRFKQ5", "review_title": "Ok product but not for winter,Easy to use,There's no support for the product . You will not get the warranty.,👌👌👌,Value for money,Good,Good,Quality of the product is not as I expected.", "review_content": "it is not useful in Winter as the water is coming normal temperature.,,There's no support for the product . You will not get the warranty. It should be mention somewhere.,Very nice,I have ordered it again, i am using the last one from last two years. Working very well and take least space and very compact,छोटे परिवार के लिए सही है ज्यादा पानी वालों के लिए नहीं,Good,Quality of the product is not as I expected. I does not warm the water as it should be.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41AQNOLe6GL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/CSI-INTERNATIONAL%C2%AE-Instant-portable-Plastic/dp/B0836JGZ74/ref=sr_1_274?qid=1672923606&s=kitchen&sr=1-274"}
{"product_id": "B0BCKJJN8R", "product_name": "Hindware Atlantic Xceed 5L 3kW Instant Water Heater with Copper Heating Element and High Grade Stainless Steel Tank", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹3,599", "actual_price": "₹7,290", "discount_percentage": "51%", "rating": "3.9", "rating_count": "942", "about_product": "COPPER HEATING ELEMENT: Copper element present in this quick water heater ensures long lasting performance and efficient heating|STAINLESS STEEL TANK: This instant water geyser has high-grade stainless steel tank for superior protection against corrosion and high durability|WORKING PRESSURE: Class-1 Working Pressure built to withstand the high pressure of 0.65 MPa, making it perfect for multi-storey buildings.|TECHNOLOGY: i-Thermostat technology maintains an equilibrium between the temperature attained and the temperature required. Instant auto power cut-off feature adds to the safety and power saving as well|SUPERIOR SAFETY: Pressure release valve provides protection against any pressure build-up and very high temperatures", "user_id": "AEUGPJCYVDS74WR3B5AAHYQ67XMA,AEPH3KDGWVA4YF2X5H4KC3MMK67Q,AHF7EJSIX2PYEQKA4EF3OLMPI6SQ,AEJ63C77IP6XR6EZNHFYI7KN6BCA,AGY6MPTJJNB3OV4PE3HOOYXG6IXQ,AE7JD7KIAYTAFPP35NQ7YUJF2GNA,AFXKLQI6SM4PUEQO7CJQ3G53PKOQ,AFI4YEGCYKF6Y5UN3GHY2AKCQYHQ", "user_name": "ABC user,Abhishek Kumar,Rajasekar K,Anil .P,NEEL SARSIJ,Akash pundir,Suman Jana,Saurabh kumar", "review_id": "R2B3FENTTL8FY5,R2LLTOR4VYRSUP,R38QJJ3J9FUKGT,R1F6I0EPG64UKU,R1RMEFMJ2K9U77,R2N6SGIK0RA7CZ,RVMWQ6RR0C1HY,R3UBFGKNSPP1T", "review_title": "Good product but pipes/installation/plug not included,engineer charge 850/- he said company not provide instaltion bill,Good product,Its ok Good, not bad,Geyser is very Good,Genuine,Average,time saving", "review_content": "I bought 5ltr 3kw model 10 days before Provides hot water just below boiling temprature 80°-95°C in 4-5min if provided mild cold tank water and auto cutoff after reaching hot temprature,Pipes/installation/plug not included installation is 350 +18℅= 413 rs and i also paid 440rs hefty amount for 2 18inches steel pipes which I bought from installing engineer which is much higher than market pipe rate(200-250rs) better buy it from market if you buy this gyeserAlso there was no MRP on pipes wrapper provided by engineerSo be ready to spend 700 - 1000 rs extra if you want to buy this gyeser even though your bathroom is fitted with angle valves and other gyeser fittings.Till now not tested in extreme cold weather of january starting in which no sunlight + temprature drops below 5°C in my area I am from middle up region,I bought 5ltr 3kw model 10 days before Provides hot water just below boiling temprature 80°-95°C in 4-5min if provided mild cold tank water and auto cutoff after reaching hot temprature,Pipes/installation/plug not included installation is 350 +18℅ also = 413 rs and i also paid 440rs hefty amount for 2 18inches steel pipes which I bought from installing engineer which is much higher than market pipe rate(200-250rs) better buy it from market if you buy this gyeserAlso there was no MRP on pipes wrapper provided by engineer charge 850/- he said company not provide instaltion bill,Good product enjoying with the performance... Hindware mechanics charging too much and force to pay the amount else warranty is not available... It is too much... No 3pin plug and water hose supplied... If hindware charge the fixing charges at the time of order is fine,Look is Good this Hindware gysar ,I have faced problem with wire is very short and  three pin plug set not given.I am using from last one month working condition is Good.Instantly water heating is good.,5 Lt XCEED geyser is very good heats water very fast one drawback is installation is not free I had to pay Rs 370 extra while I bought my own plug and conecting pipe Amazon hide this thing.,Good product,It's a good product,easy to install and handle", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31i-KNZeKML._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Hindware-Atlantic-Instant-Heating-Stainless/dp/B0BCKJJN8R/ref=sr_1_275?qid=1672923606&s=kitchen&sr=1-275"}
{"product_id": "B008P7IF02", "product_name": "Morphy Richards New Europa 800-Watt Espresso and Cappuccino 4-Cup Coffee Maker (Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Coffee,Tea&Espresso|EspressoMachines", "discounted_price": "₹4,799", "actual_price": "₹5,795", "discount_percentage": "17%", "rating": "3.9", "rating_count": "3,815", "about_product": "Makes espresso, cappuccino and latte coffee|Milk frothing nozzle: Use the milk frothing nozzle for making Latte, Espresso Macchiato, Caff? Breve, and Caramel Macchiato varieties of coffee ; Turbo cappuccino nozzle: Use this special nozzle exclusively for achieving a satisfactory froth in your favourite Cappuccino|Warranty: 2 years on product|Power: 800 watts; Operating voltage: 230 volts. Bar Pressure: 4 bar. Function select knob :Yes|Includes: Coffee maker, Instruction manual, Customer care list and Guarantee card", "user_id": "AEFYJ3VKDQDLXLOEH7TKQUXIT7HA,AFLARMOT32PZ5FPIILELCOKTTCWQ,AERLEJIKGVDMADHIHSA4DVMEJUGQ,AEDK7NNC32QPIBYSPK3J4OFILH4Q,AF4NZ4IE7EJVM3TNU3EWWNTVVPTA,AEOSZOOLVIL7K74EVIMKO7G6FG2A,AF4O4LUZMCTMSSHA7Q7DJNUIFZZA,AE7H55TQ6WG5UBHJXDIJXAZJKCIA", "user_name": "Manish Holla,SuperPlayer117,Sudeepmirza,Amba vasantha lashmi,Swati,Damaitre,Amazon Customer,Amazon Customer", "review_id": "R2FNV0NZDLWHE,R2M99BK02MCDNV,R2P5UQ0XEPCTOW,R1J2HEVC2FWFAN,R2RIUPW9S9ZHGN,R2LV0EOIWD1E49,R1D75XFJREJIF7,R2K5FL56JA45QK", "review_title": "Sufficient for a Family,Makes superior coffee,almost par with those brewed in CCD,value for money,Nice,Doesn’t justify the Description,Good for the price,Unnecessary Buy,Delivery without Warranty Card", "review_content": "This machine can easily brew coffee for a family of 4-6 members at a time. Some people asked whether this can be used in a cafe. The answer is simple 'NO'. Reason is that this isn't a sophisticated machine like a professional commercial grade coffee brewer.Now my experience with this machine was good. And a bad thing was that I did not get the steam pipe sleeve. Except that, everything was well packed. When you buy this machine, make sure to rinse the internal passage. throw the first water from the machine. thoroughly wash the caraffe, puck, filter and measurement spoon. Remember to NEVER USE dishwash gel or soaps to wash carafe, puck or anything such. It may ruin the coffee aroma.Method (efficient as per my opinion):1. Fill the water in tank. No need to measure it as it can be controlled with the selector. Don't run it dry. It may damage the heating element or pump.2. Switch ON the machine. After that, pour the ground coffee powder inside the filter, level it and press it to compress. I use 1:2 ratio. 1 spoon of coffee powder to 2 spoon of water at output.3. Before changing over to drip mode, open the steam valve and check if sufficient pressure is built. Placing carafe under the puck, slowly move the selector till Europa, and quickly back it to steam icon. This will let the coffee bloom inside. After 5-7 seconds, slowly move the selector upto Espresso. The decoction should be not too slow or not too runny.4. Wait till your desired quantity is reached and quickly change the selector to steam mode.5.  Take milk in a tumbler which is slightly larger than the level of milk. Place the tumbler under the steam pipe such a way that the tip should immerse just slight under milk meniscus. Slowly open the steam valve located at the side. Steam it as per your need.6. Mix the milk and decoction. That's itRemember to not uncap the top lid after usage as there may still be pressure inside. Open the steam valve and let all the pressure get released.Coffee used: Bombay Island Espresso grind Medium Roast. Use only espresso grind or maybe south indian filter grind. Don't use Aeropress, V60 or any other grind as it may not produce desired taste.I personally like this machine. For the price it's good and build quality is Moderate. Please watch some YouTube videos if you are new to coffee machines. It's very very easy to ruin coffee without proper knowledge. You may also watch James Hoffmann. He is World Barista Champion and shares tips about coffee.,I'm a fan of espresso. Every time I go to a coffee joint, I tend to order a doppio( A double shot espresso). But, those prices are way too high if I wished to drink a cup of espresso twice everyday. So, I've decided to buy this machine. One thing to say, the quality and durability depends on the user. If you take care, the machine would take care of your cup of joe.So, how do you properly clean this thing is the question raised by many guests after seeing.1. Always rinse the drip tray2. Use 10% dish washing liquid with 90% water to clean the carafe3. Do not hit the filter basket to drop the used grounds. Run water over it forcefully to loosen the grounds. This is crucial because dents can affect quality4. Before and after your brewing activities, make sure that you clean the internals. To do this, fill the carafe till the 4 mark with bottled water.  Assemble an empty perma-filter.  Switch on and set the strength to max. In about a minute, you can see steaming hot water flow into the carafe. Check its color. If it's yellow, then rinse and repeat. If it is white, dry everything and switch it off. Then, either do your coffee brewing or assemble it back and call it a day.5. Always let the steam out. When you froth milk, immediately wipe off the residual milk with a lint free clothWARNING: NEVER EVER USE HARD/TAP WATER. IT CAUSES SERIOUS LIME-SCALING ISSUES WHICH CAN GREATLY AFFECT THE TASTE, QUALITY OF YOUR COFFEE. IT MAY ALSO CAUSE DIGESTIVE ISSUES. ALWAYS USE SOFT-CAN WATER(THE WATER MUST NOT TASTE SALTY OR SWEET).  TAKE THIS SERIOUSLY. PLEASE DO NOT POST MISLEADING REVIEWS STATING THAT MY MACHINE BROKE.THE STEAM KNOB IS THE WORST PART OF THIS MACHINE. THE MACHINE WAS USED JUST FOR 14 DAYS. THEN, THE STEAM KNOB DECIDED TO LOOSEN UP AND FALL OFF. I CALLED THE SERVICE CENTER. THEY TOLD ME TO BRING IT THERE. THE PROBLEM IS I'M JUST 17, AND I CANT DRIVE. AND THE SERVICE CENTER IS FAR AWAY. SO, I REMOVED THE RUBBER CASKET AND FIXED THE KNOB DIRECTLY. IT COMES OFF, BUT I THINK I'LL USE IT ONLY TO EASE THE PRESSURE, BECAUSE I ALWAYS DRINK IT BLACK. BUT THIS ISSUE MAKES ME REDUCE A STARTips for using the machine.1. Use fine grounded coffee. I use Narasu's PB or Royal Elite Bold. Currently,  I'm using Phalada Pure & Sure Organic Coffee Powder. For the best results, you must grind the coffee on your own. If you can't make sure the coffee is fresh. Mind that using instant coffee powder or using coffee mixed with chicory can lead to disaster, both for the machine and your stomach respectively. You can also go for Lavazza. But, it makes a hole in your wallet deeper than the Mariana Trench.2. Only use good quality bottled/can water.3. Maintain a good cleaning discipline4. In case you've used hard/tap water, immediately do a descaling. Refer your instruction manual.5. Always tamp your ground in the filter. You must apply about 30 pounds of force. This is about 13 kg of force. Hold the force for about 6 seconds and slowly rotate the tamper before removing it. Make sure the filter lock is up when doing thisAs you can see, this is a real espresso maker. It produces crema provided that you use fresh and the correct coffee. For me, it produced about 4 mm crema for a double shot. This is good for a steam driven machine. Note that this is a steam driven machine. You can never get the finish of coffee joints, because they use dual boilers powered by thermoblock pumps. Although the tastes would be similar, provided you use the correct beans.Please look at the pics  to see the finish. The cirrus clouds like crema was from coffee powder a week old. The brown and rich crema is from that organic coffee powder I've just bought. Can you notice the finish being directly proportional to the freshness? This applies even to taste. The white crema cup tasted a bit bitter and left a bittery taste in my mouth. The brown crema cup tasted like coffee at its best, leaving a crisp and nutty taste. Also, after I did some research, I came to know that an espresso must have three layers. A bitter crema, a sweet middle and a nutty acidic bottom. You must mix these before drinking to have the best shot. If you see the glass picture I've attached , you can clearly see those layers.OVERALL, THIS IS A GREAT ESPRESSO MACHINE FOR A BEGINNER. IT MAKES GREAT ESPRESSO AND IT IS ECONOMICAL TOO. AS I SAID, IF YOU TREAT THE MACHINE WELL, THE MACHINE WOULD TREAT YOUR CUP OF JOE WELL.,Being a coffee enthusiast, the product fits in my requirement.Easy to use. Time taken is reasonable. Adjustment of intensity works well.Frothing tool is very good... though i prefer black coffee, frothing helps getting a perfect creamy coffee for my guests.,Nice product,The coffee strength nob is a mythBut itne paise me itna is good,Very happy with the machine, works fine and easy to operate, unfortunately it wasn't packed very well buy the seller so the plastic spoon that came with the machine was broken , everything was packed in the original box with only one tape to secure the box.,It makes the whole process of making coffee more difficult. Also was shocked to know this is not covered under Amazon's return policy. My bad I didn't check and now I am stuck with this. Life is no better after you buy this.,Coffee maker delivered without Warranty Card & Instruction manual", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31M+TYWPdQL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Morphy-Richards-Europa-Espresso-Cappuccino/dp/B008P7IF02/ref=sr_1_276?qid=1672923606&s=kitchen&sr=1-276"}
{"product_id": "B08CNLYKW5", "product_name": "Lifelong Power - Pro 500 Watt 3 Jar Mixer Grinder with 3 Speed Control and 1100 Watt Dry Non-Stick soleplate Iron Super Combo (White and Grey, 1 Year Warranty)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MixerGrinders", "discounted_price": "₹1,699", "actual_price": "₹3,398", "discount_percentage": "50%", "rating": "3.8", "rating_count": "7,988", "about_product": "500 Watt Powerful Mixer, this grinder can grind and blend both wet and dry ingredients with ease.|Operating noise levels between 80-90 dB; Initial burning smell is to be expected due to evaporating varnish, which is normal|This Lifelong combo has 3 Jar 500Watt mixer grinder and 1100Watt Dry Iron|1100 Watt Iron; with Non-Stick soleplate ensures that your garments do not stick to the plate even when the temperature is high.|1 year Brand Warranty|The 3-speed control knob of the grinder helps you get the right consistency as per your requirement. The iron also has a temperature setting knob that helps you adjust its temperature as per the fabric type.", "user_id": "AFIVMIYDHVSWUJ77XS632R7TSN6A,AE5PSEM6HJVUV5QNHJVA7RRSLNVA,AHNWJSDCHTTUYK5WOJBU2YKTR3IA,AEKDDCDBJEPCINQLCPOG33CGEZ6A,AGMYHDB65TQJ72JNLCDSU7RTYDFQ,AGYELK56Z7JKZAKVNPGUEI4TGRUQ,AG5CGZYQFXZAC3I63JBZ3K424DRQ,AHNWVF7BXDF76ZZFCIHJ4WW4CWDA", "user_name": "Lachhu Tejwani,Suaeb ansari,Aditya Upadhyay,kartar singh,Jameel Ansari,yaeo verma,Alice dsouza,pooja bhilare", "review_id": "R13SXCYDWPZD7M,R27X89M6VNZAZ6,R13PRENBWGTJL4,R1DIQOKB8QYLUH,R2FHZN2WCMLBOH,R2AOJHZMUZ7G2I,R91I40PR8A2CN,R2IZYQKHGOMD5L", "review_title": "Like it,Nice 👍 he,Iron worse grinder still usefull,Good,Nice work,Good for,Mixer is good. But package is very shabby. Wanted to gift it. But changed my mind,आवाज बहुत आती है बाकी मिक्सर accha hai", "review_content": "Value for money,Bahot achha product he ye,Iron got damaged in just 1 year. While past few months I used before that just using occasionally like 1 time in month. Same uses of grinder. But currently grinder working fine. This review date 30 dec\"22 purchased product at 7th oct\"21.,All product good. I am happy,Good product of life long,Good,,Loud jyada hai", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41q7gsgB+gL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Lifelong-PowerPro-Mixer-Grinder-Super/dp/B08CNLYKW5/ref=sr_1_277?qid=1672923606&s=kitchen&sr=1-277"}
{"product_id": "B08C7TYHPB", "product_name": "iBELL Castor CTEK15L Premium 1.5 Litre Stainless Steel Electric Kettle,1500W Auto Cut-Off Feature,Silver", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Kettles&HotWaterDispensers|Kettle&ToasterSets", "discounted_price": "₹664", "actual_price": "₹1,490", "discount_percentage": "55%", "rating": "4.1", "rating_count": "925", "about_product": "1.5 Litre Capacity|1.5 Litre Capacity|Stainless Steel Body|Auto Cut-Off Feature|1500 Watts", "user_id": "AG23E67LYRJ6Y26AIHNKS6ES4OXQ,AFT6TQLA4GD3L4RAOWFVDAH3IFTA,AEYH6IVYMLPHU62VNOKKM2KTOIIA,AE42ERTVDMJOMKKWUM2TY7O2SPHQ,AGL54U42PQROPV23ORMEIR6HZNQQ,AELYVI5NYV4RAW3MAGJ3P2GX6MLA,AER5GTDM6DHXOUD4KBSKYYYWX6AQ,AGSJPBY7DN7SSADF42CAXHTGNKWA", "user_name": "Rahul chauhan,Satyam Singh,Kiran K.,Arun,Ram E Singh,noorudheen,Raghuram Venkatesan,suhel basha", "review_id": "R1785DO8M4HFFD,R348X4GTO6PQU9,R1VCNIW9SC311F,R2D84AXLIIYENV,R1CW2N7FWCQ2E9,R8KYBGAM1VF8Y,R33F0EVLTMR7Q0,R3P48DOOF0CDJ8", "review_title": "It’s a good product in this price.,Nice product,It's very good,Good for use,Velue for money product,Good product,Value for money purchase,It is worthy", "review_content": "It’s a good product and I’m using it since 1 week and it’s performing well,I like the product but the code is small,It's good and easy to use .  Full Paisa wasul hai but cord thoda sa aur bada hona chahiye tha.,Good for hot water in minutes, But it has 2 pin connector .,Velue for money product,Nice product,Good product, fast delivery and ease of use make this a good value for money purchase.,This is good", "img_link": "https://m.media-amazon.com/images/I/41VG2A4BrbL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/CTEK15L-Premium-Stainless-Electric-Cut-Off/dp/B08C7TYHPB/ref=sr_1_278?qid=1672923606&s=kitchen&sr=1-278"}
{"product_id": "B08VJFYH6N", "product_name": "BAJAJ PYGMY MINI 110 MM 10 W HIGH SPEED OPERATION, USB CHARGING, MULTI-CLIP FUNCTION PERSONAL FAN", "category": "Home&Kitchen|Heating,Cooling&AirQuality|Fans|TableFans", "discounted_price": "₹948", "actual_price": "₹1,620", "discount_percentage": "41%", "rating": "4.1", "rating_count": "4,370", "about_product": "It is designed with Multi-Utility Clamp Mechanism; Enables table as well as wall operation|Easy charging compatibility with existing power cables|Li-Ion Battery with 4 hours’ battery backup provides continual operation during power cut and uninterrupted air delivery|With a size of 158 L x 95 W x 204 H MM, it gives instant comfort with high speed operation and high air thrust.|Mounting Type: Tabletop; Material Type: Plastic", "user_id": "AFSG325V4OVLV4CZQO3Q4OIHYNAA,AEFIFPUVWYO3I3N2P2WD7XLI6MXA,AGZA77NZOFDILVEQM2OA4JCW6YAQ,AEZNI2AOOQKK3JT2BBLMNAPNYJCQ,AG3XIMGKJUIAVY5V3MVT5EQU6W6A,AHKW7DHRIBCVNG35XNH6SEJWI5EA,AHAWKE7CIEPMX6PGO6LF6UNT776Q,AGSA2QU7S2ACENHUDHPQBHRZTIHQ", "user_name": "Chesin Cherian,sheela k.,siddharth,Manish Yadav,michel raj,Mnp,Dhruba Bakshi,Raghvi", "review_id": "R1QPP4497NVNZ0,R3TCP13OGSIO0A,R537ORAZ3D691,R1FR1SGYIKT2UT,R2BGMFCU9XSZIO,R29PA6GTSHBZT5,R2F2GEQ7YAXRSD,R3FJPTSYA7QLDQ", "review_title": "Replaced the first one.,It is very good product,Go for it,Nice Product,Simple and supper,Compact and Premium look product,Tiny but good,Best buy ever", "review_content": "The first one was not working. So got a replacement of the same within 2 days. Thank you Amazon. Now the new one is working but the battery life is not so good.,It is very light, portable, battery life is good and it's blowing fast wind of its capacity.,1.Light weight2.Battery life  •low speed -3hrs  •Medium speed-2hrs  •High speed-1 hr3.Fan speed is much better while it's charging.4.Takes long time to charge5.Overall quality is good and worth the price,Product is awesome. Easy to use. Bettery life is good. Take too time in charging.Price is high on Amazon. You can buy it at 800 from any offline store,Nice good product,Compact and very good look. Looks premium product. Air flow also good and noise level is also ok. Don't look for other fans. Battery backup not yet checked but only one point bad is that full charge you can't findout. There is no indication for full charge.,Pros:Original Bajaj productGood buildLight weight3 speed settingGood air throw for one personCan change fan face both horizontally and verticallyCons:Vibrates, causing fan base to move if not clampedVery very small, so can only cool a part of the body of one personBattery life is 3 hrs, which is too lessClamp isn't big enough for table sidesOverall:Very portable and good for one person. Would have been better if size was a bit bigger increasing cooling surface. No regrets though..,Moneys worth. Innovative design. Can fix it anywhere. Speed is good.  Been using it for 2 months now. Only con is switch is small and at the back. Have to search n adjust speed or switch it off.", "img_link": "https://m.media-amazon.com/images/I/51OQUmSwngL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/OPERATION-CHARGING-MULTI-CLIP-FUNCTION-PERSONAL/dp/B08VJFYH6N/ref=sr_1_279?qid=1672923606&s=kitchen&sr=1-279"}
{"product_id": "B08235JZFB", "product_name": "Crompton InstaGlide 1000-Watts Dry Iron with American Heritage Coating, Pack of 1 Iron", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹850", "actual_price": "₹1,000", "discount_percentage": "15%", "rating": "4.1", "rating_count": "7,619", "about_product": "PRODUCT: Crompton's dry iron with American Heritage Soleplate Coating for higher durability and longer life|TECHNICAL SPECIFICATIONS: Wattage 1000 W; Voltage 220-240V ; Dimensions 250 X 115 X 170 (L X W X H) mm|SAFETY: ISI Certified with power heating element for heavy duty use and overheat safety shut-off features|CONVENIENT AND EASY TO USE: 360⁰ swivel cord for easy cord movement and 6 pre-set fabric settings with variable temperature control|DESIGN: Matte black finished base and bronze lining, and a larger soleplate area with curved edges to ensure quick ironing", "user_id": "AHTJVOG52ZROVUFB64P2TTWIUCYQ,AFWZ75RYXU4BLWIZOEUMOWBSAPXA,AHACIF5SS4LL76SN3DNBDFNZQSHQ,AH2E7TXMON44B7YYHRAHWJ6HYFPQ,AG4Q3J2BSPCZD6YPMZ5FFE5A623A,AH37YFHELE7WDG7Z4C4HQWFY6DTQ,AFKYOQD6A4YUIYNDYWHM27QXER2Q,AE27QPJRG7545VJX7LYRK2EO3I4Q", "user_name": "Yogesh,Ashok,raja,Debabrata Das,Pushkar Gade,Shaheed,charafoudine,Gopal Samanta", "review_id": "R1YXTYLLFSDN6F,R2IU9VU91K2RIN,R13T54P444JQ2A,R2PQUB36L5O64N,R1KII9H1CWAA05,R22699HYNGFQ3F,R3VW949SRSI8DG,R33VXW5FCRM538", "review_title": "Good,Very lightweight and good looking,good,So far so good,Nice 👍,Average,I think is this 1000 watts? Produce 750 watts.....,Good", "review_content": "Light weight,Product is compact and goog looking.Due to light weights sometimes need hard press. Heating is quick but feels inappropriate.Cord sometimes abstract on standby.Not that much effective on cotton which requires hard press.Does lught and quick press job instantly,Good,instructions ( manual) not clear,Using it for a couple of weeks now. No complaints, does it’s job well. Will update my review after using a couple of months.,It's light weight and easy to move,Good but nice product,Every points are ok.,Good", "img_link": "https://m.media-amazon.com/images/I/31TSknJ2JbL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Crompton-InstaGlide-Certified-Dry-Iron/dp/B08235JZFB/ref=sr_1_283?qid=1672923606&s=kitchen&sr=1-283"}
{"product_id": "B078XFKBZL", "product_name": "Prestige Clean Home Water Purifier Cartridge", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterCartridges", "discounted_price": "₹600", "actual_price": "₹640", "discount_percentage": "6%", "rating": "3.8", "rating_count": "2,593", "about_product": "The Activated Carbon Media Traps And Destroys The Microbes In The Water And Removes The Unwanted Chemicals In It,Making It Safe To Drink|The Cartridge, Doesn'T Just Remove Harmful Pathogens As Per Usepa Guidelines, But Also Removes Odour", "user_id": "AGHNV56OVDCREEB45JCJLBST7XDA,AFZSMXS2MILXOSTT2ZEJDE3W7TLQ,AFVD6HB7DZDVOBDGJOB5OD5HRJFQ,AGGWFEEYQILYSQ7RS7GPJSTUWU7A,AEAS3VMYYUY4TJIVXZRHM6G6J7VA,AFGTTEXEMY2JB5T2LU3VKLX2IOMA,AEIJPU4PXM6JZM5QZSZWUPLV5I5A,AGEVYFS5HUW4XJWULHXIHHWYOQCA", "user_name": "Chittaranjan Gantayat,Raja Laxman,Tomichan Matheikal,Amazon Customer,Suyash gupta,C Balasubramanian,Shonjana,Anshuman Panda", "review_id": "R364MSHPSCBSZC,RKEUW208YEVV5,R1HDU0OEUM7U2H,RE3OPNCDGNAGC,R28G1EME0HSGGY,R1YR3D0NQE0YA6,R8VXX7ZVUBYGD,R2TDWGLITZUANO", "review_title": "Good cartridge but works for less than 3 months for 2 people,Normally sediment water filter,Works for a short period,Water is not going down and not filtering,Great product but too costly .,Correct spare,Great water cleanser,ABC", "review_content": "Prestige water purifier cartridge is obviously good. But it lasts very less number of days. It doesn't even last more than 2.5 months for 2 people. Also the MRP is cut off and it is sold at a higher price.,This Product normal sediment water filter, but not long use, So All customers you go to electric RO UV Water Purifier, I am suggested v guard, Kent, Havells Brands,I wonder if the product is genuine because the cartridge that came with the filter ran for over a year. After that, the ones i received worked for about 2 months only. I'm now looking for a Prestige service center from where i hope to get authentic product.,I order it for my prestige tatva non electric water filter. But it's not working properly. Water is not filtering and company is not giving any solution and saying it's not covered under warranty. My 600 rupees is totally wasted. I'm not expecting it from prestige company.,These filter cartridges are replace in three months.,Easy to replacr,All great but it lasts only for like 4-6 months max.,Good", "img_link": "https://m.media-amazon.com/images/I/313Cd59228L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Prestige-PSWP-2-0-Purifier-Cartridge/dp/B078XFKBZL/ref=sr_1_284_mod_primary_new?qid=1672923606&s=kitchen&sbo=RZvfv%2F%2FHxDF%2BO5021pAnSA%3D%3D&sr=1-284"}
{"product_id": "B01M265AAK", "product_name": "Morphy Richards Aristo 2000 Watts PTC Room Heater (White)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|ElectricHeaters", "discounted_price": "₹3,711", "actual_price": "₹4,495", "discount_percentage": "17%", "rating": "4.3", "rating_count": "356", "about_product": "Instant Warmth: 2000 Watts PTC Room heater ensure your comfort during chilly winters|Plug :3 pin power socket plug ,Overhead protection with power selector: Yes , Personalized Comfort: Customized to your heating needs with an adjustable thermostat and power selctor knob to set power as required|Peace of Mind: Featuring an indicator light for ease of operation|Convenient & Elegant: Aristo comes with an easy carry handle for your convenience|Reliable & Safe: Our room heaters are dependable and they also come with a 2 Year warranty", "user_id": "AETUVXSYNBLCDT2ZXECIXNWDVCEQ,AGNQO2QCWQX2CZT5KHHSNQVDD4OQ,AHBE5ZXUIVBQ63F4YQRPMX7RPATQ,AHBFNBEGK65M56REIXOVXEBAUBGQ,AHIFF4JR45VFWKDINQEHRJNWL3CA,AGBKPIZT2ILBXHFLJEQKBPAJEO2Q,AE3LGSXHC4DSCKB6JNXLAHV5KUZA,AHQXBLF3NC2JI5LCO7PUTYQMICJA", "user_name": "Rajeev M,Lakhan Singh Kushwaha,Ashish Parikh,Amit,Kalc,Joshi shrikant m,bhanu pratap Phulwaria,DB11", "review_id": "R1RIXV8K7LNZPG,RV401DJ0XBW51,RXUB8YDK5V29B,R39J7BNAZRV82W,R19LI8LD47VTRC,R2MH08WHCZODCE,R3FSG9EKSAV3RH,RLS3Q3GQ6V9X5", "review_title": "Sleek , Silent and Effective,Good product,100 % satisfied and recommended....,Bad product. Fan makes lot of noise,Its good with a flaw,Overall best.,Number 1,works decently.", "review_content": "Perfect for room heating ..... Noiseless,,Silent instant heating within 30 seconds. Easy to carry just a small suggestion that it should have left and right wind blower also instead of only up and down. Best product not saying it in this range but I have used others also this is the best till date. Even some time we use it as heat massager also as wind flow is awesome so sometime for back pain or knees it's a perfect product. Anyone of buying for the first time or buying for a better experience will recommend to go for this. Its almost 60 days of usage now. And yes easy to clean also. I have a dog and she also enjoys it...,I got a 15 month old used heater, not a new one.The fan is making a too much noise. It is a defective or a damaged piece.I got it on 18th Dec 2022. When I try to request a replacement I am told the return window is closed.If Amazon / Seller is sending a 15 month old used defective product should they at least not have the responsibility to at least get it replaced.,I have been using ptc heaters for a few years now and have been happy with their performance and longevity(usha & orpat).So decided to buy one more this year - saw this one had the highest rating. Bought it. Saw that its basically made by bajaj.Anyway, its good looking and all seemed fine. But i started noticing a flaw with the thermostat. Normally, there is always a hysteresis in the thermostat dial - it turns on at one point and turns off a little further back. But this one was turning On and OFF at exactly the same point. Then i started observing that if the thermostat was on , it simply remained on. If it was off, it remained off. Tried it multiple times and realised that the thermostat doesnt work. So finally returned it.Overall power consumption is as expected - around 1.4KW at low and 2KW at high.,Good,Very nice product.....,good for a room of small size upto 150 sqft, warms rooms within an hour and takes about 2 for a room of 200 sqft. its really light weight and silent in operation. has different settings for fan speed and hot/cold air. the only drawback is that it wont work for a big room or hall area.  overall a good product .", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41nYaR0z9fL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Morphy-Richards-Aristo-PTC-Heater/dp/B01M265AAK/ref=sr_1_285?qid=1672923606&s=kitchen&sr=1-285"}
{"product_id": "B0B694PXQJ", "product_name": "Gadgetronics Digital Kitchen Weighing Scale & Food Weight Machine for Health, Fitness, Home Baking & Cooking (10 KGs,1 Year Warranty & Batteries Included)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|DigitalKitchenScales", "discounted_price": "₹799", "actual_price": "₹2,999", "discount_percentage": "73%", "rating": "4.5", "rating_count": "63", "about_product": "PRECISE MEASUREMENTS: Built with high precision sensors to quickly deliver accurate results & ensure your healthy recipe is deliciously perfect. Measures in grams/ml(water)/ ml(milk)/lb:oz/fl oz with range 1g-10000g|EASY TARE FUNCTION: Calculate net weight of ingredients by subtracting empty bowl or container weight. Press TARE button to reset scale to zero & weigh while adding ingredients to same container|BATTERY INCLUDED: The scale comes handy with 2 ready to use AAA batteries which gives long battery life of more than 6 months when used twice a day. Features Low battery & Error Indicators|ADDED FEATURES: Clear LCD display screen with large fonts & Auto-Off feature to facilitate power saving. Two separate buttons for unit conversion and On/Off/Tare function", "user_id": "AF67LQRZS6WAY2MDTZEV7V5VKLLQ,AHCI4YNJ5ZX4GMLKZMRA5CVQPRHQ,AH2PQ7GHEBOEWANWP7BA4U6OIJGA,AHKOD27G2AIJP3DK46K55BDZELGQ,AFPQDD3DIPXU6C3Z75XBYUVWTH3Q,AEIIOCCDVYEZSGZVFZSNYZKHM6HA,AG5IEBFXQTBJ4OY2YRIDGM5T53WA,AEG3FM4NNSWVGPQKTOWSUWD5WIRQ", "user_name": "Reena Rodrigues.,Placeholder,Adil,Srinath P.,Gulam,Harish Thakkar,velu,Sanjeev Rawal", "review_id": "RV3NO42W0C95H,R1JQHFJM4G2WI6,R2P9PNOUDS613K,RN3HT9PBUD3NZ,R3JA7B5ISXAC5G,R1KJ8O69J9KEI2,R3FWP3NBL54127,R2KTH8A4IY9ZZQ", "review_title": "Excellent product,Good product, very accurate and sleek design. Totally Recommended,Good product,Accurate with multiple unit setting option,Light weight scale machine ... It's good for me,Good little gadget for kitchen,Good product for house use.,Awesome product", "review_content": "Great product light weight n accuracy as of now good n easy to use.... must have in every kitchen,The product looks exactly same like it's shown in pic, wonderful design and also its accurate. I would highly recommend this product for your kitchen.,Nice product and very easy to use. Thanks to Amazon and Gadgetronics. Go for it.,Accurate with multiple unit setting option,Light weight scale machine ... It's good for me,It's quite small but fairly accurate. I weighed some packets with known weight and it showed correct weight. Very useful addition to my kitchen.,Nice product for home use,Easy to use. Accurate, good.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61Vt5Egqf4L._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Gadgetronics-Weighing-Warranty-Batteries-Included/dp/B0B694PXQJ/ref=sr_1_286?qid=1672923606&s=kitchen&sr=1-286"}
{"product_id": "B00B3VFJY2", "product_name": "HUL Pureit Germkill kit for Advanced 23 L water purifier - 3000 L Capacity, Sand, Multicolour", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterPurifierAccessories", "discounted_price": "₹980", "actual_price": "₹980", "discount_percentage": "0%", "rating": "4.2", "rating_count": "4,740", "about_product": "Compatible only for Pureit Advanced 23L water purifier|Germkill Kit (GKK) Capacity - 3000 Liters|The Germkill Kit (GKK) contains 3 Parts - Microfiber Filter, Germkill Processorᵀᴹ and Carbon Polisherᵀᴹ|Microfiber Filter - Removes visible impurities like dust, dirt, sand, etc.|Germkill Processorᵀᴹ - Uses programmed Germkill technology to remove invisible harmful viruses & bacteria|Carbon Polisherᵀᴹ - Removes chlorine, odor, along with other impurities to purify water and improve its taste|For GKK replacement instructions, refer to the user manual pdf (in Product guides & documents section)", "user_id": "AECK2OJ3MXCQOGMEUQOFE6NDAU5Q,AFRKDBJPRCMNG6TYZHA3WNYGCQHQ,AFMUGZSK3VORG5NDNEGPIP43M64Q,AEPIQC3KWAW7KJEW5ITDNPQRLWOA,AE343V2CIFDUDQORRTJSRI6PXNYQ,AHAPSYB734TV27VGJABANCXUCJXQ,AHZGL7KVNWGGBE7Y6SHNILECWSFA,AERJ6EV2HUDZQHWL2HOFZJYQ4GEA", "user_name": "Amazon Customer,James k Joseph,Shri,Devraj Nikumbh,rupali lakhera,Palash Seth,Venkatram Rao K,Dipika S.", "review_id": "R2ED9VEPT3A38F,R2TW58C4LDA0HB,R2FV708D23KCXU,R1ASXINH1OT6DR,R3E1ULB5JMK8M8,R5HEJW9MXSBSN,R1JLHUKHV02599,R3QWATH0CEY9UB", "review_title": "It's very nice,Got the correct one, asked,Good product,Very good item,Awesome,Good,ok,Delivered on time", "review_content": "Ok,For replacing battery of Purit 23 advanced water purifier. Got what i required.,Good,Very good,I like it,Been using it since 5 years,ok,Nice product", "img_link": "https://m.media-amazon.com/images/I/51G5KRUKOgL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/HUL-Pureit-Germkill-Advanced-Purifier/dp/B00B3VFJY2/ref=sr_1_287?qid=1672923606&s=kitchen&sr=1-287"}
{"product_id": "B08W9BK4MD", "product_name": "Tom & Jerry Folding Laundry Basket for Clothes with Lid & Handle, Toys Organiser, 75 Litre, Green", "category": "Home&Kitchen|HomeStorage&Organization|LaundryOrganization|LaundryBaskets", "discounted_price": "₹351", "actual_price": "₹899", "discount_percentage": "61%", "rating": "3.9", "rating_count": "296", "about_product": "MULTIFUNCTIONAL LAUNDRY BAG - Useful for homes, apartments, bathroom, student's dormitory and hostels. Also help you to store other stuff, such as umbrellas, toys, shoes, etc, Make your room look clean, tidy and save space|Dimension: length (35) cm x width (38) cm x height (55) cm|HIGH QUALITY - Made from non-woven fabric with strong durable stitching, which is environmentally friendly, durable, wear and tear-resistant fabric, anti-wrinkle-free, lightweight|FOLDABLE STORAGE CONTAINERS - This box is foldable for space-saving, easy to set up and convenient to carry. Can be folded when not in use|Package Contents: 1 Tom & Jerry Laundry Basket|REMOVABLE LID - Laundry Box comes with the matching Lid to prevent dust from settling on the stored contents while bringing a decorative look", "user_id": "AEIDEFLG7JQYBGDO37SBXCH7B5KQ,AGWY7U4YUFFWBPLEIZ4YZWS3R6WA,AH3HXCEWLMYQAPX5RIUV3R4ULFHA,AFWDYM3RGZH3ZTQI6VVBUGPWMBWQ,AFOFO2Y527YK7Z6NVB2U2VRO5XCQ,AFR3M7QXD7ISIXY5MTYRP375RPKQ,AGTGOOPKKZKNNZTJPIXAFO7MGBUQ,AF4ZKGB6HT37NGYK4C6VZX44NTOA", "user_name": "asha chatri,Amazon Customer,Mahlaqa,Shashi Gupta,Pavit,Satish Kumar,Lalit Patil,indhu", "review_id": "R2OA6WLUYP9I0P,R2HMQ0VOKWQ62Y,R2HSP5VBSX6NB1,R5R3XSEYG901F,R127MA65JNSOWI,RYSCU07717MB5,REWASLCJXLZ0P,R3LMQYP4S3TZ1D", "review_title": "Good,Product is good bt smell like hell.,Amazing,Good Bag ☺️,Good quality and quick delivery,Worth money,Good and big bag,Good product", "review_content": "Very good product at this price exactly as shown...,Product is good.large storage capacity.the only drawback is that when is opened  it smell like hell.i hv to to sat  them outdoor from my house for 1 day.then they r at least tolerable.otherwise it's very good,https://m.media-amazon.com/images/I/61FXsvTLNnL._SY88.jpg,Better Size & Nice Design,Good quality better than images.Very fast delivery.,The best purchase I ever had made,Product is good and big enough but price and quality can be little bit improved.,I just now received the box! It was exactly the same as in the description! I loved it! I chose this colour because no mosquitos will be attracted with the light color! Awesome product! Worth buying!", "img_link": "https://m.media-amazon.com/images/I/41nfxayjM9L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/PrettyKrafts-Folding-Laundry-Clothes-Organiser/dp/B08W9BK4MD/ref=sr_1_288?qid=1672923606&s=kitchen&sr=1-288"}
{"product_id": "B09X5HD5T1", "product_name": "Ikea Little Loved Corner PRODUKT Milk-frother, Coffee/Tea Frother, Handheld Milk Wand Mixer Frother, Black", "category": "Home&Kitchen|Kitchen&HomeAppliances|Coffee,Tea&Espresso|MilkFrothers", "discounted_price": "₹229", "actual_price": "₹499", "discount_percentage": "54%", "rating": "3.5", "rating_count": "185", "about_product": "Frothes milk up in 15-20 seconds.|Can be used for both cold and hot drink.|Requires 2 AA batteries.|Easy to use and clean. Easy and convenient to operate.", "user_id": "AGXLM7AXU7V4W4OQ3VSKDHE5D3JQ,AGLJPQA3EFCU25WU7YUBUQR7EVAA,AHZNIOL2ID4R7NAEE4BOVV3TOTSQ,AEHQFXO3FHGOI47KAVTBR4CKSEGQ,AHXRHYRPN4MICARR3YECLYRGKMFQ,AFSQYEXGBU5QTKBRQV5367KAVECA,AFROPZ2OZBGFDAOSLXX3RSLV6C5Q,AFSSX5G62IXDDJPIFOQ5CEG6R4VQ", "user_name": "bharath,Naveen manikandan,Garima Katarya,Sadum Yeshwanth,Raynold Mathew,Namrata,Siva pidugu,Consumer", "review_id": "R2DHVCKWVHZBDL,RQZRV02WQM827,R2BSNORS4S8Y5O,R29IBNM5TII6SZ,R38ON0Z6Q9J451,R1R37QKX0HRTS,R2YU28MLKMSTYH,R29Q1VTK27KFLC", "review_title": "Good product,Decent product,nice n powerful but delicate,Good product. It’s a bit difficult to insert cells.,Worked well for a month,Extremely useful,Waste product,Value for money", "review_content": "It’s good and easy to use,The product appears cheap but works alright. As you might know from the product description, there are speed settings. Decent product for this price range.,Its very nice n poweful, but needs proper care n cleanup after every use, also u should keep changing batteries when u see the power low. Been using it for years now, however 1piece lasts for about a year if taken proper care.,The compartment to insert cells should have been a little bigger. It might break while trying to squeeze the cells in.,,This a useful product.. very easy to use and clean. Looks very light but is of good quality.  Froths milk efficiently.. a must buy if you like frothy coffee or milk .,Waste product.don’t buy this by its brand name or by its price.very delicate product.,This is certainly a great product. Saves time as getting a froth in a conventional way, you need to be very patient. Nowadays everyone needs something quick. This served my purpose. Bought 2 extra that I am planning to gift. Thank you.", "img_link": "https://m.media-amazon.com/images/I/21OPu5-M3qL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Ikea-PRODUKT-Milk-frother-Frother-Handheld/dp/B09X5HD5T1/ref=sr_1_289_mod_primary_new?qid=1672923606&s=kitchen&sbo=RZvfv%2F%2FHxDF%2BO5021pAnSA%3D%3D&sr=1-289"}
{"product_id": "B08H6B3G96", "product_name": "Philips EasySpeed Plus Steam Iron GC2147/30-2400W, Quick Heat up with up to 30 g/min steam, 150g steam Boost, Scratch Resistant Ceramic Soleplate, Vertical steam, Drip-Stop", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|SteamIrons", "discounted_price": "₹3,349", "actual_price": "₹3,995", "discount_percentage": "16%", "rating": "4.3", "rating_count": "1,954", "about_product": "Triple Precision Tip and 360 degree swivel cord make ironing strokes comfortable, effortless and quick|Even distribution of steam for quick ironing in less number of strokes, powerful steam kills bacteria and removes odour|Includes: Steam Iron, User Manual, Warranty; Power: 2400 watts|Drip-Stop feature to prevent leakage even at low temperatures|Material Type: Plastic; Size Name: Medium; Color Name: Purple", "user_id": "AENFDXWEAU44PPUHUUVPYH77NQOA,AHESNAO7PLB2VBKKKSFAHWBEA4CA,AE4HN6JZ6ZJYA2ACUAOQIUXSP5FA,AG4ALUK7YMBO2CIH3UPELENCTIYQ,AEIONG3VGVATP3YQSMWU4PZBE3UQ,AGOAPHGD2KXRK3K6SX7ZP3BFF2DA,AH2EUYDH6AHKHEJJLXBYOEWMVDUQ,AGY6ULRZMVHPJJPB2HEISF6GHD4Q", "user_name": "Khush,Vivek Chengappa Kodira,Chenna Rao,NAZIA AHMED,Sankar N,Cma,SANJAY M.,Sandeep Yadav", "review_id": "RYDPEWV9WC0PU,R3L51B7RDHW16V,R100Y29EI0KGW9,R31K3QIMP4B1CU,RR7DW11JUGVUX,R2CUG4B7G56O7U,R2XR0OPWFJK2OG,R1SOHNFLA9IKXL", "review_title": "Go for it,Good steam iron,Plage big size,Good Product and worth Buying,Nice,Easy to use,Good,Going good so far", "review_content": "Writing this review after a month of use.Works absolutely fine, i use it for my tailoring projects. I had a question regarding water dripping bt the company was prompt to send salesman and resolve my queries. Also a tip that I have heard from alot of technician and sounds logical to increase the life of ur machine is to use filter was. Tap water has alot of impurities and gets stuck and reduces the life of iron. I have seen that myself with my other steam iron as it leaves small dust particles on the waterstorage area. So do that will solve leaking issues if u ought to have any,Wanted a heavy steam iron. This works very well. Lots of steam and easily irons out clothes. Very easy on fabrics too so you are able to use the high steam setting to remove out wrinkles on clothes without worrying about the fabric setting too much..,,Easy to Use and All types of Clothes,Nice it's did it's purpose nicely. Happy,,Cup to pour water must have been included,Heat up very quickly, no water dripping, steam is good and don’t stick. I use filter water to keep it clean", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/4145oJH-y0L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/EasySpeed-GC2147-30-Resistant-Soleplate/dp/B08H6B3G96/ref=sr_1_290?qid=1672923606&s=kitchen&sr=1-290"}
{"product_id": "B09N3BFP4M", "product_name": "Bajaj New Shakti Neo Plus 15 Litre 4 Star Rated Storage Water Heater (Geyser) with Multiple Safety System, White", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|StorageWaterHeaters", "discounted_price": "₹5,499", "actual_price": "₹11,500", "discount_percentage": "52%", "rating": "3.9", "rating_count": "959", "about_product": "Suitable for 8 bar pressure withstanding capacity for high rise building|Titanium Armour Technology for longer life of tank|Swirl Flow technolgy for 20% more hot water output|4 Star BEE rating, Pre coated Metal outer body for rust resistance|Unique Weld free joint for rust resistance", "user_id": "AGZRM2RWS4THP5KLEQGH6NRPQTDA,AGP6HZ22S4GEDJXBDIPCABFZKPZQ,AGJWCWD4TCORDXCAWBAEDB5U7RAQ,AFNSWAGDMRM6X72NFEMXXYC7LJQA,AETK27O6JGFTV6NL5CEBS2ZFWP6A,AE5MYFZ4IHAZY7EEV6IIXV7RPLTQ,AGIWVZOMLAEWR65TNHRDLWKLL4OA,AGBI6JFU3QTM476FG362LU6SH3IA", "user_name": "Lokesh Shukla,Srini D,Hari Prasad Reddy,Gajendra,Balbir Singh,Arnab Samanta,Dulam Harish goud,Priy Ranjan", "review_id": "R23G8LLBD9D4H3,R2SU25E3ZH4JEH,RCOH95A6KJB8J,RR11J9T0OGAT7,R3HMJ84LRX3RFE,R1PA4J2DPWMUX4,R1ULQ43S9KU1K1,R2T4O0DRQL3QIP", "review_title": "Ok,A good water heater,Easy to use inverter,Good product,Screw missing,Nice,Gd product from amazon,Good purchase but costly installation", "review_content": "Ok,The product works very well. The support is also good. The product was not delivered with the required water inlet and outlet connecting pipe and 15A 3 Pin electric plug. Had to run around for procuring them. Wish Bajaj packaged this in the product.,I bought this three months back till now no complaints and using with out any issues.,It's taking time to get hot water,The screw required for installation is missing,https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81YXC87RPYL._SY88.jpg,,Product is good but installation charges are high", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31U-ACCgQ1L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Bajaj-New-Shakti-Neo-Storage/dp/B09N3BFP4M/ref=sr_1_291?qid=1672923606&s=kitchen&sr=1-291"}
{"product_id": "B09DSQXCM8", "product_name": "House of Quirk Reusable Sticky Picker Cleaner Easy-Tear Sheets Travel Pet Hair Lint Rollers Brush (10cm Sheet, Set of 3 Rolls, 180 Sheets, 60 Sheets Each roll Lint Roller Remover, Multicolour)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|LintShavers", "discounted_price": "₹299", "actual_price": "₹499", "discount_percentage": "40%", "rating": "3.9", "rating_count": "1,015", "about_product": "Quickly removes lint, dust, dandruff and pet hair from virtually anywhere.|Use on pants, coats, sweaters, dresses, suits, formal wear and more.|Balanced adhesive for effective lint removal without risk of damaging surfaces.|Mini lint roller perfect for travel and common everyday use small enough to fit in a purse or pocket for use on the go with minimal space taken and maximum convenience;|Cleans in seconds, reusable to be sticky all over again, efficient for lint, dust and hair, multi-functional, to keep clothes clean.", "user_id": "AHEE4KV3RGGHWUXGCNXJ4DMKM53A,AGEUYT4DWSJF64CD5VCFHPX2VMGQ,AEBHZXZIBEHNBKLIAYNXWBMDX2ZA,AEFDNKBBMU2WUSR5PXNGKH3RVGZQ,AG5M6CPA43SQPDBTR6UHVIPTRFIQ,AHREJM66P5NGBJ3674WM56ZTHF2A,AE2CMOCWNJRTN53KESNTBUNXV37A,AEDNFIJI2HDWTA4SZPMOVNEHPKOA", "user_name": "ANILKUMAR,Sudeep Jain,siri srujana,Dipankar Paul,Anshula @thebookishlawyer,Amrit Kaur,Mini,shaila", "review_id": "R2XK30UZ0P7UXJ,R3NQKJO364XETX,R1CYYHWHYX2NX1,R3KATRBZJYOAFW,R1GZC1U1UELK8E,RNQ8FWEZB09XX,RYW158D6ZC85D,RHI3BSTRUG006", "review_title": "Good to use,Really good in this price,Lint roller,Adhesive could have been better,I like this,Low effectiveness,Good for those who have pets!,Useful product", "review_content": "Good to use,Really good product in this price as compared to other expensive products. Does it's job properly. Roller doesn't come out if you scroll it properly. Adhesive is good in removing febric lints. Doesn't come with a cover but you can keep the used sheet wrapped till next use. Then you can remove it to get fresh sheet.,Easy and handy.,Works, but adhesive could have been better.,It's exactly as the pictures of the product. The roller works well and does the job. Go for it if you need one. I have pets at Home (cats) and I need to use this everyday.Will definitely re-purchase !!,The roller and the frame is loosely tied and cuts hand every time I use. The whole roller disassembles quickly while in use. The adhesion is not very good and finishes when rolled 2-3 times.,I ordered this because my pet’s hairs always stick on my clothes. This product removes those hairs easily. But in one jeans or shirt, you need at least two sheets and also the roller comes down which make cuts on fingers. So for cleaning, really good but not at all easy to use.,Easy-to-use. Can go for it", "img_link": "https://m.media-amazon.com/images/I/31t6ATbG1jL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/House-Quirk-Reusable-Easy-Tear-Multicolour/dp/B09DSQXCM8/ref=sr_1_292?qid=1672923606&s=kitchen&sr=1-292"}
{"product_id": "B01M69WCZ6", "product_name": "Allin Exporters J66 Ultrasonic Humidifier Cool Mist Air Purifier for Dryness, Cold & Cough Large Capacity for Room, Baby, Plants, Bedroom (2.4 L) (1 Year Warranty)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|Humidifiers", "discounted_price": "₹2,249", "actual_price": "₹3,550", "discount_percentage": "37%", "rating": "4", "rating_count": "3,973", "about_product": "Improve air condition: this cool mist ultrasonic humidifier could prevent dry or chapped skin, stuffy air, flu germs in dry conditions. Humidify the air, breathe easier, and relieve cough and sinus congestion due to colds, allergies, and flu|Essential oil and any other oils are not recommended to use in humidifier as these are made of abs grade plastic to ensure hygienic mist generation that may react with essential oils (like Citrus oils) to diffuse harmful and reactive mist. If you're looking to have humidification and aroma diffuser in one unit, try our range of 2-in-1 ultrasonic diffusers and humidifiers that are made without bpa plastic and are safe to use essential oils and other aroma and maintaining humidity in the interiors|Germproof water tank: covered with antimicrobial coating, the water tank of this humidifier will prevent the growth of mold and mildew and provides clean cool mist Adjustable mist spray and auto shut-off: the mist output can be adjusted at random while the highest mist capacity is 380ml/h. It will be shut off automatically when out of water or at low water level for protection|Long working hour: extra-large 2.4L tank capacity allows 12 hours working time under highest mist mode (up to 24 hours at minimum output setting) after refilling|1 Year Offsite Warranty against manufacturing defects. Visit our service center or send the product via courier. One-way courier charge will be borne by the Customer.", "user_id": "AEJS5FT3PUYMZ27UQBFICD2YXDQA,AFFHWVYKVSRM37YO4YB3Z6IMFLYA,AGJKOP63VWH3PLV46FL33T3AAMZA,AFIXS23I6JWYAYRYKIQN6XQ5DNCA,AFT5MTRDID47T6IFK3WZKMHPL3GQ,AGOFMGGVERIDKNPHMFBODPTPJ5YQ,AE5RKE23GK5T7VQBYKSUCUIHPMIQ,AHH4RVJIROHTEVGRWPYUX2SUHUBQ", "user_name": "Anshuk Pani,Sujit,Neeraj,M Sajan,Gabs,Kishore Bandi,Molly Papachan,Shrinidhi", "review_id": "R3JY7DEIB727Q4,RERB22NNP18BZ,RE6LIDZ65EW5G,R1YO7O7DO2O5U6,R1A6I4INOCGWBG,R1ARO6W0N7HC7F,R1VGL0ZOWEIDPZ,R22OSYPO6IBZ8O", "review_title": "So far so good,Good product.,good quality product and create ultra fine mist.,Can be a Great Product,Super,Works as described though difficult to refill water,good one,Amazing", "review_content": "Apart from it leaving a watermark on table, it's been a good experience.,Good product but one issue i found that the head from where cool mist air comes should be flexible to rotate to any direction. Now suppose you are keeping in table and sitting on chair then all cool mist will go above instead of coming to you.,my sleep quality improved by this product and it gives the feeling of freshness.,Operating Manual inadequately written. The 2nd diagram is not labeled, water filling method not mentioned.Most importantly the cord length is too small, why being so thrifty. Most switch boards are at about 5 ft height. Cord does not support this height. As said can be a great product.,Nice product,The quality of the product is normal.  Very thin plastic. Refilling water is a tricky job as we have to fill it up side down. The instructions are not clear. If the product is tilted a little it behaves differently.  The LED lights are delicate and I think loose as well,its an awesome product ...humidifier helped my baby to sleep better due to nasal congestion ... so relieved as a mother,", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/21Kb8kWuKTL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Allin-Exporters-Ultrasonic-Humidifier-Purifier/dp/B01M69WCZ6/ref=sr_1_293?qid=1672923606&s=kitchen&sr=1-293"}
{"product_id": "B0BM9H2NY9", "product_name": "Multifunctional 2 in 1 Electric Egg Boiling Steamer Egg Frying Pan Egg Boiler Electric Automatic Off with Egg Boiler Machine Non-Stick Electric Egg Frying Pan-Tiger Woods (Multy)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|EggBoilers", "discounted_price": "₹699", "actual_price": "₹1,599", "discount_percentage": "56%", "rating": "4.7", "rating_count": "2,300", "about_product": "Egg Frying Pan", "user_id": "AFZ2YKWX4KR7MWSA6UOMEGGHT32A,AEP6WZ7AR6XDQSBFSQRILJOUWYIA,AHOOA3EKEVKQGQAVQE762YGB5KPQ,AH2CHLPBROIU447VRDW6K6DE5TWA,AH4H7RTFFSOM4T7YUCTXGIKLZEWA,AHPGXSE3AFIV5HHD4Q4C4EY3X2KQ,AEQEH72IPVWNOQYVPL3FMKPMSRBA,AEJALL3TNEOIEEC5G3VCPKZVCEBQ", "user_name": "Nitin G.,Veerasomachary,Roshan,Kunwar Indranshu Singh,suresh,Prerna,Arjun Kr. Sah,Jagadeesan", "review_id": "R2DHTJGY77MOP0,R36IXNHZC037AW,R3GPHUMRV75VWK,R2DO6A5Z7D5XSI,R15XQF7WAO4JPS,R2I9R8AJ9WCXXC,R1Q6IO5RWUTRT8,RF5Y8BO9PDVBD", "review_title": "Amazing! Value for money!,Very easy to use,2 in 1,Good product,Easy to clean,Good product to buy and use,Easy to operate that is simple process,Worth", "review_content": "Worth buying for eggetarians,Working great so far!Value for money!4 stars as wire is very short in length!,I like this product and it is worth for money,Very good item,Value for money,Easy to use,Easy to use and easy to handle,It is awsome product,Good qualility,Good product. It's very nice", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51IE+nI0KGL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Multifunctional-Electric-Automatic-Non-Stick-Pan-Tiger/dp/B0BM9H2NY9/ref=sr_1_294?qid=1672923606&s=kitchen&sr=1-294"}
{"product_id": "B099FDW2ZF", "product_name": "Maharaja Whiteline Nano Carbon Neo, 500 Watts Room Heater (Black, White), Standard (5200100986)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|ElectricHeaters", "discounted_price": "₹1,235", "actual_price": "₹1,499", "discount_percentage": "18%", "rating": "4.1", "rating_count": "203", "about_product": "500 Watt Performance|Superior Carbon Rod Technology ensuring more heating efficiency than conventional Room Heaters|One Rods|Healthy heating due to carbon technology|Low Glare: No discomfort to eyes, creates ambience of warmth and care|Tip over safety switch: Heater turns off automatically if it accidentally falls down or kept on uneven surface|Shock Proof Body", "user_id": "AEKB7MS4WMERS6DHWXCANJ5TPTRA,AGQYWUEUFKLJUS25GTEV25GOXZUQ,AECXYBWM74VM7PE44MKGWPPLUPMA,AHP67WDPXUM5SNLJEWOQWUM2LWLA,AHASFHQCZH73IANLGF6IXB2B3O7Q,AFZOF5V4W33EHJ3VL42U3O52ZIWQ,AGFCF6HSB2SOWHPEQDVQPWF2OSOQ,AF6HB6GYUYNZ4G4FDTQIGQK76WSQ", "user_name": "AV,Amazon Customer,Navneet raj,Vijay Pratap,Farid Kapasi,Vishwa Vijay,YOGENDRA KUMAR,A.M.", "review_id": "R380FB13JOT72K,R2RNY0K3PT2PAU,R2KEZ6LFKH1BOT,RJ1FQK256DKD5,R3TXMZ9OL1L7MI,RI4DLEXTUDQ8,R2SR5699KY8T7X,RY24YLHPCI7XM", "review_title": "A good heater for tiny spaces,Good purchase,Best room heater in budget especially power saving,Handle to carry & a bit high stand would have been better additions to the product.,Nice little room heater.,Metal body with carbon heating element,Needs some care to handle when carry and use,good", "review_content": "The product arrived on time and in good condition.It is not only portable but also convenient as it uses a standard plug that can be plugged into normal 5Amp sockets.I mostly just use it to heat my bathrooms as its a low wattage heater and thus can only work well in tiny spaces.IMPORTANT! If using in bathroom, ensure there is NO water on the floor or spraying on/around it. Just heat the bathroom and then move away the heater before using the bath area!!!!,It's a light weight easy to use product.Perfect for small space.Heats quickly.,Best room heater in budget, especially it uses less power nd gives sufficient heating, even can be used with inverter in places where power cut is a problematic issue.,Not so easy to use or regular movement.,I liked this room heater. It only uses 500 watts and so can be plugged into any 5 amps. It's quite as there is no fan. Adequate for a small room.,It looks good and the feel is metalic. There is line indicator in its back and also there is a switch on its side. Heating feels powerful and there is no breathing issue due to this heater.,It was Very useful in my Himachal tour in January. I have used it whole night in -5 °C, with few care ie ventilation in room and few waters in room.,good", "img_link": "https://m.media-amazon.com/images/I/41XrOa1+-PL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Maharaja-Whiteline-Carbon-Standard-5200100986/dp/B099FDW2ZF/ref=sr_1_292?qid=1672923607&s=kitchen&sr=1-292"}
{"product_id": "B0B935YNR7", "product_name": "KENT Electric Chopper-B for Kitchen 250 Watt | Chop, Mince, Puree, Whisk, 400 ml Capacity | Stainless Steel Double Chopping Blades | Transparent Chopping Bowl | Anti-Skid | One Touch Operation | Black", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MiniFoodProcessors&Choppers", "discounted_price": "₹1,349", "actual_price": "₹2,999", "discount_percentage": "55%", "rating": "3.8", "rating_count": "441", "about_product": "KENT Electric Chopper Black is a smart and efficient kitchen appliance designed to eliminate your chopping/ cooking stress|250W high-performance function ensures perfect results every time|It features sharp and high-quality stainless steel double blades for quick operation|Includes 400ml transparent bowl, plastic whisking attachment, and long power cords for maximum convenience|The bowl has anti-skid ring at the bottom to ensure stable operation|It chops veggies into fine, coarse, or medium texture and whisks cream in seconds|Operates with single press button to ensure maximum ease|KENT Electric Chopper Black 1-year warranty on the product for your peace of mind", "user_id": "AEUXMKJNJJBXOKFC3FADQRG2OIMQ,AH4XLMFRDKQPGZUWFZPCO5CLNVWQ,AEFCRF3XKSLRNEZ35P6P4SCLGIPA,AGAQWV5XLA3XNG4ZUSPCAKWDKK7A,AHFQD5KRJY7BD46B7QVH6J632T7Q,AFVYO2JECMG7CWP5JCMNWSIU5B3Q,AHVBDKH2WQYS37WL25RFWGDSLLDQ,AE5FLXF7GOUMGRXJNSX6UBK4SVNA", "user_name": "Amazon Customer,Anurag Singh,SS BATRA,SWATI B.,Anil,M S P,Reena Rawat,Subhendu D.", "review_id": "R131UUX5RGGPM6,R1QT715X5TOYH0,R3GOHZPUGY57VL,R2X5IYZIUB4MVE,R964KPPOLNHFJ,R2X77NBYOU06B5,RDRCHM3EVHLZP,R1QKKV15C79IXH", "review_title": "Helpful for my mother,Do Not Buy this product,Very cute solid and comfortable 👌,Very efficient,Not operational product dispatched Also u cant cancel the order, received replacement working ok,Bottom bowl is low quality plastic & not as per in the picture,Overall good product,Good material product.", "review_content": "Nice machine for adults at home .. who need small appliance which can do work in jiffy.,,Easy to use,Double blade option works fantastic... Body is sturdy... Chops stuff super fast and super fine...,Very poor qualityNew product refuse to operate,The bottom bowl was not so good enough,Heavy in weight,Good product.", "img_link": "https://m.media-amazon.com/images/I/41VM+D8AGWL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/KENT-Chopper-B-Stainless-Transparent-Anti-Skid/dp/B0B935YNR7/ref=sr_1_293?qid=1672923607&s=kitchen&sr=1-293"}
{"product_id": "B07JGCGNDG", "product_name": "Crompton Amica 15-L 5 Star Rated Storage Water Heater (Geyser) with Free Installation (White)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|StorageWaterHeaters", "discounted_price": "₹6,800", "actual_price": "₹11,500", "discount_percentage": "41%", "rating": "4.1", "rating_count": "10,308", "about_product": "PRODUCT: Crompton's energy efficient storage water heater with fast heating|TECHNICAL SPECIFICATIONS: Wattage: 2000 W; Capacity: 15L; Star Rating 5; Pressure 8 bar|3 LEVEL SAFETY: Capillary Thermostat, automatic thermal cut-out & multi-functional valve to provide higher safety|ANTI-RUST: Fitted with specially designed magnesium anode which prevents corrosion due to hard water quality|QUALITY COMPONENTS: ISI marked nickel coated special element to provide resistance against scale formation", "user_id": "AHVHHPNIDA6XPCW2ODA2IHXUHZYA,AF2IWKFSVGHOYJKFBTMNDELPVFVQ,AGB7UMNSKR6R3WD2NM5KY7S6W57A,AEOULYDSLLD2FVDNR7WTWLQFRG7Q,AEW2QMVUPCPVEBXBZXT6GXJ7T4CA,AHTIXIDXG2UN6WNFRRMQ3VLNU2EA,AGI7FLR5BUYXHCEJCWGQPYKFSWXQ,AFI5ILRQ2722AXN6DPUEV63DSY6A", "user_name": "Aryan Raj Singh,Akash Saini,Shalini Rani,Sayan Roy,vivek vishwakarma,NITIN,Mahesh singh,krishnareddy", "review_id": "R1Q8U0KHBE4RAJ,R3M5X5REVHJUFI,R2G64QBZXNF1G2,R7HQDX5RMXVNS,R3J3KGQAFR06WR,RXZ2UHPZ7431G,R1OF1W4L7V2MFV,R37WO2GKN6E3Q9", "review_title": "Good product st this price,Good Product,Good product,Awesome product,Pipe is not there it's mentioned that pipe is with this order,Easy to install,best price.,Good,Good product", "review_content": "As always amazon never disappointes if you are finding best quality product st low price go for it.,https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51-YaFM4jHL._SY88.jpg,I like the product.it’s too cheap on Amazon,Good product,Where is pipes ????? It's with gyser as described,Product is good and price is best but it takes half an hour to fully heat 25 litre of water.,Ok,Good product", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31RWtNDo6EL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Crompton-Greaves-ASWH-2015-15-Litre-Storage/dp/B07JGCGNDG/ref=sr_1_294_mod_primary_new?qid=1672923607&s=kitchen&sbo=RZvfv%2F%2FHxDF%2BO5021pAnSA%3D%3D&sr=1-294"}
{"product_id": "B08L12N5H1", "product_name": "Eureka Forbes car Vac 100 Watts Powerful Suction Vacuum Cleaner with Washable HEPA Filter, 3 Accessories,Compact,Light Weight & Easy to use (Black and Red)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Vacuums&FloorCare|Vacuums|HandheldVacuums", "discounted_price": "₹2,099", "actual_price": "₹2,499", "discount_percentage": "16%", "rating": "|", "rating_count": "992", "about_product": "No Installation is provided for this product|100 Watts Powerful Motor|Powerful Suction|In-Built LED Torch|Range of accessories for different cleaning needs|Fit type: Universal Fit", "user_id": "AGTDSNT2FKVYEPDPXAA673AIS44A,AER2XFSWNN4LAUCJ55IY5SOMF7WA,AE3MSW6H3AL6F3ZGR5LCN5AHJO6A,AG5OL5WIIPJBY25HISJLM5K2UBTQ,AGHFSIBYVYXUGSNYUDAHBGOIZ3KQ,AHYH6AZT3U3U44CDW5Y563UYIIUA,AFLOAOURRZZZGFBF7F6IKGXRB6NQ,AGNWBYEVAIII4MPQNKN3LFVOHYZQ", "user_name": "Divya,Dr Nefario,Deekshith,Preeti,Prasanth R,Pradeep kashiram Tetgure.,Abhijin Janardhan,Prashant", "review_id": "R2KKTKM4M9RDVJ,R1O692MZOBTE79,R2WRSEWL56SOS4,R3VZRQJOKCBSH4,R2QI4626ASSCIT,R1TFFJ5ON6ATEO,R14JK9VQCXXEKU,R1V4J4B7RXHG8T", "review_title": "Decent product,doesn't pick up sand,Ok ok,Must Buy,Good one for basic use with normal suction power,Super,First review,Perfect product for my car", "review_content": "Does the job well,doesn't work on sand. though the suction is very good, the sand stays back no matter which lead you use.,Ok ok,Easy to use product (I used it for the first time without knowing the know-how of its use). Cleans almost 90% of your mess inside the car. Highly recommended.,Pros: look and feel, easy to hold and handle, Cord length, useful led light during night, normal suction power but good enough for general useCons: noise is bit loud, suction power could be better,Good,Hmm,Strudy design, quality accessories,reputated brand.I have seen some car vaccum cleaners especially the low cost one's where dust comes out of machine due to poor locking mechanism, so ofcourse you don't want the dust to be falling back when the sole purpose is to remove it!!!You get what you pay for, I have home vaccum clear from same company with has a good suction and does the job well, I wanted a battery pluggable clearner where I can use it anywhere.Believe me no vaccum cleaner is good enough for heavily soiled cars, so if you are expecting a commercial level cleaning the don't buy any.Car vaccum cleaner is a portable device which gives decent satisfaction but not a perfect, I have seen some people who do not take out mats and just shove the cleaner in it and say it's not good.Mats need to be take out which actually collects big dust and derbies, this poor small machine can't handle a 100% cleaning on that.If the car is heavily soiled the you must get it cleaned at a professional clearner then start using the small one.I found this to be doing the job when compared to my house vaccum clearner.One thing I observed was the wires was getting hot and has a soft component which makes it even thinner when it's hit but I think I can handle the job, accessories quality is good and fir and finishe is good.I did not seen any dust seeping through the compartment and it was well contained in the dust chamber.Suction is decent and you can give almost a clean and tidy look to your car with this machine, again a professional grade cleaners can doa good job which cost nothing less tha 15K.I would say worth a buy it used delligently by not expecting too much.I only hope if the company can provide a bag to carry it for the price or find one in your own which can fit your needs.,Perfect", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41lZEy8e9DL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Eureka-Forbes-Vacuum-Cleaner-Washable/dp/B08L12N5H1/ref=sr_1_295?qid=1672923607&s=kitchen&sr=1-295"}
{"product_id": "B07GWTWFS2", "product_name": "KENT 16025 Sandwich Grill 700W | Non-Toxic Ceramic Coating | Automatic Temperature Cut-off with LED Indicator | Adjustable Height Control, Metallic Silver, Standard", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|SandwichMakers", "discounted_price": "₹1,699", "actual_price": "₹1,975", "discount_percentage": "14%", "rating": "4.1", "rating_count": "4,716", "about_product": "Compact and sleek looking modern appliance, KENT Sandwich Grill is perfect for a healthy and tasty quick snack|It is multi-functional and helps you grill, toast, roast and even make multi-layered sandwiches with great ease|The appliance has non-toxic ceramic coating that uses less oil or butter and ensures easy flipping as nothing sticks to the surface|The ceramic coating also makes the grill easy to clean|With its ergonomic handle, you donâ€t have to concern about the safety|KENT Sandwich Grillâ€s adjustable height lets you easily cook various sizes of snacks|The automatic temperature cut-off turns off the appliance once your dish is cooked", "user_id": "AEY6PEMQ7DII44WSUSC67JEWDE3A,AFMVVM2AXA3WHTC23D2ZQH4YUTZA,AEQGRU6X2E3PF6OHP7HL7ZVTHOTQ,AEB4KX3FFG2DE2Q5CNKYTOWP5CBQ,AEASTV5BKJJIYW6WVS6JUBSK4MHA,AHQ7UT4SYDQMQB6DJDBVVHQBCXXA,AEZFDGHBWLHUXOLDPVNS3UERDNSQ,AFPMGJN4SHWHD3DBQBS2FXGBZ6TA", "user_name": "Tabassum,Ark,AMIT GROVER,-,deshraj s.,Ankisha Mishra,NITIN,Jai goyal", "review_id": "RXPUKJKEHY256,R1DXJ48GMFWOZD,R24RXWIR7PL4IW,R12KBR8IKSS7J2,R1MJZTN0DNDU71,RMUCAZHGYK1RB,R2KJM0QA35OC7I,R1UYOQA2722J9E", "review_title": "Only for grill sandwich use cord length is too shorthort,Decent product, has some old flaws,Good 👍,Every home should have this,Weak body material,but overall good product,Good one with a small issue.,Trusted brand,Nice product but cord length had to be replaced..very short", "review_content": "Good quality but cord is too short .it is ok for sandwiches.,Value for money product, does what it promises. Ceramic coating.Peoduct designers did not make a single sandwich with this. Product usage images and actual usage does not match. The hinge mechanism is flawed and will result in flat sandwiches. If you force the hinge/ clip to shut, it may just break.Poor product design in 2022.,Good Toster and easy to clean,Superb product. Every home should have this product. Especially if you have aged parents, not feeling well. Cooking difficult. Can eat something. Even aged persons/ parents can use it and start their day having a breakfast on time, morning. Evening snack, etc auto power cutoff feature is the greatest attraction, and easy cleaning. Built quality is superb. Most busy persons skip breakfast, you dont have to skip it if you have this product, and a pack of bread, and if there are some vegetables, luxury breakfast with this product,You can make big to small sandwich without any problem,at a time 2 sandwich...but be careful body is weak ,possibility of damage is more.,Pros-1. Ceramic coating & non-toxic.2. Can make 2 jumbo sandwiches at once.3. Takes only 3-4 minutes.Cons-1. Had to manually close it as the height adjuster is small.,The brand vakue is justified. The Product is good , easy to handle,Go ahead and buy, if ubr looking for a trusted griller,Likes the product but cord length is short..had to replace it", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41mtYvY3VdS._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Kent-16025-700-Watt-Sandwich-Grill/dp/B07GWTWFS2/ref=sr_1_296?qid=1672923607&s=kitchen&sr=1-296"}
{"product_id": "B09KRHXTLN", "product_name": "Candes Gloster All in One Silent Blower Fan Room Heater Ideal for Small and Medium Area, 2000 Watts (White)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|FanHeaters", "discounted_price": "₹1,069", "actual_price": "₹1,699", "discount_percentage": "37%", "rating": "3.9", "rating_count": "313", "about_product": "Motor : Powerful Motor for Quick Heating|Heat Setting : 2 Heat Setting 1000/2000 W|Warranty: 1 year limited warranty. For warranty claim|Over Heat Protection|Handle for Easy Portability|Heat Resistant Body and Stand for Stability|Hot Air Outlet and Safety Grills", "user_id": "AGDD5ACY3AGTMTVBQOC3DMUR6REA,AFHT3WYWI4DB6Z42VVJZQGFFNIZA,AFSHYGNQHXNKBEXS62GRETNGH3GQ,AEZVJENT2FC3K3MKMIB4ZXDWNDPA,AHUKNKB6OS7JE4VQCHKF5363DOKA,AEIETT5YH6XRP434INQB4KSDMI4Q,AG7Y3XXKXV7O63XWG4Q7FKGNR6LA,AFZCNPDZYVYZCJ2JE5AH4SKJ7WQQ", "user_name": "ASIF ANSARI,Amazon Customer,Shashank,p k kishen pejathaya,Rohit,Deepak Sarkar,sudhananda,Rahul sharma", "review_id": "R2H4C76KXFUF5N,R2X2MGZJI8JOV5,R2PHMY74SQMCM4,R2EOV466KP2TSZ,R3HO5I93IRXGK4,R1IKS35P0F8TAJ,R3GCXN4RSB3T4Z,R3GM1KFHUQJ886", "review_title": "Good product,Value for money,Auto cut is not working properly and fan continues even after auto cut...,Room heater,Worth of money,Budget friendly,Best room heater,Not satisfied with the product", "review_content": "Good product but price 800-900 ok it's product good,Easy to use, Very Handy.,Auto cut  continue starts fan...which lower down the temp.,I liked the swivelling action to spread the heat,Beat product,,Best room heater.thank you,I received the broken article but there is no replacement service for this product", "img_link": "https://m.media-amazon.com/images/I/41IJvfYMaZL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Candes-Gloster-Silent-Blower-Heater/dp/B09KRHXTLN/ref=sr_1_297?qid=1672923607&s=kitchen&sr=1-297"}
{"product_id": "B09H34V36W", "product_name": "Inalsa Electric Fan Heater Hotty - 2000 Watts Variable Temperature Control Cool/Warm/Hot Air Selector | Over Heat Protection | ISI Certification, White", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|FanHeaters", "discounted_price": "₹1,349", "actual_price": "₹2,495", "discount_percentage": "46%", "rating": "3.8", "rating_count": "166", "about_product": "Powerful 2400 RPM copper winded motor for quick heating and can be used vertically or horizontally.|Cool, Warm or Hot Air selection knob for heat setting (Please note that regulator changes heating power & not fan speed)|Variable Temperature Control for setting Room Temperature as desired.|Plastic body with rust resistant metal front grill.|Built-in overheat Safety protection.|Lightweight with Carry Handle for easy portability.|Do not worry if you experience some burning smell when you run your room heater for the 1st time. This is due to the motor varnish getting heated for the 1st time. The problem should not recur in subsequent usage. If it does, please contact our Customer support|Caution - Always use the product with 16A socket. Using it on lower rating sockets may result in melting of socket or the plug. This Consumes 2 KW when operated on high heat setting.", "user_id": "AF7PPF6P5ZASHL4RYP7AZQBHRRTQ,AHSCASHEA5LLVORCEIHZYHNTHUMA,AEKWTFXLMJ5IK4T2CSJT2AY2CGYA,AHDL7PIYXZ36YFNS7NBPEFD3WRUQ,AGFYVS63J2YEAO7NGQCRW3TTFB3Q,AE6VPREPQCXMNBLLF3SDM4ZWRSLA,AG35AFPFHGMNYSEFQYN6USFG3FJQ,AH7JGQRRWMJTCWMZPQZDA7324DUA", "user_name": "Alok Vajpayee,Amazon Customer,Pilot Muhammed M Khan,pradeep Verma,RNMISHRA,Takshak Tathagat,Amazon Customer,Anamika Nagpal", "review_id": "R1QHY0304RCZS6,RV3GIBR7FUXWH,R3M83QIXOQMO9J,R227LWX8C4MTYQ,R1B938V5HN71BQ,R2K9QFBTB6FYEF,R2K0ND1WP31RYH,R35YG940TYIGK5", "review_title": "Worth Buying,Very good,Good and sturdy room heater with compact design.,Inalsa Hotty Heater,Good for winter,Don't buy it go for Amazon brand,Package,Decent", "review_content": "Heater is good for regular sized room, might not work on bigger room or hall but for regular sized room it's heavenly,Like very much.,The hotty model produced by inalsa is sturdy and compact in design easy to handle good quality of cable and fast heating ability with auto cut out system. I had received this product with crack inlet air net however it replaced with new one by inalsa and amazone at ease. It would be added advantage if air deflector be facilitated in this with good quality of indication light. All and all good quality product in this price range,This hotel heater is very light weighted and compact in design, it has a fast heating ability and comes with auto cut out system, its good for a medium size room the blower keeps your room warm for great amount of period, the price is also reasonable overall a great product by Inalsa.,Must have in cold season for small room,Don't buy it go for Amazon brand. No value for money.,Package is damaged but product is in good condition,Reasonable performance for the price", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/411uVIJr+QL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Inalsa-Electric-Heater-Hotty-Certification/dp/B09H34V36W/ref=sr_1_298_mod_primary_new?qid=1672923607&s=kitchen&sbo=RZvfv%2F%2FHxDF%2BO5021pAnSA%3D%3D&sr=1-298"}
{"product_id": "B09J2QCKKM", "product_name": "Havells Zella Flap Auto Immersion Rod 1500 Watts", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|ImmersionRods", "discounted_price": "₹1,499", "actual_price": "₹3,500", "discount_percentage": "57%", "rating": "4.1", "rating_count": "303", "about_product": "India’s 1st Immersion WH with auto cut off & Temperature setting Knob (Low, Medium & High)|Its smart dual purpose collapsible flap works as a cover as well as a hanger when completely open|Heating Indicator; Heavy duty 3 Pin molded plug|Efficient heat transfer heating element; Nickel plating heating element|Touch protection cover; Elegant & sturdy safe bucket hanger", "user_id": "AG2VWPTTUEHEZWGDIYDJWPX7IDJQ,AEDNFNVOPMOWPCSBXQJFW6PCP3ZQ,AHJQJ4BFKEDVWHP6FIXGMF75XSSA,AENPKYWO4NMYRYNE3PNVGD4CVOAA,AEZOCEHWCXQRBNLIQCNEC43TNMGQ,AFGGQUIZ4KW57HMRGQTSERDLCFEA,AHQ5BOJJTHUA6XD6IIN7GLN53DVA,AHPM47CWRZDB6XMDV2IVXQR3KDUQ", "user_name": "Jignesh malvi,Garry,sonu,Amazon Customer,SANJAY PATEL,SANJIV KUMAR,Md Nafis Ansari,Subhash kushwaha", "review_id": "R2PDTLV982BZ70,R2DG09GG88T9WZ,R2FI87586PEKJ8,R3BT931YPQDPLF,R2609G1V725LV1,R29G2BHEEMZ8TK,R12M631S82DWX9,R3HBBWJEZQNBH4", "review_title": "product good but service bad unexpected,Its good,Very nice product,Efficient Product,Nice,Very good and useful product as expected before buy.,Handle length is too good you can use whole dram,Very fast heating", "review_content": "no doubt product is good but after 2 month product auto power cut funtion not working so try to claim warrenty but havells said talk to amazon and amazon said talk to havells both the comany raise our hand. by the way product gave 2 year warrenty but they gave me only excusses. very bad experiences with havells. never expected,Its good the ony pro and cons can be the flap ..Pros us can say is that the flap can be used for wider bucket of water for heating Cons u can say is the again the flaps bcoz while not in use flaps must be closed and you can't hang the heater anywhere bcoz there is no option given . Flaps can cause issue bcoz it have to be kept on the ground while not in use ..Rest all is good . Auto cut feature is best,Cord length is shortEnergy efficiency good &Temperature control too good,I realt like the design and auto shutoff features of the product. But there's is also design flaw that you can't insert it into the half filled bucket and water should be full.,Awesome,Very good product,,Energy efficiency is ok not good", "img_link": "https://m.media-amazon.com/images/I/21TQo2rZRbL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Havells-Zella-Immersion-Watts-White/dp/B09J2QCKKM/ref=sr_1_299?qid=1672923607&s=kitchen&sr=1-299"}
{"product_id": "B09XRBJ94N", "product_name": "iBELL SM1301 3-in-1 Sandwich Maker with Detachable Plates for Toast / Waffle / Grill , 750 Watt (Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|SandwichMakers", "discounted_price": "₹2,092", "actual_price": "₹4,600", "discount_percentage": "55%", "rating": "4.3", "rating_count": "562", "about_product": "MULTIPURPOSE: Different Sandwich Plates for Toast / Grill / Waffle plates to make the snack of your choice|Detachable Non-Stick Plates are easy to clean and maintain|Thermostatically controlled Heating Element | Auto shut off function|Grip handle | Elegant black finish body|Power : 750W | Voltage: 220V-240V;|Warranty: 1 Year Standard Warranty + 1 Year Additional Warranty on FREE Registration", "user_id": "AFIO2JLNOU6SSNCHMG2ZED34SVNQ,AFKJ6IC227YNTE5PYNVT4YBPT2SA,AFV3HKJKN55O6CQNAAIYSAPMCPXA,AGW3GPXDCYJJB5FMX6SOXTO7PKPQ,AEYJQQMMMEZZQ2D7WGG2KJG7EUJA,AF67RC7KNNJB3EMMFB5RSJ73N7SQ,AE6DZEFBVJYVMURYFDATZFAANXJA,AF34LKGQ5JFWGMS3TVAZMUKQCO4A", "user_name": "Srishty,Somesh Bandopadhyay,sowjanya,pritamsharma,Jaseyfiroz,Basanth Balram,Prem,Ritesh Mehta", "review_id": "R2P85TVQQPR3XX,R3IGUN8ESO1GE5,RAO29VFIR7Y20,R21E4GVF798QBC,R2600ZN2HS1KVZ,R44ZNSYWMMKWH,R5E0YEMP9TLPD,R11PAFU64U5LGV", "review_title": "Nice Product,Three options (toaster/grill/waffle maker) are  neatly packed into this readily usable device.,Product arrived in under 24 hrs...yet to test it,Good Quality,Very nice,Don't know why I waited so long to get this!,Value for money,Good quality, could have been somewhat lower in price", "review_content": "Overall nice poduct just one problem is that is the cord length only rest awesome. Easy to clean and easy to handle.,We used this for sandwich making and it performed well. The plates for grill and waffle making are readily interchangeable. The cord length is adequate although slightly longer cord would have been great.The device is readily portable because of its size and weight. Overall very useful.!,https://m.media-amazon.com/images/I/71cciIOHxUL._SY88.jpg,The quality of product is good,Used a couple of times .....and sandwitch came good,I wanted a sandwich maker and refused to buy one from a store since it was all 2k-4k and didn't have half the features that i was looking for. Saw this and love iBell as an upcoming Indian brand (own an electrical sander too), so didn't think twice and got this. Don't regret it one bit!! Pros are the 3 interchangeable plates for different ourposes. Grill one is just fantastic to hear all kinds of sandwiches and rolls and other food. All the plates are easily removable and washable too. Only con that i saw to this was the latch wasn't properly latching while making a heavily loaded sandwich in the sandwich maker. Otherwise it's a top of the range product in comparison with other big brands!,All the 3 functionalities works pretty well. Only thing is it should have had auto switch off feature. Nevertheless it is a very good product and worth the money. Sandwich also gets made fast.,I ordered vguard removable plates sandwich maker, but it came in faulty. The plates eject button had an issue. Later I ordered this one as was recommended by someone I know. It's of good quality, only that could have been somewhat lower price", "img_link": "https://m.media-amazon.com/images/I/41iHB-nmy8L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SM1301-Sandwich-Detachable-Plates-Waffle/dp/B09XRBJ94N/ref=sr_1_300?qid=1672923607&s=kitchen&sr=1-300"}
{"product_id": "B07SLNG3LW", "product_name": "Inalsa Vacuum Cleaner Wet and Dry Micro WD10 with 3in1 Multifunction Wet/Dry/Blowing| 14KPA Suction and Impact Resistant Polymer Tank,(Yellow/Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Vacuums&FloorCare|Vacuums|Wet-DryVacuums", "discounted_price": "₹3,859", "actual_price": "₹10,295", "discount_percentage": "63%", "rating": "3.9", "rating_count": "8,095", "about_product": "Wet or dry, bagged or bagless - No matter it is dust, hair, daily waste, the device can clean the dirt perfectly. You don't need to change filter during operation. Please take out the cloth dust filter and use sponge filter when sucking liquid|Blower function- The blower function is suitable for drying and cleaning of narrow and hard- to-reach indoor or outdoor areas. For effective blowing results, do not use any filter in vacuum cleaner. To hold a large amount of waste, this vacuum cleaner boasts a container capacity of 10 litres|Powerful and durable – Equipped with powerful motor delivers 14KPA strong suction power and ensures long time operation. The vacuum cleaner has an impact resistant polymer tank for longer usage life|Safe buoy technology – Safe Buoy technology immediately stops sucking water when the liquid capacity reaches the critical point. This protects the machine from being damaged and guarantees superior lifetime. This device ensures low-noise operation|Flexible and convenient - With ergonomically carry handle, along with four 360° rotating wheels enable it to move flexibly to anywhere you need. Its compact and lightweight is easy to store without occupying much space", "user_id": "AE6YWSEP7SYHCL2F5WLM3JLAPTDA,AGMOSQZYENCGDYQFYZG76EYEMCGA,AF33L2INL2ERR46KPNMQ6R5BRYXQ,AG247WO5BV4INTTCQ3H35SSEPVJQ,AER4JBQGMSVBHQGHMB6GOMU3BS3A,AGTJV66YYDYUYNBXEY2LCR7M5O5A,AHJDJPODT66LJAPROAV3ENMD4PLA,AGL5JWV3DFJIR6T23UKXMUS7BQTA", "user_name": "Sunny Senpai,Prashant,chetna,Surendran,Harisha,Raju Gupta,Shabazuddin,Defence aspirant", "review_id": "RPH459PHQQOP4,R17ZRY0K8T3ZVJ,R1UCB8TXKZ7JE0,R1YM20O66MTQUR,R1R7T8TNV9C1DX,R3OCX18B6XDQ39,RRIN800K9UFKC,R8EDW68GK5IJK", "review_title": "Great value,Very Nice product,Very good product at reasonable price,Nice Product. Cost efficient,Value for money,good product for the price,very powerfull motor best product i like it,Good product", "review_content": "Bought this almost a month ago, so far it works well. Suction power is above average. Blower feature is a nice addition. Only con is it's a bit loud.,Very nice product.....really amazing,It's very sturdy, wheels are very good so u can take it wherever you want. Electric cable is long.,Deserves the purpose.,Just value for money,good for domestic use,very powerfull motor best product i like it,The product is good honestly i have tested it for cleaning the dry dirt. And in that this works great.Good long power chord and nice attachments that gives the cleaning abmngle a better approach.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/414PLTPvJBL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Inalsa-Micro-WD10-1000W-Multifunction-Resistant/dp/B07SLNG3LW/ref=sr_1_301?qid=1672923607&s=kitchen&sr=1-301"}
{"product_id": "B0BNDGL26T", "product_name": "MR. BRAND Portable USB Juicer Electric USB Juice Maker Mixer Bottle Blender Grinder Mixer,6 Blades Rechargeable Bottle with (Multi color) (MULTI MIXER 6 BLED)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|JuicerMixerGrinders", "discounted_price": "₹499", "actual_price": "₹2,199", "discount_percentage": "77%", "rating": "2.8", "rating_count": "109", "about_product": "Portable & Convenient to Charge: This little body light weight design is easy for you carry it to school, office, parks, camping, anywhere you want to. and it also convenient for charge by power bank, laptop, computer, car or other usb devices.|Easy and Safe Cleaning - It has have smart safety protection device, magnetic sensing switch ultra safe to use and clean, the juicer cup's body and bottom can be separated, you can easy to clean it|Multi-function - With our juice blender mixing kinds of fruit and vegetables, you can make natural tasty juice, milkshake, smoothie and other baby food. It's very portable and great for traveling, outdoor.|Enjoy your fruit juice anytime and anywhere.|6 stainless steel blades, sharp and durable, can last for long time.", "user_id": "AEJKHGA26MUVUZIYWZOW4B6I4X7Q,AF3B47EOSBULYG63EGZZZGO6HTNA,AGNSXRFJBDVGM7FS7YYPNCEO7XFQ,AHR53IW5LAAXGGFK3DRWRMXMM7KQ,AE5W6S5KCJV6L2WMBIOKYWQJN37Q,AH5J4DROVHI6XHMTCBAK7WWU3F4Q,AE5KAK3S3XZDPRUR2VCND2QNZTUQ,AEKG7ELYA43YNPZ2YT3ORIL2VSOA", "user_name": "Yashvant Gote,Nargis Sultana,S.I.KUMAR,Ravi,Lokesh Hegde,Abhinav Anand,Any babar,Sarada peram", "review_id": "RGB7OLWZEBW2D,R35V1I6KBBWDA1,R2S9K0UTNSD0L6,R3RC91ZJN8FXRE,RHM5Q098AI06R,R2QOHI14M69TVA,R2PQH5L3O1O0F4,R3TYY0655P2RMO", "review_title": "Portable but not much powerful,not so good. power back up is very poor.its more like a toy for my 9 years old girl.,500 rs ok,Don't be fooled by ratings, not a good product,Not recommended,Worst Battery, no use,It is affordable .,User friendly blender, Recommended to buy nice products", "review_content": "Not sufficient power,the product is more like a toy for kids. can't use  it as a proper juicer. power back up is very poor.,Ok,I had to replace this product first time because it was leaking and now after replacement the new one has no battery backup and vibrates too much.The MRP is above 2000 rupees which is not at all justfied by the product.After buying the product I found that with the product they are giving a cashback offer of 25 to 100 rs if you give 5 star review, probably that's why it has good ratings. I feel I was fooled by the ratings.,Waste product as the juicer is leaking which creates the whole place mess and the juicer doesn't grind properly where the pieces of fruits remain ungrinded. I generally dont write reviews but i was forced to write this one as this is just waste of moneySpend it wisely for something better,It's does not work properly at all, after charging for 4 hours the battery last only 30 - 45 sec. Very bad product.And they have given a cashback coupon to attract good rating.Misleading information is given on the detail page.,I bought this mostly for milk shake and it does an amazing job and it is affordable but it didn't worked while charging,User friendly blender, very useful for the pg accommodaters. I am using this to make a protein shake from day one when I was received from Amazon.", "img_link": "https://m.media-amazon.com/images/I/51pFS9lDzML._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/MR-BRAND-Portable-Electric-Rechargeable/dp/B0BNDGL26T/ref=sr_1_302?qid=1672923607&s=kitchen&sr=1-302"}
{"product_id": "B095PWLLY6", "product_name": "Crompton Hill Briz Deco 1200mm (48 inch) High Speed Designer Ceiling Fan (Smoked Brown)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|Fans|CeilingFans", "discounted_price": "₹1,804", "actual_price": "₹2,380", "discount_percentage": "24%", "rating": "4", "rating_count": "15,382", "about_product": "PRODUCT: Crompton's premium design ceiling fan with a strong cooling effect TECHNICAL SPECIFICATIONS: Sweep Size 1200 mm; Speed 380 RPM; Air Delivery 210 CMM; Input Power 70W|SUPERIOR COMPONENTS: 100% copper motor, double ball bearings and dynamically balanced blades|RUST FREE: Powder coated aluminium blades offer life long corrosion resistance|PACKAGE CONTENTS: 1 Ceiling Fan, 1 Motor, Set of Blades, Set of 2 Canopy, 1 Down Rod, 1 Shackle assembly, Instructions Manual and Warranty Card|Collection Name: Crompton Hill Briz Deco Designer Ceiling Fan; Finish Type: Painted; Mounting Type: Downrod Mount", "user_id": "AEKMKQMXK2FBIL6MRKHIPN56QJAQ,AGPNJEK2EUJ6YFFPND6OSSAVG5WA,AHY5LCCPN4ZSDFIFF3JUXP2YS4TQ,AG5TXXR5HQ3GX2KC5IHGIAEZXEPA,AH7GMEHVW44SQG6NRGTTTK4EQPOA,AEOCUF6Q6MJC37C4Z5LQT3RUWV5A,AHASKB67VHNUNB3RITEIHSC2YNMQ,AGEYV75NXF3MUJH7XB456WFUK2GA", "user_name": "David,Pujeshwar Sharma,Abhishek,U can buy,Ravinder singh,Gururaj B.,suresh,Jaswalshashi", "review_id": "R4F2HUXYO2V7U,R26UCI4JLBHQQA,RQH9Q1TBCSHWW,RLNUKMIVTZF3D,R3L9VSEBHFY0CO,R3RD12MBAHBOGJ,R3JX5CDKU775U,R1UOXH0VDEH21G", "review_title": "Good Fan for this Price,Good fan with high speed,A decent product for the price.,Good,Good in price,Very happy with Amazon,Good,Good", "review_content": "It doesn't make any noise. Speed okay for this price range. Light weight. I don't face' any issues in this fan. Over are good.,Good fan from Crompton,Fan was well built and value for money. The noise at the top speed is kinda loud. (can't complain with this price.),Speed control not working,Good,Nice product 👍,Good , while running time slightly shaking . We don't no why .. but it's fixed properly,Good", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31uAkMaOShS._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Crompton-1200mm-Designer-Ceiling-Smoked/dp/B095PWLLY6/ref=sr_1_303?qid=1672923607&s=kitchen&sr=1-303"}
{"product_id": "B07Y9PY6Y1", "product_name": "Sujata Powermatic Plus, Juicer Mixer Grinder with Chutney Jar, 900 Watts, 3 Jars (White)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|JuicerMixerGrinders", "discounted_price": "₹6,525", "actual_price": "₹8,820", "discount_percentage": "26%", "rating": "4.5", "rating_count": "5,137", "about_product": "Warranty: 1 year warranty provided by the manufacturer from date of purchase|Includes: 1 unit Motor, 1 Jucier attachment, 1 Blender jar, 1 Grinder jar, 1 Chutney jar|Most powerful 9 watts motor with double ball bearings for efficiency, low maintenance and trouble free running for years|Juicer with unique honeycomb filter mesh for finer juice with higher yield|22 rpm operation- retains flavor and aroma of juices and food|9 mins. continuous running- suitable for longer usage|Totally shock-proof and safe|Low maintenance, trouble free running.customer care: 11-45793882 / 27691512", "user_id": "AHXQPNDQMOD2RJE2S6KG3CM6QRXA,AHEDAEYXIZIPVLI6HSDRKIGYILCA,AHNDQGC5II2W2NNJDKODYCGFN77A,AFEOPOMJ6P77R4KX2YKC4UXVHCMQ,AEGFHIVVOOMWQ2JRIPHMTSZ2VIYA,AEBIN6NSCXXL32OUISQKEN575X2A,AEAUDCMXHJHTKQNGANQYEVTM5ZYA,AFPWUFA4L6HJ5LJTBDR4J3MKJ4XA", "user_name": "Arjun A,shwetha murthy,rahul,Jubaida H.,Hemali Thacker,Amazon Customer,Alexis engg and mktg Pvt ltd,Amazon Customer", "review_id": "R3MKON00OQCF7T,RACP11DCWDX8H,R2AFW2I68NL7DV,R2Z8JARJBUORLB,R12IW90EHDETBO,R23PRYLHN54BOF,R3NY4R1RGDRP6I,R2EKZLAZBSNIGH", "review_title": "Best mixer juicer,Nice,Best product in this price,Good Product, can buy it.,Very easy to handle and very sturdy mixer,Realy great product... Noone providing such heavy motor.,Good product,Value for Money", "review_content": "One of the best juicer mixer I have ever used till date. Used almost all renowned brands but this one is class apart. 3rd purchase in the family circle,Nice,It is unique machine it can do everything which we went from a. Juicer machine fine quality of mixing grinder in few seconds and use both domestic or shops and very easy to use and clean I choose it after many machine used it is best all of them.,If u want to take out the juice after several days gap then u can prefer it,bit on the regular basis it is not good because I had taken out mausambi juice from it but it's waste was not containing some juice in it which can give a loss to u.  Else it's good.,I have not used juicer thus, 4 stars. But mixer grinder is excellent. Even hard items like coconut 🥥 pieces grind in just 3-4 turns. Very happy with the product . Easy to clean. Just waiting to use the juicer though.,Very good experience using this produc from year's.,Very nice products and most powerful motor,Nice Machine meets the purpose as I was looking for a strong performing juicer. its just that. manufacturing quality is also good and sturdy. though I feel the motor is loose fitted as one can feel it hitting both sides inside while cleaning or shifting", "img_link": "https://m.media-amazon.com/images/I/41yPeG8kXxL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Plastic-Powermatic-Jar-Juicer-Grinder-Chutney/dp/B07Y9PY6Y1/ref=sr_1_307?qid=1672923607&s=kitchen&sr=1-307"}
{"product_id": "B0BJ966M5K", "product_name": "Aquadpure Copper + Mineral RO+UV+UF 10 to 12 Liter RO + UV + TDS ADJUSTER Water Purifier with Copper Charge Technology black & copper Best For Home and Office (Made In India)", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterFilters&Purifiers", "discounted_price": "₹4,999", "actual_price": "₹24,999", "discount_percentage": "80%", "rating": "4.6", "rating_count": "124", "about_product": "RO technology reduces TDS, hardness, and removes pesticides & heavy metals. Eliminates harmful bacteria, viruses, protozoa & cysts|1 year warranty*;10-12 Liter capacity; Booster Pump is required for the functioning of water purifier in case of inlet water pressure being less than 0.3kg/cm sq. Available through our service technician at an additional cost.|Ultra Filtration imparts crystal clear clarity to your drinking water in addition to making is safe from viral & bacterial contaminations* UV+UF removes viruses; Patented Mineral Guard Technology to retain essential minerals in your water|Color: Black and Copper, Capacity: 10-12 liters, Power: 60 watts, Input Water Temperature: 10˚ to 40˚C, Operative Input voltage: 100 -300V ac; 50Hz, Material tank type: Food grade engineered plastic; Can be used for TDS upto 1500 ppm. Please use a TDS meter to find out the correct TDS of your water source before buying a water purifier|1 year warranty for electrical parts, except UV Lamp. Warranty starts from date of dispatch. Filters are consumables, get blocked or choked because of water only. If water quality is good filters life will be more, If water quality is bad (More turbidity or more TDS) Filters life will be less. so, not covered in Warranty. Electrical part will be send through; Installation will be completed within 48 to 72 hrs.|Taste Adjuster (TDS) controller enables adjustment of taste depending upon the source of water|12 stage filtrations,12 liter storage, High quality grey & Black color filters. With Active Copper Filter Series;ncludes â€“ RO Purifier, Pre Filter, Installation accessories, user manual. Installation You need to pay Up-to Rs. 500/- to the technician for installation.", "user_id": "AHZJHJWFZLYD64GVP4PXVI2F4LXA,AEUCRZPOISXKHXMCZUH6BXTUXUWA,AFL2ICS3EEESPGYLFF7OTVYMLVJA,AG63J3CFIT6RYX32RHHYWRZ2WKKA,AE6EGCFBVJIZEZ4XPPIY3PES2SDQ,AHUZG5YJCM4UWL66ALQ744FD3OOA,AEIKB2XA64MPG7BBXRG4DT57QKPQ,AF4ECPZRARF7SK2GDSBPTINVA2CA", "user_name": "Manish Mehekare,Rajesh,Nitesh singh,Lalit,Prathamesh poojari,Charan,santhakumar,Nikhil Bhagat", "review_id": "R410I44U1ORFS,R2EL6RDO42L8HA,R2LMSC4S998NYI,R2RVMZV1I42LGA,ROS3I3HXBLAYE,R2V70PAEVT1EYU,R1GYY0PDUBZVOK,R2180U6SP2A0B1", "review_title": "service is excellent,  installation guy is very professional,  I liked the service,Amazing,Value for money,Nice product,Water is clean and tasty also. Its cleans very well,Good. Happy with the installation,Nice product at affordable price.,Affordable and we'll functioning R.O.", "review_content": "I like the service most and the product,Note: Writing the product right after installation.Product looks nice and the storage capacity is good enough for a family of 5. The technician is very friendly and installed the product without issues. Will write a detailed review after using the product thoroughly.,It's value for money product.Works fine and installation was on time.,Nice product, and service is also good,Product is very good. Purity of water is excellent.,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71NXtZ0RVWL._SY88.jpg,Product and installation is excellent.must buy item at this range.,Value for money R.O. water dispenserSufficient capacity", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41ZvKRULvDL._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Aquadpure-Copper-ADJUSTER-Purifier-Technology/dp/B0BJ966M5K/ref=sr_1_308?qid=1672923607&s=kitchen&sr=1-308"}
{"product_id": "B086GVRP63", "product_name": "Amazon Basics 650 Watt Drip Coffee Maker with Borosilicate Carafe", "category": "Home&Kitchen|Kitchen&HomeAppliances|Coffee,Tea&Espresso|DripCoffeeMachines", "discounted_price": "₹1,189", "actual_price": "₹2,400", "discount_percentage": "50%", "rating": "4.1", "rating_count": "618", "about_product": "Compact & powerful 650 watt drip coffee maker for home and office use;Brews up to 5 cups at a time (25 ounces or 740 ml)|Premium quality materials are food grade with a glass borosilicate carafe;Reusable filter and removable filter basket is convenient and does not require additional paper filters|Auto keep warm function is ideal for instant, anytime coffee;Easy to use & set up|Please Note: Carafe is to be hand washed (not dishwasher safe);Package Contents:- 1 x 650 W Drip Coffee Maker with Borosilicate Carafe|Color Name: Black; Material Type: Metal; Size Name: Standard", "user_id": "AH6NXC2M3PH6OZHLJ6YXG54VIBMA,AGSDBEOHKXCL3WBEIN5VEZK4JY4A,AFCHIB73U3D4VQHZCH4MV2Z5FESA,AGLFKVLO32UB72C43CQNOPGQVKGA,AHBUPKENA77XVDAUGWUHVZLCKSEA,AEY34MNYOS24F3P7Q3IGMQVH3ZUA,AHMBANCEQ5AJOQVPFHONG2QTDE7Q,AFNQQLFJGPPNZCI6BVYZCEAZQZQQ", "user_name": "Subhajit Sadhu,Indrajit Sarkar,Ashwath,Dorje,Harish R.,Jana,Amazon Customer,Viknesh Harren", "review_id": "R3NLWGZTKSITSC,R1NCNL2F8KAM4L,R32I8HG9OTUY0V,R1Y6YHN4M285CN,RIR2EVLB3KG1Q,R2KUZ1CLHNTJAY,R27RDEPJ1W7VOQ,RQWPQXKORWT5I", "review_title": "Okay to use,Good value for a well finished product - recommended,Do not buy this product,Better than expected.,Best carafe from amazon,Build quality is not that great,Replacement parts not available or sold for twice as much as the value of the entire product,Good product", "review_content": "The pricing is good, using is very easy but the product is not too much worth to buy.,I have been using a similar coffee percolator for over 20 years now - and my old workhorse, a Chinese (Nova) is still capable. Since it was white, and therefore a very unappetising sight now, I needed a new one.Packaging: The design of packaging was perfect - stiff corrugated sandwich board box, foam profiled panels stuck on board for bottom and top, board wrapping around the glass kettle, the whole unit inside a thick ply cover. Frankly, this sort of packaging is more common in high end audio equipment. 5 * plus for the packaging design.Size: This is a small machine - and will make about 600 ml of coffee - sufficient for 2 mugs in one go. If you need a larger volume - look elsewhere.Body and finish: The plastic body is well made - the matte finish looks good. The bottom metal plate is seamless and black - will have to wait and see when spots appear. The kettle is good quality glass, and though no branding is present, feels thick enough to withstand minor washing bumps. The filter bucket and the holder with the flow control spring is OK - hopefully the spring and washer - which are fixed - will last. The lid moves smoothly and the hinges and the sprinkler also look sturdy. Switch is firm.Function: It worked very well on the first use. I had used an extra coffee filter paper on top of the nylon filter bucket. The flow was smooth. Coffee liquor starts weak, and then picks up strength. The drip stops well with the removal of the kettle - and though the manual cautiously states a 10 sec gap for drip stop, I did not find any leakage on longer removal.Overall: Very satisfied with my new coffee maker. Recommend buying.,Product doesn’t work within a month,Easy to use, and it turned out better than I expected it to be for the price.,Just Magnificent. Saves lot of time.,The plastic quality for this product is poor. It feels like a toy. I had bought a Amazon basics air fryer it had great build quality comparing to this Amazon basics product,If you try to find a replacement part it costs twice its value,its cheap and breakable. And the coffee is very very light,waste of coffee and also not a good flavour.,Nice product and simple to use", "img_link": "https://m.media-amazon.com/images/I/41EuzetRjTL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AmazonBasics-Drip-Coffee-Maker-Black/dp/B086GVRP63/ref=sr_1_309?qid=1672923607&s=kitchen&sr=1-309"}
{"product_id": "B08MVXPTDG", "product_name": "Crompton Insta Delight Fan Circulator Room Heater with 3 Heat Settings (Slate Grey & Black, 2000 Watt)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|FanHeaters", "discounted_price": "₹2,590", "actual_price": "₹4,200", "discount_percentage": "38%", "rating": "4.1", "rating_count": "63", "about_product": "Tapping into a natural phenomenon known as “convection” InstaDelight|Circulates air through a fan after passing it through the heating element|Its easy portability and multiple heat settings makes it a quintessential appliance on a chilly day|Comes with a 3-heat setting and turbo fan design to spread heat quickly in the room|Powered for over heat protection and height adjustable stand for comfort with ease of use|An ISI approved product powered with shock proof body and a carrying handle|Warranty: 1 years warranty provided by crompton from date of purchase, covers on manufacturing defects kindly read the usermanual for more details", "user_id": "AGYS2OMZE7DCEFQOBUJ7OSMPG3DQ,AF56UQ52OFSZL2KX2TPXPHBSNZ3Q,AFCOSVW2NHSFLPG7O5EKP2YRUERQ,AENAIK2GP3PTBWPAWBEFRET5BZ3Q,AH5CZZYZK64I4UNJA35AVYAY3SLA,AEPFMS33QLD2SPSAW7OBES4S5MTA,AEQBRKHWGFEJSWMMD7NCRL47IAUQ,AGQKV65KDMYKBD6ZQTXSQ74VID4A", "user_name": "Kanwar Singh,mukesh bajpai,Deepak Kumar,sreekanth veerla,Divyesh Patel,Jitendra Kumar singh,MAHESH L,Amazon Customer", "review_id": "R1KQ8JLFP0TG78,R1NBW7YR79U41D,R3J7GSQFAQVB31,RBQNYREQ6R6XW,RSL0KWN4H04GJ,R2NZ0UNFFXKZUB,R23D039HGB5VNX,R12EIACNZU7VVH", "review_title": "no,Good and reliable product 👍,Overall very fine Quality,Useful product helped my family a lot in winter,Operating switch is too hard for aged person,Sabse badhiya,Good product,Good product at this price", "review_content": "no,There should be a fan speed control option.,Overall very good,Little noisy but expected,Fan is slightly noiseOperating switch is too hard for aged person,Best in market,Good product. easy to use.,Received 2 days ago, looks, color r good. Heating nice, 3 adjustments for heating 660W 1200W 2000W, whichever u requireNo auto cut or over-heat protection available", "img_link": "https://m.media-amazon.com/images/I/31vL9-jaaJL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Crompton-Delight-Circulator-Heater-Settings/dp/B08MVXPTDG/ref=sr_1_311?qid=1672923607&s=kitchen&sr=1-311"}
{"product_id": "B0BMZ6SY89", "product_name": "!!HANEUL!!1000 Watt/2000-Watt Room Heater!! Fan Heater!!Pure White!!HN-2500!!Made in India!!Thermoset!!", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|FanHeaters", "discounted_price": "₹899", "actual_price": "₹1,599", "discount_percentage": "44%", "rating": "3.4", "rating_count": "15", "about_product": "2 heat settings providing more convenience in usage. Customer can set it at either 1000 Watt or 2000 Watt depending upon the requirement|Thermal cut out protection and Power indicator light.|Handle grip got portablity|It can be placed vertically as well as horizontally.|Adjustable thermostat", "user_id": "AH6EYS5AIDI7KYTTTFTZZHH433UA,AEXFEVEJ7L7LN3Q2JBWZQZ3YHUEA,AGVR6CP2GL562CMMN3TJJDIBQKOA,AGQ7DDSSAIHW4EQERMBBWQWQMVTA,AEK7OBBEY4AB77GMD7E334J3CYGQ,AHNX2BVKDDWFDLQBCZVT3U6I3QDQ,AEDKU3NF2473GPBRWDHIHRTZJPXQ,AGM2UWKCJESUA2YZADPFXZ6PANVQ", "user_name": "Vivek,Amazon Customer,Kundan,Rajan kumar,chaman prakash,Amazon Customer,Chinna,Dhaval", "review_id": "RRZOYTJL6LAHO,R3L2TDS1XKX1T7,R2RGIFD5MNW5ES,RWMH1CZ8YZVA1,R4ES2CY3SDLGW,R1Z3JXTI330QGA,RVC3N6LRSJBX6,RAA5Z4UFLIC05", "review_title": "It's working perfect,Excellent 👍🤠 piece,Value for money,Very good product,Good product,Good Quality 👌,Late delivery 12 days,Totally money West", "review_content": "Everything is fine about the product, light weight, good air blower and good heating, most important price is good,Best you can in this winter without doubt go for it,thanks Amazon for this heater,built quality as per description,haneul brand same as mentioned,Amazing product at amazing price, work as per the description, same brand received build quality is also superb, great for winter pocket freindly as compare to other brand, recommended,It is good product,Weight and heating process so easy and movable,Value for money and quality is also good.,I am not satisfied because product bilt quality poor and use that  on heter semll very iterating,High consumption electric", "img_link": "https://m.media-amazon.com/images/I/41OZjIUftuL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/HANEUL-2000-Watt-Heater-HN-2500-Thermoset/dp/B0BMZ6SY89/ref=sr_1_312?qid=1672923607&s=kitchen&sr=1-312"}
{"product_id": "B09P1MFKG1", "product_name": "Melbon VM-905 2000-Watt Room Heater (ISI Certified, White Color) Ideal Electric Fan Heater for Small to Medium Room/Area (Plastic Body)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|FanHeaters", "discounted_price": "₹998", "actual_price": "₹2,999", "discount_percentage": "67%", "rating": "4.6", "rating_count": "9", "about_product": "Lightweight (1.2 kg) for easy portability between rooms; Plastic body with rust-free metal grill front|Air throw range of 10 feet which is ideal for small to medium sized room; Product can be placed both vertically and horizontally (kindly refer to images)|Powerful 2400 RPM copper winded motor for quick heating and can be used vertically or horizontally (kindly refer to images)|Cool, Warm or Hot wind selection knob for heat setting; Please note that regulator changes heating power & not actual fan speed", "user_id": "AENGRDSABHKCYNYJPZ2SML6FWVHA,AFNGD6S7UIHBQ2FNXUDBWCJDMLMA,AFWHWM3CHMTSRKJH7IY2U64CRVOQ,AHWQ3GYAYROPEKLLI6SVIM3S2ZNA,AEOYVLH6A6P643MDQBU67RJ4DTDA,AGKOT3DLM55KCHF3AQAOROIFZ3EA,AGWCBYRA3OJTMA3TUUUH2RKJPPTQ", "user_name": "Chanchal Gurjar,Shyam,Lalit Garg,Anil Kumar,PREM NATH,SURESH,VIJAY K.", "review_id": "R2REMFEEN6UKBC,R29TQDV31QHMAP,RSC1YPIBXFW9B,R3M0C49RRYPXKN,R1P7N12X78US49,R17PHQ7LHY70GL,R1E8B0LMBUZ21K", "review_title": "It's good,Happy to purchase,Product is really good.,It was excellent,Very Good Product,Heater,The final finish product is not  elegant.", "review_content": "It's good  nd amazing product,Very nice product. Very low noise, leaves no dryness in air, elegant in looks, very fastly heat the room. Safely design. happy to purchase this  heater . 🤩⭐👍,It maintain the room temperature and provides sufficient heat.,It was really excellent product I like it,Awesome product,Product is very good,", "img_link": "https://m.media-amazon.com/images/I/41xLjSyJtYL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Melbon-Blower-Heater-2000-Watt-White/dp/B09P1MFKG1/ref=sr_1_313?qid=1672923607&s=kitchen&sr=1-313"}
{"product_id": "B01LY9W8AF", "product_name": "Cello Eliza Plastic Laundry Bag/Basket, 50 litres, Light Grey", "category": "Home&Kitchen|HomeStorage&Organization|LaundryOrganization|LaundryBaskets", "discounted_price": "₹998.06", "actual_price": "₹1,282", "discount_percentage": "22%", "rating": "4.2", "rating_count": "7,274", "about_product": "Material: Plastic, Color: Light Grey100% food grade|Package Contents: 1 Laundry Basket|Size: 425 cm x 355 cm x 605 cm|Luxury laundry basket|Specially designed air vent to keep clothes, odour free|Space saver and ideal to use anywhere|Comfortable, reach-through handles for easy lifting and carrying", "user_id": "AFUIW75M2VCMJ2RAD5HFEUHXCRKA,AFWO26UIM72Q7ZPHSQ3DUGDM6H6Q,AF5EL6S3V6JDA7HNA6BKXAKBMZMA,AGZ4IHSUMB233GB7DKCBY2RVARRA,AERD4G54UG5KQSX4LPXU4QPYCDYA,AHUSPS7GCSBQRWBRLXTUC6WNS3EQ,AEJP6U7ZTSGESRMPO24FNKJ6SP7A,AHOTHO6NULKUVDSAY6WBXCA2YCBA", "user_name": "Amit Singh,RN,Madhuri,SHUKDEB P.,Mano,Harsha,mahamod sharif,Bhavesh Soni", "review_id": "R3ORPP4CPI5V9S,R2M6DE07UL43TF,R37BE8EXG1TX8H,R31M0VY9OTJB9I,R2ZQ1L37VEHS9C,R2BKJHDM07WI0G,R357SWC6WSG1AM,R2H4OG72VGEPXR", "review_title": "Nice product,Ok,The lid could be more sturdier. Very thin plastic.,Not very good,Fine,Excellent product,Quality,Very good quality product,can store a week laundary", "review_content": "It's a good product for strong daily laundry clothes. Fine quality!,Flimsy and the lid alignment is not good design. Colour is sober which i liked better and not bright brown. I've Milton and size is almost same though Milton bottom is a bit wider. I liked this colour better so bought this.,As shown in the image. The basket quality is good. Expected a little thicker lid. Its not as sturdy as expected given the brand and price,Good,Good for home,Looks cute too,I like this product 👌,https://m.media-amazon.com/images/I/61g3Yt9YAyL._SY88.jpg", "img_link": "https://m.media-amazon.com/images/I/51CyJ9dUiWL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Plastic-Laundry-Basket-Light-Grey/dp/B01LY9W8AF/ref=sr_1_314?qid=1672923607&s=kitchen&sr=1-314"}
{"product_id": "B07ZJND9B9", "product_name": "ACTIVA 1200 MM HIGH SPEED 390 RPM BEE APPROVED 5 STAR RATED APSRA CEILING FAN BROWN 2 Years Warranty", "category": "Home&Kitchen|Heating,Cooling&AirQuality|Fans|CeilingFans", "discounted_price": "₹1,099", "actual_price": "₹1,990", "discount_percentage": "45%", "rating": "3.9", "rating_count": "5,911", "about_product": "Box Contains: Fan Motor, Blade Set, Canopy Set, Downroad and Shackle, Manufactured Under The Guidance Of Highly Qualified Engineers To Ensure The Life Of Product, For Help Or Guidance Call On Our CC, Note: Self Installation and product will be repaired in our service center.|Material Type: Aluminium; Controller Type: Button Control; Mounting Type: Downrod Mount; Finish Type: Painted", "user_id": "AFCLVEPUPFSZU5KJMDBYKGARGQBQ,AEC4ACDLYBYYFG2473OXFA6BOCHA,AGEUOPY2YJ6HCREEOLU73JCGLFVQ,AGT2HSAHUC2KL5P2RL657BNZW3EQ,AERD6R3OJ5GSAGDUSNOOSYWMJJAA,AFXYWZZ4PXDEVN5DJPTUF6SKLEGQ,AHYAQT2F3NUTKS7LIHXKTFNR7WQA,AHKSXLMJOQHJNI2U6A4FURPV5CYQ", "user_name": "Ravi,Pasala Eswararao,Verified User,Azarudeen,Shubham,venkatesh,VELMURUGAN,kutty", "review_id": "R1SWHPJDUW2G3M,R2RFQJDQF5BT8,RPGTYXQGC3TXI,R3TFGARGJENEPY,ROG4D0YGDQMH,R3HAW9CAE08DZ5,R1LA2HMRSTZGUS,R2NOWT8O685BUW", "review_title": "Decently priced fan,Power saving fan low super qwality,Nice one, go for it,Fan rod was missing,Overall good fan at this price,Good,Love it .. nice product,Okay", "review_content": "A good fan. Very sad no regulator, and had to spend money for a regulator,Iam like this prodect amazing,I’ve been using it since last 4 months and it doesn’t have any issues so far. Product came with all the necessary items and it works perfectly fine.,Rod was missing Kindly resend,Good performance and good fan.Just upper cap not given by company.Rest is good at this price.I hope it long lasts.,Good one,,Just okay don't get too much hype", "img_link": "https://m.media-amazon.com/images/I/31hXo964hqL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/ACTIVA-APSRA-Approved-Ceiling-Warranty/dp/B07ZJND9B9/ref=sr_1_315?qid=1672923607&s=kitchen&sr=1-315"}
{"product_id": "B0B2CWRDB1", "product_name": "Shakti Technology S5 High Pressure Car Washer Machine 1900 Watts and Pressure 125 Bar with 10 Meter Hose Pipe", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|PressureWashers,Steam&WindowCleaners", "discounted_price": "₹5,999", "actual_price": "₹9,999", "discount_percentage": "40%", "rating": "4.2", "rating_count": "170", "about_product": "Power:1900W, Pressure:125 Bar, Flowing:10L/min, Voltage:220V~50Hz, 3 Meter Power Cable|Venturi System, Auto Stop, Self-Intake Function, Pressure Gauge, Variably Adjustable Fan Spray Lance, Water Filter|Low-Noise Operation: Auto Stop Technology Switches The Motor And Pump Off Automatically When The Switch is Released|Includes: 1900W Pressure Washer, Inlet Pipe, 10M Outlet Pipe, Water Filter, Soap Dispenser, Inlet Filter, Quick Connector, Pressure Gun With 6 Months Warranty", "user_id": "AFS6NM2UFY5M77EWX5YT2KBMWBVQ,AEBC5L4UVUOB45BUSQHLNHGZC2JQ,AGF2ODSIJFBYL52VO3O77F576SGQ,AGYWLAKGGNH4OP5G5WPNQUJWLVPQ,AHNZZYO7DIGCLRTY76GJ4D5Z676A,AEVYKVKVPEDFXLD5ZL2C4PYUPVUQ,AFZ32GLS7WFVSLNXGJBJYFJWWSUA,AHBRCKJY6F5ZLV7GSUC3IXI6OSOQ", "user_name": "Ravinder kumar,Ashok,tejas,seema,HARSHVARDHAN,Shubham kushwah,Saurabh Patwa,Shreyans Jain", "review_id": "RWSKUEMV0AS0P,R2YZOJVWTFMYAH,R17E9QT7OVVJVX,R3KPQIECAK271I,R2UJ9SFJ6B6U93,R1670TIBLR378H,R14R0I9YVONH86,R1FIR49JO1CT41", "review_title": "It is very good,Good product,Just go for it,Good product,Value For Money.,Good product easy to use,Pressure is very good but mtr shows 115bar,Nice Product.", "review_content": "Product works very well, easy to use i recommend to this product shakti s5 to all,To noise!,vary good washer, product work vary well ,go for it,Paisa vasool,Awesome Car Washer for Domestic use. Good Pressure for superior cleaning. But Inlet pipe should have more length than it has.,Good pressure washer and easy to use , i think inlet pipe need to be more long other wise all good,Pressure is very good but mtr shows 115bar,Used this product for wash my roof as well as to wash my car.  Product is very good with low noise and good pressure. Recommend to have this product for personal use to wash your Car, Floor, Roof etc", "img_link": "https://m.media-amazon.com/images/I/51RQbF6ZuLL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Shakti-Technology-S5-Pressure-Machine/dp/B0B2CWRDB1/ref=sr_1_316?qid=1672923607&s=kitchen&sr=1-316"}
{"product_id": "B072NCN9M4", "product_name": "AMERICAN MICRONIC- Imported Wet & Dry Vacuum Cleaner, 21 Litre Stainless Steel with Blower & HEPA filter, 1600 Watts 100% Copper Motor 28 KPa suction with washable reusable dust bag (Red/Black/Steel)-AMI-VCD21-1600WDx", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Vacuums&FloorCare|Vacuums|Wet-DryVacuums", "discounted_price": "₹8,886", "actual_price": "₹11,850", "discount_percentage": "25%", "rating": "4.2", "rating_count": "3,065", "about_product": "This Stainless Steel vacuum cleaner is an excellent device to clean your home or office. Designed to meet your varied needs, it has a sleek design with a Stainless Steel body that makes it stand out wherever you keep it. This wet and dry vacuum cleaner with blower function which removes deep embedded dust from the surroundings.|Whether it is a commercial or residential cleaning job, you will obviously have different needs, which dictate the kind of vacuum cleaner that is right for that particular job. If the main concern is multi purpose cleaning, this vacuum cleaners could be the most appropriate. It comes with HEPA filter for effective dust filtering.|This Vacuum cleaner contains washable dust bag for easy care & durability. you can conveniently remove dirt, pet hairs, tough stains and more with complete ease. The static charge that some users have pointed out is a rare instance that builds naturally when dust is rubbed strongly. That's not an electric current and is harmless|Warranty: 1 year on product; Capacity: 21 liter; Power: 1600 watts; Includes: Vacuum Cleaner; Power input: 220V Furthermore, the of its suction mechanism allows you to remove both solid particles and fluids with equal ease. This vacuum cleaner has a powerful 1600W motor that is able to draw in every last piece of dirt using the HEPA filter that captures small particles that cause allergens. DON'T MISS THE SPECIAL PRICE OFFER THIS MONTH.|Package Includes Vacuum Cleaner, 5 Feet Flexible Hose Pipe, 2 x 1.5 Feet Extension pipes, Floor-cum-carpet brush, Wet brush with two separate mouths, Upholstery nozzle, Crevice Nozzle, Washable dust bag, HEPA filter, Instruction manual, Warranty card. All spare parts are available for warranty & post-warranty repairs.|AMERICAN MICRONIC is an Indian-owned brand with global ambitions and footprint. Headquartered in Delaware, USA, the vision is to make an Indian-owned world-class brand of home appliances that competes with the largest multinationals in the most advanced countries ie: the USA, Europe & Middle East by offering better product quality, service delivery, and value for money.", "user_id": "AHX7I43IUBTBR5SMBWXO2VWLFLDA,AGUV5JDS7DN6OSZ2CENPDKWATUQQ,AFHZWLSX6C4TWMNGGNGRE2KODIAA,AHFNG3ELM4SUVBZJXLUUMP4NZSGA,AH7PUFLOQIEDBHZZIKRKWNNIRFOA,AEJAPH5MWACXXHMLGLEDYPPSRVNA,AG7NNDG43AB32RR66C6QNTQKGO6A,AHKF4O42OIQQEWP4GOW4TCQJILTQ", "user_name": "A.sh,Jp,Junaid Yaseen,Maya sutar,Andrabi,praveen elangovan,Satpreet Singh,Amazon Customer", "review_id": "R3TVMEHW7XIWSU,R20EKADK19NV0G,R3AGXOFMA1Z00Q,R97FQ3X9NLEAL,R3D45IE6H47RBM,R1HL2KTGD7AU9J,R39IL0Q9V5M18U,R7M2JXHO1GESO", "review_title": "Best in its price range,Best suction power,Domestic Beast,Very good suction power and efficient,Beast of a Vaccum Cleaner 🔥💯,Good built quality,Nice product with good suction power,Great Product", "review_content": "Purchased from Amazon for full price under no offers, still beat competitors by Rs.163Order was placed on Thursday 01/12/22, late in the evening at 11 pm.Was to be Delivered on Thursday 08/12/22 but arrived early on Monday 05/12/22 at 10 am.Quite satisfied with the Delivery, Packaging, Condition of the item and also Happy with the early arrival.Along with the Vacuum we received a basic Instruction Manual and Warranty Card.The Invoice was missing from the parcel, so it had to be downloaded from Amazon.To Register your Warranty, you require to scan the Bar Code on the Invoice and WhatsApp the details.Without any delay, excitedly we got to assemble the unit which was a fairly easy task, took approximately 10 minutes, which I guess is ok for the first time while getting familiar with all various attachments etc.First impressions, the Vacuum itself looks sturdy built wise, but some attachments could be a little stronger. Especially, the extension pipes could be Stainless Steel same as the Drum and Telescopic in feature / operation. The main Vacuuming head attachment used for floor / hard surfaces could also be Stainless Steel as it gets used the most and gets banged around quite a bit, would extend its life.Its a 2 pin plug, instead of a 3 pin which could have been better with a surge protector fuse.The cord is of decent length, quite impressed with the quality of the cord. Also, the cord, which has no autowind and cannot be inserted within the body of the unit, after use can be rested on top of the Drum in a winding fashion, it kinda works and does keep in place without being a nuisance. Hose, same solution.The 2 side Latches are reasonably strong. Wheels are easy to install / insert and work fine.It would be absolutely fantastic if the various attachments could be stored / latched to the main unit while not in use, storage wise but can understand the limitations in this regard.First demo was for the Vacuum.Noise average (not too loud or unbearable), reasonable with any other domestic Vacuum of similar power.Inside the lid, the dust bag clings on to its inlet, would be better if it could be secured / locked with a clip.In Vacuum (suction) mode the air gets forced out of the Blower outlet, this outlet is directed on the opposite side of the unit and is directed straight onto the floor level. Now imagine, if you had not yet cleaned that part of the room and that dust gets thrown around or blown onto the already cleaned surfaces, it would be an unending job like a dog chasing its tail. If this outlet had a removable or having the ability to rotate something like a flap or adjustable Ac vents like in cars, then it could direct the blown out air upwards while Vacuuming the surfaces and this could have been of great design sense.Suction is at par with as described or claimed in the adverts, nothing too exciting but definitely not disappointing, does the job which is important.Then, follows the demo for the Blower.This feature should technically be equally as strong as the Vacuum, because the force of the air sucked in while Vacuuming is supposedly the same force leaving the Blower outlet. To make things interesting, there are fish gill like 2 vents on either sides of the Lid. These vents are the fixed kind, cannot be closed or opened. One of the vent very faintly can be felt taking-in air, while the other vent blows out air at a significant force. This particular phenomena I am bewildered with, cause as I understand the escaping rate of air through this vent will weaken the force supposed to leave the Blower outlet. So make of it what you will. Still does the job, if you're looking at blowing leaves or scaring the neighbours pet.Finally, the demo for the Wet.Performance is at par with as described or claimed in the adverts and as other customers have described in their video demonstrations, again nothing too exciting but definitely not disappointing, does the job which is important. May need to dry mop even after using the Wet function.In closingDefinitely do purchase it, use it often as required and also helps keeping fit,Do not allow dust to settle on your Vacuum Blower.Also ordered extra:i) American Micronic Replacement Dust Bag for AMI-VCD21-1600WDx & AMI-VCD15-1600WDxii) RODAK 35 MM Mattress and Upholstery Nozzle for Vacuum Cleaner Wet and Dry Cleaning, EU Import,It have the best suction power among the wet and dry vaccum cleaner, even better than some of the dry vaccum cleaners. I bought this for my mother in-law. She likes it for being easy to use. It's simple and easy to connect and remove dust covers and pipes, Extension pipes are little loose though. It's easy to clean those cat hairs now. And don't have to worry about accidentally sucking the water from the floor, because it's Wet and dry vaccum cleaner. Hope the customer care is a good one incase of any needs arise. They send me already opened package, but not used I think. They could have send us a fresh unopened perfectly sealed package. No complaints untill now. I liked the reusable dust cover feature, also it's easy to connect it inside. Easy to handle, don't have too much weight.It would have been better if there was an auto winding of power cables with a switch.,This is a domestic beast.... great suction.Only thing that should had been ther is speed control.Noise level is high, but with such suction is ok. As long as it cleans it all without ne to redo it again and again, I am ok...Rest how it will stay with time will be something to see.,It is very easy to clean as the suction power is great 👍 very powerful machine indeed,I have been looking for a good vaccum cleaner for a long time now. I recently came across this and read the reviews etc. Some were good and some were bad. But at the same time I couldn't find any better specifications in any of the other vaccum cleaners  in this price segment so I finally bought it.It came in a big Amazon box well packed and secured. Unboxed and it was as perfect as in the stock images. Here is the list for you to understand the pros and cons as easily as possible :⁠-⁠)• Very Good quality steel and plastic build💯• The suction(28kpa) is really really good even with the thick carpets etc💯• The wheels are really good too,They move effortlessly 💯• You get a lot of accessories to clean different surfaces and they're good quality 💯• The blower function is really powerful 💯• The bag inside,which collects the dust & dirt is big and can be cleaned & Washed easily 💯• The noise level isn't much. Its okay, Not loud💯• The cord length is 5mtrs which is enough 💯• The overheating protection is Good💯• All the Accessories can be stored at the given spaces on the base💯Cons:• The only thing that I think should be improved is the locking mechanism of the extension pipes. They are good and fit well but if its a carpet or some other mats you're cleaning you need to tighten it well otherwise it loosens and needs to be tightened again and again.🌟 Overall a 10/10 Product which fits all your needs,Wet and Dry [Cleaning of course;⁠) ].Better than any other Vaccum cleaners in under 10k price range . Go for it 💯( P.s I've tried some other Vaccum cleaners too which are in the 6k and above range but this is the all in one OP Vaccum Cleaner💯),Good suction with great built quality,Good durability,good suction power and quality product,Vacuum cleaner is very fine, suction power is quite good, drying power is also just OK,noise level is high as I expected. Cost is high as compared to other brands. Overall I rated it four star.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41tcKYuBPSL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/American-Micronic-AMI-VCD21-1600WDx-Wet-1600Watts-21-litres-Stainless/dp/B072NCN9M4/ref=sr_1_317?qid=1672923607&s=kitchen&sr=1-317"}
{"product_id": "B08SKZ2RMG", "product_name": "Demokrazy New Nova Lint Cum Fuzz Remover for All Woolens Sweaters, Blankets, Jackets Remover Pill Remover from Carpets, Curtains (Pack of 1)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|LintShavers", "discounted_price": "₹475", "actual_price": "₹999", "discount_percentage": "52%", "rating": "4.1", "rating_count": "1,021", "about_product": "Quick and efficient Switch to turn it on and gently run the shaving head over the surface of the clothes.|Corded The fluff remover runs on an inbuilt battery and has a corded wire. Battery operated fluff removers run out of power after a few times of use but you save hundreds on batteries with this corded fluff remover.|Smart design With large shaving head, detachable lint catcher and comfort grip handle. Slide downward to release the lint catcher gently to remove and clean the collected lint. The comfort grip handle allows the fluff remover to fit comfortably in your hand, giving you a good and control as you de-fuzz your garments|Dual protection The adjustable height spacer protects your garments from being cut or snagged or caught. It also protects and reinforces your hands from accidentally touching the shaver foil. A cleaning brush is included in the pack to help you easily clean your appliance after use.|Easily remove fabric fluff, fuzz, bobbles, pills, burr or roye from all types of garments and fabrics|Package Content: 1 Unit of fluff Remover Report incorrect product information.", "user_id": "AE7RG5GRVSLRP2HGPKIF2JJ7BAHQ,AFCDHTYGHMNLNK2S3X6JVQOT6AXA,AG3JRPG6MIZTLYNMIRBGFYDZVLBQ,AGFY572BCNP6M74AI2RXGPJTWC7A,AF56KWTGYOCMXLKEJHOSIUZSVZ4A,AF276RVUYCN7YJGIRUR2HDODWF7A,AH4ZIAFAMC5PBWBHQZDSHS2JHUBQ,AFBJNCLV6XVUCTE24MRPXR4IURXQ", "user_name": "vipin,Bhavana Rangarajan,Raj,Dimple Aggarwal,Jaidev,Harsh pandit,MAHESH CHOUDHARY,Sheetal Pandita", "review_id": "R2TBG87E7UU7IT,R8OA8PY28PACZ,R3PAX3XE02N0SU,R1A1WNBXQ3ZV8U,R27MAAIUO0M5EU,R2EI5EUGGANOP4,RAGDDQU7ERLG3,R1091DNAFCQ1ML", "review_title": "Good,It's a good product. Go for it.,Easy to use,Good product, but quality is ok ok,Value for money,Gave new life to my old clothes-magical,I could not believe that this product is so good ✨✨,Good for woolen clothes", "review_content": "Plastic is not of very good quality thought but it does the job well and it is easy to use.,,Nice product,I bought this product at a price of rs 335, at this price product is good, but don't know how long will it work, as blades are quite low quality, plastic of the body is good, Cord length is also quite good. I have used it on my old woolen clothes, they have become like new, used on cotton trouser too, it is also like new, I like this product, only makers should improve its quality.,Value for money,The product is literally magical. It gave a new life life to all my discarded old winter clothes. Must must must buy thing. Highly recommended.,I am very glad that I purchased this as my all clothes became new purchase 💖,It's easy to use and useful especially in winters...", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41Xg2TPKwyL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Demokrazy-Remover-Woolens-Sweaters-Blankets/dp/B08SKZ2RMG/ref=sr_1_318?qid=1672923607&s=kitchen&sr=1-318"}
{"product_id": "B0B53DS4TF", "product_name": "Instant Pot Air Fryer, Vortex 2QT, Touch Control Panel, 360° EvenCrisp™ Technology, Uses 95 % less Oil, 4-in-1 Appliance: Air Fry, Roast, Bake, Reheat (Vortex 1.97Litre, Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|DeepFatFryers|AirFryers", "discounted_price": "₹4,995", "actual_price": "₹20,049", "discount_percentage": "75%", "rating": "4.8", "rating_count": "3,964", "about_product": "VOLTAGE (230 Volts): Instant Vortex Air Fryer 1.9 Litre is designed as per Indian Electrical Power 230 V - 50 Hz|FREE HOME INSTALLATION & FREE HOME SERVICE: We, at INSTANT BRANDS, are committed to \"Keep Customers Interest Ahead of All.\" Feel free to contact Customer Care at 1800 123 2700 for Demonstration, Installation and Service Requirement.|SMART ALL-IN-1 FUNCTIONALITY: Air fry, Roast, Bake and Reheat.|WORLD OF POSSIBILITIES: Make French Fries, Samosas, Kabab/Cutlet, Chicken Nuggets, Corn Cheese Balls, Banana Chips, Cakes/muffins and much more!|GUILT-FREE FOOD WITH 95% LESS OIL: With EVENCRISP TECHNOLOGY Instant Air Fryer delivers all the crunch and tenderness of deep-frying with 95% less oil.|EvenCrisp TECHNOLOGY: Advanced technology that drives air flow top down for a perfect golden finish and crispy, tender results every time!|ONE-TOUCH DIGITAL PANEL: The Digital Touch Panel consists of 6 cooking functions, Air Fry, Broil, Roast, Dehydrate, Reheat and Bake along with cooking time and temperature settings.", "user_id": "AGXJAYXZKJ6NCPSLX57MXJLQ3F6Q,AEQYSJWBP6DN2IV2LDP4XVNI4FBQ,AGNHWTOCLPVNZ56CWEF3QQI25ROA,AHC4JPWEXYM3O4YAKYIJZ5CAUOVQ,AECXWRKH4W4B73UW5IAHDTBZYTBQ,AEU6W4IG5BLXZ5XJ23PYFQKXYHSA,AGY4IRMJHF35GY44YCTUVQAEIJ2Q,AHVMCHCWTUWBKE4WYBY27MBIQ32A", "user_name": "nikhil,Rituja Ray,Prasan Krishnan Karthikeyan,Amazon Customer,Georgy Mathew,Vikas Kakkar,KANNAN P,Placeholder", "review_id": "R2FHIBV8JE4CTB,R315K0BCU0KVKO,RD129PA7KQQOR,R3BTQPGZLTN48E,RH0STL2LKD7N5,RVNS9SRGUWUT3,R25CXUY1Y74QGF,R1SIGI0M0INPVB", "review_title": "Loved it,Good product,Good product,It's easy to use.,Fine product,Awesome Product,Nice product & user friendly,Correct size and easy to use.", "review_content": "I have used multiple air fryers. But this one is best and value for money,Good product and a excellent demo was given by Manikandan on video call.However we returned this to get a higher version of this.,It's a good product, worth the money. The virtual installation and demo given by Manikandan was very helpful and made it easy to use.,Easy to use. Easy to clean. Easy to maintain. Good product. Value for money must recommend to everyone. Thanks a lot.,This airfryer as expected is an alternative for people who hate deep frying and oil less food. Not only that Instant pot could be better than other airfryers out in the market.Manikandan gave a demo of the product. Thank you,Very Good explanation about product and it's function then  safety precautions and clarify our doubts by Manikandan and this demo was very useful to us.,Nice product & user friendly, got video session for demo & installation given today by Zafar. He explained all the options very well & ready to support even after demo. I am giving 5 star for product & installation.,This Airfryer is most satisfying,compact,not over sized and easy to clean.I was worried it will be too large.worth the cost.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/313WfOy8VSL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Instant-Vortex-2QT-EvenCrispTM-Technology/dp/B0B53DS4TF/ref=sr_1_316?qid=1672923609&s=kitchen&sr=1-316"}