{"product_id": "B07WFPMGQQ", "product_name": "iQOO Z6 Pro 5G by vivo (Legion Sky, 6GB RAM, 128GB Storage) | Snapdragon 778G 5G | 66W FlashCharge | 1300 nits Peak Brightness | HDR10+", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹19,999", "actual_price": "₹27,990", "discount_percentage": "29%", "rating": "4.3", "rating_count": "9,499", "about_product": "Snapdragon 778G comes with octa-core processor that adopts the 6nm process and Kryo 670 architecture.|66W FlashCharge|Liquid Cooling system intelligently sense the heat source and adapt the optimal cooling solution, thereby effectively cool down the phone and reduce the CPU temperature by 12 degrees and surface temperature by 3 degree.|Equipped with 64MP triple camera system, 8MP Wide-angle camera, 2MP Macro camera|iQOO Z6 Pro 5G display provides immersive visual experience with true color contrast and a peak brightness of 1300 nits. HDR10+ helps in providing right color tone mapping for each scene. The display offers 90Hz refersh rate and 180Hz Touch Sampling Rate for a smooth touch response.|Display type:amoled, Form factor:bar, Human interface input:touch screen", "user_id": "AELBDTDLN6LH4TEVDSSVNVRMHOTA,AF6WQKW6OFXB56NMHLIN4Z3XRTNQ,AFH5GFI3ZLDKRPX7OOXJDZKNTTTQ,AEQCU4OWLDASI2OKORSLGN4UFUXA,AHKQFWVTWLZQYGV6ZA6OCY333SNA,AHX5S7C6OWULLEH2WS5TSQFATXPQ,AHTWMZQ36LO3QXAIALC6VJ7OLTCQ,AHE3N52C6VWHPAF36U7GF7W2UV6Q", "user_name": "Thukkaram,Vishnu,Vyshnav g nair,Vijaya lakshmi,Dileepkumar,AJAY KUMAR,Amit sahu,Amazon Customer", "review_id": "RJYLPPJ0FGP7W,R2FID5PFZZFEMW,R358SS960NFBLL,R3V2BSMUA81YBR,R11VQG0J80EBFL,R3ULSAT0BPNPG4,R2XXGJP0K25QJZ,R2PQ51W8C26K8S", "review_title": "Good phone , little expensive,Buyers Beware,I bought this mobile at 18k, worth on that price.,satisfied with the product,Single led flash light,Good product,Good not Excellent.,Good one", "review_content": "The camera is good, phone is quite respponsive, fast charging.There are some niggling software issues and do not forget password (pin), there is no way you will be able to get it back to factory settings,This is my second iqoo z6 pro and my humble advice to all the users and purchasers out there is that please DO NOT update your device to the latest software version. Doing so will definitely cause serious overnight battery drain issues. I speak from my experience. My first iqoo z6 pro 8gb is updated to the latest August security patch update and drains battery at the rate of 10 percentage overnight for no specific reason. The idle drain is very pronounced. However my second Iqoo z6 pro which I purchased is still running on the original software version and has excellent battery back up with negligible idle battery drain . So I think it's best not to update till iqoo rolls out a better update resolving the battery drain issue,Above average performanceNo heating issueFastest fingerprint reader&face unloakGood battery lifeOk camera qualityLight weight,comfortable on hand,All the features of this mobile was good.no doubtly anyone can buy this but nor for games.withinh the budget only it was available for me.,Dual tone flash light is not working i think it's only single led light,Two things missing1. Pin hole camera2. Earphones jack.Overall 👍,Camera Excellent, but battery life not good, maximum 6 hours,As this price limit its a good mobile with camera, battery, screen quality", "img_link": "https://m.media-amazon.com/images/I/41XtHlbmOHL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/iQOO-Storage-Snapdragon-FlashCharge-Brightness/dp/B07WFPMGQQ/ref=sr_1_198?qid=1672895806&s=electronics&sr=1-198"}
{"product_id": "B09QS9X9L8", "product_name": "Redmi Note 11 (Horizon Blue, 6GB RAM, 64GB Storage)|90Hz FHD+ AMOLED Display | Qualcomm® Snapdragon™ 680-6nm | 33W Charger Included", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹12,999", "actual_price": "₹18,999", "discount_percentage": "32%", "rating": "4.1", "rating_count": "50,772", "about_product": "Display: 90Hz FHD+ (1080x2400) AMOLED display; 16.33 centimeters (6.43 inch); 20:9 aspect ratio|Camera: 50 MP Quad Rear camera with 8MP Ultra-wide, 2MP Macro and Portrait lens| 13 MP Front camera|Battery: 5000 mAh large battery with 33W Pro fast charger in-box and Type-C connectivity|Processor: Qualcomm Snapdragon 680 Octa-core; 6nm processor; Up to 2.4GHz clock speed|Memory, Storage & SIM: 6GB RAM | 64GB UFS 2.2 storage expandable up to 512GB with dedicated SD card slot | Dual SIM (nano+nano) dual standby (4G+4G)", "user_id": "AEJLOEHISUISLO2Z4RE2TO2V6NGA,AEJ4UYFD3M2WGB3WEQJOZ3GGJY7Q,AFJ3CVFC3MO2Z3MYQTCELWT4TTKQ,AEEBECR65JN34YC7NEJIFAQB67TQ,AE5XN2CICXIBA4IK6F4ONOJ6TOCA,AGUZQN2LWKQXLXBJO2NRTXGV7EUA,AHWQSD5JHCOHW7JYN7F52ABQCJQA", "user_name": "Meghnad,Partha Dey,JAIDEV CHOUDHARY,Mayank Singh,JeneZ,chetan kamerkar,Gangadhar", "review_id": "R1GQJYYLCFOXJ8,ROASRYCFUFCK0,R1M63KP70YH4TU,RV26OEPPLTVTZ,RAS4252SOW901,R1EQV38U53I993,RD4X602L8KNNS", "review_title": "Excellent Phone in the budget segment,Best value for money... But afraid of future MIUI updates.,Don't purchase it as camera phone 😤,Dependable & it's been a year.,Budget mobile,Good for basic use,Phone is nice , but software is not", "review_content": "I was looking for a phone below 10K. I am not a person who believes to burn money for phones. My requirement was a phone that has good network reception, good wifi reception, a balanced software, good battery life, good screen that don't strain eyes, a good hardware, 3.5 mm headphone jack, and a charger. i don't need 5G network because 5G drains battery a lot and 5G spends too much data. I don't watch movie or YT on mobile network and I wonder how many does watch FHD, 2K, 4K videos over mobile network. For downloading documents, social networks, banking apps 4G is more than enough.In my budget I found all phones have 4gb RAM. Realme Narzo 50 was 9999/- during GIF and had all those features along with a good processor and another one was Redmi note 11. But I found that if I can extend my budget a little more with all coupons and bank offer I can get a Redmi note 11 with 6gb RAM at 11749/- . 6gb RAM is always preferred over 4gb RAM because nobody knows whether with future updates the OS would demand more RAM or not, also the softwares may require more RAM as time passes away. So this was the only option I knew then available.Redmi note 11 has AMOLED Display, I am not bothered with 60Hz, 90Hz,120Hz. I keep the refresh rate at 60Hz and display works without zero lag or stutter. All my Desktop screen has 60Hz refresh rate and I am happy with them so why do I need a 90 Hz screen? I think this is all just gimmick marketed by companies and online reviewers. The display has excellent colour reproduction capability and colours look rich. You can adjust colour temperature to warm or cool but I think standard is fine for me. Also you can calibrate display colours in settings but I think you don't need that. Display size is 6.43 inch it could have been better if it were 6.7 inch. I prefer big display phone. Redmi note 12 has that big display. A plastic screen protector is pre applied on screen and I am happy with that. The screen protector feels smooth and fingerprints can be easily removed by wiping with a damp cloth. The screen has a punch hole camera which looks good.This phone duel speakers. One is more powerful at bottom and another on top. But i think the second speaker is actually earpiece which amplifies while watching movies or YT. Bottom speaker is louder than top speaker and volume is good. What more do you expect from such tiny speakers!The phone has excellent wifi and mobile network reception. Many have complained about poor wifi connectivity but from my experience I can say my phone and Wifi modem stays at different floor, still I get good signal, and never disconnected. Voice over mobile network sounds nice and clear and the other party can hear you well and clear. However because the second speaker is an extension of earphone piece the sound will leak if the other person is shouting over phone.The phone has 5000mAh battery and comes with 33W charger which is a bonus at this price point. The battery gives long backup. With good mobile network you can use it for 3 days without charging using basic features, like phone, sms, email, FB, WA etc. But I charge it regularly and battery charge never drops below 70%.The phone has SD680 processor which is more that enough for basic tasks and performs well without any lag. The experience is butter smooth. However the apps get automatically cleared from RAM which I like because I don't have to clear RAM manually. However after Android 12 update the RAM hold App for longer time but eventually cleared. SD 680 doesn't heat up and it is very energy efficient. Because of that battery drains very little and 33W charger charges phone within 30 mins for my usage. The cable is USB A to C and feels good.This phone has IR blaster so in your home office you can control AC or other supported gadgets with this phone when remote is unavailable.This phone has DDR4X RAM and UFS 2.2 storage. The RAM is 6GB and can be expanded additional 1 GB as virtual RAM by occupying storage. But I have disabled that option from settings because it increases SSD life. This has 2 Sim + SD card slot. Which is a great. Both SIM have VoLTE and carrier aggregation.The phone has beautiful back and colour is attractive. Some people may complain about plastic But remember plastic back phone has better network reception than metal or glass back phones. And I have no problem with plastic. I don't think plastic back makes your phone or you look cheap. I am happy with plastic back. The phone also gives a TPU cover and the cover however yellowing after i month. This is inherent chemistry of TPU, and no one can prevent this chemical degradation. How ever can be slowed by not exposing it to sunlight.The fingerprint scanner is excellent it works flawlessly. The touch screen is excellent too.However I dont like some of the preinstalled apps. Some can be uninstalled a few can't especially Mi pay and getapps from mi store. I don't like them. However I like the pre installed security app. There is no ad in notification  and all can be easily disabled. Camera at back is good and sufficient for me however the front camera is not good. Does not show pictures like 8MP camera. I have added some pictures clicked by Redmi note 11 back camera. MiUi is fluid and has many user friendliness like OneUI. MiUI is now free of Bugs and has an extremely polished version that will please the user.So I give Redmi 11 a score of 9.5/10. This is an excellent phone the I got at 11749/- during Great Indian festival. I recommend anyboy with basic usage to buy this phone. This phone is not for gamers or people who watch 2K, $k videos or shoot such things. This is not or those who are crazy for 5G. Otherwise this phone will fulfil your every requirement in this price segment.,50 days usage...1. Good battery LIFE. Bqest for day-day use. 33W charger also good.2. Best display but should've 120hz instead of 90.3. Sturdy in-hand feel4. Stereo speaker is loud and crisp(65-35 split).5. Camera above average... But good concerning the price.6. Buggy UI(minor) as expected. But ui13 all way better than bloody MIUI 12.5.7. 4G chipset SD 680, which is fine... 4G+ always available.8. Some minor issue with WiFi reception. Don't know may be they will fix it through OTA.*** THIS PHONE IS FOR PEOPLE WHO CLICKS PHOTOS HERE & THERE, CASUAL GAMER & BINGE WATCHERS OF WEB SHOWS/MOVIES... \"NOT INTENDED FOR HEAVY GAMING\"NOT FOR PUBG, COD LOVERS.,The first look of this starbust design is eye catchy...no word to express its design,in hand feel and and it's all physical dimension. the second this which impress me, it's battery backup.....even you playing game hardly for a long time....it gives you sufficient battey backup and charging speed also 33W, is also a good deal at this price. The third impressive factor is it's dual speaker....I have an another phone of 40k and the sound quality is almost same as it. Media playback experience is also enhanced by it's amoled display, very colour charming display...... literally the display quality is unbeatable. The camera notch and dual speaker increase the media playing experience. Other Performance like gaming is also good at this price point. Fingerprint button is also very responsive. All other things and features are good to the price point.Only one thing is very disappointing bcoz the hype of its camera that company shows is very up to the mark and professional photography but the camera is lower grade...even my old Redmi Y2 which I exchanged with this, had better camera than this ....So plz I request you to all .... don't buy this for camera....just don't. The images are shown of camera pictures on the website is illustration according to me......I don't recommend you to buy this phone as your camera phone.If you are non camera user then you will surely go for it.Pros- design, in-hand feel, battery and charging, amoled display,dual speakerCons- camera😤😤,Quite a smooth daily driver phone. The overall experience has been satisfactory, camera's good, durability also seems to be good, I've dropped it quite a few times & the gorilla glass 5 seems to be holding up. 120hz feels great. Charging speed is good too, nothing mind-blowing though. Battery life is decent. Lasts quite a bit, but since I keep it in the 120hz mode all the time, it's a little less for me. But I don't have any problem with battery life for now.,It does what the description says.Camera quality not upto the mark, compared to other redmi mobiles. Even A3 model clicks better pics.Finger print sensor is same as that of the lock  button. You need to press the lock button every time to get the fingerprint read.Volume is good for both call and streaming.Fast charging but charger gets heated soon.Battery back up is good, unless you don't do heavy gaming and all day video sreaming.Dual app and dual space option is missing.Light weight and good video resolution.Overall good for learning students for online sessions and persons with less need for photography & gaming.,I bought this for my dad and it's working good for him, if you are planning to give it to your parents or elderly people in your family just install third party launcher and hide unnecessary app aslo turn off spamming notification and lockscreen ads overall good Phone for elders or first time smartphone user.,Phone is good, but i facing weird bugs due to software issues. After that i manually installed latest global software then working fine.When i was using indian firmware, after the update the phone got into bootloop every 10 sec, but after manual installation its working fine", "img_link": "https://m.media-amazon.com/images/I/4121yWSVFmL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Redmi-Starburst-Qualcomm%C2%AE-SnapdragonTM-Included/dp/B09QS9X9L8/ref=sr_1_199?qid=1672895806&s=electronics&sr=1-199"}
{"product_id": "B0B6BLTGTT", "product_name": "Noise Pulse 2 Max Advanced Bluetooth Calling Smart Watch with 1.85'' TFT and 550 Nits Brightness, Smart DND, 10 Days Battery, 100 Sports Mode, Smartwatch for Men and Women - (Jet Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹2,999", "actual_price": "₹5,999", "discount_percentage": "50%", "rating": "4.1", "rating_count": "7,148", "about_product": "Massive 1.85\" display: See everyday data clearly under the brightest sun on the 1.85'' TFT LCD that sports 550 nits of brightness and the highest screen-to-body ratio.|BT calling: Talk directly to your loved ones from your wrist; manage calls, access your favourite contacts and dial from the dial pad.|Tru Sync: Now connect with the world in a smart way, thanks to Tru Sync technology that ensures faster and stable connection and low power consumption.|Smart DND: Take a break when you want to and get uninterrupted sleep time.|Noise Health Suite: Get started on your fitness journey with a whole range of wellness features in Noise Health Suite and 100 sports modes to support you.|NoiseFit app: Manage your day-to-day life better with the NoiseFit app at your disposal.|150+ cloud-based watch faces: A new day calls for a new face, choose from over 150+ cloud-based watch faces and don a new look every day.", "user_id": "AHVEG7WUVHTOAT7YZ2Z6VNJCBYYA,AFX7Y424L7A2WXEKEFTRAATHZTGA,AGKVBPWUJ5SHPUHQCCYNHWBISW5A,AEC2T4BCBJLQGM6767M73GQX6THA,AEUUGGQ72VZ33Y4WLZKDODUA3XZA,AGGHAVSNZUQC5BOOK56TT6TQJSGA,AEZX46Y3IHTKWR3QYFI34XQKFJ6Q,AEZZ4FRTICGTE5ELNL2IAZYRH3QQ", "user_name": "Amazon Customer,Abhinay Kanth D M,Himanshu,Aadi Raj Uthup,Gaurav,Kiran das,Santosh Bakare,Suman Sharma", "review_id": "R2G9RHDQN3S511,R3GFHK3HJ4FRRZ,R3QKL6QNRFS6T,R1JGF7WFAYR6SA,R3QMM0HI96HW0Z,R3OW5MN95Z8BDO,R1NBO3NP1WH1V8,R9DM4KZATOPQE", "review_title": "Value for money smartwatch for those interested in tracking their physical activity.,Noise pulse2max smart watch is awesome and looks good,Paisa wasool,One of the best smartwatches in this segment,Noise,Touch,Good value for money,Best budget segment fitness watch", "review_content": "Linking the smart watch to my mobile phone was not as seamless as is to be expected for such a product. Once it was set up it works flawlessly. However, the NOISE smartwatch app on my Google does not give any data on sleep cycles and neither is there any information on how to transfer the data to another useful app such a Google Fit.,Noise pulse2max smart watch is awesome and looks goodOnly one default battery life 4 days is coming with notificationsWithout notifications it is coming upto 8 days,Packaging was not proper the package having full of oil in the package  but the brand packaging was proper so no issues with the productAfter using more than 4 months the product is really impressive and having good battery life and accuracy and the quality of calls on smartwatch are the best,I've been using the product for a while now and I gotta say I love it. The battery lasts around 4-5 days not 10 days, you do get around 10 day battery life if you disable almost all the features of the watch like heartrate sensing and not connecting it with your phone. The watch requires more software support and they should add more watch faces...,Nice product. Value for money totally !!,Good product,The calling feature at such a price point is definitely a plus, the health features are a bit not upto the mark but manageable. The screen is responsive but a bit low res.,https://m.media-amazon.com/images/I/61vikO9CUdL._SY88.jpg", "img_link": "https://m.media-amazon.com/images/I/41u0PC4NajL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Noise-Advanced-Bluetooth-Brightness-Smartwatch/dp/B0B6BLTGTT/ref=sr_1_202?qid=1672895806&s=electronics&sr=1-202"}
{"product_id": "B077Z65HSD", "product_name": "boAt A400 USB Type-C to USB-A 2.0 Male Data Cable, 2 Meter (Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹299", "actual_price": "₹999", "discount_percentage": "70%", "rating": "4.3", "rating_count": "20,850", "about_product": "2 meter special reversible Type-C to USB A male user-friendly design helps you insert the connector in a right way all the time|Data sync and charge for apple new MacBook 12 inch, nexus 5x, nexus 6p, OnePlus 2, pixel c, Lumia 950, Lumia 950 xl, Nokia n1, Chromebook google pixel, Asus zenphone3 and other USB-c devices|Support the maximum 3A fast charging and the speed of data sync up to 480 mbps|Aesthetically designed, aluminium ends, with high-density boAt's premium nylon braiding wrapped around the entire length of the tangle free cable for reinforcement and added durability|One end normal USB type a and other end USB type c", "user_id": "AH3LHRL5P4YAVOQQCH72G2PJFXSA,AFA332YHUPB6I7KMME7SOFX5RKQQ,AGUUHLF34AIEIOE5KULXXVWKBCMA,AEYA6LQE25O2P6C7XV62XM3YV2EQ,AHWY6IG3PXBBJMLVFMHHKM25BVCQ,AEOKB3ECJUM6UQOBFKMEMQVVHL4A,AHMKSLALVS62JUHSHAI3FUXWDYYA,AFZIZOK5KDBOB5QCHUQRR2ZWUYKA", "user_name": "Amazon Customer,GHOST,A Vase,Ganesh Inguva,Mani Jha,Anu B,Prabhu,Amazon Customer", "review_id": "R1DXRMVWV2OVE8,R1G4I5FLAHM16P,R2BJFG3I9TAZ2P,R2WKO9Y6VGUOOP,R35RERUQG5AERU,RQVMA35UH4D2P,R1NECHJ8DC9INS,RDDDU5N0JHZS7", "review_title": "Quality is good,Just buy it dont even 2nd guess it,Nylon braided quiet sturdy,Sturdy and durable. Useful for charging Power Banks,Amazing,Feels like steel harnessed wire - strong,good,Nice quality", "review_content": "Ok with charging. Looks very sturdy and durable.,One amazing cable for 300 bucks,Fast charging upto 25watts 2m in length and really durable.Bought it like the 4th time passed down my older cables to family members all still in working state.,Great product. Wanted this as my Portable battery has USB slot and iPad and Kindle Reader have USB-C ports. Fits my requirement perfectly. Charges very fast.,I bought it in 2019 and it almost last three years post heavy usage... Gonna buy it again! Very good quality,Good quality USB C Charging cable that enables Fast Charging for Samsung M21 as well as M33 5G 24 W seeking phones. 2 metre cable length helpful in keeping phone on desk while Charging Adaptor plugged into Electric Outlet. Best value. Similar 2 m cable costs 3x or 4x in retail market. This is best price,good,Very good overall", "img_link": "https://m.media-amazon.com/images/I/41jk4zYjTsL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/A400-Type-C-Cable-Meter-Black/dp/B077Z65HSD/ref=sr_1_204?qid=1672895806&s=electronics&sr=1-204"}
{"product_id": "B09W5XR9RT", "product_name": "Duracell USB C To Lightning Apple Certified (Mfi) Braided Sync & Charge Cable For Iphone, Ipad And Ipod. Fast Charging Lightning Cable, 3.9 Feet (1.2M) - Black", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹970", "actual_price": "₹1,999", "discount_percentage": "51%", "rating": "4.4", "rating_count": "184", "about_product": "1.2M Tangle Free durable tough braiding sync & charge cable|Supports iOS devices with max output up to 2.4A|Ensure fast and stable data transmission up to 480 Mbps|Up to 10,000+ bend and 10,000+ plugging and unplugging test ensure this cable a longer lifespan|Compatible designed to work flawlessly with MFi or apple devices, iPhone, iMac, iPad etc.|2 Years Warranty", "user_id": "AHZWJCVEIEI76H2VGMUSN5D735IQ,AH2DFUHFTG4CKQFVGZSB4JHXSAWA,AGYTSAUTXMOPROERNJPXNEB2XWNQ,AF5JWNCDVWTXOFCICR6IYNOEQENQ,AEEFM3W6RGC2KDYG5B6N7VQXR4QA,AGRT55DXEGF2EOL63HOKKKBB2KFA,AF6R7AMFHIWTMNFF6WPGFDOF7Z5A,AEGXNM3XGAHJGUJ7MIFPE7QFMJHA", "user_name": "Amazon Customer,Govind Gujarathi,Vihari,shalem,Tejas,RADHA krishanan,Vasudeva Govindraju,Amazon Customer", "review_id": "R1Y30KU04V3QF4,RK3DSUGKIZT8Z,R3BIG7J6V2JZTU,R1QI1HTJPGLS5O,R3SETXTOZ47CM4,R10SL1Q7F6CHBK,R1CBYX6RCGU739,R3PGNXSPA35NB3", "review_title": "Very good product.,Using as a spare cable in car,Sturdy, Durable, Fast Charging!,Good brand,It’s like original apple cable,One of the best wire ..,Super well build. Quality product worth the money,Good product", "review_content": "Fast charging.,Cable seems to be of good quality, not used much as I keep it as backup in my car.,It’s good, sturdy & durable!It supports fast charging!Only thing is it’s a little expensive!,Nice product,I am writing this review after 10 days usage of this product and I found it very durable and sturdy. It is also good for travelling where you have to keep it in the bags without any kind of box. I would recommend it to all.,Best wire type c to lighting connector go buy worth of money,Value for money,I am happy with product. Quality is good. Durable.", "img_link": "https://m.media-amazon.com/images/I/4177nw8okbL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Duracell-Lightning-Certified-Braided-Charging/dp/B09W5XR9RT/ref=sr_1_205?qid=1672895806&s=electronics&sr=1-205"}
{"product_id": "B084DTMYWK", "product_name": "Myvn 30W Warp/20W Dash Charging Usb Type C Charger Cable Compatible For Cellular Phones Oneplus 8T 8 8Pro 7 Pro / 7T / 7T Pro Nord And Oneplus 3 / 3T / 5 / 5T / 6 / 6T / 7", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|WallChargers", "discounted_price": "₹329", "actual_price": "₹999", "discount_percentage": "67%", "rating": "4.2", "rating_count": "3,492", "about_product": "Never slows you down:We’ve custom engineered our OnePlus Warp Charge 30 Power Adapter to be surprisingly clever. Integrated circuits are built into the adapter itself, so heat is dissipated before it ever reaches your phone.|FASTER AND SAFER:This means faster, safer, and cooler charging that never slows down – even while you’re browsing, gaming, or doing anything else you enjoy on your OnePlus device.|Power whenever you need it:Our ultra-fast charging technology makes overnight charging a thing of the past. Simply plug in your OnePlus 7 Pro for 20 minutes for enough power to get you going, without having to worry about your device slowing down or overheating|BACKWARDS COMPATIBLE:The Warp Charge Power Adapter for OnePlus 7 Pro / 7T / 7T Pro and is backwards compatible with previous OnePlus devices, offering DASH CHARGING speeds.|Disclaimer: Please charge WARP/Dash Charge-enabled devices exclusively with the official WARP/Dash Power Adapter and Dash Type-C Cable", "user_id": "AFXUMOU3PMUQEHSYTB7SBVYFN34Q,AFJBVZGNIZISS2EGIUZRHMIDD7AQ,AGLIJTPBLLORZ2E35K2DFO3V3FXQ,AF5JPNCVJVCR3EMLVNG3MERJYU3Q,AFZDR5KNLP6HTBN33LC3AZ472J5A,AEKW5FURRS4HCH6MS7RL7FI2GC6A,AGKBXNKA52CUF4OZMIFDDTKVI6LA,AHILS5IGSFXF4SM2DAOB4LLULPHA", "user_name": "Mukul Ghosalkar,R. V,Deepak kumar,Nikhil Dalvi,HIMANSHU JOSHIYARA,Akanksha Srivastava,Amazon Customer,Sathees", "review_id": "R3JPYH668MK3JJ,R2PR9B2W94FLT2,R1P08EMGTQXLEZ,R2RS93VMF3PSHS,R3TJKDUB3GKBQ8,R1PKZ6WASMYMSG,RZV7UUDKB6JRH,R2Y3US2UNMI3UR", "review_title": "Good Quality,Good one,Good,Decent buy,Value for money,Product worth buying,Lasted for 5 months,It fullfilled my expectations.. Looks awesome..", "review_content": "Good Quality. Works well. It shows warp charge on phone when charging. 4 start only coz the charging is a bit slower (about 20%) than the original.,Value for Money,Good 👍, but not like original,Over all good product. Decent buy,Very good product,Value for money,This cable i bought in July'22 end and in December mid 22 it stopped working. Not durable and not value for money for 330rs of cable lasted hardly for 5 months.,Original one plus type c cable cost around 800rs. So went to have a decent one. But received this product with almost same as original. I will write once I start using this for a while. But my first impression on this product is good. It supports warp charge 30W. Looks steady. Good built", "img_link": "https://m.media-amazon.com/images/I/41kwROGAMEL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/MYVN-Charging-Compatible-OnePlus-Charge/dp/B084DTMYWK/ref=sr_1_208?qid=1672895806&s=electronics&sr=1-208"}
{"product_id": "B0B53QLB9H", "product_name": "PTron Newly Launched Force X10 Bluetooth Calling Smartwatch with 1.7\" Full Touch Color Display, Real Heart Rate Monitor, SpO2, Watch Faces, 5 Days Runtime, Fitness Trackers & IP68 Waterproof (Blue)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,299", "actual_price": "₹5,999", "discount_percentage": "78%", "rating": "3.3", "rating_count": "4,415", "about_product": "Bluetooth Calling Smartwatch: Make & receive a phone call directly using Force X10. 1.7 inches 500 NITs color screen with full touch display - capacitive touch, supporting taps & swipes..Band Width:2 centimeters.Water resistance depth:1.5 meters|Health/Fitness Trackers: Realtime Heart Rate Check; SpO2 Blood Oxygen; Sleep Monitor; Sedentary Alert; Sports & Fitness Tracking; Step Count & Calories Burnt; Distance Traveled; Sports Mode|Smart Features Smart Notifications on Your Wrist; Listen to Music on the Watch; Camera Remote Control; Raise & Wake Display; Weather Info; Find the Watch; Stopwatch & Alarm; Voice Assistant support|150+ Custom Watch Faces to match your Style; Lightweight Metal Casing; Skin-friendly Flexible Strap; up to 5 Days Runtime; 10 Days Standby; IP68 Dust, Dirt & Waterproof; Changeable Silicone Strap|Built-in Mic & Loudspeaker; Vibration Alert; Bluetooth 5.0 with 10 mtrs Wireless Range; Use pTron Fit+ App; Compatible with Android 8.0 & above/iOS 9.1 & above; Just 3Hrs Charge Time; 1-Year Warranty|Download & install \"pTron Fit+' App from Playstore/Appstore, Turn On Bluetooth on your phone, and bind the smartwatch to the App. Enable functions like Message Push, Wrist Sense, Do not Disturb, etc.", "user_id": "AH7LW3BCJBLCZTMWBOFL33UGIRBQ,AFSJYBGBY2U6KAAUR23KS3COL5SQ,AGCLLMGPNMO4IGCQ4253BICGDADQ,AHHC3QIX44VPXBB4HHGJ2RNFV67Q,AGBJ6SKHL3RD37OYZ54U52DAIIPA,AHDPRYTLYXKEPSTVF2LRV5SQJIYQ,AEIQA6TZQ4Y2SMVJTGE27G4MGBXA,AHE7VTTWP3YUKXVDZDJP6NZUIHLQ", "user_name": "anurag,Nirmal Singh,Vikas Keshavrao Vanave,K. Sarath,Abid Hossain,Mahesh Kumar,Amazon Customer,Vinay Kumar Sadhula", "review_id": "RZ7HZPPMZP6NJ,R3UU1TR7386E57,R3IX0H9MIZUJNR,R14GI2JBIZGJ61,R1U84J3FQUIM6L,R2ENIZDLLQ21KM,R2XNZ6AHVRFG25,R1JHP7LI8PMNM", "review_title": "just a watch not smart one... all features are to make fool of  you,Worst watch, connecting problem with phone nd automatically disconnecting from phone.,Very good quality of product and price is very low.,Good,ভালো,Damaged product supplied later on exchanged,Battery life less.,Amezing", "review_content": "just a watch not smart one... all features are to make fool of  you,Worst watch,  connecting problem with phone nd automatically disconnecting from phone,Very good quality of product and price is very low.Very good,,ভালো ঘড়ি টা।,Dislike,After use of 2 months observed battery life is getting only one day max with only normal usage with out audio.Ok for regular usage,Superb", "img_link": "https://m.media-amazon.com/images/I/41GXZy6dLIL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/PTron-Force-Bluetooth-Smartwatch-Waterproof/dp/B0B53QLB9H/ref=sr_1_209?qid=1672895806&s=electronics&sr=1-209"}
{"product_id": "B0BDYW3RN3", "product_name": "SanDisk Ultra® microSDXC™ UHS-I Card, 256GB, 150MB/s R, 10 Y Warranty, for Smartphones", "category": "Electronics|Accessories|MemoryCards|MicroSD", "discounted_price": "₹1,989", "actual_price": "₹3,500", "discount_percentage": "43%", "rating": "4.4", "rating_count": "67,260", "about_product": "Ideal storage for Android smartphones and tablets|Up to 150MB/s transfer speeds to move up to 1000 photos per minute|Load apps faster with A1-rated performance|Class 10 for Full HD video recording and playback|Compatible with SanDisk MobileMate USB 3.0 microSD card reader", "user_id": "AG44HJB2AMIVHAGQZ2WGWONERKCA,AHL2FABQV6XAHZN547DN662X5RWA,AHJE6QFY5XEOZJJWOIOHHIDFWWFQ,AEDMSJ2CEQZID62NXPKEQLMBG2LQ,AHF7ZBKNBLCLFHGJG5KXKPI7QVCQ,AGD2S7EXXSXHBCJHTXUAV6FLXAZA,AHZRUY7MR4SVM3HFJ2SZDGHZJ56A,AHEHKOZPPOVYL75KDU52PSBYDEFQ", "user_name": "Prashant,Sumesh Sundararajan,Vijay Baitha,S.k nahak,Vikram Kumar,Manish,Jm,amit nayak", "review_id": "R2A7MIUNOW8DOE,R2FXP703540FR1,R37E7QJET0BYE8,R1NOL0GE16P06G,R48EN3ANVWEX9,R17WYXS17TYDER,R2BMYAH01K8EG8,R23IO3LHHG39H", "review_title": "Fake Product,Costly but excellent quality,Storage good but don't know how to Activate warantee??,Good for use,5 stas nahi diya kyuki capacity 477gb hi rahta hai,Speed not as advertise,Good one,It's ok", "review_content": "128GB SD Card is showing 134GBDon't buy this product,It was a bit costly but prouduct is of great quality. Could have been made little bit cheaper cost wise.,All good,Fast and smooth,Ab mujhe computer ki jarurat nahi padti,Speed is fast but not as advertise I get around read speed 70MB/s and write speed 30MB/s,Good one,Product is ok.", "img_link": "https://m.media-amazon.com/images/I/41g54hBpHkL._SY300_SX300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/SanDisk-Ultra%C2%AE-microSDXCTM-Warranty-Smartphones/dp/B0BDYW3RN3/ref=sr_1_210?qid=1672895806&s=electronics&sr=1-210"}
{"product_id": "B0B3RS9DNF", "product_name": "Fire-Boltt Phoenix Smart Watch with Bluetooth Calling 1.3\",120+ Sports Modes, 240*240 PX High Res with SpO2, Heart Rate Monitoring & IP67 Rating", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,999", "actual_price": "₹9,999", "discount_percentage": "80%", "rating": "4.3", "rating_count": "27,704", "about_product": "Fire-Boltt is India' No 1 Wearable Watch Brand Q122 by IDC Worldwide quarterly wearable device tracker Q122.【Bluetooth Calling Watch】- Fire-Boltt Phoenix enables you to make and receive calls directly from your watch via the built-in speaker and microphone. This smartwatch features a dial pad, option to access recent calls & sync your phone’s contacts.;【High Resolution Display】- Comes with a 1.3\" TFT Color Full Touch Screen and a 240*240 Pixel High Resolution this watch is covered to flaunt the sleek and stylish look always.|【120+ Sports Modes】- Track each activity effectively with this smartwatch & activity tracker. Track your calories, steps and much more while you are on your fitness journey. This fitness tracker has it all;【In Built Mic & Speaker】- Get HD calling experience with this power-packed watch. Enhance the look of your wrist with attractive colors and sleek finish|【Smart Health】- With the latest HRS3300 technology track your heart rate anytime of the day or even while you perform some activity. The optical sensors assure results so accurate. Monitor your blood oxygen levels to stay fit and healthy;【Smartphone Notifications】- Get all your mobile phone notifications on this 1.3\" Round Display Full touch smartwatch and never be late for a meeting, party or date.|【Gaming On Wrist】- Enjoy playing games on the wrist itself as you are on the go. 【Breathe Function】- Ensure your breathing exercise is fit and healthy with the breathing function.; 【Multiple Watch Faces】- Over 100 Cloud based watch faces to choose from and match your outfit and look each day everyday|Included Components: 1 Smartwatch, 1 Manual, 1 Magnetic Charger, 1 Warranty Card; Compatible Devices: Smartphonetabletiphoneandroid; Human Interface Input: Buttonstouch Screen; Clasp Type: Tang Buckle; Color Name: Silver Grey; Band Color: Grey; Band Material Type: Silicone; Case Material Type: Stainless Steel **Disclaimer** The Charging USB needs to be connected to a 4.7V to 5V charging adapter for best battery backup", "user_id": "AHUGCKS7YANTMDYINXQG2UDTU4JQ,AGHQ2VHXMPWZV5SV25S5N3OENXSQ,AH3GZWZM5RVOFCJCXRU7QFBAJ5NQ,AGQ2RWOECSEFEQMIGE7VTXP65OKQ,AEVUBEFT2MRH2PRVW53SJEL7H42A,AENY7L4XGCQMI627A27G3NVIBJNA,AHQISETKX3OXMZ4IX3YO7YV4UZ6Q,AGESGUTIYJQOZ7PU563DHLYSPRTQ", "user_name": "yogita ratre,Arun k.,Amol Basutkar,janarthanan,Naman,keshav Chelmeti,Hritik jain,Jatin Shah", "review_id": "R34816YEM3Y2VJ,R3P1QZDIWJJYVR,R2HXC35HKL6S3E,R2CUWR6SL0MMRR,R3PWLUFNP117X0,R2PK2034NVCPNH,R2YJZKVTCUJAVZ,R27X5G6UFUKCM9", "review_title": "7-8/10, Decent, good for day to day use,Good choice under budget of Rs2000,Average product.,Budget friendly,Overall it's a good watch,Good product,Best in design, accuracy and looks fancy. A must buy for every person who is watch enthusiast.,Having a great experience", "review_content": "2 months review- its been working fine, there's been no problem as of now.. some things-the whole step tracking thing, i bought it due to that reason, it didn't basically satisfy me to that level with that, but it does count steps accurately in the walking mode(activity)Its got some scratches in it.. but its not that noticeable at first glancethe backgrounds, I believe it could've been wayyyy better if we could change 4-5 backgrounds of 10, but we can only have 2, 1 customised and 1 download from the app(which has limited options)  the other backgrounds are just.. eh..the looks, I'll give it 9/10, it's good looking stylish differenttouch screen is goodthe sleep tracking too is kinda accurate(i still haven't understood it that well lol)battery life is muah, I use it without Bluetooth and it easily survives for 6-7 daysspo2 and heart rate, I just believe what it says as i can't check prove if that's correct.the water resistance, I haven't used it in water (ofc am scared) the calling feature works fine.. its got good sound overall its a decent watch and can be used in day to day activities, am quite satisfied with it as my first smart watch 😗,I've used this product for 4 days, and i'm going to rate the various features and different aspects of this smartwatch which could help the customers here -So, Bluetooth calling (4/5) - the in-built mic of this watch is excellent and the voice gets to the other side without any disturbance, watch connects smoothly with the mobile and don't get disconnected automatically until you do it yourself through watch or phone. Only con is you can't silent the incoming call which is annoying sometime, hope they fix it with an update.Built quality and looks (4.5/5) - metallic built which looks premium and straps are also quite smooth and comforting. Best thing is, it also looks good over skinny wrists(poor me, with 5.6 inch wrist). Only con is you can get scratches on display so protect with it some sort of screen guard.Touch screen (5/5) - it's almost buttery smooth without any lag which is pretty impressive for a smartwatch under 2k. I bet you will not get any laggy experience ever.Accuracy (3.5/5) - SpO2 and HR has fairly decent accuracies, it gives you a rough idea of your being, so its quite reasonable for a watch under 2k. Count steps with decent accuracy as well. Sleep accuracy is also just acceptable.To sum up, you should definitely go for this watch if you've a budget, constrained under 2000 rs,,I recently purchased the Fire Bolt Phoniex watch, which is quite stylish, and the Bluetooth calling is excellent. The voice gets to the other side without any disturbance.The build quality is good over the wrists, but you can get scratches on the display, so protect it with some screen guard. You should go for this watch if you want a budget-friendly smartwatch under 2000.,It's a good watch but i have faced two problems in it the first one is there is no feature of raise to wake and the second one is there is no option to silent it when someone calls you.....i think you should purchase it if in future company add these two features...,I recently purchased the Fire Boltt Phoenix Watch, and I am very happy with my purchase. The watch is quite stylish, and I get compliments every time I wear it. The watch is also quite comfortable to wear, and the strap is adjustable to fit any wrist size. The watch also has a great battery life, and I can go for days without having to charge it. The watch also has a number of features, including a step counter, heart rate monitor, and sleep tracker. All of these features are very useful and make it easy to track my activity and health. Overall, I am very pleased with my purchase and would highly recommend the Fire Boltt Phoenix Watch to anyone who is looking for a stylish and functional watch.,This watch is absolutely stunning and great value for money. Really pleased with the design and shape of watch, definitely a must buy for every person .loved the colour, durability and accuracy is super 👍. just go for it.,I liked the product it has so many features like sleep tracking, sp02, Heart rate measuring, music player, temperature checker my only nitpick would be that it only have 2 games and secondly it has good wallpapers but a Ben 10 Omnitrix wallpaper would give it an even more awesome look", "img_link": "https://m.media-amazon.com/images/I/41vjHoqVHJL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Fire-Boltt-Phoenix-Bluetooth-Calling-Monitoring/dp/B0B3RS9DNF/ref=sr_1_214?qid=1672895806&s=electronics&sr=1-214"}
{"product_id": "B09QS9X16F", "product_name": "Redmi Note 11 (Space Black, 6GB RAM, 64GB Storage) | 90Hz FHD+ AMOLED Display | Qualcomm® Snapdragon™ 680-6nm | 33W Charger Included", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹12,999", "actual_price": "₹18,999", "discount_percentage": "32%", "rating": "4.1", "rating_count": "50,772", "about_product": "Display: 90Hz FHD+ (1080x2400) AMOLED display; 16.33 centimeters (6.43 inch); 20:9 aspect ratio|Camera: 50 MP Quad Rear camera with 8MP Ultra-wide, 2MP Macro and Portrait lens| 13 MP Front camera|Battery: 5000 mAh large battery with 33W Pro fast charger in-box and Type-C connectivity|Processor: Qualcomm Snapdragon 680 Octa-core; 6nm processor; Up to 2.4GHz clock speed|Memory, Storage & SIM: 6GB RAM | 64GB UFS 2.2 storage expandable up to 512GB with dedicated SD card slot | Dual SIM (nano+nano) dual standby (4G+4G)", "user_id": "AEJLOEHISUISLO2Z4RE2TO2V6NGA,AEJ4UYFD3M2WGB3WEQJOZ3GGJY7Q,AFJ3CVFC3MO2Z3MYQTCELWT4TTKQ,AEEBECR65JN34YC7NEJIFAQB67TQ,AE5XN2CICXIBA4IK6F4ONOJ6TOCA,AGUZQN2LWKQXLXBJO2NRTXGV7EUA,AHWQSD5JHCOHW7JYN7F52ABQCJQA", "user_name": "Meghnad,Partha Dey,JAIDEV CHOUDHARY,Mayank Singh,JeneZ,chetan kamerkar,Gangadhar", "review_id": "R1GQJYYLCFOXJ8,ROASRYCFUFCK0,R1M63KP70YH4TU,RV26OEPPLTVTZ,RAS4252SOW901,R1EQV38U53I993,RD4X602L8KNNS", "review_title": "Excellent Phone in the budget segment,Best value for money... But afraid of future MIUI updates.,Don't purchase it as camera phone 😤,Dependable & it's been a year.,Budget mobile,Good for basic use,Phone is nice , but software is not", "review_content": "I was looking for a phone below 10K. I am not a person who believes to burn money for phones. My requirement was a phone that has good network reception, good wifi reception, a balanced software, good battery life, good screen that don't strain eyes, a good hardware, 3.5 mm headphone jack, and a charger. i don't need 5G network because 5G drains battery a lot and 5G spends too much data. I don't watch movie or YT on mobile network and I wonder how many does watch FHD, 2K, 4K videos over mobile network. For downloading documents, social networks, banking apps 4G is more than enough.In my budget I found all phones have 4gb RAM. Realme Narzo 50 was 9999/- during GIF and had all those features along with a good processor and another one was Redmi note 11. But I found that if I can extend my budget a little more with all coupons and bank offer I can get a Redmi note 11 with 6gb RAM at 11749/- . 6gb RAM is always preferred over 4gb RAM because nobody knows whether with future updates the OS would demand more RAM or not, also the softwares may require more RAM as time passes away. So this was the only option I knew then available.Redmi note 11 has AMOLED Display, I am not bothered with 60Hz, 90Hz,120Hz. I keep the refresh rate at 60Hz and display works without zero lag or stutter. All my Desktop screen has 60Hz refresh rate and I am happy with them so why do I need a 90 Hz screen? I think this is all just gimmick marketed by companies and online reviewers. The display has excellent colour reproduction capability and colours look rich. You can adjust colour temperature to warm or cool but I think standard is fine for me. Also you can calibrate display colours in settings but I think you don't need that. Display size is 6.43 inch it could have been better if it were 6.7 inch. I prefer big display phone. Redmi note 12 has that big display. A plastic screen protector is pre applied on screen and I am happy with that. The screen protector feels smooth and fingerprints can be easily removed by wiping with a damp cloth. The screen has a punch hole camera which looks good.This phone duel speakers. One is more powerful at bottom and another on top. But i think the second speaker is actually earpiece which amplifies while watching movies or YT. Bottom speaker is louder than top speaker and volume is good. What more do you expect from such tiny speakers!The phone has excellent wifi and mobile network reception. Many have complained about poor wifi connectivity but from my experience I can say my phone and Wifi modem stays at different floor, still I get good signal, and never disconnected. Voice over mobile network sounds nice and clear and the other party can hear you well and clear. However because the second speaker is an extension of earphone piece the sound will leak if the other person is shouting over phone.The phone has 5000mAh battery and comes with 33W charger which is a bonus at this price point. The battery gives long backup. With good mobile network you can use it for 3 days without charging using basic features, like phone, sms, email, FB, WA etc. But I charge it regularly and battery charge never drops below 70%.The phone has SD680 processor which is more that enough for basic tasks and performs well without any lag. The experience is butter smooth. However the apps get automatically cleared from RAM which I like because I don't have to clear RAM manually. However after Android 12 update the RAM hold App for longer time but eventually cleared. SD 680 doesn't heat up and it is very energy efficient. Because of that battery drains very little and 33W charger charges phone within 30 mins for my usage. The cable is USB A to C and feels good.This phone has IR blaster so in your home office you can control AC or other supported gadgets with this phone when remote is unavailable.This phone has DDR4X RAM and UFS 2.2 storage. The RAM is 6GB and can be expanded additional 1 GB as virtual RAM by occupying storage. But I have disabled that option from settings because it increases SSD life. This has 2 Sim + SD card slot. Which is a great. Both SIM have VoLTE and carrier aggregation.The phone has beautiful back and colour is attractive. Some people may complain about plastic But remember plastic back phone has better network reception than metal or glass back phones. And I have no problem with plastic. I don't think plastic back makes your phone or you look cheap. I am happy with plastic back. The phone also gives a TPU cover and the cover however yellowing after i month. This is inherent chemistry of TPU, and no one can prevent this chemical degradation. How ever can be slowed by not exposing it to sunlight.The fingerprint scanner is excellent it works flawlessly. The touch screen is excellent too.However I dont like some of the preinstalled apps. Some can be uninstalled a few can't especially Mi pay and getapps from mi store. I don't like them. However I like the pre installed security app. There is no ad in notification  and all can be easily disabled. Camera at back is good and sufficient for me however the front camera is not good. Does not show pictures like 8MP camera. I have added some pictures clicked by Redmi note 11 back camera. MiUi is fluid and has many user friendliness like OneUI. MiUI is now free of Bugs and has an extremely polished version that will please the user.So I give Redmi 11 a score of 9.5/10. This is an excellent phone the I got at 11749/- during Great Indian festival. I recommend anyboy with basic usage to buy this phone. This phone is not for gamers or people who watch 2K, $k videos or shoot such things. This is not or those who are crazy for 5G. Otherwise this phone will fulfil your every requirement in this price segment.,50 days usage...1. Good battery LIFE. Bqest for day-day use. 33W charger also good.2. Best display but should've 120hz instead of 90.3. Sturdy in-hand feel4. Stereo speaker is loud and crisp(65-35 split).5. Camera above average... But good concerning the price.6. Buggy UI(minor) as expected. But ui13 all way better than bloody MIUI 12.5.7. 4G chipset SD 680, which is fine... 4G+ always available.8. Some minor issue with WiFi reception. Don't know may be they will fix it through OTA.*** THIS PHONE IS FOR PEOPLE WHO CLICKS PHOTOS HERE & THERE, CASUAL GAMER & BINGE WATCHERS OF WEB SHOWS/MOVIES... \"NOT INTENDED FOR HEAVY GAMING\"NOT FOR PUBG, COD LOVERS.,The first look of this starbust design is eye catchy...no word to express its design,in hand feel and and it's all physical dimension. the second this which impress me, it's battery backup.....even you playing game hardly for a long time....it gives you sufficient battey backup and charging speed also 33W, is also a good deal at this price. The third impressive factor is it's dual speaker....I have an another phone of 40k and the sound quality is almost same as it. Media playback experience is also enhanced by it's amoled display, very colour charming display...... literally the display quality is unbeatable. The camera notch and dual speaker increase the media playing experience. Other Performance like gaming is also good at this price point. Fingerprint button is also very responsive. All other things and features are good to the price point.Only one thing is very disappointing bcoz the hype of its camera that company shows is very up to the mark and professional photography but the camera is lower grade...even my old Redmi Y2 which I exchanged with this, had better camera than this ....So plz I request you to all .... don't buy this for camera....just don't. The images are shown of camera pictures on the website is illustration according to me......I don't recommend you to buy this phone as your camera phone.If you are non camera user then you will surely go for it.Pros- design, in-hand feel, battery and charging, amoled display,dual speakerCons- camera😤😤,Quite a smooth daily driver phone. The overall experience has been satisfactory, camera's good, durability also seems to be good, I've dropped it quite a few times & the gorilla glass 5 seems to be holding up. 120hz feels great. Charging speed is good too, nothing mind-blowing though. Battery life is decent. Lasts quite a bit, but since I keep it in the 120hz mode all the time, it's a little less for me. But I don't have any problem with battery life for now.,It does what the description says.Camera quality not upto the mark, compared to other redmi mobiles. Even A3 model clicks better pics.Finger print sensor is same as that of the lock  button. You need to press the lock button every time to get the fingerprint read.Volume is good for both call and streaming.Fast charging but charger gets heated soon.Battery back up is good, unless you don't do heavy gaming and all day video sreaming.Dual app and dual space option is missing.Light weight and good video resolution.Overall good for learning students for online sessions and persons with less need for photography & gaming.,I bought this for my dad and it's working good for him, if you are planning to give it to your parents or elderly people in your family just install third party launcher and hide unnecessary app aslo turn off spamming notification and lockscreen ads overall good Phone for elders or first time smartphone user.,Phone is good, but i facing weird bugs due to software issues. After that i manually installed latest global software then working fine.When i was using indian firmware, after the update the phone got into bootloop every 10 sec, but after manual installation its working fine", "img_link": "https://m.media-amazon.com/images/I/411yU+n3UkL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Redmi-Storage-Qualcomm%C2%AE-SnapdragonTM-Included/dp/B09QS9X16F/ref=sr_1_218?qid=1672895814&s=electronics&sr=1-218"}
{"product_id": "B08HV25BBQ", "product_name": "Noise ColorFit Pro 2 Full Touch Control Smart Watch with 35g Weight & Upgraded LCD Display (Deep Wine)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,499", "actual_price": "₹4,999", "discount_percentage": "70%", "rating": "4.0", "rating_count": "92,588", "about_product": "The brilliant 1.3\" colour display is now full capacitive touch, supporting taps and swipes, so it is easy to read and operate. Watch case material : Polycarbonate. Scratch Resistant : Yes|Find, invite and add friends to your list; track their achievements and get fit together|9 sports modes to cover all your activities, whether you walk, run, hike, bike, treadmill, work-out, climb, spin, or perform yoga. Capacity - 210mAh, Charging Time - 2 hours|Log in to NoiseFit app and track your health and fitness details. Get insights on your progress and share your achievements with the world", "user_id": "AE3XH7AL52IBMYH77L5KO4DGTCDA,AHZHIHTLOMIHI5DFCYLT2ZIBMUCA,AEFZB452E6G2IGBYI3RXU7C5QGTA,AE56M2JBQC5JI3MSRAM3VTYP36HA,AEEVA2YRT3OJQTU2U7EWDW7EKPPQ,AHDGC4HI43BOPM4AH4NOT4SJNL2Q,AHQLC5YA473NA4RJFGR33PYO5GGQ,AHRP5SYVMJGYNSHAWBCS6AKC5VEQ", "user_name": "Vishal shah,Sameer,Joshilla P.,Sunil Govind Jawale,Pawan kumar,C.Rajeshkannan,Manisha tyagi,Wizzy", "review_id": "R2IUZKZ2BFCQPB,RS3FCMS4SCQ6V,R1DKS4CX2ELE9L,R2O8KBZUC4EB8A,RNT0QZ6SRDN5V,R3H9YQ6S3H3GLL,R3W56W4AW11KW1,RPJ5DDRIN3STD", "review_title": "nice product,Great watch,Ok ok,Nice 👍,Thik thak,Avarage,Smart watch,They can improve more", "review_content": "I really like this product. Gifted to my sister, and she likes it,Great ⌚,Good product,Nice 👍,Thik hai,In this price range it's ok product,Color so nice..I loved it,Need some more features:(", "img_link": "https://m.media-amazon.com/images/I/41zs4v3adaL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Noise-Colorfit-Pro-Control-Cloudbased/dp/B08HV25BBQ/ref=sr_1_220?qid=1672895814&s=electronics&sr=1-220"}
{"product_id": "B09LJ116B5", "product_name": "Redmi Note 11T 5G (Aquamarine Blue, 6GB RAM, 128GB ROM)| Dimensity 810 5G | 33W Pro Fast Charging | Charger Included | Additional Exchange Offers| Get 2 Months of YouTube Premium Free!", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹16,999", "actual_price": "₹20,999", "discount_percentage": "19%", "rating": "4.1", "rating_count": "31,822", "about_product": "Processor: MediaTek Dimensity 810 Octa-core 5G processor based on 6nm process with HyperEngine 2.0 and clock speed up to 2.4GHz;|Display: 6.6 inch FHD+ (2400x1080) Dot display with 90Hz high refresh rate and adaptive refresh rate technology; 240Hz touch sampling rate;|Camera: 50MP High resolution primary camera f/1.8 with 8MP Ultra-wide sensor| 16 MP Front camera|Battery: 5000mAh battery with 33W Pro fast charging support|Memory, Storage : 6GB LPDDR4X RAM | 128GB UFS2.2 Internal storage|Headphones jack:3.5 mm,Display type:LCD,Operating system:MIUI 12.5 based on Android 11", "user_id": "AGD5KTBDTS26I2SB3B7LCYBR6U3A,AFE2LQATN64EXU6NVTTEMV5XKDGA,AEJA3E7VLQFEQGJGJLV3KOZPXJMA,AEE6AOZ236TYFSCLGHGXIIG2SFUQ,AEZR42M5D6YTRJ732HWXBM5YEGKQ,AFCR3Q2LBT2KWRN42AOROJEDECNA,AET435JGPEIORB35LT7EZ4ASDRRQ,AENNEXWQZKHYRUEMUASXQG6O4GDQ", "user_name": "Kapil kumar,Rajendra K Jadhav,Nazaf beg,Jose Febin,suresh gaur,Rinku Barota,Jagdish Joshi,8826277722", "review_id": "R1A2H4LNTTSZKN,R29RZ6S6SY3H4F,R2MZ7BZ4991B7O,R125UHW97PT3OH,R1GNNZDXKP43DG,R1ZDKQ5659C68H,R36FYJ9DGL1QL1,R1IZDBZW18XJPH", "review_title": "Good 5g mobile,Overall good phone,The best phone in 2k22 I have purchased in 30sep,Works amazing and buttery smooth, design kinda boring though,Good,Overall good under this budget,not bad,Buy for normal daily use..", "review_content": "Good one display is good battery life is very good camera quality is good for me finger printer placement is not good can't be used with both hands,Using it from last 3 months now. Battery backup is good , camera is good and in this price range this is one of the good option as of now,The best phone in 2k22 I have purchased in 30sep but on 2dec my mobile stolen during this period I have used 7-8 hrs in a day continuesly but there's no lag problem battery life is good the speaker is not good I think in this mobile there is one problem I face,-Phone runs amazing with the dimensity 810 and I only have praise for the performance-90Hz refresh rate is eye opening coming from a 60hz phone-Build is pretty solid and the back has a nice texture that doesnt build up fingerprints much-Redmi has packed the phone with some neat features such as the IR blaster and the surprisingly amazing DAC which redmi didnt even flex about in the marketing. (my headphones sound miles better out of this phone than my laptop smh)-Included phone cover is alright and its nice of redmi to throw one in (hole around headphone jack couldve been bigger though as it interferes with any aux cables with chonky housings.)-Only complaints id have are that the design is kinda mid; doesnt look very amazing, but nothing to complain about either hmhm-Cannot comment on camera quality as I am a pleb who doesnt know how to nitpick at camera quality :P-Included screen protector is reaally bad( its only been under a month and there are already scratches around the lower screen where id be typing). So highly recommend peeling it off and taking your chances with the Gorilla Glass or just getting something aftermarketOverall strongly recommend if you're into a solidly built phone that focuses on getting stuff done rather than sitting around and looking pretty,Good,If you buy phone for camera purpose then don't buy this. But overall average mobile under this price. Battery backup very good and changing time apx 40-50 minutes for 1 to 100%.,good,It's a good product for normal daily use.Camera quality is not up to the mark.Overall a good product.", "img_link": "https://m.media-amazon.com/images/I/417k0DCw0GL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Redmi-Note-11T-5G-Aquamarine/dp/B09LJ116B5/ref=sr_1_221?qid=1672895814&s=electronics&sr=1-221"}
{"product_id": "B0BMVWKZ8G", "product_name": "Newly Launched Boult Dive+ with 1.85\" HD Display, Bluetooth Calling Smartwatch, 500 Nits Brightness, 7 Days Battery Life, 150+ Watch Faces, 100+ Sport Modes, IP68 Waterproof Smart Watch (Jet Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,999", "actual_price": "₹8,499", "discount_percentage": "76%", "rating": "4.3", "rating_count": "240", "about_product": "Bluetooth calling: Enjoy convenience with smart Bluetooth calling, right on your wrist. Dedicated speaker and microphone and AI voice assistance only elevate the experience.|Superior battery power: Leave the stress of charging frequently as Dive Plus offers 7 days of standard usage, 25 days of standby time, 2.5 for a full charge, and 2-3 days of battery backup with heavy Bluetooth calling. Type C Lightning Boult charging: No more waiting game. Dive Plus with Type-C fast charging delivers 2 days of standard usage in a mere 15 minutes of charging.|1.85” HD display: Get a clearer picture with the premium 1.85” HD display, and 500 Nits brightness that gives you a vivid picture even during the brightest hours of the day.|100+ sports modes: Flex how you like. Dive Plus offers you 100+ sports modes to activate your fitness regime.|150+ Cloud-based watch faces: Flaunt a new look each day with more than 150 cloud-based watch faces, and custom watch face option.|Complete health monitor: With sedentary reminder, calorie counter, sleep monitor, and many more, Dive Plus let you keep a track of your overall health the smart way.|Multiple colour options: Dive Plus is available in Tan, Icy Blue, and Jet Black. So pick the one that matches you best.", "user_id": "AH3DPBR7M2QD4UAT3SOYSFP4WTAQ,AH7YF74D552LEEDO65OAPQU5EXYQ,AHGHZUAWSZHBYY7LU2UTO447DP3A,AEN5AYM227HQJ5KNJ6DH6T3TFFQA,AHWQK2QNBGWHI7PRLYLJLBEE5LVA,AFN6XC3BAISXNBNSU2JN3D3KLIRQ,AEKRHF4LHGITVJ45B7H73OOEYNNQ,AFWUGSDFT6MHTAGQWD3KBFOSLXRA", "user_name": "Amazon Customer,Dheeraj,SMD FAYAZ,M.suneetha,ameer A.,Manoj Kelwade,milind,Shivraj p.", "review_id": "R3673WOUZQ8VY4,R3129KHZHX9V13,RDPHA1Q2BUYT2,R1Z655ELTMOH4N,R1J3D9HLJQKZTS,R2B7BEQ6YQOWVO,R2SF8G03AVZDBK,R9UEQQ3FCV3UD", "review_title": "Sensors burnt my wrist upon wearing overnight,Worst to buy,👍👍,It's  good,Low battery life and it's okay to buy,Superb 😘,Good,Good product", "review_content": "The sensors has burnt at two point of more than 3mm dia on my wrist upon wearing overnight and I have abandoned using it out of fear.  Had enclosed photos herewith.,Worst to buy, it's belt quality is totally poor, performance is average, not proper tracing of activities and battery life is too average.,Value for money,It's  good,Low batter life,Nice Smartwatch, Big Display, Long Battery Life, Max Features,Good,Good product", "img_link": "https://m.media-amazon.com/images/I/41OEfM3qYLL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Boult-Bluetooth-Smartwatch-Brightness-Waterproof/dp/B0BMVWKZ8G/ref=sr_1_230?qid=1672895814&s=electronics&sr=1-230"}
{"product_id": "B0BD92GDQH", "product_name": "OnePlus Nord Watch with 1.78” AMOLED Display, 60 Hz Refresh Rate, 105 Fitness Modes, 10 Days Battery, SPO2, Heart Rate, Stress Monitor, Women Health Tracker & Multiple Watch Face [Midnight Black]", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹4,999", "actual_price": "₹6,999", "discount_percentage": "29%", "rating": "3.8", "rating_count": "758", "about_product": "【1.78\" AMOLED display】500nit peak brightness & 368*448 resolution with 326 PPI. The display content of the screen can be clearly seen even under strong sunlight.|【60 Hz Refresh Rate】Fast & Smooth Experience with 60Hz smoothest smart watch refresh rate & minimalist round 2.5D. Reduces motion blur and makes action feel smoother, can make the picture appear sharper, and can make smartwatches feel more responsive and speedy.|【N Health App Integration】: Download this mobile application on your smartphone & connect with your Nord Smartwatch. You can easily check insights of your health stats. 【105 fitness modes with 2 automatically detect modes】Choose your own exercise mode from a long list including Yoga, Meditation, Cricket & various others.|【Enhanced Battery Life】Long-lasting 30 days standby time with 10 days of battery life. Call & message notification and Music & camera control. 【IP68 waterproof & dust resistant】 【Metal watch case】with OnePlus watch Sporty strap – Fashionable smartwatch|【One Tap Measurement】Smart health monitoring technology – SpO2 Blood Oxygen, 24 hour heart-rate, Sleep tracking, All day stress tracking and many more. 【Women health tracking】- Tracking menstrual cycles digitally for early prediction of periods.  【Bluetooth 5.2 】- Helps highly reduce the power consumption of the watch and brings better stable and fast transmission Android & IOS compatible ( Android 6.0 & IOS 11.0 and above).", "user_id": "AGWQCZIF4W7MPCFGEWBBYGVWS22Q,AFDZC4D7R4555BAGB45PI7V7DNEQ,AFDCKNT7PKHIXJGOE5KTS2T543DQ,AFVF7AJZSBE46XHJTIQKCTOWZIAA,AHWYTMSJ7KUHHJOOCNC6WQI6G25A,AE64VTXK4VOBPNSBG2EGZS62YF6Q,AHV5XE2XBBMMQTGCBDR5QB54FJYA,AG77NL56ZZCL5IZXNPYYVIMOGNHA", "user_name": "SYED SHABEENA,Faizalmalek,Varun Nair,Chetan,lattaben parikh,Amazon Customer,Simran,Majid khan", "review_id": "R2E39V9PQNSKB2,R3UPIMMS24KIKB,RM0KONA0D7IDQ,R72MOQ4D28G1E,R1X07P7FPU0WD8,R7VI24QL64CL,RE10WZDEARA78,R5P9JRFHZZ909", "review_title": "Na,Add bluthooth calling,Premium build watch with mid range features and some bad design choices,Happy with the purchase,Got this watch at 4499,Nyc watch with minimal features,Worth the money,No call receiving option", "review_content": "I really suprise there is no Bluetooth calling and no gpsAlthough brand is good but if there is Bluetooth and gps it will be extra good for buyers,Pleas add bluthooth calling so your watch selling will increase,Its a premium build watch with mid range features. It needs a lot of software updates to fix bugs and bad design choices. I returned the watch after a day's use because the features didn't warrant the price i was paying for it.The same notification appears twice in the watchNotifications that i have cleared from my phone dont go away from the watch and it even vibrates randomly, showing the old notifications.When i want to clear a notification, i have to swipe to the left for the delete icon to appear and then tap on the delete icon. Why the extra step? Why not just consider swiping left as a removal of notifications?Calls on the watch only have the reject button. There is no button to accept the call from the watch.Google Fit Sync doesnt workYou can only store 5 watch faces at a time. Also the variety of watchfaces isn't a lot, which is probably understandable because it just releasedWith a couple of software updates  this would be a really competitive watch, hopefully they dont abandon it  , like they abandoned updating the OnePlus Watch,https://m.media-amazon.com/images/I/61OuSyAi-0L._SY88.jpg,Nice watch at 4499 Price I have used City Bank credit card for availing discount,,The functions are super smooth although the N-health app sometimes does not track exercise, overall the watch is great product.,Plz update and add call receiving option", "img_link": "https://m.media-amazon.com/images/I/31OgHTags6L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/OnePlus-Display-Refresh-Multiple-Midnight/dp/B0BD92GDQH/ref=sr_1_231?qid=1672895814&s=electronics&sr=1-231"}
{"product_id": "B08Y1SJVV5", "product_name": "pTron Solero MB301 3A Micro USB Data & Charging Cable, Made in India, 480Mbps Data Sync, Strong & Durable 1.5-Meter Nylon Braided USB Cable for Micro USB Devices - (Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹99", "actual_price": "₹666.66", "discount_percentage": "85%", "rating": "3.9", "rating_count": "24,870", "about_product": "Fast Charging & Data Sync: Solero MB301 micro USB cable supports fast charge up to 5V/3A for devices and data syncing speed up to 480Mbps.|Universal Compatibility: This USB charging cable connects micro USB port devices with standard USB port devices like laptops, hard drives, power banks, wall and car chargers, etc.|Rough & Tough USB Cable: Charging cable with a double-braided exterior, premium aramid fiber core and metal plugs. It has passed 10,000 bending tests and can easily withstand daily use.|Extended Length: 1.5-meter long micro USB data and charging cable use nylon material to protect the wire and avoid knots.|Perfect Fit Connectors: pTron Soler MB301 has passed the 5KG load test, swing test, 5000+ times connect & disconnect to ensure that there are no loose connections.", "user_id": "AEQ2YMXSZWEOHK2EHTNLOS56YTZQ,AGRVINWECNY7323CWFXZYYIZOFTQ,AHBAT6VLOXWGYDL57KHCNCLPXAKA,AF7NDY2H6JVYTSQOZP76GCATQ34Q,AFV7ZA733ZLME4KNLZPMPCBUNPPA,AEP4MK3EKOBDKTGPJTRN5RBDIODA,AHFAAPSY2MJ5HYOU2VQDJ7AQY4NQ,AH2WGV2PEBUTICRPBEEVKF24G5LA", "user_name": "Jayesh,Rajesh k.,Soopy,amazon customer,Aman,Shankar,Ajaybabu.O.M,dinesh,Chitra", "review_id": "R7S8ANNSDPR40,R3CLZFLHVJU26P,RFF7U7MPQFUGR,R1MV1NKC23DWPI,R11D3U0V2XKDKF,R1XN72FU6Q37IH,R18MP1KLUE18PC,RWGJNVEH5ZQME", "review_title": "It's pretty good,Average quality,very good and useful usb cable,Good USB cable. My experience was very good it is long lasting,Good,Sturdy but does not support 33w charging,Nice product and useful,-", "review_content": "It's a good product.,Like,Very good item strong and useful USB cableValue for moneyThanks to amazon and producer,https://m.media-amazon.com/images/I/51112ZRE-1L._SY88.jpg,Good,Sturdy but does not support 33w charging,Nice product and useful product,-", "img_link": "https://m.media-amazon.com/images/I/31ew3okQR2L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Solero-MB301-Charging-480Mbps-1-5-Meter/dp/B08Y1SJVV5/ref=sr_1_234?qid=1672895814&s=electronics&sr=1-234"}
{"product_id": "B0B5GF6DQD", "product_name": "Noise Agile 2 Buzz Bluetooth Calling Smart Watch with 1.28\" TFT Display,Dual Button,in-Built Mic & Speaker,AI Voice Assistant, Health Suite,in-Built Games, 100 Watch Faces-(Jet Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹2,499", "actual_price": "₹5,999", "discount_percentage": "58%", "rating": "3.7", "rating_count": "828", "about_product": "1.28” display: Get an immersive on-screen experience with the clearest visuals upon every glance.|Bluetooth calling: Manage all your calls directly from your wrist. You can even access your dial pad and set favourite contacts.|AI voice assistant: Get things done with the convenience of your voice.|Noise Health SuiteTM: Take better care of your daily health with a series of health monitoring tools – Blood oxygen monitor, Sleep monitor, 24x7 heart rate monitor, Activity record & Breathe.|NoiseFit Track app: Make the most out of your smartwatch by pairing it to the NoiseFit Track app.|60 sports modes: Indulge in the routine of your preference with several sports modes to choose from.|Up to 7-day battery: Stay powered up for an entire week with up to 7 days of battery life.", "user_id": "AE5DHPL6NSPL4NZU5YM6P2U67ZSQ,AFGLK3RB6EJGURQ7WAJ5OCSYZVZQ,AHCEM32SEYJBW2IHJIAF62AVK4VQ,AGUP3L3UQTAMC3O7ML4OKIQMZJGA,AGZWO6D4BGO7B4PZ57VBFVKYARIQ,AGZTEQUP744MNZ7EOTLOHQSA6CWA,AFTKUCFRMCTXZQTTCJZLOSNFVTDQ,AFUVA7UIKBWGLYUMDJ5AUS64V2QA", "user_name": "Amazon Customer,Harshil Sheth,Aman Verma,Nitendra Rohit,Prerana Wagle,Sreenadh Raveendran,Jaiba,Rashmi", "review_id": "RPGI8FD8L5XJ6,R36XGTWLTTWPKY,R11S82IA4CCOBF,R2N5BCWW3L6N61,R368GSXQQ4XZOQ,R2IX7Y214VQ393,R3E53UMP67OLFQ,R1A09WDPBYAYY5", "review_title": "Noise,Nice watch',DeezNuts are important,Noise,Noise,Good 👍,Noice,Noise", "review_content": "Only issue I've had is battery life.Rest it is a great product.,Very nice watchNice touch,ok.,Nice,Good product,Battery back up need to be improved... Remaining all features are good...,Ai is not working properly,Watch is good ..but I had battery issue and alarm issues", "img_link": "https://m.media-amazon.com/images/I/41DgrxyBPTL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Noise-Bluetooth-Calling-Display-Assistant/dp/B0B5GF6DQD/ref=sr_1_238?qid=1672895814&s=electronics&sr=1-238"}
{"product_id": "B09JS94MBV", "product_name": "Motorola a10 Dual Sim keypad Mobile with 1750 mAh Battery, Expandable Storage Upto 32GB, Wireless FM with Recording - Dark Blue", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|BasicMobiles", "discounted_price": "₹1,399", "actual_price": "₹1,630", "discount_percentage": "14%", "rating": "4.0", "rating_count": "9,378", "about_product": "Ensured Power packed performance with Mediatek processor expandable memory upto 32 GB|Dual Sim with big 1750mAh battery gives you twice the power of other phones|Get 2 Years replacement warranty on motorola a10 keypad mobile|Modern, sturdy and Stylish Looks which you would love to flaunt|Entertain yourself with wireless FM with recording feature|Experience loud and crystal clear sound|Easily increase text size as per your convenience", "user_id": "AEN657OFUBBVTAFRFCOOUKFBNQ4Q,AESZZZXVFKLKXWSQPL4ECENSVBWQ,AG2UBCLWPOQR4QN5YCLXLC3XLHCA,AG7LUOL4B7W4Y5AWCZ5MK47P3OUQ,AFKWQ4PQTTDZKB7EET3UOXALXIOQ,AFTRUR7C3BJWFR5KW4W4SCBXU6NQ,AF4QNWLEXCHDBQ54GFXNI6N72XZQ,AGURV6CHVKSHPRM6VV4FSRY5NYKQ", "user_name": "Rajasekhar,Dimpal,rajat kumar,akanksha,Noone,Hemavaraprasad,Sachin Katyal,BUNGA DINESH", "review_id": "R27C4TPKHXYBRU,R1WGISGIIXAU1B,R2WFSJJW04UWJ8,R2QYC49E7WPALL,R1URJDO4NTW2ML,R3D6T949ZTO02J,RL8X7H598LEE4,RB0LBG619UMSN", "review_title": "Out of 5 iam giving 3.5 rating everything is okay except voice sound during call,Simple for rough use,charger quality bad,Lightweight.,Terriffic battery life,Good one for elders,Good in this price,Good", "review_content": "rating everything is okay except voice sound during call,Battery life is very good... sound is also loud..Economical.,charger quality bad,https://m.media-amazon.com/images/I/614VMH+hRtL._SY88.jpg,Battery lasted for 15+ days with low-medium usage. All functionality works fine. Perfect for someone wanting to limit the distractions of a smartphone.,Good product for elders,Working well for about 1 year. Everything okay,There is some disturbance in the sound While using wireless FM", "img_link": "https://m.media-amazon.com/images/I/412DrCgktiL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Motorola-keypad-Mobile-Expandable-Battery/dp/B09JS94MBV/ref=sr_1_239?qid=1672895814&s=electronics&sr=1-239"}
{"product_id": "B09YV463SW", "product_name": "Fire-Boltt Ninja 3 Smartwatch Full Touch 1.69 \" & 60 Sports Modes with IP68, Sp02 Tracking, Over 100 Cloud based watch faces ( Silver )", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,499", "actual_price": "₹9,999", "discount_percentage": "85%", "rating": "4.2", "rating_count": "22,638", "about_product": "Fire-Boltt is India' No 1 Wearable Watch Brand Q122 by IDC Worldwide quarterly wearable device tracker Q122.【1.69” HD Large Touch Screen】- Fire-Boltt Ninja 3 comes with a 1.69” HD Full Touch Display for smooth swipes and clear vision;【SPO2/ Oxygen, Heart Rate】 - Fire-Boltt Ninja 3 Smartwatch comes with real time 24*7 SPO2 / Blood Oxygen tracking, Dynamic Heart Rate Monitoring (If a patient is suffering from Covid 19 please use a medical device prescribed by the Doctor)|【60 workout modes】- This smartwatch consists of 60 sports mode to track. Keep a track of all your activities and compare history to analyse your performance. Count steps, distance, and calories burned.;【IP68 Water Resistant】- This smartwatch can withstand dust, spills, raindrops and is sweatproof too|【POWERFUL BATTERY】 - About 7 days battery life and a Standby Time of 25 Days 【Multiple Watch Faces】- Unlimited Customized Built in Watch Faces and also multiple watch faces through the app;【Stay Social Stay Updated】 – Inbuilt Social Media Notifications.|【All In One Smart Coach】 - Track your Daily Steps, Sleep, Fitness, Sports, Heart Rate and SPO2 【Enjoy Music And Camera Control】 【IP68 Water Resistant】- This smartwatch can withstand dust, spills, raindrops and is sweatproof too;Clasp type: Tang Buckle; water_resistance_level: water_resistant|Band Color: Silver; Included Components: 1 Smartwatch, 1 Manual, 1 Magnetic Charger, 1 Warranty Card; Band Material Type: Silicone; Case Material Type: Plastic; Connectivity Technology: Bluetooth; Human Interface Input: Touch Screenbuttons; Item Type Name: Smart Watch; Compatible Devices: Smartphonetablet; Color Name: Silver", "user_id": "AH2OARRWRYKQNYKCWGQKO3NOINQQ,AFIIBGWYNYPKBPVV3YRZPI3PYGBA,AF6HCCU2LSBC7VI7PXDP7BV234VA,AFOFD4PXG6Q4MMOSO5DL3Z6SPH3A,AFJLVCFIQOLK52GX6GEPNDVDXMLQ,AEQQH4MFXL57BHAPR5HEDWJ7IYSA,AHKFAQZRUQBRNNHBMARKC5YBCLBQ,AFU4L7YEY73K63B4VWGPBWQVAYWQ", "user_name": "Rahul Singh Rauthan,Sanjoy C,Prashanthi,Aditya Singh,Satyajit Patale,Owais,Amazon Customer,Himon Roy", "review_id": "R2VEHBS4GTI9SH,R560D18O1BJM7,RYPXAOQI77XRF,R2T1AP2XBIAQBK,RU2RYKNTJU52I,R3D6UA9AB1KZ5D,R1YFZYNSZI9FAG,RQU8SHDXBG8NZ", "review_title": "Premium looking watch,Excellent Product,The Tracking and touch would be better,Bluetooth connectivity,Very good,The watch is good,Felt Good,Not bad", "review_content": "Its only 4 days since we are using the product and based on so far usage, review is as below :PROS :1) Looks, it looks premium.2) Features at this price range3) Battery : It seems as if the battery will easily last for a week or more with normal usage ( Have closed all notifications which saves battery )4) Steps Accuracy : Will give 8 out of 105) Magnetic charger ( easy to charge )CONS :1) Have not noticed anything till now.,I ordered 2 watches for my wife and sister. Got it at the price of 1500. I am always a fan of Firebolt. And ninja 3 is very good. Touch responce is good. Good battery life. Sleep track is very occuracy. It has all necessary features and those are quite accurate. It's light weight and looks good. Over all it's an excellent product at this price.,Touch screen is not so good it takes time may be i need to use it for a while for better experience,I like the sleep tacking , heartbeat measuring , Spo2 and exercise tracking .I dislike the bluetooth of the smart watch only .  I use this watch for exercises,Battery is goodTouch screen is niceAll fixtures are very good,I like the watch style and charging is so fast,Firebolt Ninja 3Felt Good  for the watch , simple and easy,Its good, value for money, overall performance is good.", "img_link": "https://m.media-amazon.com/images/I/41-IPkI1Y5L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Fire-Boltt-Smartwatch-Sports-Tracking-Silver/dp/B09YV463SW/ref=sr_1_242?qid=1672895821&s=electronics&sr=1-242"}
{"product_id": "B07XLCFSSN", "product_name": "Amazonbasics Nylon Braided Usb-C To Lightning Cable, Fast Charging Mfi Certified Smartphone, Iphone Charger (6-Foot, Dark Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹899", "actual_price": "₹1,900", "discount_percentage": "53%", "rating": "4.4", "rating_count": "13,552", "about_product": "Fast Charge: When Used With An 18W Or Higher Usb-C Wall Charger With Power Delivery You Can Charge Your Iphone To 50% Battery In Just 30 Minutes - Supported Models Include Iphone 8, 8 Plus, X, Xs, Xr, Xs Max, 11, 11 Pro, 11 Pro Max, Ipads, And More. High-Speed Data Transfer: Up To 480 Mbps For Transferring Music, Movies, And More In Seconds|Durable Friendly Design: Built With Top Rated Materials And Tested To Withstand Up To X Bend Cycles And Features Textured Grooves On Connector Ends For Improved Grip|Certified Chip: Apple Mfi Certified Charging And Syncing Cable For Your Apple Devices With Improved Chipset To Ensure Full Compatibility|This Cable Is Not Compatible With Standard Usb Chargers / Laptop Ports. Works Only With Type C Adapters And Laptop Ports. Please Check The Port Of Your Adapter Before Buying The Cable.|Connector Type: Usb Type C", "user_id": "AF2IRSQZKMBGX44YDNUPYRHWXOZQ,AF6VSSXOI3Y4PZCNRJ3L27NCXPYA,AHQKC4MLLVOPBTKJFDBGTXFRKLYQ,AGX5ELLH3KJJ4CY2DJJOXDSOEI6Q,AGJ23TWSY6YFMAVSEAOAUEWO4QLQ,AFOHB4M2RWSUQ3SSZWPMD2FPH6PQ,AFVHKKOI25DAQSETPL7Z5W5SIVUA,AE55WJERHR4C7SEAIWX4JJHFSZBA", "user_name": "Wraith,Krishna Engineering,Kindle Customer,Deeps,Chintada Bhaskar Rao,FH,Vasudev,Done Chandra Mouli", "review_id": "R213ILI3XNVHQ0,R1LZN1V8UCR9IU,R1EBFTZINSJ0LG,R3BKR3VZ1U81LW,R5OJ20F8H5T8U,R1FKQR9LSBVLH2,R3R8UN7IQY7EIT,R2WBDNEW6HCVSH", "review_title": "Good,Worth to buy,Great value for price,Good product,Nice product.,Reliable and worth it!,Much more sturdy and durable than Apple cable,Good", "review_content": "Good budget mfi certified lightly cable for this price . Update usage review after 3 to 5 months .,Better than the original one in matter of robustness and durability. Better in prospect of charging . It is far better in durability from the original apple wire. Do not think more you can buy blindly worth to buy and it is mfi certified so you IOS device not damaged. But small negative point is packaging quality of the product.,The charger is a great carry on accessory while travelling without risking the original charger.Price is also very affordable and charging speed is very good with good adaptor or power bank.,Good product , can recommend all , only thing I see as issue is the material,, the cable threads peels off when stick to a Velcro materials. Other wise good product, charges very well like original,Nice,Reliable and worth it,The cable shipped in box made by Apple felt less sturdy and reliable after using one or two times and felt it would break more quickly at the lighting port and had to order Amazon basics cable which is miles better and apple MiFi certified,", "img_link": "https://m.media-amazon.com/images/I/3183iGEWksL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/AmazonBasics-Apple-Certified-Lightning-Charging/dp/B07XLCFSSN/ref=sr_1_245?qid=1672895821&s=electronics&sr=1-245"}
{"product_id": "B09NL4DCXK", "product_name": "Flix (Beetel) Bolt 2.4 12W Dual USB Smart Charger, Made in India, Bis Certified, Fast Charging Power Adaptor with 1 Meter USB to Type C Cable for Cellular Phones (White)(Xwc-64D)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|WallChargers", "discounted_price": "₹249", "actual_price": "₹599", "discount_percentage": "58%", "rating": "3.9", "rating_count": "2,147", "about_product": "With The Intelligent Chip Inside, Dual Usb Wall Charger Matches The Current As Your Device'S Need Automatically. Over-Current, Over-Voltage And Short-Circuit Protection Also Effectively Protect Your Smartphones From Damage|Internal Protection Mechanisms Offers Multiple Protection Against Short-Circuit, Over-Temperature, Over-Current, Over-Voltage And More|Robust Textured Casing And Premium Internal Components Ensure Perfect Performance|Usb Charger With Dual Ports Allow You To Charge 2 Devices At The Same Time With The Total Output Of 2.4A Current.|Power Source Type: Corded Electric", "user_id": "AGNJW4JB3SQZZEVJCOR6EXOTNMOQ,AFTBDE5KEINLXCQI2KBACSU4VO6Q,AHG766GX32WE357IIFA2PJWO7XRA,AG6TL6KXOCB6HW6QITVEZ3NFPYFA,AGD2H2SMDLQK62MH7BFWQ2INBP2A,AEHKGBC4LAMAC3AUCAWLJKKHRTAA,AHB6B3AB5OU3ITBYOSU2YSPVJ7RQ,AF7JC6AKO652RERHTNJ4NFM6NN4A", "user_name": "Bristidev Burman,P VENKATESH,D.Dutta,Swapnil Patil,ABHAY SINGH,Rohit,Manikanta,D MANJUNATHAN", "review_id": "R2XF84DPH68G5Y,R272LVPQ9OGM0S,RBQF76FUWS8PH,RUV6A5DB7ROJU,R25Z9XP6UQKEBZ,R33QHW049WSWGB,R3QAWS03V5OYSG,R3407AFPL16VUS", "review_title": "good till now,Good,An additional charger same as ORIGINAL .,Good adapter,Best,okay okay,Good,Good product", "review_content": "i use it for powering my bluetooth speaker and another usb light. so it powers then nicely,Good charger my feedback is 1 month after giving is nice product.,Working with any types of USB either C-type or micro.Temperature always normal with 2.4amp ranges .,Adapter is good but tyape c cable is not good bought for Rs.188,Very best,@99 or 149 that's the good deal, a normal changerlet's see the warranty conditions,Good,Nice product and value for money.", "img_link": "https://m.media-amazon.com/images/I/31efS1bi1vL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Charger-Certified-Charging-Adaptor-Cellular/dp/B09NL4DCXK/ref=sr_1_246?qid=1672895821&s=electronics&sr=1-246"}
{"product_id": "B0B8CHJLWJ", "product_name": "Kyosei Advanced Tempered Glass Compatible with Google Pixel 6a with Military-Grade Anti-Explosion Edge-to-Edge Coverage Screen Protector Guard", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Maintenance,Upkeep&Repairs|ScreenProtectors", "discounted_price": "₹299", "actual_price": "₹1,199", "discount_percentage": "75%", "rating": "4.5", "rating_count": "596", "about_product": "Kyosei Provide perfect fit, high quality materials and craftmanship|Anti-Shatter: If broken, the glass will break into small parts but stay in one piece, making it safer for glass screen of your phone.|Precise laser cut tempered glass made with polished,Base Material from Japan Asahi Glass Factory and Nippa Glue", "user_id": "AHOQPLT222WN4LQV55XMUEZY6MAA,AFNKDB2UZ7JPX7N53QPPTXBDCJXQ,AFHKQPCPHXZP3ZYZE5AN7VSCVDRQ,AGXQ7FB3Q276VMKWFLEWL3T23SLQ,AGLMYJKO4AKOSRJGJSMVBCDD2X5A,AETHGZYL2OPKWCDKUT5CWOO6ANMA,AEG4RN3E6SIUFNUSICKYE5VPJMMQ,AFIPC6U53NW33X7IKK7KRDEA2TCQ", "user_name": "Kirti Sardana,Daactr,Shubh,Mayank K.,Vijay,Saakshi Pratishruti,Amazon Customer,ANKIT", "review_id": "R3SMBF0YI93Z13,R32MW4CZK929NC,R1SHQ7Y1O213S7,RFCIU1144956F,R29OJILEK4V1FH,R1MEGOIYHS8OLM,R1WY4BGMPQ0EYI,R2XGJ9GML1PUJO", "review_title": "Good quality screen protector,Well made basic screen protector,Good one,Good affordable tempered glass,Perfect for pixel 6a,Recommended,Perfect and budget screen guard for pixel 7,Okish", "review_content": "Nicey packed , easy to install and with good quality adhesive. Perfectly fit on the screen,It's a well made basic screen protector. Application can be tricky as it comes with no aligner. But the protection it offers is goodRegards to durability to scratches..habe to wait and seeObserved the finger print recognition is affected a bit as it take an extra couple of tries to register the finger printAll in all a well made economical basic screen protector,The tempered is nice and easy to install. The adhesion could be better.,A good product at this price range,Better than other costly tempered glass,Feels premium. Touch sensitivity is good,With a little fear, I purchased this item for my new Pixel 7. To my surprise, it perfectly fits the phone, and even I was able to stick it without any bubbles. Even the touch reponse and finger print are working flawlessly There is no guide to help you stick the screen guard, which is okay as we all know how to do it. I recommend this product over the overpriced, branded screen guards. But yes, I am not sure how it acts in a drop, and I am scared to test it. But it feels like it will protect the phone display during an accidental drop.,Does the job. Thats it", "img_link": "https://m.media-amazon.com/images/I/318wXJER9zL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Compatible-Pixel-6a-Military-Grade-Anti-Explosion/dp/B0B8CHJLWJ/ref=sr_1_247?qid=1672895821&s=electronics&sr=1-247"}
{"product_id": "B0B8ZWNR5T", "product_name": "STRIFF 12 Pieces Highly Flexible Silicone Micro USB Protector, Mouse Cable Protector, Suit for All Cell Phones, Computers and Chargers (Black)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Décor", "discounted_price": "₹79", "actual_price": "₹499", "discount_percentage": "84%", "rating": "4.2", "rating_count": "1,949", "about_product": "AUDIO BOOST which rewards your ears with studio grade sound quality for the most immersive gaming experience|Pre-installed I/O Shielding provides better EMI protection and more convenience for installation|On-board Wi-Fi 6 (802.11ax) with MU-MIMO support which provides a great networking performance and online gaming experience|With 3rd Gen Ryzen processors, this motherboard featurs the latest Lightning Gen 4 solution on both PCI-E and M.2 slot, which allow for faster data transfer on graphics cards, storage devices and networking devices|Enhanced Thermal Solution includes extended heatsink, 7W/mK level thermal & choke pad with 2oz thickened copper PCB to ensure best performance for gamers", "user_id": "AG2V3QSA4MVD6RPA5UGUMYMH3PXQ,AGHIZULBQOJPXZ2EUBOVSCRTBI4A,AEFNEVSP4WMJVLBSRPH3YKKRSDWA,AFW6KM45ORMBEVYBQ4QMSGG2ODOQ,AGB2EEPBUR5MIG35HYFKQFWBDHNQ,AHXTIJOG7AQRG6AAFQC6P74S5WYQ,AHSOOVRJXP7QJTQUF6JLK3WGI3AQ,AHK2ZYSXEGSQYPDXT53GDNFSEWXA", "user_name": "Santosh Kumar,Prateek Jain,shubham,Ahsan Shaikh,Munish waran,Lalitaroat060682@gmail.co,Nancy Arulraj,Nevil Gandhi", "review_id": "R1EZC4VZXSJG4L,R1R39X4XI4GF5N,R2NR5VY4ULMZGZ,R1FGNEOQQOF3QC,R7BTN0BZCR0JG,R1IGYOAGJ9FW5U,R3B1Y0WDM2QS0U,R2KNU5Q3FUL54C", "review_title": "Very useful,Very useful item to make your phone cables long lasting,Price can be reduced as this product is not worth for 80 rs,Value for money,It is useful,Good product,Good quality,Its good item in this money", "review_content": "A 10bucks piece can save cable worth hundreds. Totally recommend,I just received it and applied on my iphone related cables and connectors. Specially, apple accessories are not that sturdy and doesn’t last long due to breakage at the end points due to wear and tear.This seems to be a very good and low cost investment to protect all of such cables to break due to usage and wear&tear. Have applied in earphones also. Will be watching over the period if time if it indeed increases the cables life.Till now, feeling good about this useful product.,Price is high,You can go for this.,It is useful. After using it, the durability of the cable is good.,Very good product it definitely protect your cable,It doesn't really protect your cable if the cable is starting to wear out. You need to use this before the cable starts wearing out. It works only if the cable is thick enough. But overall good quality.,Good", "img_link": "https://m.media-amazon.com/images/I/41R0DrIbTNL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/STRIFF-Flexible-Silicone-Protector-Computers/dp/B0B8ZWNR5T/ref=sr_1_250?qid=1672895821&s=electronics&sr=1-250"}
{"product_id": "B0BBFJLP21", "product_name": "Redmi 11 Prime 5G (Thunder Black, 4GB RAM, 64GB Storage) | Prime Design | MTK Dimensity 700 | 50 MP Dual Cam | 5000mAh | 7 Band 5G", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹13,999", "actual_price": "₹15,999", "discount_percentage": "13%", "rating": "3.9", "rating_count": "2,180", "about_product": "Processor: MediaTek Dimensity 700 with 5G, 7nm Octa-core processor; Up to 2.2GHz|Display: 90Hz FHD+(1080x2400) AdaptiveSync Display; 16.71centimeters; 20:9 aspect ratio|Camera: 50MP AI Dual camera | 8MP Front camera|Memory, Storage & SIM: 4GB RAM | 64GB UFS 2.2 storage expandable up to 512GB with dedicated SD card slot | Dual SIM (nano+nano) dual standby (5G+5G)|Battery: 5000 mAh large battery with 18W fast charging support and 22.5W fast charger in-box with Type-C connectivity", "user_id": "AEJHP62NHRVRCWIMXUODSZLSBNUA,AF3U4PQTRSBX3JB6NUI4Q652IE4Q,AG64E4GTHGCK5JAQJBFV3GPWYWOQ,AEBM3UFSICAMJJ63YZUBAFR6DZHQ,AGVN2YMSW5XV3H7H2MLRNDINPITA,AGRZTDPR7I75A5V36SYCPXIXHI5Q,AGECH5TXOT3LNZSNATG3E7NFATBQ,AGSAHTWECW2CLZXM5NWAEUDBU6OQ", "user_name": "dhruvi,Sujal Negi,hussain khan pattan,NAGARAJAN,Sreenath,Placeholder,Waseemakram,Shivi", "review_id": "R3KJZVGMCEDPKA,R1EU6W1X8DZQN1,RE8OSDUM47BMX,R3L27Z1PJ76EKV,R1834GGPCPMNI7,R1UMU1N5S0KAZR,R1WXD21WPVTX5W,RKAXT22G5HS62", "review_title": "Nice phone,15 day review,Nice Phone,Extent,Awesome phone, recommend to buy it.,its all okay,Design,Good", "review_content": "Overall it is nice  phone at this price go for it,Tbh it's a good phone for your parents. Of you are a heavy user then don't consider this phone.Cons:-1. Slow charging (this phone usually takes around 2 hours for full charge)2. In initial days you will be impressed by the battery consumption I.e it runs 1.5 -2 days after only charging once but after few days it comes back to normal3. You will not get features like slow motion etc etc. In this price range you can get these feature on other phone Or MI variantsThis is my 15 days reviewHence I haven't tried every feature of the phoneWill come back soon after using it for months,Nill,Extent,Awesome phone, recommend to buy it.,its all okay,https://m.media-amazon.com/images/I/513nl6zJI4L._SY88.jpg,Nice", "img_link": "https://m.media-amazon.com/images/I/412VyMavsJL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Redmi-Thunder-Storage-Dimensity-5000mAh/dp/B0BBFJLP21/ref=sr_1_255?qid=1672895821&s=electronics&sr=1-255"}
{"product_id": "B01F262EUU", "product_name": "Samsung Original EHS64 Wired in Ear Earphones with Mic, Black", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹949", "actual_price": "₹999", "discount_percentage": "5%", "rating": "4.2", "rating_count": "31,539", "about_product": "In Ear Volume Control. Water Resistant: Yes|Design: Canal phone|Headphone Jack: 3.5mm|6 months warranty", "user_id": "AFTS5BKDRY7Y23B27UVBE2V6TOHA,AHRIDJXYEBQS7MXFDZ7AAX3AACRQ,AEDHFXMKZMTSZUD6ZDT2EAIJBQUA,AHBMWXLEXHMD3QWGJ4BY7XIDEDUQ,AGVSEPNAZEEDAMS3QS6KVA7XYXXA,AG2ITB7GSXUQM6CODSEUDY2P64DQ,AG37JT3DBXZLS3HJHIAJZUA7A3LQ,AGYBSDZV56GWQP7LHLWIBBYLJF4Q", "user_name": "Ranit Barman,Ravi Singh,Karan Rai,Amazon Customer,Saurabh,Jayesh,Amol kale,Sankar Prasad Dutta", "review_id": "R10FUJSCR3VYHY,R2Y8B5LQ5HLACQ,R3BC8GS9GGMBTI,R2BO0XUUDY4ZA3,RN23FCU4EP3F3,RDGNXFM923PG4,R26PGAI8JKY8XB,R381CGOL80J2QM", "review_title": "Works well, but not for long,Good product,Good product,Good quality,Excellent.,Good,Average item,Try to improve", "review_content": "The sound quality is excellent for the price, and so are the three buttons. However, the material quality isn't good, and the wite breaks after 9 months or so.,Less bass.. good sound.. quality might be better,I like to buy this headphones,Good product,  very much I like you 👍Good sound quality. Good its really very nice product. Thank you so much samsung galaxy,I have tried many wired earphones almost every brand. But this is just perfect. Mids and lows are superb. Treble and bass are balanced well. The Remote has 3 buttons, mic works well during the call.,https://m.media-amazon.com/images/I/81qrQ52Xf8L._SY88.jpg,Its not so good not so bad,Like but....?", "img_link": "https://m.media-amazon.com/images/I/31+GLbqRPtL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Samsung-Original-EHS64AVFBECINU-Hands-Free-Remote/dp/B01F262EUU/ref=sr_1_256?qid=1672895821&s=electronics&sr=1-256"}
{"product_id": "B09VZBGL1N", "product_name": "STRIFF Multi Angle Tablet/Mobile Stand. Holder for iPhone, Android, Samsung, OnePlus, Xiaomi. Portable,Foldable Stand.Perfect for Bed,Office, Home,Gift and Desktop (Black)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Stands", "discounted_price": "₹99", "actual_price": "₹499", "discount_percentage": "80%", "rating": "4.1", "rating_count": "2,451", "about_product": "[PORTABLE SIZE]- 98mm*86mm, STRIFF desk phone stand is foldable and easy to slip into your pocket suitable for bed,table and home|[MULTI ANGLE ADJUSTABLE] - Directly adjust to your preferred angle among 10 different viewing angles, from 0° to 100°.Hold your smartphone or mini tablet in portrait or landscape mode safe|[PREMIUM MATERIAL] - Superior ABS and rubber pads on the bottom to protect the stand from sliding and durable in usage|[USEFUL DESKTOP CELL PHONE STAND] - Hold your smartphone or mini tablet at a comfortable angle, ideal for watching video, reading, video recording or simply browsing the web, playing games, facetime and other handsfree operation at home, office and travel|[UNIVERSAL COMPATIBILITY] - Works with all 4- 7.9 Inch smartphones, mini tablets and e-readers including iPhone X 8 8 Plus 7 7Plus 6S 6S Plus 6Plus 5 iPad mini, Google Pixel Pixel 2 Pixel XL, Nexus 5X 6P 4 5 7, LG G2 G3 G4 G5 G6 V10 V20 V30 K10 K20, Samsung Galaxy S9 S9+ S8 S8 Plus S7 Edge S6 S5 S4 J7 J3 Galaxy Note 8, HTC, Moto, Nokia, Huawei android phones and more|0|0", "user_id": "AFAKLGJPBTX3EWCXJWB6TF4LJOXQ,AHR5LL4YACXI5EFTGVBU56XUEG3Q,AEWZWQVWEH3665BOU2QPVBRLTTSQ,AG4K2GZXDJUJR73746BVI5ZCXXAA,AHRRE5O2H4IOLL6MP6GQDG5WA7CA,AHXDIZAFO4I6IXLPNGBHUSK7UZBQ,AHTLGCL5SZOQA3Z7FN2JPUWU2FAA,AGWT3N6VGOTZTXX4EK53LSAV4JDQ", "user_name": "Sean m.,Medha Garg,DEEPAN CHAKRAVARTHI R,HARIHARAN M,Amazon Customer,IQ,Tessy George,Aman Rizvi", "review_id": "R1SWNKZP36AU1J,R2T4RPK1O46TBX,R1WBRQ50IN70OF,RE0HLO48TPM4O,R2V8WPXZSTAKKE,RMQ0XU5QGL5LV,R2URDJTQLPFEYH,R2P9AVX3K59AMP", "review_title": "Totally worth rs99,Best,Valuable,Good,Fulfil purpose, easy to carry,Good product,Good product,Good", "review_content": "Perfect for a 10 inch tablet both vertically and horizontally,It was the best phone holder,Premium quality and reasonable price 👍🏼,Good,Fulfil purpose, easy to carry, solid material. Think it will last long.,Nice,Liked the product. Easy to carry, portable,  foldable, lightweight.,Good", "img_link": "https://m.media-amazon.com/images/I/31xJT-3ZAkL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/STRIFF-Android-Portable-Foldable-Stand-Perfect/dp/B09VZBGL1N/ref=sr_1_257?qid=1672895821&s=electronics&sr=1-257"}
{"product_id": "B0BNVBJW2S", "product_name": "boAt Newly Launched Wave Electra with 1.81\" HD Display, Smart Calling Ultra-Seamless BT Calling Chip, 20 Built-in Watch Faces, 100 + Sports Modes, Menu Personalization, in-Built Games(Cherry Blossom)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹2,499", "actual_price": "₹7,990", "discount_percentage": "69%", "rating": "4.1", "rating_count": "154", "about_product": "Screen Size- Big and Bold meets Bright and Sharp with a 1.81” HD Display. Backed with 2.5D curved display, 550 nits brightness & its seamless edge design, it makes it the ideal metal body you want strapped on your wrist.|Seamless BT Calling- Calling made convenient with just a tap on Wave Electra. Dial and receive calls anytime, anywhere and save up to 50 contacts.|20 inbuilt Watch Faces- Be Spoilt for choice, with 20+ inbuilt watch faces. Find the one that matches your vibe with over 100+ on the cloud.|Sports Modes- Switch up your fitness and sports routines with 100+ Sports modes to choose from. Cricket, Football, Judo, Skipping, Rock Climbing, Dance, Hockey, Basketball, Volley ball and a lot more to choose from!|Personalization- Add a touch of personalisation to your watch with 2 menu style options to choose from. Easily navigate through the watch and keep all your go-to features just a swipe away by adding or deleting feature pages on the home screen.|Inbuilt Games- Get your fun on! Make and beat your high scores with 2 games - Whack-A-Mole and 2048.|HR, SpO2 & Breath- Wave electra smart watch keeps a tab on your HR and SpO2 levels and provides breath training to keep stress in check.IP Rating- This smart watch is has IP68 rating making it dust, sweat and splash resistant.", "user_id": "AEYLB6L333GKGCRGR5N6NDB335TQ,AEUZYVUGRR6URWHTEQR3NCGWN46A,AHYWG4RZCXWYBUPMUCNYX76JWF4Q,AHKCYSBVKKLZ6TZEUYSMS7JK7O3A,AHOLDR6WNL5GVEDVEX7HEK7KGA2A,AEVCDJRYLA3LTJCNTFYX53MAHAGA,AHM52LICMSWL734Q5OL4BUM7YWLA,AHFK5JSZGYMOMOE36LRSR2HC3V3Q", "user_name": "App,Dr. Rinchin,Priyanka Devaraj,Yasinlove,Anand Patel,bhaskar,MUHAMMAD ALAU DIN,Mantu kumar Sahoo", "review_id": "R2IIY08QX4SR46,R267DLLCKGD15M,R31P4MQH7YLP4I,R42A5QTEMPPGQ,RHE6HF6ZA5R2W,R1YAD59EAWIPJS,RYH2UHSWNFEWJ,R23524DWSS2QQ3", "review_title": "Feature Wise OK at this Price But Sometimes call screen not come on the display of Watch,Problem with connection.,Good,Good watch,Worth ₹1799,Very nice product,Touch working smoothly.,Nice watch", "review_content": "This review is based on my two days of usage. Work fine on Activity and Fitness Tracking but Sometimes Software does misbehave. Need some improvement on the Software and Not Work only with Bluetooth Connect it Requires an Internet connection for sync.  and sometimes Bluetooth does not fully Work. I believe problems which are coming may be solved by the next Software updates. Entry Label Smartwatch with calling features wise ok.,I only have one problem, sometimes it acts as a speaker, and all the sounds of whatever that is playing on phone comes from the watch. Also i would like to know if i can silent the ringtone coming from the watch. Is there any way. Please help. I am using iphone 11.,The product is really good, it feels so light during workouts it's so comfortable to wear and the reason I gave 4 stars is that the sound quality is not so great,Good looking and two things are missing 1.female health cycle2.belt strap was very smallscreen touch is very smooth and u can give some lengthy strapOver all 4/5And gps also missing,This watch is good at this price range as compared to other smartwatches but it has delayed in wake up wrists feature. Overall good look, good performance, good quality and affordable price.,https://m.media-amazon.com/images/I/71Saf3ahXhL._SY88.jpg,Very nice texture of this watch.  It is light in weight.  Very comfortable to wear.,https://m.media-amazon.com/images/I/61oENyrSG2L._SY88.jpg", "img_link": "https://m.media-amazon.com/images/I/41LDspRanIL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/boAt-Launched-Electra-Ultra-Seamless-Personalization/dp/B0BNVBJW2S/ref=sr_1_259?qid=1672895821&s=electronics&sr=1-259"}
{"product_id": "B0B2DJ5RVQ", "product_name": "WeCool B1 Mobile Holder for Bikes or Bike Mobile Holder for Maps and GPS Navigation, one Click Locking, Firm Gripping, Anti Shake and Stable Cradle Clamp with 360° Rotation Bicycle Phone Mount", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Mounts|HandlebarMounts", "discounted_price": "₹689", "actual_price": "₹1,999", "discount_percentage": "66%", "rating": "4.3", "rating_count": "1,193", "about_product": "Mobile Holder for Bike is an innovative solution for mounting your phone on the Handlebar. With just one click you can lock or Unlock the phone. One Button Technology. Unlike the other ways which takes long time to mount or which damages your phones|Mobile Holder for Cycle : You can Rotate your Phone 360 Degree and maximized your Flexibility and convenience of Viewing the Screen. Tilt the phone to the angle that is clear to your vision.|Mobile Stand for Bike is Stable and Safe : Soft Padded Anti Slip Silicon Gripper ensures your Phone is Fixed without Scratches and will not Fall down.The Mobile Holder is designed to reduce the Vibration and prevent Phone from scratching.|Mobile Stand is Easy to mount and you can do it Yourself. DIY. No need of any Tool to attach the Mobile holder to the HandleBar.|The Mobile mount for Bike is designed to provide Full Access to your Phone Screen. Adjust the foot Support to ensure that Power / Volume buttons are not interrupted while holding the phone.|Bike Mobile Stand that can hold the smartphones with screen size from 3.5 Inches to 6.5 Inches. Universal Mobile holder that fits all phones", "user_id": "AFSRFIJ7SMY5WDUSEHB4FW3ZJHBQ,AEEK7DYZXOHAWSCKMMKJYMOMDS5Q,AHW36WCBK4L6CVEGYNZELYFAN66Q,AFBU23LMK34PMRYBIIPLRVFPP6WQ,AFO4M4BQ2WS7A3LPKJY45B5C7DYQ,AF25RSBVLDMIXQZLIJSBVHHU7HJQ,AE2H52BMLK7G66D6ALAYEQHW37PQ,AGSMYUPKP2KNRQPZ2URY75DV7OYQ", "user_name": "Arijit Mishra,MOHAMMED JAHANGIR,pranav,SHANKAR,Abiram,thirumaran,purti,antony93", "review_id": "RMN6DAWRN6MNN,R1GQKFSLO6JQPG,R2D1O37R5BY6XH,R1WVLTHBMN7N0E,R8WN9F9D8U570,RPW50TOB01UYA,R11TIPQDVW2QS6,R3R2G8NOZZEM2R", "review_title": "Quite firm and steady.,👍,good buy,Theft easy,Good product,Its work,Best in market,quality", "review_content": "Quite firm and steady. I wish they used a little metal or hard fiber for this Like bobo company holders. But great product at this price.,Good product and good quality,stud should be provided to fasten the rear screw,Everything is good but it suppose to have a locking system bcoz anyone can remove easily at parking areas,Value for money,Quality is good,I wish there was a proper instructions manual other than on the box but it's not hard to figure out. The product is amazing. It is Sturdy and steady even on bad roads. The phone is completely safe. Buy this product without thinking twice. I loved the product so much that I have to order one more because my family members need one too.,avarage quality", "img_link": "https://m.media-amazon.com/images/I/31LVAoe3VNL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/WeCool-Navigation-Locking-Gripping-Rotation/dp/B0B2DJ5RVQ/ref=sr_1_260?qid=1672895821&s=electronics&sr=1-260"}
{"product_id": "B096TWZRJC", "product_name": "Sounce 360 Adjustable Mobile Phone Holder, Universal Phone Holder Clip Lazy Bracket Flexible Gooseneck Clamp Long Arms Mount for Mobile Tabletop Stand for Bedroom, Office, Bathroom, White", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Mounts|Bedstand&DeskMounts", "discounted_price": "₹499", "actual_price": "₹1,899", "discount_percentage": "74%", "rating": "4.1", "rating_count": "1,475", "about_product": "【PERFECT FOR ANY PLACES】: Perfect for watching movies & enjoying music in the bedroom, cooking in the kitchen, exercising in the gym and working in the office. Fine details and craftsmanship, make life easier. Lazy bracket for you, free your hands.|【HEAVY DUTY & STURDY HOLDER】: Large Base for Stable Mounting without Vibrations, tight and bendy arm, secures your smart phone, iPad or tablet and other electronic devices tightly to prevent the unit from falling or moving around.|【360 º ROTATION】: Designed with flexible long arms clamp, working at 360-degrees, making holder adjustable to view your device at any angle.|【COMPATIBILITY】: This ergonomic gooseneck tablet holder, compatible with all 4. 7 - 10. 5 inch cell Phones and tablets, such as iPad mini 2 3 4, iPad Pro 9. 7 10. 5, iPad 9. 7 2018/ 2017, 2018 new iPad Pro 11, iPad Air, iPad Air 2, iPad Air 4, Galaxy Tab a 10. 1 10. 5 9. 7 8, Galaxy Tab s 8 9. 7, Galaxy Tab E 9. 6, Switch.|【QUALITY GUARANTEE】: If there is any quality problem of the product itself, do not hesitate to contact us immediately. We will solve the issue to your satisfaction. Customer service is our business philosophy.", "user_id": "AFUDD2HQICGHV2X6MXURZJ3FFKTQ,AHFWTVQF2PV2OSERO2BHZXE6OKFA,AGH7ZYNYWARUASLXNJWFVBMBQ27Q,AG5CZPAP4OJQAWDOFWDX5DEQ23JQ,AHEWCJSLDVOE5SZ7AB4VZ7GWOSCA,AFMCJ44W4DCNOIZZWGHT4II3EYZA,AFYNVZTVIP3DSF3J5C2NCUYYSHBA,AHUW3CZFOWPFLM3DYDHP3N4HXD7A", "user_name": "Amazon Customer,GopiKrishnan,S.md riyas,suhail khan,VIVEK KUMAR,Subba Rao,Sumedh,MK", "review_id": "R3IBC8ULMDZUKM,R347N3QN1A9C,RUY22A4DUCUEL,R11AIQ47T2I3TL,R3LJ607WFYPUQ4,R3COKVLLD9MI38,R295JPL1432HLX,RCIVIPD80E5T8", "review_title": "Very sturdy and convenient.,Good product,Very,Find summed up review below,Very Useful 🙂👍,Great product,Good product,Works well enough, it isn’t really stable and tend to vibrate", "review_content": "PROS: Very sturdy and stable. Not easily knocked down by kids. No fear of falling over.Mobile holder stand is very flexible, easy 360 degree rotation.Mobile holder also pretty tight., very safe to keep the mobile.The adjustable clamp is wide enough to suit any width - you can fix it on very slim or thick surfaces. Holds well.Easy to assemble according to the instructions given on the website.Overall, very satisfying.CONS: A bit tight when it comes to the gooseneck clamp. So quick adjustments (to length) may not be possible while watching.. But that adds to the sturdiness. So that's okay.The mobile holder also is a bit tight to insert the phone and remove. But again, you needn't fear about the mobile loosening and falling off.,For the price it is the best, it's hard but without hardness it cannot withhold a weight of tabletSo the the hardness makes sense,Not bad it's okaysVery nice product bro value for money but you ask the store in this product how much other ways the quality and material are good,Better for streaming videos because if you fit your phone in this and then touch it then it moves due to the weight of phone or use this for any work where you don’t have to touch your phone frequently such as video calling or voice calling etc.  Otherwise it’s good,Very useful for students for their online study, aslo useful for movie lovers.,Using for Kindle on bed. Quite sturdy and good clamp. Length of wire should have been slightly more by 9 inches which will enable user to hold the mobile/ Kindle at a good distance.,The length is not great but the product is perfect for its prize and solves the purpos, using it as a bed arm,Works well enough, it isn’t really stable and tend to vibrate and shake when holding tablet and some heavier phones.Also I can only hold phone horizontally, that means it gonna block charging ports and speakers.", "img_link": "https://m.media-amazon.com/images/I/41bFp+Wev+L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Sounce-Adjustable-Universal-Flexible-Gooseneck/dp/B096TWZRJC/ref=sr_1_269?qid=1672895828&s=electronics&sr=1-269"}
{"product_id": "B09GP6FBZT", "product_name": "OpenTech® Military-Grade Tempered Glass Screen Protector Compatible for iPhone 13/13 Pro / 14 with Edge to Edge Coverage and Easy Installation kit (6.1 Inches)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Maintenance,Upkeep&Repairs|ScreenProtectors", "discounted_price": "₹299", "actual_price": "₹999", "discount_percentage": "70%", "rating": "4.3", "rating_count": "8,891", "about_product": "TopDeals Mobile Accessories: It is 100% brand new tempered glass for iPhone 13 / 13 Pro / 14 (6.1 Inches) which is specially designed for edge to edge protection.|Real Experience: This iPhone 13 tempered glass is designed to provide the smooth experience with 99.9% transparency to allow you to feel a natural viewing experience.|Best Quality: This iPhone 13 pro tempered glass is ultra-thin (0.33 mm thickness) which is made by precise laser cut, exquisitely polished, good rounded edges and compatible for 3D touch. This iPhone 14 tempered glass promises full compatibility with touchscreen sensitivity and HD Clarity which retains the experience of the original glass. This iPhone 13 screen guard contains hydrophobic oleophobic screen coating which protects against sweat, oil and water.|Scratch proof: This iPhone 13 pro screen guard provides the 9H Hardness screen protector can effectively protect your phone from unwanted scuffs and scratches by knife, keys and some other hard substances. The surface of the iPhone 14 screen protector has a strong hardness and 9H tempered glass protects the entire front display. Don't get scratches even if scratched with keys in your pocket.|Compatible Device: iPhone 13 / 13 Pro / 14 (6.1 Inches) Easy Installation: This iPhone 13 edge to edge tempered glass is bubble free adhesive and easy to install. You can follow installation guidelines which printed on OpenTech box. Box Includes: iPhone 13 Pro gorilla tempered glass, Wet wipe, Microfiber screen cleaning cloth, Dust absorber sticker and OpenTech box with installation guidelines.", "user_id": "AGPLH6XWDVSULDCZOFJRM6XNTNXQ,AGJA524SLTMC75HT355BYHZ4SYZQ,AHKBD2IJWFB65Y2C2W4J2VOMZQ6Q,AGKPXBE2NL6FYBQESVEHL3RA6X5A,AFKTDJKT5X5JYXWOH5SMI7ZBB42A,AFN6SNPXWBPQF3LKVCMEV42Z66EA,AHBOEAQIX4ZVKW7XTBDVCH3CWVSA,AFWQEIDPK36M5BVEIU5MXV4HEMEQ", "user_name": "Prashant,Ranjan S.,Trx,Misika,sourabh chatterjee,parth,basnayee,Dr Jerrish A  Jose", "review_id": "RRF41F2P7DFYP,R2SE5XVJ5LORTD,R2N5ZJZILGOY2N,R1SQ6MJK0SVC2A,RMDL90RMZO5Y,R1QERTKSSSD95F,R3FN5C259GVPPY,R2FT933TABEB7O", "review_title": "Prompt service. Good quality,Product is good, but little over priced.,The best screen guard I’ve used in terms of ease of installation & product finish,Since there is no align master provided, it's nearly impossible to stick it in the right place.,Nice product and well priced,Great quality and 100% transparency,Good for the price,Excellent customer support with a perfect product", "review_content": "Good quality tempered glass. Best part is these guys are extremely prompt in customer service and warranty issues,Product quality good, but over priced. Also there is a small gaps from the edge, but can be ignored.,I got two screen guards (for 14 pro & pro max ) & installed only the one on the 14 pro. I’ve been used to fixing screen guards for multiple types of phones from multiple brand screen guards .My honest review after the installation - I really liked how easy the installation was, the coverage of the screen guard across the entire screen & the finish of the product once installed . Hope to put an update after a period of time on how the screen guard coped with my rough use .,Good,The product came well packed & is durable. Infact much better than other organisations who try to sell you same stuff with inflated pricing. the product stays on for long and has all the qualities to be called a top product,I recently purchased a screen guard for my smartphone and I am extremely happy with my purchase. The screen guard was easy to install and it fits my phone perfectly. It has provided excellent protection for my phone's screen and has prevented any scratches or damage. The screen guard is made of high-quality material and it is very durable. I highly recommend this screen guard to anyone who wants to protect their phone's screen. It is a great value for the price and it has exceeded my expectations. Overall, I am very satisfied with my purchase and I will definitely be purchasing from this company again in the future.,Quality of the glass is good. Have been using it from last two months the scratch resistant coating works fine.,I had issues with initial application of screen guard (I phone XS) and then I contacted customer support to get it resolved. They immediately responded back and the issue got resolved. I am very much happy with the purchase and I am planning to get another one for my Samsung M 42 5g.", "img_link": "https://m.media-amazon.com/images/I/51WJbMPuROL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/OpenTech%C2%AE-Military-Grade-Tempered-Protector-Installation/dp/B09GP6FBZT/ref=sr_1_274?qid=1672895828&s=electronics&sr=1-274"}
{"product_id": "B0B3DV7S9B", "product_name": "EN LIGNE Adjustable Cell Phone Stand, Foldable Portable Phone Stand Phone Holder for Desk, Desktop Tablet Stand Compatible with Mobile Phone/iPad/Tablet (Black)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Stands", "discounted_price": "₹209", "actual_price": "₹499", "discount_percentage": "58%", "rating": "3.6", "rating_count": "104", "about_product": "This adjustable cell phone stand for desk is widely used in all mobile phones and tablets below 15 inches. The stand is compatible with iPhone, Samsung Galaxy, Huawei, LG, Sony, Xiaomi,VIVO,OPPO,nexus and all types of smart phones including case.|The desktop mobile phone bracket can be folded, and the folding mobile phone bracket takes up almost no space when storing, so it is easy to carry in the pocket or bag. You can use the mobile phone bracket at any time, which is a great partner for watching YouTube videos or FaceTime calls. Perfect choice for home, travel or business. With it, your life will be easier and more convenient.|This desktop adjustable mobile phone bracket is ergonomically designed. The height and angle can be adjusted to meet your different viewing needs. This mobile phone bracket riser provides you with a comfortable view, which helps to hold your posture and reduce pressure on your neck and back. You can enjoy your games, videos and face-to-face time hands free.|The Mobile Holder Is A Handy Tool For Your Kitchen Routine As Well. You Can Use A Holder To Fasten Your Mobile Phone To Watch A Video On Youtube, The Premier Of Your Favourite Actor's New Release, Or A Recipe For The Subtle Savour Of A New Cuisine While Scouring The Pots And Pans. Aren't You Saving Up On Time And Preventing Your Smartphone From Getting Wet", "user_id": "AGY4ILCL5CCENO25T2FOKOESHJTQ,AH32DGGWA7EAENDTHYGGGHBVNQPQ,AFNU4IC55QLKRUH3HO4F5Q3IFMMA,AGOUFAD56YMVQOAFUWLW3XFVWX4Q,AFSM54B2B2VV367PWSU7PU6PE4HA,AGFXR3KSCZMQCGC4PF6KV4YYBI5A,AF7767UQSOLO562YELBYVK7LKB4Q,AE3DUU4DR7FZFATXB6EAXVQ2XXHA", "user_name": "Sheetal,DADA,Tanmay,Bala chalapathi,hamid,MOHAMED ISMAIL,Rohit,Chandni verma", "review_id": "R3M6TF2LH1H23Q,RT3G3MB3U8LC1,R3GU8IR94309OK,R2LWF5MF37BRFN,R16HGOYD8RITO8,RS7K2VARSRPPH,R29RY4BYVG8N55,R1WPHPSV5DKHQJ", "review_title": "Ok but not bad,Good stand but not quality product,Not so good,Low quality,Worth and good quality,Very useful,Very use ful and easy to carry,I like the product", "review_content": "Lital bit ok,Good design but china product,It changes the angle and gets loose in a few days only,Very poor quality,It's worth and good quality,Very good quality,,I like the quality of the phone holder its amazing", "img_link": "https://m.media-amazon.com/images/I/416n3nd4MhL._SY300_SX300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/EN-LIGNE-Adjustable-Tabletop-Compatible/dp/B0B3DV7S9B/ref=sr_1_293?qid=1672895835&s=electronics&sr=1-293"}
{"product_id": "B09MKP344P", "product_name": "Tecno Spark 8T (Turquoise Cyan, 4GB RAM,64GB Storage) | 50MP AI Camera | 7GB Expandable RAM", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹8,499", "actual_price": "₹12,999", "discount_percentage": "35%", "rating": "4.1", "rating_count": "6,662", "about_product": "50MP High Resolution Camera for Extra Clarity with F1.6 Large Aperture | 8MP Front Cam with Dual Front Flash | No support for Africa's frequency bands|6.6\"FHD+Segment leading display with 91.3% screen to body ratio|New metal coding design-Bold, appealing and youth centric|5000mAh powerful battery with ultra power saving mode|Helio G35 Gaming Processor for robust usage", "user_id": "AFBPBZLHAOY5FLNKXSMY7R5NGW4A,AGRIGBJGBMM4HDFVZRSR6KNFCZQA,AFL2RLMNGDTJED222FJJLDX6BN2Q,AGO2GZLUYPY2PUV7F5YM244ODJ7A,AGZT23MB5BA7JK74E4NOOJEWQVAQ,AEEK7J244RB5UK7OFFLH5QHEQ3RQ,AGHSNUIUGMFHBLKEXG7CRIF5DC3A,AEPBNLNECBWYCIHCV4MUJDT5WCBA", "user_name": "Bipul s.,Nigen das,Ranjit N,Placeholder,yogesh kumar,ANIRBAN  GANGULY,Patan,Abhijeet Padave", "review_id": "RMGE5B6FD1FS5,R1FN1REHXYLMZ,R1BL6NYV6D8W1M,RJHBMPZRSI8AJ,R144IGLWP70M8K,RHSVGQWZTK60L,R2M5S0A5M8DPEJ,RWJG2SH0FCSIY", "review_title": "I have been using this phone since 2month it's very good on problem,Nice products,nice product,I am giving  9 out of 10.,Ek dam mst,Tecno Spark 8T,Gud,Lag", "review_content": "I used this mobile Last 2months overall very good i am very satisfied buying this and no lag no heat you can go for it,Nice phone looking good and over all good for this price,good,Everything is good, but the voice of recorded call is very low.,Fentastik,Good. But brightness level is naturally low in this phone brand,Gud,It lags and hangs a lot and there are too many ads and inbuilt functions in the phone which are very annoying.", "img_link": "https://m.media-amazon.com/images/I/41KVdXIcg0L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Tecno-Spark-8T-Expandable-64GB/dp/B09MKP344P/ref=sr_1_294?qid=1672895835&s=electronics&sr=1-294"}
{"product_id": "B08JW1GVS7", "product_name": "URBN 20000 mAh Lithium_Polymer 22.5W Super Fast Charging Ultra Compact Power Bank with Quick Charge & Power Delivery, Type C Input/Output, Made in India, Type C Cable Included (Camo)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|PowerBanks", "discounted_price": "₹2,179", "actual_price": "₹3,999", "discount_percentage": "46%", "rating": "4.0", "rating_count": "8,380", "about_product": "Proudly Made In India|It will charge a 3000mAh phone battery up to 4.7 times & It will charge a 4000mAh phone battery up to 3.5 times|Input - Micro & Type-C Port. Charges in 5 hours (Powered by 22.5W Adapter) and 10-12 hours (Powered by 2 Amp 5V Adapter)|Compact body along with smooth touch finish gives the Power Bank its premium look, weighs only 339 grams|For 22.5W Super Fast Charging the gadget and the cable needs to support 22.5W QC or PD.", "user_id": "AH3HLGFYASB5KSFZRSQVOQF5BKKA,AGTPV3RAU44JP5BCX4LCQJD4WVLQ,AHPI2KLLZMZK5CGEZ6ILSIA4FHJQ,AEZZW5Z3LUJUY5RPYIDDTT64QVQA,AHBEND2UUAP6UNJZVH72H7FKZSMA,AHLQIXPRTNN5L6C3CBOUFKA5BJ6Q,AFJVOXOQOKVDW2MJ24CT2NJD6Q7Q,AELCTVZ7X3OEG62M4JR2TL2VCHDQ", "user_name": "Saunak,RAJA PANDIAN,Shanky,Bhabagrahi Panda,MJ,SOHAM B.,Marion Noble,J. M. V", "review_id": "R1PRZD3XZDNYN9,R2ZE4LMVZ6V163,RKC553AXS535M,R333JM0032BELJ,R5S6E55NYGJUK,R2ZE9NQLM0OD5B,RNZNVONK9XAL7,RIZOHKWA7NHO4", "review_title": "Handy, premium and fast charger but just 2 outputs,Don’t give much back up,Lightweight heavy duty but charging speed less,Not fast charging to one plus Nord mobile,Power beast with some drawbacks,BEAST mode,User review,Charging is fast. C to C cable and adaptor not supplied", "review_content": "The product is handy and really feels good to hold. It supports fast charging.It takes around 5 to 6 hours to fully charged it.The only down side is that, it just has 2 outputs 1 usb 2 and another USB C,It is good is if you want a budget power bank but maximum it last up to 2.5 charges in Apple 12 pro max the charging is super fast the disadvantage is it take so long to get recharged,Gud product. Lightweight considering 20 k charge but slow charge. I have a fast charging phone and doesn't charge fast enough. Lightweight. Easy to carry. Charges fast too. Overall gud. Got at discount of rs2000. Satisfied,It is not fast charging to my mobile One plus Nord 2.,Initial review post 1 month usageCharging time - More than 6 Hours with fast charging power cable & power adapterCharging phone - Can charge a phone 3-4 times(tested with 3400mah battery)LEDs - Utter waste. So mild that it cannot be seen from a distanceThis power bank truly delivers as mentioned. I was able to charge my 1+7T phone 3 times fully with still some charging left in power bank. It took around 1.5 hours to charge my phone completely. Absolutely amazing product at offered price, you can go for this one. Also tried dual feature i.e. charging power bank & at same time charging phone and it works well no problem. Did not face any problem with power bank heating issue while charging phone or itself. Type C charging port for power bank is good so you don't have to carry two different cables and type A usb cables are hard to find.Few cons what I felt after using1. Charging cable provided along is of no use, it does not support fast charging. Hence used fast charging cable for both charging phone & pw bank.2. LEDs is of no use from a few feet distance. As they r so mild to be seen from a distance. You will have to hold PB very near to actually see LEDs. Although not a deal breaker but definitely 1 star deducted due to this.3. Bulky very bulky, definitely cannot be carried in a pocket. Not a deal breaker again.,This powerbank is the daddy of them all. Considering the amount of juice packed into it, it's form factor is manageable. It holds a whopping 27k mAH of charge. Can reverse charge another powerbank. It charged up a 8k power Bank from 0-100% in around 18min while it dropped from 100-75%. 4 LED indicators, indicating the quartile of charge left in the device is very useful. I've not yet had to even once struggle to charge the device as even with heavy usage daily, I barely drop to 75% before I recharge it. It retains charge very well too. Solid buy, you literally have a generator in your pocket.,Worth for money,Charging is fast. Supplied with USB to C cable only.C to C cable and adaptor are required to use the another charging / discharging port. Hence additional cable & adoptor are to be purchased separately.Other manufacturers supply along with c to c cable even with lesser cost.", "img_link": "https://m.media-amazon.com/images/I/312X0wyfvmL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/URBN-20000-22-5W-Charging-Output/dp/B08JW1GVS7/ref=sr_1_295?qid=1672895835&s=electronics&sr=1-295"}
{"product_id": "B09LHZSMRR", "product_name": "Redmi Note 11T 5G (Stardust White, 6GB RAM, 128GB ROM)| Dimensity 810 5G | 33W Pro Fast Charging | Charger Included | Additional Exchange Offers|Get 2 Months of YouTube Premium Free!", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹16,999", "actual_price": "₹20,999", "discount_percentage": "19%", "rating": "4.1", "rating_count": "31,822", "about_product": "Processor: MediaTek Dimensity 810 Octa-core 5G processor based on 6nm process with HyperEngine 2.0 and clock speed up to 2.4GHz;|Display: 6.6 inch FHD+ (2400x1080) Dot display with 90Hz high refresh rate and adaptive refresh rate technology; 240Hz touch sampling rate;|Camera: 50MP High resolution primary camera f/1.8 with 8MP Ultra-wide sensor| 16 MP Front camera|Battery: 5000mAh battery with 33W Pro fast charging support|Memory, Storage : 6GB LPDDR4X RAM | 128GB UFS2.2 Internal storage|Connector type: usb type c|Headphones jack:3.5 mm,Display type:LCD, Operating system:MIUI 12.5 based on Android 11", "user_id": "AGD5KTBDTS26I2SB3B7LCYBR6U3A,AFE2LQATN64EXU6NVTTEMV5XKDGA,AEJA3E7VLQFEQGJGJLV3KOZPXJMA,AEE6AOZ236TYFSCLGHGXIIG2SFUQ,AEZR42M5D6YTRJ732HWXBM5YEGKQ,AFCR3Q2LBT2KWRN42AOROJEDECNA,AET435JGPEIORB35LT7EZ4ASDRRQ,AENNEXWQZKHYRUEMUASXQG6O4GDQ", "user_name": "Kapil kumar,Rajendra K Jadhav,Nazaf beg,Jose Febin,suresh gaur,Rinku Barota,Jagdish Joshi,8826277722", "review_id": "R1A2H4LNTTSZKN,R29RZ6S6SY3H4F,R2MZ7BZ4991B7O,R125UHW97PT3OH,R1GNNZDXKP43DG,R1ZDKQ5659C68H,R36FYJ9DGL1QL1,R1IZDBZW18XJPH", "review_title": "Good 5g mobile,Overall good phone,The best phone in 2k22 I have purchased in 30sep,Works amazing and buttery smooth, design kinda boring though,Good,Overall good under this budget,not bad,Buy for normal daily use..", "review_content": "Good one display is good battery life is very good camera quality is good for me finger printer placement is not good can't be used with both hands,Using it from last 3 months now. Battery backup is good , camera is good and in this price range this is one of the good option as of now,The best phone in 2k22 I have purchased in 30sep but on 2dec my mobile stolen during this period I have used 7-8 hrs in a day continuesly but there's no lag problem battery life is good the speaker is not good I think in this mobile there is one problem I face,-Phone runs amazing with the dimensity 810 and I only have praise for the performance-90Hz refresh rate is eye opening coming from a 60hz phone-Build is pretty solid and the back has a nice texture that doesnt build up fingerprints much-Redmi has packed the phone with some neat features such as the IR blaster and the surprisingly amazing DAC which redmi didnt even flex about in the marketing. (my headphones sound miles better out of this phone than my laptop smh)-Included phone cover is alright and its nice of redmi to throw one in (hole around headphone jack couldve been bigger though as it interferes with any aux cables with chonky housings.)-Only complaints id have are that the design is kinda mid; doesnt look very amazing, but nothing to complain about either hmhm-Cannot comment on camera quality as I am a pleb who doesnt know how to nitpick at camera quality :P-Included screen protector is reaally bad( its only been under a month and there are already scratches around the lower screen where id be typing). So highly recommend peeling it off and taking your chances with the Gorilla Glass or just getting something aftermarketOverall strongly recommend if you're into a solidly built phone that focuses on getting stuff done rather than sitting around and looking pretty,Good,If you buy phone for camera purpose then don't buy this. But overall average mobile under this price. Battery backup very good and changing time apx 40-50 minutes for 1 to 100%.,good,It's a good product for normal daily use.Camera quality is not up to the mark.Overall a good product.", "img_link": "https://m.media-amazon.com/images/I/41sJ50FH9OL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Redmi-Note-11T-5G-Dimensity/dp/B09LHZSMRR/ref=sr_1_297?qid=1672895835&s=electronics&sr=1-297"}
{"product_id": "B0B5V47VK4", "product_name": "OnePlus 10T 5G (Moonstone Black, 8GB RAM, 128GB Storage)", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹44,999", "actual_price": "₹49,999", "discount_percentage": "10%", "rating": "4.3", "rating_count": "3,075", "about_product": "Camera: 50MP Main Camera with Sony IMX766 and OIS, 8MP Ultrawide Camera with 120 degree FOV and 2MP macro lens with LED Flash; 16MP Front (Selfie) Camera with EIS support|Camera Features: Nightscape Mode, Ultra HDR, Smart Scene Recognition, Portrait Mode, Pro Mode, Panorama, Tilt-Shift mode, Long Exposure, Dual-View Video, Retouch, Movie Mode, Cat/Dog Face Focus, Video Nightscape, Video HDR, Video Portrait, Focus Tracking, Timelapse, Macro mode|Display: 6.7 Inches; 120 Hz Fluid AMOLED Display with Corning Gorilla Glass; Resolution: 2412 X 1080 pixels; HDR 10+, sRGB, Display P3, 10-bit Color Depth|Display Features: Image Sharpener, Video Color Enhancer, Screen Color Mode, Auto Brightness, Manual Brightness, Screen Color Mode, Bright HDR Video mode, Dark Mode, Screen Color Pro Mode|Operating System: OxygenOS based on Android 12|Processor: Snapdragon 8+ Gen 1 Mobile Platform|Battery & Charging: 4800 mAh with 150W SuperVOOC|In-Display Fingerprint Sensor", "user_id": "AFPMBWVYFY6T7W3RZXDGZUPYNKPA,AG5QSBZVK2PROVFXY6NCIIPZCBMQ,AGIZ3WNZX67YKD4PT46PBZS2V3QQ,AEZRQDYOBPGOJXGYBF76TP4PVIUQ", "user_name": "Subhra S.,Omkar,Varun George,Atul Anand", "review_id": "R28G51B8I2WH0N,R1PAALMCY8OGOR,R2S1GDT2RANQ20,R3F1K3SM97DG5P", "review_title": "A conditional beast,Overall satisfied but Wow factor is no missing,Honest one which might help.,Perfect one , You can buy", "review_content": "Liked - Top notch display, gorgeous display, heavyly and seriously powerful device thanks to 8+ gen 1. Tremendous battery life in heavy usage. Super cool device. Silky buttery experience with blazing fast performance. good sound quality. The form factor is really good. I mean the screen is flat, so it feels like a wide(not actually wide but feels like) phone also it is tall, that's why it really feels good at hand. I have an iPad but all the work now can be done by phone so I am happy.Didn't like it - As I had op5t i loved oxygen os, but now it feels like realme UI. Camera is worst for this price. Main sensor is good other two are useless. Company should provide a telephoto lens in this price range. I had op5t and previously op3t,both camera were good. Op10t camera is exactly same as nord 2t.Conclusion - if you looking for speed, performance, battery life, longevity, best of display, premium feel then go for it.If you are looking for OP experience like an alert slider, or a good camera then please don't choose this. Either u can wait for the next OP or go for other devices. if you don't bother about UI experience(i.e. oxygen) then go for iqoo9t(its far better in spec)go to gsmarena compare op10r and op10t. exactly same specification except processor and charging speed(this much fast charge is not required by excluding important spec) .,I am OnePlus user since their 1st phone. I have used OnePlus 1 , OnePlus Nord , Nord CE, Nord 5T and now 10T. I have been using 10T as my primary phone since last 1 month.  Everytime OnePlus never fails to impress with their new phone but this time you would feel something is missing may be because OnePlus has already raised their bar so much that user always expect more from them . When I saw 10T first time , somewhere in my subconscious mind I had taken my decision to buy this beast. But before I reviewed so may phones, from One Nord 2 to  iPhone 14.My ratings :Design and build: 9/10Camera quality: 7/10Battery backup and charging time : 9.5/10Performance: 9/10Undoubtedly design and build is unmatched. So sturdy and beautiful. Camera quality might be discussion point. They should have given more in camera because phone comes in high range and premium level but current camera is not so bad. Noone can beat it's battery charging time and backup time. Within 20 min 0 to 100% , highly impressive. It will survive around 1 day for average user. Performance is good , installed and ran multiple apps at a time, never faced any hung issue or app carsh issue.As I said , even if wow factor is missing this time, I would say good phone with nice overall performance , design and features. If you get it in sale around 40k it's a good deal . Go for it , nothing to regret. 😊,Purchased it some days ago !!Switched from my Asus so I had really high expectations and well, it did perform somewhat close to it but also many downgrades as well, I'm just gonna list as pros and cons !Pros : - I mean snapdragon 8+ Gen 1, you can expect amazing performance, why not top tier since it's the best processor android could offer? Well cause I feel the processor on this one is under clocked to reduce heating but it's holding up pretty good in terms of gaming and other benchmark tests and stuff.- Build Quality is actually good, Especially the back, the back does feel amazing and while holding it does feel like a premium phone, expect for the frame ofc, it's made of polycarbonate but we can get a hang to it later.- Software, I'm not gonna sit around and cry about their merging with oppo, I feel it's fast and a good ui, of course some old features not available now since I've used a OnePlus 5 in the past for some weeks but we can get a hang to this new oxygen os, just hope it's not completely turned to color os.- Charging is just insanity on this one, switching from a phone which used to take around 2 hours to get fully charged to this one, almost finishing full charge under 20 minutes and I've witnessed it several times, it's just impressive but some issues and I'll talk about it in cons.- Networking and connecting is fast and good! Haven't faced any major issues in my networking experiences! calling is a good experience, connecting with networks and bluetooth is extremely fast, good overall.Cons :- about the processor, like I said it is under clocked and the benchmark scores proved it a bit, although I don't care about benchmark scores and just want to keep my belief in real life usage so it is doing good.- Polycarbonate frame and No alert slider? Like really? at least we deserved a metal frame at this price segment which is what upset me a bit, not really a big fan of alert slider so I didn't mind that part.- the camera setup is so so so average and stupid, aside from the main lens, the wide and macro just did not make sense at all and are completely worthless in this segment, this is literally the same setup from Nord 2T but just a better software optimisation, front camera is alright too, nothing that great- Charging indeed is one of the key factors in this phone but it takes a toll on the battery backup, usually in my usage I have to charge it 2 times for it to be used the whole day, it drains a bit more than I expected it to, also there's no option available to disable 150W charging to let it charge in usual speed to test the battery, only except for the night optimisation mode, which is kind of good in my opinion.Phone is a good segment in this price range and If you do believe in the particular brand image and it's products then go for it. Although Iqoo 9T does provide a better camera setup with a bit more aggressive processor performance, but this device does the job too.,So , basically I am reviewing it after usage of 1 month and 2 days. I am giving it 4 star because of Alert slider missing. Let's me clear it by points.1. Battery is awesome. It will get full charge in 19 minutes 20 seconds. It lasts more than 25 hours to me.2. Camera quality is nice. Specially night mode is awesome. Some improvements should be done for selfie camera but it clicks nice picture.3. No lagging , no hang. It runs smoothly and very fast.4. Only thing that disappoints is alert slider that is missing in this phone.5. Video quality is awesome while you record and it is stable.6. While watching any OTT , streaming quality is awesome. You can fully enjoy it .7. Speaker of phone is perfect, even at lowest volume you can clearly hear the voice on call.", "img_link": "https://m.media-amazon.com/images/I/413c3ZnFLxL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/OnePlus-Moonstone-Black-128GB-Storage/dp/B0B5V47VK4/ref=sr_1_300?qid=1672895835&s=electronics&sr=1-300"}
{"product_id": "B08H21B6V7", "product_name": "Nokia 150 (2020) (Cyan)", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|BasicMobiles", "discounted_price": "₹2,599", "actual_price": "₹2,999", "discount_percentage": "13%", "rating": "3.9", "rating_count": "14,266", "about_product": "MicroSD card slot expandable up to 32. Network bands GSM 900/1800|Rear camera with fla|Talk time up to 19.4 hours, standby time up to 23.4 days Country of Origin: India 1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase|6.09 cm (2.4-inch) display, ergonomic design with large button|3.5 mm headphone jack, wireless FM radio, MP3 player, Bluetoo", "user_id": "AEE5XXQWRVZSVDNYTBDR3BY4PHAA,AHBJI32NFYYFJRSI2NZ3RGNYYNLA,AF2H7SUW3MQY6BK7UCPQQIEGRMTQ,AGRZAB2LJP4QQYHXKK3B7UW6YF2Q,AHOI4MSGDEZLYUHGIGUGTGYJKDXQ,AGVPR6MD63A3AKMWVSTGLXNYTXQQ,AFOIHDXLNQ6URAZKGT3UND7PPAQQ,AGQJUVEAZQS64J4PFY7EENAHF2QA", "user_name": "Rajkumar,Amazon Customer,kamal,Nishan singha Roy,Mehul Solanki,Rajesh,MAHENDRAN,Sundar", "review_id": "RGIN9AS9WAQNP,R2TI5S1VH0Z88G,R3K4W8ED08OFWZ,RHSML7W05JVC0,R1CFTT0Q5RRC8C,R3SMLK8O4PUTW5,R3BHJRLDSTVS7W,RO0KLBJXV6XCR", "review_title": "Ok phone,Good Basic Phone,Nice one,Hghjk,Good one,Nokia 150,Listen to this before buying..,Good produt", "review_content": "Audio contains lots of distortion when using speaker, Battery life is good.,I bought this phone for my staff, who can handle only these basic variety types. She is very happy and loves the color.,Nice one,Hgh,Battery backup is great. Didn't like center button design. Separate four buttons would fit great rather than one square one. Irony is that it is for indian customers but couldn't find Gujarati language in this phone. Overall product is good for normal usage. Bluetooth , radio, camera, memory card, dual sim, games are added features for fun.,Good Product,It's amazing...and worth the cost ..the only weak point is that the response from the phone is a little late..after pressing buttons...otherwise it's best under this range..,Nice one, easy use and more flexible one easy to carry, good battery life and camera quality also good not bad sound quality is good  over all value for money.", "img_link": "https://m.media-amazon.com/images/I/41fMEQ-GoHL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Nokia-150-Cyan/dp/B08H21B6V7/ref=sr_1_301?qid=1672895835&s=electronics&sr=1-301"}
{"product_id": "B09BNXQ6BR", "product_name": "Noise ColorFit Ultra SE Smart Watch with 1.75\"(4.3cm) HD Display, Aluminium Alloy Body, 60 Sports Modes, Spo2, Lightweight, Stock Market Info, Calls & SMS Reply (Vintage Brown)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹2,799", "actual_price": "₹6,499", "discount_percentage": "57%", "rating": "4.1", "rating_count": "38,879", "about_product": "1.75” TruViewTM display : See the clear, bigger picture on the 1.75’’ touch screen with 320*385 pixels Crafted from Grade 6061 aluminium, ColorFit Ultra can withstand daily rough use with ease.Strap Size & Material : 22mm & Silicone|Personal health assistant & NoiseFit App : Take care of your health with features like blood oxygen (SpO2), heart rate, stress, REM & sleep monitors. Know more about your health, stay connected with the world and more via the dedicated NoiseFit app.|60 sports modes & 100+ watch faces: With 60 sports modes, you are spoilt for choices; just pick and play your sport. Change your look as per your preference with 100+ customisable and cloud-based watch faces (and straps).|9-day battery & IP68 Waterproof : The powerful 9-day battery stays with you through your everyday hustle. ColorFit Ultra is ready to go with you everywhere, thanks to IP68 waterproof rating.; Productivity features : With smart utility features like call notification, quick reply SMS, world clock, stock market info, torch and more, you will be on top of your game. Charging Time : Upto 2 hours|Item Type Name: Smartwatch", "user_id": "AEZH7UN4SKV7VKJ3NYH7D7CBHA4A,AEEMDECLMB6ZOYW4MZDRUTMPNDMQ,AGCDPH7XJBZZ6ALNCA6XYKP3BZIA,AEZHGBDTPEAIDEC4HF753JL7NDNQ,AFNGYI4A433E2ZEIJ4PTRXTOFSCQ,AGGWFNVDN6N7RMXJH3DXEDO63ANQ,AEF27BA6AC4XT2HSGW57TG3YS2HA,AF5WOBBT3ODEBTFUCW72L3P57TLQ", "user_name": "shiv,Pankaj Bhatt,Dipanshu Kr Biswas,Jeet Jangam,Ekta,subhabrata paul,Anurag kumar,Manish B.", "review_id": "R1JO87DOGUEQHC,R1UQ0AYNB30CZS,R34O4E591I5RJN,R2X9U1VWHBNIAX,RPRRWM1J2QDNP,R32LTUGL01I85B,R1HKJTBFVLO3DB,R3S7HEACPHR8D5", "review_title": "Budget friendly watch,Good product at this price range,Ok,Satisfied,Watch ⌚️ Review,Nice,Display touch was good but screen bazales is too much,Nice watch under 2000", "review_content": "I liked the watch, the battery of this watch is so good that before use i charged this watch and it's been 2 weeks and this watch still have 25% battery left. And nagative side is i ordered black strap watch and i got grey strap watch and this is sellers mistake, i tried to return this and I've called Amazon help line then hear my problem and see it online that i got wrong item and then they say they will connect me to other person who will solve this and then no one pick the call the ring just continue to ring and after 5min i thought that no one is gonna pick the call ever and i disconnected and start using it. Watch have some basic futures and i like it.,One of the best product in this price range. Been using it for a year now and I have no complaints. Built quality is good. Steps count is not very accurate and we can say that the software lacks in accuracy in many ways when compared to other big brands (Apple/Fossil). But I have seen worst. Touch is very smooth and the notification alerts works as expected. This is water and swim resistant. I am not sure if it has IP67/8 rating but I believe this is dust proof as well, since I have been using it for almost a year now.Good product for this price range.,Everytime sleep mode has to activate, this should not be done. It should be automatically.,Good product,bezels are big but it's ok for this price range and I am satisfied with the product.,Watch is beautiful and upto mark, only one con in this watch, you can't  attend the call and revert you can only revert by messages,Nice,https://m.media-amazon.com/images/I/71ZeE6pWAaL._SY88.jpg,", "img_link": "https://m.media-amazon.com/images/I/41AGCk95dpL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Noise-ColorFit-Ultra-SE-Smartwatch/dp/B09BNXQ6BR/ref=sr_1_303?qid=1672895835&s=electronics&sr=1-303"}
{"product_id": "B01FSYQ2A4", "product_name": "boAt Rockerz 400 Bluetooth On Ear Headphones With Mic With Upto 8 Hours Playback & Soft Padded Ear Cushions(Grey/Green)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|On-Ear", "discounted_price": "₹1,399", "actual_price": "₹2,990", "discount_percentage": "53%", "rating": "4.1", "rating_count": "97,175", "about_product": "With 40mm Drivers get ready to immerse in HD auditory experience with super extra bass to get the day going. Inline Remote : No|Plug into your rhythm with style via the wireless Bluetooth headset and carry the vibe wherever you go|Stay immersed into Nirvana for extended durations with a playtime of up to 8 hours|Its lightweight and ergonomic design offers the comfort and ease while you listen to your favourite artists and have fun|The easy access integrated controls with built-in mic offers a smooth user experience and hands-free communication on the go|Stay connected to your sound via not one but two modes: Bluetooth as well as AUX|1 year warranty from the date of purchase.", "user_id": "AFWOX5BA5QS5TCVTNV3EHQXOSCLQ,AGGM4C652EG6WSDEOWBQCR7UXG7Q,AFZ3S6RJS6RVOXVK5OAIT4AX76UA,AFRUXOMHPM4OTISKC4VE3PM45DTQ,AFGX776XSUUA2LIYKLHSXN3PHOXA,AF6XZI4LVIVFP2UTPNVFYGF7JPQQ,AGYX7IY6ZHCU2J6DXRW5SN6LGEVA,AHA3ODJCWS52ZKJYWV2UBFR3AVBA", "user_name": "Sagar,Shreyas,Arjun Thomas,Sachin Yadav,Karthikeya Reddy,Raja,Anku kumar,Sagar kate", "review_id": "R2E3GV1LFGQNFD,R3IM6TBVGY4SYQ,R236B8Q3BSGZJ7,RO9KNXZ2RH2TI,RT2VNM024LSCP,R3PRBLGHPRCZ6A,R1AYA1JIHAVM50,RR81G0GIJQKT9", "review_title": "Worth Every Square Inch.,VFM, Plastic build. Must buy,3 years of extensive usage , delivered the perfomance to its price,Still working after 2 years,Low in price but sound was high,Super head phone under 1300 rs,Wow nice this headphone Just like fall in love🥰 ye kuchh jyada hi ho gya😜,Good quality", "review_content": "-------------------------------------------------UPDATE:20/01/2018-------------------------------------------------It's been 5 months since I first got Boat Rockerz 400. Some of the dislikes I've mentioned earlier in my review are no more dislikes. I said the sound is more or less on a flatter side but I'm quite used to it and \"I'm loving it\".. :) the Second point is I said if you are an audiophile then you may not like it but I was wrong. You might ask why... Here is why:After a long gap, I visited my Father who is an audiophile. He has numerous high-end headphones but unfortunately, he got the attention of my headphone and he just wanted to try it. I said yes (I regret it :( ) he paired it with his device and played a song. Boy!! you got to see the grin on his face :D. He said I'm keeping it you buy another one. Poor me was forced to buy another one. A few days back I got another one :(One thing I noticed in two of my purchase isTHE AUDIO CABLE IS NO GOOD. Both my audio cable had the same issue.----------------------------------------------------------------------------So the moral of the story is: Hide it from your audiophile Dad or brother.. they will unceremoniously snatch it from you.Jokes apart, people, you can't go wrong with this purchase. It's worth every square inch.Happy Shopping...END OF UPDATE---------------------------------------------------I got this product 3 days back, and I got it for Rs. 1299( lightning deal of course) This is an honest unbiased review keeping in mind the price of the product:Three days might not be a sufficient time to review this product but sorry I can't help the excitement...----------------------------------------------------Likes:1> Good built quality-------  4/5It is sturdy, for the price the build quality is great. It is not flimsy. The ear cushions are good enough.------------------------------------------------------2> Sound quality------3.5/5If you are an audiophile this is not for you. Bass is decent nothing to go overboard( as noticed in other reviews). Bass is deep enough for the price.---------------------------------------------------------3> Connectivity: pairing is easy connects like a breeze.------ 4/5----------------------------------------------------------4> Dual Mode- Wired and wireless: Boat rockerz 400 comes with an aux cable.If you run out of charge you could always connect the aux cable and use it as a wired headphone. ( I couldn't find a substantial difference in the quality of music between wired and wireless though :) ) I absolutely loved this feature. ------5/5-----------------------------------------------------------Battery backup: I'm impressed with the battery backup of this beast. I've been using it for 3 days for 2-3 hrs a day still its running. So i guess the 8 hr backup per charge is not a marketing gimmick I presume it's true. So far so good. will update it after a month's usage.------------------------------------------------------------Dislikes:1> Sound quality is more on the flatter side. When you compare it with budget wired headphones like Sennheiser CX 180 Street II bass is not too deep. You won't get that ambiance. Boat's website says:\"Don't just be loud, be loud and clear\", Nope... sorry I've to disappoint you on this. When it's loud it's not at all clear. A lot of distortions are there when you are loud.-----------------------------------------------------------2> Comfort: Believe me, it's not at all comfortable for prolonged usage. Your ear will beg you to take it off after 30-45 mins.. If you have high fortitude you can push it till 1-1.20 hrs... If you could go more than that without taking it off for a minute then you are superhuman...-----------------------------------------------------------3> Range: Boats says 10 meters range... In my experience, if you go beyond 5-6 meters then the voice will break. You will never ever get 10 mtrs range trust me on that. And I'm experiencing occasional breaks in the streaming nothing intrusive so far but I don't know whether it will be a problem down the line. Will let you guys know about it later if it's a problem.------------------------------------------------------------- 4>Flimsy aux cable: I can't complain too much about the aux cable keeping the price in mind. Remember I paid only 1299 for it. But with certain devices, the aux was not working properly. Mi note 3 had issues, Mi 4 also had issues with aux. Not sure whether it's the problem with my device. But it worked flawlessly on my laptop.--------------------------------------------------------------5> Wafer thin service centers: Boat gives 1 yr warranty but what good is it if you can't find any service centers near you. This is a hit or miss guys...---------------------------------------------------------------6> Voice cancellation: I didn't find this effective. Maybe it's just me, not sure.----------------------------------------------------------------7> Microphone is pretty much useless. You can't make calls with this headset.-------------------------------------------------------------------Some alternatives:( These are all wired headphones, comparing them with a wireless may not be a good idea but still, I compare it with them because Boat rockerz comes with an aux cable, and if you are looking for an alternative irrespective of wired or wireless it might be of some use to you)1>Sennheiser CX 180 Street II : I don't think Boat can beat this one's quality. The sound is incomparable- the base is deep, nice fidelity, nice ambiance and for a price of 799 this is unbeatable budget wired in-ear headphone. I own 2 of this beauty. Total value for money. If you are an audiophile and are on a  tight budget then I can't a better alternative than this.2> SoundMagic E10C In-Ear Headphones with Mic (Black/Gold): This is another TVFM earphone3>Sony Extra Bass MDR-XB250 On-Ear Headphones--------------------------------------------------------------------Don't buy it:1> If you are an audiophile ( obviously audiophiles will go only for wired headphones :D )2> If you intend to use it for long hours.----------------------------------------------------------------------Buy it:1> If you are looking for a budget wireless headphone with decent built quality and performance.2> If you require a wired and wireless package in one..-----------------------------------------------------------------------Verdict: I'd give this headphone a score of 3.75/ 5If you are on a budget and you want to enjoy a hassle-free Bluetooth headphone with good performance then CLOSE YOUR EYES AND BUY THIS BEAST trust me you won't regret it you won't be disappointed. In this price range, I couldn't find any other headphone with such a performance. We don't have many options.... Do we?  :P :PThe actual price is Rs. 2999 and Amazon claim they are giving 57% discount. pls don't fall for that. I would not recommend paying more than 1700 rupees for this headphone.--------------------------------------------------------------------------Note: I'm not an expert in this field. This is just a lay man's review.Thank you for reading the review and I hope this will help you with your purchase decision..,My boat wired in ears were giving out after hard use and i wanted a new pair of headphones and i wanted them to be over the head types like this one. I also wanted one with both aux and bluetooth options since i would be using it for the TV, Laptop and my phone. I have fumbled with this strata of the headphone market previously and after buying good for nothing ones from motorola, i chanced upon this.Value for moneyGood bassNice sound qualityGood build, but not premiumIf you can get it below 1000 rs, then it is a very good deal,its difficult to let go of  my boat headphones , i bought this on 2019 for a 1k price on sale , the bluetooth was working fine but it went off after an year , i know this would happen , and thats when the legendary aux cable comes in , ive been using it with the aux cable for almost 2 years again , but later the top headphone band broke off , i used a fevistick to stick it up , and used it , i stretched it even further but it broke again , but there is no difference in soundquality what so ever so far , its been a soldi 3 years since usage of this product , still trying to stretch it further , if it doesnt work , i may hvae to say good by to this beast of a product , and its sad to note that the current boat products on offer fail to deliver this robust quality , they've become the company that focuses on quantity over quality nowadays , evolutions aside , i gotta respect this product for what it has given me so far .,I genuinely reviewed after 2 years and it's still working but once head strip was broke i fixed it by using YouTube video overall it's very good purchase for me.,Don’t think about specs you can blindly buy because it worth it,I recently purchased the boAt Rockerz 400 Bluetooth headphones. They have great sound quality and the soft padded ear cushions are very comfortable. The battery life is also impressive, with up to 8 hours of playback. Overall, I'm very happy with my purchase and would recommend them to anyone looking for a good pair of Bluetooth headphones.,Under 1300 rs it is best head phone.... sound quality super, bass good, noise cancelation not bad, product weight not heavy.,Nice headphone, nhi,bole to jhakas😜Sound quality is very good and bass is also  good but I was expecting more like theatre bass but not like that, hhh laalach karna buri chijh h🤩🤩, hum sudhrenge nhi kabhi😂😂I think u r bored sum of this headphone  mast hai😂😂 enjoying,Good quality, easily connected my lg 4k smart tv", "img_link": "https://m.media-amazon.com/images/I/41zejggGzLL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Super-Rockerz-400-Bluetooth-Headphones/dp/B01FSYQ2A4/ref=sr_1_307?qid=1672895835&s=electronics&sr=1-307"}
{"product_id": "B08L5FM4JC", "product_name": "SanDisk Ultra microSD UHS-I Card 64GB, 120MB/s R", "category": "Electronics|Accessories|MemoryCards|MicroSD", "discounted_price": "₹649", "actual_price": "₹2,400", "discount_percentage": "73%", "rating": "4.4", "rating_count": "67,260", "about_product": "Ideal for Android smartphones and tablets, and MIL cameras|Up to 1TB to store even more hours of Full HD video|Up to 120MB/s transfer speeds let you move up to 1000 photos in a minute [32GB-1TB]|Load apps faster with A1-rated performance|Class 10 for Full HD video recording and playback", "user_id": "AG44HJB2AMIVHAGQZ2WGWONERKCA,AHL2FABQV6XAHZN547DN662X5RWA,AHJE6QFY5XEOZJJWOIOHHIDFWWFQ,AEDMSJ2CEQZID62NXPKEQLMBG2LQ,AHF7ZBKNBLCLFHGJG5KXKPI7QVCQ,AGD2S7EXXSXHBCJHTXUAV6FLXAZA,AHZRUY7MR4SVM3HFJ2SZDGHZJ56A,AHEHKOZPPOVYL75KDU52PSBYDEFQ", "user_name": "Prashant,Sumesh Sundararajan,Vijay Baitha,S.k nahak,Vikram Kumar,Manish,Jm,amit nayak", "review_id": "R2A7MIUNOW8DOE,R2FXP703540FR1,R37E7QJET0BYE8,R1NOL0GE16P06G,R48EN3ANVWEX9,R17WYXS17TYDER,R2BMYAH01K8EG8,R23IO3LHHG39H", "review_title": "Fake Product,Costly but excellent quality,Storage good but don't know how to Activate warantee??,Good for use,5 stas nahi diya kyuki capacity 477gb hi rahta hai,Speed not as advertise,Good one,It's ok", "review_content": "128GB SD Card is showing 134GBDon't buy this product,It was a bit costly but prouduct is of great quality. Could have been made little bit cheaper cost wise.,All good,Fast and smooth,Ab mujhe computer ki jarurat nahi padti,Speed is fast but not as advertise I get around read speed 70MB/s and write speed 30MB/s,Good one,Product is ok.", "img_link": "https://m.media-amazon.com/images/I/41ML8ZbPiiL._SY300_SX300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/SanDisk-Ultra-microSD-UHS-I-120MB/dp/B08L5FM4JC/ref=sr_1_312?qid=1672895835&s=electronics&sr=1-312"}
{"product_id": "B0B54Y2SNX", "product_name": "iPhone Original 20W C Type Fast PD Charger Compatible with I-Phone13/13 mini/13pro/13 pro Max I-Phone 12/12 Pro/12mini/12 Pro Max, I-Phone11/11 Pro/11 Pro Max 2020 (Only Adapter)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|WallChargers", "discounted_price": "₹799", "actual_price": "₹3,990", "discount_percentage": "80%", "rating": "3.8", "rating_count": "119", "about_product": "✅ 20W Fast Charger with Cable: Fast Charger equipped with 20W PD 3.0 USB Type C power delivery with cable, PD 3.0 Quick-Charge USB C port provides Max 20W output power, charge your device up to 3x.|✅ Wide Compatibility: Fast charger for iPhone 13 / 13 Mini / 13 Pro / 13 Pro Max / 12 / 12 Mini / 12 Pro / 12 Pro Max, iPhone SE, iPhone 11 / 11 Pro / 11 Pro Max, iPhone XS / XS Max / XR / X, iPad Pro 12.9 / 11 / iPad Air 3 / iPad Mini(2019).|✅ Safety Protection: The charger shell is made of high quality ABS material, heat resistance and low temperature resistance, chemical resistance and excellent electrical properties. The Charger Internal High Quality Chips Protect Your Devices from overHeating, Short-circuiting and over Charging.|✅ Compact & Lightweight: Extremely compact size & travel-friendly design fits into your pocket or bag easily without occupying too much space and ensures incredible portability wherever you go. Handy for home, office, and vacations.|✅Sales Package: 1 x 20w C-Type Adapter, 1 x C to Lightning Cable (1 Meter)", "user_id": "AGQVEI5FN545VZMNGYRR752JCSUA,AHMJA6VNTL3MQGWVBYXNUI26DTLQ,AH4OTB7KAP7IRL7PQDKLY5C4M7YA,AFIWQPGVVMPXHXEOCBSOG7COXDDQ,AHAVKIJW3GZCEMG6GGBR2KY7SJBA,AE42NSELZZ36ILVUWVDCPYWS3HDQ,AERT4TSCBIG3ZL2UH52LZBPXJCLA,AGC3K2VMDCOKRMMB2TRB3JZU4HAA", "user_name": "Manoj Nagabhairu,Mohammed kabeer,umar_ _mohammad,sam chauhan,Tyson D'costa,Nevith Gowda,Satyanarayana,Abhishek K V", "review_id": "R3VBC6VU8OT0QP,RNFZF13HB44YR,R2UQNJFA27MAKM,R1EURXJL39I8LN,R33PGOF5ODIFCJ,R3MN2XSFL7T48O,RDVFTWAGEQNT,R2GHXYM6OGD6TQ", "review_title": "It’s worth,Good,Iphone 18w adapter.,The product is good to use,Nice,Excellent,Very useful and excellent product at an very affordable price. tag,Affordable price, Great deal!", "review_content": "Looks good and didn’t harm to iPhone battery and as price is worth,Value for money,Best product and fast charging. Thanks!,The money is affordable and charger is good,Nice,Bought both Adapter and cable.! was very skeptical about it first but ordered based on the reviews.! However, was very happy with both the products.! Original packaging of adapter and cable as well.! Thank you,The product meets the requirements envisaged.,Value for money, Package seems like original.", "img_link": "https://m.media-amazon.com/images/I/21rFBH5Lf2L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Compatible-I-Phone13-I-Phone11-Only-Adapter/dp/B0B54Y2SNX/ref=sr_1_315?qid=1672895842&s=electronics&sr=1-315"}
{"product_id": "B08BQ947H3", "product_name": "LIRAMARK Webcam Cover Slide, Ultra Thin Laptop Camera Cover Slide Blocker for Computer MacBook Pro iMac PC Tablet (Pack of 3)", "category": "Computers&Accessories|Accessories&Peripherals|LaptopAccessories|CameraPrivacyCovers", "discounted_price": "₹149", "actual_price": "₹149", "discount_percentage": "0%", "rating": "4.3", "rating_count": "10,833", "about_product": "Cool Gadget: Protection against possible video surveillance from hackers. This webcam cover slide easily slides over your camera ensuring that it won’t be used as a surveillance tool against you.|Ultra-thin: Super thin design, perfect curve edges, and extra mini size, which means it can be perfectly combine with your devices. Webcam Cover is only 0.027 inches thick and does not feel its existence when the laptop lid is closed|Universal Design: Webcam Cover is compatible with most Laptop Computer, Smartphones, iPad,iphone, MacBook, MacBook Pro, Tablets PC, PS4 and all-in-one desktops. Many pieces package, meet your all cameras need|Super Sturdy Adhesive: Solid durable, because the strong Nano gel provides durable and reliable connection between your devices and webcam cover. Also, the adhesive can be easily applied and removed from the device without any traces|Easy to Install: Use a dry cloth to clean the surface of your device's webcam, then remove the 3-M adhesive tape from the back of the camera cover Slide, align the lens and attach the protective cover to the lens, and firmly press for 15 seconds to achieve a strong, but non-permanent seal.", "user_id": "AFF3MID2VKCRG3UPIGY4OPDLKNBQ,AGYZOVT6JVQNGFJ2WL62EMZ2Q6XQ,AGM2GCYQPQRIRJYCQBKBUOCD6VJA,AHKM6B5F2SLXBFKIBHFHGBXNF4HA", "user_name": "Vishal Bhardwaj,Parvathi M.K,swaraj,Simi", "review_id": "R18D9LZAYX9JSY,R2TD56H4WD69RD,R3022ERQVPT7PV,R3T0CWF358RZNJ", "review_title": "Merges with the device, Ultra Thin, Smooth Sliding,Good for Privacy Concerns,Good product,RESEARCH PROPERLY BEFORE BUYING! NOT SUITABLE FOR MACBOOKS!", "review_content": "PRODUCTLIRAMARK Webcam Cover SlideEVENTS DATESOrder Date - 09/04/2022Delivery Date - 11/04/2022Review Date - 05/05/2022STATUSReceived and AcceptedRATINGS4.2/5.0DESCRIPTIONUsed terms in the description -->> Slider - Sliding part of webcam cover> Static Frame -  Static back frame of webcam cover> Screen Frame - The laptop's screen frameThe product is sturdy, invisible (for the mutual color theme for device and product), and well manufactured. If the device has the same matte black theme, this webcam cover can easily be merged and becomes a part of the device's body. As you can see my laptop has a matte black screen frame and astonishingly the product has merged with it. The little plastic container in the package will act as storage for the rest of the webcam covers.It is ultra-thin as described by the company with acquiring about a millimeter thickness. This thickness can cope with the windows laptops as they are having the rubber buffers on the top side of the screen frame because those buffers act as a spacer between the screen and the lower-up body/keyboard of the laptop to avoid any harm to the screen. This spacer is advantageous to the webcam cover as closing the lid will not harm the screen, screen frame, and laptop lower-up body. But, still, don't put pressure on the location where the webcam cover is installed as the thickness of the webcam cover is slightly more in the micrometers, than the rubber buffers of the laptop itself. The sliding function is very smooth, but be sure to push only the slider part and not the whole static part as it will make the grip weak over time of usage.The device can be used with any phone and monitor as they have no issue with opening and closing the lids.Now, for the \"Mac Laptop '' users, it is not a product for your laptop, and never try this product for your Mac laptops. As the Mac laptops have a stunning plain glass screen that is covering the whole screen frame part and has no spacers, that is there's no space left after closing the laptop lid and hence upon installation of this product will damage (crack/break) the plain glass screen.Installation is easy, remove the blue tape and carefully stick the cover as a sticker, using the scale for support, or else you could stick it a little inclined. After sticking, rub your palm for heat generation and grab the screen frame from both palms and apply the ultra-light pressure and hold the position up to a good 2 to 5 minutes. And there you go for your satisfied invisible life.*Important - Even if not in use, slide it 2-5 times once a week and clean it as per your device cleaning schedule to avoid jamming due to debris or dust.Overall, it is a good product. For me, it has worked awesome. Green Signal from here.Thank You :)SUGGESTIONSTo the Manufacturer - Notice the static frame of the webcam cover, and make its edges (the edges close to the slider) smooth (rounding off or fillet), so that upon sliding the slider with a fat finger, it can easily slide over the edges of the static frame hence do not put an unnecessary force on a static frame.To the Seller - Well packagingTo the Consumer - Check for the rubber spacers/buffers provided in the laptop (like Windows laptops), if it is then you can use the webcam cover, if not (like Mac laptops), it's not the product for you. Even for Windows laptops, after installing a webcam cover, try not to put pressure on the webcam cover location for long. Slide it 2-5 times once a week to avoid jamming.DISCLAIMERThe review(s) and rating(s) has(ve) been made upon personal usage(s) / experiment(s) / experience(s) / perspective(s) for specific product(s) acquired / delivered.,I usually don't trust my webcam so I thought of giving this product a try. It was delivered within 3 days after placing the order. I received it on 12th June. First impressions were really good. I always had a fear that It would crack my screen when I close my laptop lid after reading the reviews but It's been 3.5 months and there's not even a single crack in my screen.𝗕𝘂𝗶𝗹𝗱 𝗤𝘂𝗮𝗹𝗶𝘁𝘆 𝟰.𝟱/𝟱You will get 3 webcams covers in the package. It's extremely thin. So, It won't cause any issues when you close the laptop(Hp pavilion gaming used here) but It might cause issues in the case of laptops with thin screens like MacBook Air, Asus TUF, Asus ROG while closing the lid due to the pressure on the screen. At the end it's your choice.𝗔𝗱𝗵𝗲𝘀𝗶𝗼𝗻 𝟯/𝟱I am sorry to say that the Adhesion of this product is quite weak. It literally falls off after a week of applying it. I had to throw 2 of it as it became useless. I only had the last piece remaining.𝗦𝗼𝗹𝘂𝘁𝗶𝗼𝗻 𝗳𝗼𝗿 𝗔𝗱𝗵𝗲𝘀𝗶𝗼𝗻 : Eventually I was able to find a solution for this problem.• Remove the Stock Adhesion by gently applying Isopropyl alcohol.• Then apply a strong Adhesive glue (I used Fevi Kwick). Apply it only on the back edges of the webcam  cover. Since it's extremely thin, I used thin needle to apply Super Glue gently on it or else the Superglue  will spill out and make a mess.• Immediately you have to place it on the webcam of our laptop. And then you're good to go.Its been 3 months after using the Super Glue technique. Forget about about falling, It has not even moved a bit. No effect on the quality of my webcam. The cover won't interfere when you are using your webcam in meetings. And fully covers it when you want privacy. Overall, Its a good product except for the fact that it has poor adhesion.,Good product,I wish I had known this before ordering. Luckily a friend made me aware the very same day I had applied it.Apple urges people not to close their MacBook, MacBook Air or MacBook Pro, while such camera covers are applied because it can lead to cracks in the screen when closing your MacBook!!! It may also affect the ambience light sensor, but that is the lesser issue as compared to a potentially cracked screen and high repair costs.MacBooks are designed in a way that when closing no foreign object thicker than an average printer paper (0.1mm) should ever be between the screen and the body of the laptop. This item is 0.027inches thick, that is 0.6mm, six times the recommended thickness!!!If you are going to use it on your MacBook, be sure to completely remove it before closing your laptop. You can use it without worry on iMac as it's a desktop and doesn't get closed. You can also use it with any normal laptop where the camera isn't embedded inside the glass screen. If you have a laptop where the camera is embedded in the plastic frame around the screen it should be okay.For disappointed MacBook users like me there are two options. One is you trust Apple, who are saying their camera is hardwired to the green camera light. According to them one cannot work without the other, so even if someone hacks your camera, you will know it is on because the green light will be glowing.If you're not sure about their reliability and you still want to cover your camera, use a piece of thin tape. Apple does advice against anything which could leave adhesive residue on their screen, but frankly, if you just clean it with some screen cleanser after removing, i don't see how there could be an issue.Why am I still giving this product 3 stars? It reached in good condition, is easy to install and use, and it will still be useful to people with other laptops or desktop screens with inbuilt camera. It's not a bad product. They just need to stop advertising it for MacBooks!", "img_link": "https://m.media-amazon.com/images/I/41PeQz-jDSL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/LIRAMARK-Webcam-Blocker-Computer-MacBook/dp/B08BQ947H3/ref=sr_1_317?qid=1672895842&s=electronics&sr=1-317"}
{"product_id": "B082T6V3DT", "product_name": "AmazonBasics New Release Nylon USB-A to Lightning Cable Cord, Fast Charging MFi Certified Charger for Apple iPhone, iPad (6-Ft, Rose Gold)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹799", "actual_price": "₹2,100", "discount_percentage": "62%", "rating": "4.3", "rating_count": "8,188", "about_product": "Added Protection: An additional layer of protection has been added to the Lightning and USB ends to improve durability and reduce fraying;", "user_id": "AFWJSD4AVIM6DC3YA63G2QPENQSQ,AGKSW3FNH3REYN3OKPKJN4KWXLMQ,AEI7HJU4RFV6NR5WSRDQV5ZSRYSA,AGFN3SLEECW6DYL2CVGLIHJCVVHA,AGY7ZX7WDDSGAZJBPPS3MCIL7U7A,AEX422U2J6S45PAKDJIFJB7WNVLQ,AEHU6ETDR7HVQOGLKITDETHZEO7A,AE7VL5JTR7ZZ67UPBM6KP2NYEOYQ", "user_name": "Arun verma,Arv,Aashna Nasta,Harshitha,Sunny Panchal,Snigdha Mallik,None_123,Ravindra J.", "review_id": "R1Q0PEVL6X8WZJ,RW0MMI9AUXK5J,R2F3ACPBFRCFSK,R2SB3XYC8XHNUQ,R5L8G10EKZ9ZR,R3W2X53D3BLIBR,R29J3JSPZYQYCM,R35I0ZZH2J58P7", "review_title": "Good product but costly,It’s really long n sturdy no homo 🔥,Takes longer to charge than the regular cable,Quality is really good,iPhone X pink charging cable long one ☝️,A good purchase,It charges fine for me,Absolutely fantastic USB👍👍👍", "review_content": "It cost should be under Rs. 500,Buy it,Color is as per the photo but takes longer to charge. Also doesn’t charge on all sockets.Seems to work better when plugged in directly in the laptop.,Length of the cable is long so that you can happily use it for long distance as week and quality is really good,1 meter pInk charging wire for iPhone X long and strong one for use..,I have been using this lighting cable for almost a month now and the cable turned out exactly as it was shown. I took the rose gold one that matches my phone’s color. Although the metal ends of the cable was rose gold, but the whole cable was pink, which I didn’t like. I went for the 2m long cable so that i can use it conveniently even if it is charging. Though it’s kinda bulky, yet serves it’s purpose. Charging speed is fast and efficient just like the original cable had. Also quite durable and sturdy. My Apple’s original lighting cable had some problem while charging so I purchased this one after watching many YouTube videos and reviews. It was indeed a good purchase.,It’s long and good,It’s a superb product in terms of sturdiness, looks, and charging speed.", "img_link": "https://m.media-amazon.com/images/I/31kw1RgU5yL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/AmazonBasics-Nylon-Braided-Lightning-Cable/dp/B082T6V3DT/ref=sr_1_320?qid=1672895842&s=electronics&sr=1-320"}
{"product_id": "B0B7DHSKS7", "product_name": "Nokia 8210 4G Volte keypad Phone with Dual SIM, Big Display, inbuilt MP3 Player & Wireless FM Radio | Blue", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|BasicMobiles", "discounted_price": "₹3,799", "actual_price": "₹5,299", "discount_percentage": "28%", "rating": "3.5", "rating_count": "1,641", "about_product": "The classic Nokia 8210 redesigned & redefined in this bold new look|Big 2.8\" display with zoom UI and an easy-to-use interface|4G connectivity for crystal-clear voice with dual VoLTE|Hours of talktime and weeks of standby time Pre-loaded games including the classic keypad mobile phone game - Snake|Enjoy all-new wireless FM radio Listen to music on the MP3 Player and save your favourite songs on the built in memory card slot|Customer care number: 18001028169 for product related issues", "user_id": "AHJTLVVBATTLS7X3LPKL2MVJM6VQ,AF6TX2WLPW4DJJZ4DDZMEXKMVHPA,AGDLLU2SF3BJPMEHUPCBCSHW7YOQ,AGY3ZSD5TYCTKJVVU2CUU2QS7XXQ,AHV25QIEQTDUMOJKQQ77WG7X3TAA,AG6ISZK2C6E2PVIUWTIBAMHO4KQQ,AHG3XDBDEPOZ2PQAIQ7HUSSRMANA,AFSJ552FEBIZBYEP7AKKXOTOGO7A", "user_name": "Shyam,Tom,Rajneesh  Kumar,Bhagaban badatiya,eps,devaraj,MANAN DANI,Amazon Customer", "review_id": "R3T70N2JGTAPV2,R1LWQEOFIRU2NO,R1YDTGG09KKA7E,R2I90G9MLZ2RUP,RBQKKFWRS8SOH,R223TL7W5MX14P,R3S3ER956A091,RHWFJRSKL5O8R", "review_title": "Good to use as a secondary mobile,It's average.,Not user friendly operation of nokia 8210.,Need invoice,Good feature phone with 4G connectivity,Model for worth,Good,Good feature phone, but it is highly overprized", "review_content": "Network reception is not that great.  People who call get out of coverage area message even though the phone show two bars of network .The same sim and network worked fine in my smartphone.Can use this as a secondary phone or as a backup device and cannot rely on it as a primary device .The only benifit which I saw on this is it supports VOLTE and can sync the contacts from Android phone which avoid manual taks of creating each contact manually .,Product is average. It doesn't suck like the many contemporary feature phones from other brands. That being said, it's not great either with some little annoyance noticed.Don't expect much as its a feature phone but then some negatives are:1) There's a voice distortion noticed occasionally when receiving calls. Have to end the call & redo it, then the voice is clear.Initially thought it was an issue of a particular product. So returned the phone & got a new one.However the new one also has this. Have tried some methods to rectify this including switching off the volte . Till now this issue has not cropped up yet thankfully.2) No notepad.Come on, how hard is it to give a notepad on this phone. If it can do texting & contact saving, how difficult is it to give a notepad to record stuffs?3) No YouTube.Since there's no dedicated YouTube app, tried to access it from the opera browser, but to a big disappointment, it can't properly load the YouTube page, let alone play any video.Yes it's not a phone for constant YouTube watching. But since it's a very important site, not only for entertainment, but also for information & news, it would have been great if youtube was enabled (it supports 4g, so why not YouTube?)4) The camera is very bad.Can't expect smartphone standard camera, but this VGA camera is really bad. Nokia could have increased the price about 500 bucks, & give an average 1 megapixel camera on it.Sometimes we take photos not for posting on social media, but for information, like the name of a store or number of a vehicle.A basic camera that does that job is all that is required.5) Was delighted to see an \"English with Oxford\" app. Assumed they were very thoughtful to give an offline dictionary.But then upon opening, it turned out to be a demo version with \"Pay INR 50\" & \"Play 3 free trail\"Was even disappointed when upon clicking the free trail option, it required internet & was directed to the opera website.What's the point to this?Other than this, the phone is not bad with some positive features like wireless radio, radio recording, big screen (compared to other feature phones), voice recorder,  torch, call recording option, converter app, stylish retro design & a good easily typable keypad.,,All os Ok but battery life is not good .While we r not useing a single call also but its draining battery life,Good add-on phone. Battery life is >7 days if usage is not very heavy. FM works without wired headphones. Call quality if good. Dual nano-sim. No profile setting option as was the case with previously released Nokia feature phones. Preinstalled games but all (except snakes) are trial version. Internet browser, facebook, music & video player are there but no option to install any other app as there is no app store.,Gud for one model in Nokia and worth for money,Bettery not works more than 4 days even not using phone,It works like any other feature phones from the 2006-2010 time, but the build quality is considerably low. Good battery life and good call quality is there, nothing special other than that.", "img_link": "https://m.media-amazon.com/images/I/41tRgeQp9-L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Nokia-8210-4G-Display-Wireless/dp/B0B7DHSKS7/ref=sr_1_326?qid=1672895842&s=electronics&sr=1-326"}
{"product_id": "B09SJ1FTYV", "product_name": "Sounce Protective Case Cover Compatible Boat Xtend Overall Protective Case TPU HD Clear Ultra-Thin Cover with Unbreakable Screen Guard", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Cases&Covers|BasicCases", "discounted_price": "₹199", "actual_price": "₹1,899", "discount_percentage": "90%", "rating": "4.0", "rating_count": "4,740", "about_product": "COMPATIBLE: Compatible with boAt Xtend. Ultra-thin PC protective case with screen protector allows quick and easy installation, a perfect fit for your watch.|MATERIAL: Durable TPU material cover the screen and edges. The full cover protects your boAt Xtend & Noise ColorFit Pulse Grand prevents scratches and wear.|DESIGN: Smart design allows access to all controls, buttons, sensors, and boAt watch features. Charge directly, don't need to take off the watch case.|SCREEN PROTECTOR: The TPU material screen protector can be repeatedly wiped with a glasses cloth, to ensure the clarity of the screen without affecting repeated use.|SERVICE: Sounce offers a 12-month quality service. Package Included: Watch Case with Screen Protector Cases Only,boAt Xtend, and Watch Band are not included!)", "user_id": "AHUKIXVRPVVYYRQOUGWBDYO7RFDQ,AGGFXEMEWUIDSSL7KN6EJW42DQ2A,AGFUEPQZZPYTSQIL7UBTDIJYUGWA,AE4JBCKONTM2LRZA546FASO3KV7Q,AHQXFZDEXSIE427UGMKSKWNFS6GA,AEJM5FOA2D5WGIYCT5VSKHMSL2YA,AGQXKHGGT3Y6QOCEULP2LJ44Y3PA,AHJLV2V57MWQV4UA37TJ2ORGQLJQ", "user_name": "Gourab Kumar Patro,Amazon Customer,tuhina mamotaz,jeevesh parag,Sujata deva,subham dey,Mehar Bano,Gautam Ghorawat", "review_id": "R1E6PBJHMY4C1G,R3JHVSY69JG16Z,R2YVWM2WLBVV3S,R1QB2R2UJ7S2TI,RQXMAOZFDCUDY,R1G1M7XDU4T4HP,R3SHXIE18BG29W,R18I768SMTQA1X", "review_title": "Perfect fit n finish. But slightly over priced. Overall good and useful.,Screen cover,Amazing product.. I'm very glad after got it..Now I can use my watch confidently..Thank you Amazon..,protect our screen.,Perfect fitting for m nosice smartwatch ❤,Good for protection,Ok,Good", "review_content": "Perfect fit n finish. But slightly over priced. Overall good and useful.,Good product, proper fitting,https://m.media-amazon.com/images/I/51U+yRuGOeL._SY88.jpg,This product is very usefull because it's cover full display and body smart watch and protect any damage.screen fully protected with this product.,Too cost but its perfect & secure for smartwatch ❤ worth it  paise vasul😍,https://m.media-amazon.com/images/I/81skvqgoYaL._SY88.jpg,Ok,Good for your watch", "img_link": "https://m.media-amazon.com/images/I/4155YhLwDiL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Sounce-Protective-Case-Xtend-Unbreakable/dp/B09SJ1FTYV/ref=sr_1_329?qid=1672895842&s=electronics&sr=1-329"}
{"product_id": "B09XJ5LD6L", "product_name": "Samsung Galaxy M53 5G (Deep Ocean Blue, 6GB, 128GB Storage) | 108MP | sAmoled+ 120Hz | 12GB RAM with RAM Plus | Travel Adapter to be Purchased Separately", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹23,999", "actual_price": "₹32,999", "discount_percentage": "27%", "rating": "3.9", "rating_count": "8,866", "about_product": "Segment Best 108MP Quad Camera Setup, with exciting features like Single Take, Object Eraser, and Photo Remaster|6.7-inch Super AMOLED Plus Display, FHD+ resolution, 1080x2400 pixels with 120Hz Refresh Rate|MTK D900 Octa Core 2.4GHz 6nm Processor with 4x4 Mimo Band support for a HyperFast 5G experience|Massive 5000 mAh Battery | Memory, Storage & SIM: 6GB RAM | RAM Plus upto 6GB |128GB internal memory expandable up to 1TB|Latest Android v12.0, One UI 4 operating system", "user_id": "AFBLFBJHOW7CQX62SQP7S3QJCFVA,AHRPOOH37D4FX5UHQEWKJ5RL4DVA,AGYYGL7JDT7YHKFH7HKAQH5DPBFQ,AGB77J7O6BH5OYGIU5PPZNLCB64A,AFUPOIQZH7NDPJN6S2SA7FUJUC5Q,AHIUAO5XZ6A6KCCQVX7IX2DWQSAQ,AGPM77A4UXCNYQ6QY527N3FQGXCA,AGTXMLVIUZKUII7RXIDLLIN4TLZA", "user_name": "Krishna S Mohan,Jatin Patel,Izhar Aazmi,Thambusamy,Uttam saha,shaiksha vallii,sandy,Godfrey Mathais", "review_id": "RRKAMPIXSKUW,R3SXQQ9NVG7HOY,R3UW73PKX5XAOA,R3U8JXSUPY8MSJ,R3B9EB3AG57TR9,R2QNWBZRD42XTY,R2E243OBZNQZ4Q,R11DCSCBEFMX5F", "review_title": "Received defective phone and running from one customer care to another to replace the phone,Honest opinion.,Worth the money but not as good as promised,Good budget model phone,value for money.,Galaxy m53,Good buy for 22k,A little overpriced but gets the work done", "review_content": "Below is the experience so far.1. Received a defective product. Battery was getting drained out in few hours, wifi kept getting disconnected and almost every app was giving trouble,  including Google maps. (Location was not getting captured)2. Tried to return it on the 8th day of purchase after running into issues with every app I open. (tried on 7th night as well, but phone froze and was not able to even switch off and restart the mobile - Amazon app was in this phone. Used another phone to check how to force reboot next morning and switched on the mobile)3. Amazon said return window is closed on 7th night and now I need to call Samsung customer care directly for replacement.4. Called Samsung customer care and they tried to check the phone remotely - couldnt identify the issue.5. Informed I will have to visit the Samsung service center to figure out the issue6. First visit to center, they did a software update (3 week old phone now - not sure what update would be pending) and returned the phone saying we will see if issue persist for one more week. They also whipped out the entire apps in the phone.7. Faced issues the very same evening, lived with it for one more day and went back next morning.8. Second visit, they identified that both motherboard and battery had manufacturing defect and will have to be replaced.9. I requested for a phone replacement and they told me their policy doesn't allow them to replace the device and can only replace the mother board and battery, which was defective11. They told me I will have to contact Samsung customer case number again if I want a product replacement as they don't have the authority for that.10. Called customer care number again, and they inform me I have to contact Amazon for product replacement as Amazon was the seller.So back to step 3. Will have to see how many more hoops need to be jumped to reach the end , If I manage to reach there.Update :11. All customer care said they can't replace the phone. So surrendered to defeat and gave the phone back to samsung customer care center for battery and mother board replacement. They gave back the phone next day saying parts are replaced. Again, whipped out of the apps which I had downloaded and logged in again.12. I checked the phone from the center itself before taking it back and I figured the problem still persist (battery was draining out by the minute). I showed it to them. They told me it's a new battery and will take some time to stabilize. They also asked me to buy a super fast charger, while i bought from them to not take chances. They asked me to check for 2 days and confirm. Used for 2 days. Same situation. No improvement.13. Went back to them again. They checked and said they will forward it to technical team for checking now.14. Technical team checked the device and said there was a software issue for few products in this version and then will need a 4 days to correct it since they are still working on the software update to correct this. I have no idea how this product passed the quality test if all these statements which they are making are true.15. By this time samsung customer care has used the phone for more days than me since buying the device and they have identified hardware issue and software issue in the product, but still refuse to give the money back and take back the product inspite of repeated requests.15. They kept the phone for 5 days and returned saying everything is fixed.16. Phone started functioning normally finally but I was sick and tired of the experience.17. I called the samsung corporate customer care narating the the whole series of event and asking for refund. They refused with all their might and said \"phone is working now\". During the process I also figured out that the customer care center who kept the phone for 5 days for repair dint even create a registered complaint or a job code while holding the phone for 5 days. I officially registered a complaint. But still no luck of returning the phone.Update on Nov 30th.18. I was traveling and outside the country. On Nov 21st while using the phone and with 70% charge left screen went off and stared showing grid lines like some TV from 1980's. Tried switching of the Mobile and restarting multiple times. No luck. Still grid lines. My flight bookings, hotel bookings and everything one can think of, was in the mobile and my 3 month old phone is not responding to anything possible. Friend thankfully had a spare mobile and i used that phone till I completed the trip.19. Reached back in town yesterday and my first act is to visit samsung customer care center. (Nov 30th.) Am writing this update sitting at the customer care center. They mentioned \"patch issue. Software update dint happen\" . At this point, I know they are just speaking rubbish to engage the customer and just delay the situation. No 3 month old phone's screen will stop responding because of software update missing. They are opening the phone again to operate it, after again refusing my request for money refund.,Its really good smartphone in its range packed with features. And brand like Samsung never fails to amuse with what they deliver at a given price point. I still give it a 3.7 stars as battery 🔋 could be better. It also looses a point for not including a charger.,Phone looks are good. The charging speed is ultra slow even with the fast charger 25W original. Also camera quality is not even like 32 MP, total lied about 108 MP. Samsung UI is not very friendly and easy. Other brands have better and smoother UI.,Phone is very sleek, bought brown shade which looks much premium in hand at what it actually is....... Good budget model phone,you can not deny brand ,sumsung is a brand .overall good product for long use.,Good worck,Charger should have been part of it. But product looks good,Pricewise a little overpriced.Some of the cons are: a little rigid fingerprint sensor, after 2 months of use, i frequently encounter a lag when unlocking the phone, battery life not up to the mark, struggles to go the entire day even with regular use, no 3.5 mm jack, and a buggy BT.Pros: a very good camera, excellent screen, superb sound quality.If you somehow get this for below 18k, then go for it or else there are better options available.", "img_link": "https://m.media-amazon.com/images/I/418vxJS4AML._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Samsung-Storage-sAmoled-Purchased-Separately/dp/B09XJ5LD6L/ref=sr_1_333?qid=1672895842&s=electronics&sr=1-333"}
{"product_id": "B07WHS7MZ1", "product_name": "iQOO 9 SE 5G (Sunset Sierra, 8GB RAM, 128GB Storage) | Qualcomm Snapdragon 888 | 66W Flash Charge", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹29,990", "actual_price": "₹39,990", "discount_percentage": "25%", "rating": "4.3", "rating_count": "8,399", "about_product": "Qualcomm Snapdragon 888 5G Mobile Platform is based on a new 5 nm process and a Kryo680 architecture, Compared with Snapdragon 870, the CPU performance improves by 25%, GPU performance by 35%. Along with Enhanced LPDDR 5 & Enhanced UFS 3.1 (V6).|4500mAh battery with a 66W flash charger comes as standard, supporting FlashCharge technology. It charges 50% battery in just 14 minutes and 100% battery in just 39 minutes|Intelligent Display Chip is able to increase the frame rate and optimize colors so that every player can enjoy high FPS and rich colors at hand to be fully immersed in the gaming experience.|48MP OIS Triple Rear Camera, gives super clear pictures which retain the same clarity when they are enlarged. OIS ensures good performance while taking photos at night or capturing movements. 13MP wide-angle camera supports 120° ultrawide shots (108° after distortion correction) and macro shots with the minimum focal length of 2.5 cm.|120Hz AMOLED Display lets you enjoy a seamless and smooth screen experience & is equipped with features like 1300nits Peak Brightness, HDR10+, SGS Eye Care Display Certificate/ SGS Seamless Certificate & much more.", "user_id": "AEYESC4XEIJ23NANPR3BK2GGXS2A,AH5ZM42ZT35ZFEILY444IJR5KRXQ,AHHUUUD4XBXYHTWDGSEQGER6S5ZA,AGEJRNVD42CVJLY6QQULGJVX6J6Q,AHYCGGRP7XQVIYP6NRVZI6A7FH2A,AFMG67GYJL44TDSFMSA2OFXMGTQA,AH72QVCCGUXFHEAFLJB2IHSIDGWA,AHWAEDGCATZFN3QCEBZVXCLIRDTA", "user_name": "Ashish kumar,SAFEER SHAMSUDEEN,SJ,Aveek K. Upadhyay,Arghya Roy,Harshil,Udaya Kiran Mutnuru,RahulAravind", "review_id": "RJOCZ7VETYOPA,R3UXDJEW3BYXBD,RMTUS17UNIUS9,R2FBEMK4172QZP,R3PG1FBD4TX2RF,R2IG7GBJ9W9AIJ,RXUP19LST693F,R2OOPASHLKF3SX", "review_title": "Real Monster 👽,Overall good,Good performance oriented phone,An all Rounder in the < 30k segment,All good, battery life could be better.,A good Phone with few disadvantages.,Value for Money product,❤️", "review_content": "Posting This After 8 Days of Continous Usage:I came from Oneplus 5t that too because last to last week I had an accident and my 5t has dead on the spot.After watching a lot of reviews on Youtube and Amazon, I thought I should give it a chance.First Impression:-• As you all know OP 5t has small display so it's hard for first 3-4 days to use/Typing because of big display.• A little heavy but that could be because of upgraded species and battery from my last 5t.• Solid built but it if it's metal build then it will be more beautiful.• Space fusion color is looking killer.• Flash charger works awsome but charger design can be improved• Display is crisp and clear but but in dark apps (i.e, chrome, brave, linkdin etc) you'll notice a color change (from Black to Greyish color) that gives a cheap feel and I don't know if it's a software or hardware issue.Actual Review:-• While gaming (Call of duty:mobile) has some lags and bugs and there is no option to block notification/calls even after mute notification ONN everything is coming on screen and it's very frustrating and annoying.• Battlefield mobile ground, Asphalt 9, Clash of Clans, Battle Royale are working flowless.• Some apps like Flipkart and Airtel gives some error (screen zoom automatically while opening) might be because of android 12 or something else.• Now this is very weird that this phone reset a few setting automatically themselves when I don't want that. I don't want to set them everyday before using my phone (i.e, I am using Bouncer to remove app permission when not in use and this phone remove accessibility setting even after batter optimization and background run.While listing to music I want paranomic 360 sound but it reset to default automatically.• Gesture are not working fine, this can be fixed with future updates.• I admit that funtouch OS has some more customization then Oxygen OS but it is missing some basic customization feature like I cannot change accent color, shape, size and the default one is looking very cheap must be because Oneplus oxygen OS is in my eyes but I am not overcome from oxygen OS, Oxygen Os is lub• Funtouch OS is very uncomfortable for me for the first 4-5 days but now I'm getting it a little.• Less feature in gaming mode in comparison to Iqoo 7📷Camera:-• Average as of now takes good picture in night/evening time and selfie camera is awsome.• OIS works good as per the budget and gives value for money.• Day time picture are good but something it changes the saturation/color by itself automatically.• No heat observed while gaming/doing heavy task (minimal heat that every phone has now a days and it is 40°c outside so this is not a big deal for me.• Screen recorder and mic works awsome• Crisp clear display except the issue I told above• 6-7 SOT in one charge (0-100)• 42-44 minutes charging time (0-100)• No bugs lags observed till date• 120Hz refresh rate made it monster• Some preinstalled bloatware can be uninstall but some has to be force stop only or you can use Adb commande to remove permanently.• A few apps are unnecessary like browser and a screen (virus scan) comes just after install an app from play store that very annoying and somehow I stopped that.• Speaker volume is sufficient (enoug loud in a room)Conclusion:-In 31k it's worth for money with Snapdragon 888 processor and intelligent chip.Only thing that I don't like is funtoch os because it not gives a premium flagship phone experince.Has some bugs as of now (i.e, In gaming mode, in a few apps, camera, Display) that might fixed with future updates.Overall worth for money, And Yes you can pick it over Oneplus 9RT (like I said you'll probably feel bad for a week with it's Funtoch Os but you'll be okay with it after sometime.Just because of oxygen os spending 8-10k is not a great idea I think.,Camera quality is good , Video stability is awesome, processing and other functions are nice .  UI is not that good and battery life is not upto the mark,Pros:- Super fast app experience due to Snapdragon 888- Super fast charging- good display but not comparable with Super Amoled of Samsung/ other phone- Good large display size- No heating in general use. Only seen when using camera /video call but it cools down fast.- Accessories given with the phone like Fast charger, USB c to 3.5 female adater, thin screen guard and translucent back cover.- Ok camera:Cons:- Display is not super amoled or vivid like Samsung A or S Series phone- Battery drains fast- Avg front camera- Earth current can be felt when touching back camera while charging.,I was skeptical about the phone would perform as SD 888 has its own share of heating issues and all, but for 28k, this is one of the best phones in the segment.I had Pixel 6A and Nothing phone 1 as other options. Although their camera and software might be better in some aspects, the performance, the camera and gaming features this phone offers is incredible.Also Pixel and Nothing phone dosent give charger in the box so it's a plus point.The only issue I faced is when I switch the phone to 60Hz. It starts to act as it lowers to 30,40 fps or something. And the battery life is average. It's 1 charge in the evening for sure. But decent battery coupled with a fast charger is more than enough.I use nova launcher with this and this solves the home screen style. Recommended to all.,Good display, good sound although sound is not much loud but have a sweet bass, smooth experience, camera good but front video could be given 60 fps, good haptic, every thing is good up to the mark but battery life could be better. Overall satisfied with the product.,They are ok, i can rate 2.5/5,Mobile is worth its money.,Idont use fingerprint and camera are very good battery life ok", "img_link": "https://m.media-amazon.com/images/I/41UwKwpK40L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/iQOO-Sunset-Storage-Qualcomm-Snapdragon/dp/B07WHS7MZ1/ref=sr_1_336?qid=1672895842&s=electronics&sr=1-336"}
{"product_id": "B0BBVKRP7B", "product_name": "SHREENOVA ID116 Plus Bluetooth Fitness Smart Watch for Men Women and Kids Activity Tracker (Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹281", "actual_price": "₹1,999", "discount_percentage": "86%", "rating": "2.8", "rating_count": "87", "about_product": "✅ All-day activity tracking: Track steps, distance, calories burned, active minutes, you can check daily activity and time on OLED display or APP|✅ NOTE- NO CALLING FEATURE-You will receive only notification to See Calls & Messages on Your Wrist: Receive/Rejection call, calendar, SMS and SNS (Facebook, WhatsApp, LinkedIn, Instagram, and Twitter) notifications on display, fitness tracker band let you never miss the messages that matter.|✅ NOTE-This fitness band will only work after installing fitness band application from play store.TO set time of watch you have to install fitness band application.YOU will receive bar code pls scan it to download the application. Switch ON bluetooth and location whlie connecting fitness band from app. Dont connect band directly with Bluetooth u need to connect it from APP.|✅ NOTE -Charger is not available with this watch it has in built usb port remove the strap of watch carefully than u can see usb port which u can attach easily with any laptop,pc,mobile charges to charge. For Any Product Issue Please Contact Us Through Buyer Massage Please Install Any One App From Play Store for the device App Name FIT PRO", "user_id": "AHSYI7EUDN2RNS2IPMGAS5MKLXPQ,AHHLJNBYVOGQSFG2Q4UMMRU3V3UA,AFC7PJA3XS6MHXYAUF3JZDHDUZWQ,AFL6U5G4P2KLLZU4HCOXES7ME2CQ,AFSSRLUEWTKDHYSAS36MDQQPYTKA,AG5UBF32OIHPW42GLXLBS4QOKKVA,AHLGMGTL6FSAFU2INPKH5ISUODTQ,AFL2ZLTGQ64RMXKWRI7QSA3457GQ", "user_name": "dk yadav,MUKESH KUMAR VERMA,Vishnu,Shaikh Shahalam,sushilkumar dubey,Roshan Narendra Raut,Deepak thakur,Aappashaeb Barsale", "review_id": "RQOWF9MFTN6CQ,R23B5JORWWE85P,R3SB0VOD36AXI0,R21GGYJ4354Q5J,R2L4513I3EHE9T,R1PKO3C46KVSKW,R2MGVNOXZZ1BWP,R2IYFCFPLPOX6C", "review_title": "Very Good prodat,Battery life is 0 day,Good,Where is switch on button?,Saman kharab hai,Do not purchase totally waste of time and money.,Bhot Gandhi h ye watch,Good 👍 nice", "review_content": "Good Prodat,Battery life is so bad.,Nice product,Dislike product also not return its only replacement,,Iska tauch kaam nahi kar raha hai aur kewal mobile adoptot se charge karne par on dikh raha phir turat band ho ja raha hai.ise wapas karna hai.,पहिल्या दिवसापासूनच ती वॉच ऑन होत नाही. चार्ज केले तरी पण ऑन होत नाही. पुर्णपणे third class वॉच पाठविली Amazon ने. दिवसेंदिवस Amazon ची सर्व्हिस आणि प्रॉडक्ट bad होत चाललेले दिसत आहे.,Bhot Jada ghatia h h,All the products are very good working there is no any issue till now.", "img_link": "https://m.media-amazon.com/images/I/41lnTFZGz9L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/SHREENOVA-Bluetooth-Fitness-Activity-Tracker/dp/B0BBVKRP7B/ref=sr_1_338?qid=1672895850&s=electronics&sr=1-338"}
{"product_id": "B09NY7W8YD", "product_name": "POCO C31 (Shadow Gray, 64 GB) (4 GB RAM)", "category": "Electronics|Mobiles&Accessories|Smartphones&BasicMobiles|Smartphones", "discounted_price": "₹7,998", "actual_price": "₹11,999", "discount_percentage": "33%", "rating": "3.8", "rating_count": "125", "about_product": "4 GB RAM | 64 GB ROM | Expandable Upto 512 GB|16.59 cm (6.53 inch) HD+ Display|13MP + 2MP + 2MP | 5MP Front Camera|5000 mAh Lithium-ion Polymer Battery|MediaTek Helio G35 Processor", "user_id": "AFZECWTOM2GUH3T67XW26DXUIJNA,AEIEKF6EFHH26R4DTUACQKMPJXDQ,AEFLPPQ4RG2KHSAOJF53X2CIPTEA,AGFTSZE2FTF4SUTZC7ONQ4JZDRJQ,AE5SY7U46GVLNQWM3GYOBMBKCVQQ,AGAOZJQ4WQAODOWE4K6CSPUDNG4A,AHTX2BOQMMX45RTHRTRK2E6PASUQ,AFC5XSGIOQBZNVIN5UVP7IOUXFSA", "user_name": "Jigar panchal,NOOR MOHAMMAD,Vikash R.,hari,Muscledark,A.Misra,Alagesh S,Jerry", "review_id": "RQRTXJPYHHSFL,R18MNNVQYGQHHE,R1KJ85AGYAQR4S,R1T49OPXXOLBI5,R1UUEAIVGFS3CT,R3UJT4TR76E3A,R2U1YEB0JD1J6F,R16JEBARKXZ8BX", "review_title": "Value For Money,नॉर्मल यूज़ के लिए मोबाइल है मुझे तो यह पसंद नहीं आया पहले मैंने असूस जेनफोन मैक्स m2 मोबाईल चलाया,Good article as per price range,Good,Mobile is good at this prize,Good phone,They fooled me all over and drove me crazy...,Best in low price  segment", "review_content": "Nice Phone. All over Performance is Good,बैटरी लगभग ठीक है कैमरा भी कुल मिलाकर ठीक है नॉर्मल न्यूज़ के लिए,Battery is running good, Camera is ok ok, speed of this phone also good as per price range,Goog wrk condition,Poco c31 oprating is better but lots of internal applications added,video quality and sound very low quality effect,camera picture quality is normal good & which I recieved mobile box not clean.,Price is too high,it's price goes to Flipkart 3/32,6499/-and 4/64,7499 yesterday.I want to buy this but can't do this reason,,Best 👍👍👍👍👍", "img_link": "https://m.media-amazon.com/images/I/41UhF7l9I4L._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/POCO-C31-Shadow-Gray-RAM/dp/B09NY7W8YD/ref=sr_1_353?qid=1672895850&s=electronics&sr=1-353"}
{"product_id": "B0BMM7R92G", "product_name": "Noise_Colorfit Smart Watch Charger 2 Pin USB Fast Charger Magnetic Charging Cable Adapter (Smart Watch Charger 2 pin)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹249", "actual_price": "₹999", "discount_percentage": "75%", "rating": "4.5", "rating_count": "38", "about_product": "Specially designed for Noise Smartwatch|Perfect Fit. USB charging cable, high-quality charger for 2 Pin Watches.Not for any other models.|Mini and durable: Charge your device more securely when connected to USB power source on PC, Mac, Laptop or notebook and mobile phone.|Good replacement, make charging more convenient wherever in home, office or travel.|Charging method is by magnetic suction thimble contact.", "user_id": "AHCY2NLFROLZAQ3YQAKVF3DMHB7Q,AHH7ZBKQ6VW722YSK6JZANJAO7VA,AE6TWJIXPTWPLBA6HQBQSCSHMXVA,AG2KRPXT2HVJMBECVLAOTO7CNI6A,AFDUBGK37QSYU5TRFFFN2GO2ZIIQ,AEGFQO2LSWCXXPUILBB4B4GDIOWQ,AF7NUBGRCKGFYSLOEUO4Y2UC4QZA,AEYKETLWPT5Z6X2DVORJ76G2E23Q", "user_name": "Placeholder,Qazi a.,Kriinaa,Manivannan,Santosh kapoor,Srinivas,nidhi,Anshuma", "review_id": "R1WVE2XLG4MKR0,R1V82XUZ6QXB7R,R3DYS5BGGSYC15,R3CC60ZW27R468,R1COHLUY0DPGX5,R2B1KPMU711L9C,R3PTZIPG57O5A6,R3FD50GUF74ZCS", "review_title": "Must Buy,Truly value for money at this price point get this type of quality charger cable.,Perfect fit for my Noise Colourfit NAV,Must try product,Product good,Good product,Value for money,Good product", "review_content": "The cable was safely delivered and works well with my watch. Perfect watch for my Noise watch.,Quality finish and charging capacity are efficient universal fit and at a low cost. Fits with my smart watch and band perfectly.,The cable is perfect fit for my Noise Colourfit NAV.,It's a good product worth buying thanks to Amazon,Good,Worth for the money,I like it. This is value for money,Worth the money", "img_link": "https://m.media-amazon.com/images/I/21yMfxVmNuL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/Noise_Colorfit-Charger-Magnetic-Charging-Adapter/dp/B0BMM7R92G/ref=sr_1_354?qid=1672895850&s=electronics&sr=1-354"}
{"product_id": "B08M66K48D", "product_name": "POPIO Tempered Glass Screen Protector Compatible for iPhone 12 / iPhone 12 Pro with Case Friendly Edge to Edge Coverage and Easy Installation kit, Pack of 1", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Maintenance,Upkeep&Repairs|ScreenProtectors", "discounted_price": "₹299", "actual_price": "₹599", "discount_percentage": "50%", "rating": "4.3", "rating_count": "4,674", "about_product": "Hardness: High hardness level provides protection from accidental drop & scratches|Additional features: Bubble proof, Scratch resistant, Anti fingerprint, Anti-glare, Anti-shatter, Touch sensitive|Easy Installation: Contains 1 Tempered Glass Screen Protector, 1 wet wipe, 1 dry wipe, 1 Dust Absorber & 3 Guide Stickers|Compatible Device: iPhone 12 / iPhone 12 Pro | Area of coverage: Edge to Edge Full Screen Coverage|Item Hardness: 9H Hardness", "user_id": "AHH26HAPTOI5Z52DFLNYU5TOLWCQ,AFIPAA4KT36MSZTCVAITRIUVJCNQ,AEYXCHSBU6NC4ZKH4OOFYZZTQJFA,AG4CH37VZG5JRJCAEYYGYTFH5UWQ,AGGCXXWA7CJVTHA22YE7PTNWQ7NQ,AFNQO7B5IZKARACZBIO74VFTU6EA,AH3ABVXQTD6ZA64V6NTEJL66RV7A,AFKY3NTT4T35K67VJ2RIO76YDK2Q", "user_name": "Ram K,Ankush,Viswanathan,Sanchita Mandal,Malhotra A.,Roy,ravi verma,Pravi Gupta", "review_id": "R2K2YNHJ952H5J,R1I8HU4RYFCVYW,R2DH2MLDOFTD73,R35L5ENDJ4MHKH,R3GBYEZ0GVZWLC,R1774TGNOXHCP3,R3RHTIGZI3S51Q,R2378C6LJXZXO1", "review_title": "Big Bubble dont go away,Perfect tempered glass in given price,Nice,Overall good but difficult to install,Good quality and great price,Best Tempered Glass👌🏻,Good quality,Best tempered glass used till date", "review_content": "Used guiding stickers but in those places bubbles formed. Shop guy fixed them,Too good in this price range. Go for it.Suggestions to company - for perfect  position, at speaker cut, give transparent background of film instead of black colour.will be much easier to decide position of it,Nice,The tempered glass looks solid and protective.It was difficult to align the glass however. The film protecting the tempered glass is black opaque. You can’t see whether the ear opening aligns with the phone’s ear piece. You can only guess. It can be made transparent for better accuracy.,https://m.media-amazon.com/images/I/71LMZQ86RwL._SY88.jpg,Best Tempered glass for iPhone 14. Reasonably priced unlike other sellers, superb quality, feels like actual glass. Really nice product. Keep up the good work POPIO.,Very easy to put it on. you may go for cheap tempered glasses but the touch feels different and smooth with popio glasses,I am using this for 3 weeks now. It is very responsive. I am very happy to use it. The only challenge was applying it as its not very easy even with the help of guiding strips. They tend to slip. But after applying there was no air bubble and screen works smoothly.", "img_link": "https://m.media-amazon.com/images/I/411fc62wnpL._SX300_SY300_QL70_ML2_.jpg", "product_link": "https://www.amazon.in/POPIO-Tempered-Protector-Compatible-Installation/dp/B08M66K48D/ref=sr_1_356?qid=1672895850&s=electronics&sr=1-356"}
{"product_id": "B09RFB2SJQ", "product_name": "10WeRun Id-116 Bluetooth Smartwatch Wireless Fitness Band for Boys, Girls, Men, Women & Kids | Sports Gym Watch for All Smart Phones I Heart Rate and spo2 Monitor", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹499", "actual_price": "₹1,899", "discount_percentage": "74%", "rating": "4.1", "rating_count": "412", "about_product": "All-day activity tracking: Track steps, distance, calories burned, active minutes, you can check daily activity and time on OLED display or APP .Fitness Band Smart Band.|This watch has USB Port you need to attach the USB port with your normal mobile charger or laptop to charge the watch. Fitness band for women.|NOTENO CALLING FEATURE-You will receive only notification to See Calls & Messages on Your Wrist: Receive/Rejection call, calendar, SMS and SNS (Facebook, WhatsApp, LinkedIn, Instagram, and Twitter) notifications on display, fitness tracker band let you never miss the messages that matter.Fitness Watch Smart watch.|NOTE-This fitness band will only work after installing fitness band application from play store.TO set time of watch you have to install fitness band application.YOU will receive bar code pls scan it to download the application. Switch ON bluetooth and location whlie connecting fitness band from app. Dont connect band directly with bluetooth u need to connect it from APP.|NO CALLING FEATURE-You will receive only notification to See Calls & Messages on Your Wrist: Receive/Rejection call, calendar, SMS and SNS (Facebook, WhatsApp, LinkedIn, Instagram, and Twitter) notifications on display, fitness tracker band let you never miss the messages that matter.", "user_id": "AHR4WZ6M4WXGQP65Z6SSP4LBJJ7A,AFWCLXKTHZPXBGFUEZSMLNWHGHNQ,AGEWKSFDTAPPBDWREYVDDGF54ZLA,AGTWAL33XMDTWFE7KCCBAPV4HHEA,AELBVPKFN3ACEWFOHW6PO7WU6HSA,AEZYTNF5ZWY4QEOAAJBW4HLB2U6Q,AEN3AIBIBGI7VSC6DSJBWDF2CHKA,AHTHIO4VEWZ6SO3MIQKNNZMDUJGA", "user_name": "Richard,Venkatesan,shakeel ahmad,Mohd Kaif,sakshi jolly,Nitin Agarwal,Nadini,Rolan B.", "review_id": "R31BGTIUFLQNT5,R1OQRF5LZIEHR4,R29Q5SDNP9JWZB,R1AZR3AI0IHB30,R13H3ADGD1MXRT,RBWFP5OHEVKRS,R1M1HGIX59ETCA,R1IVSKQW9YSH7V", "review_title": "It's worth for money and satisfied.,Nice product,Not great but will do,Very good product I like this product.,Product is ok ok as it is too difficult to connect with phone or it not be able to with ios,Must buy,Good, watch was as expected,Good smart watch", "review_content": "It's good product and value for money.  it's comparable easy to operate operate for kids..,I like all the features and in main B.P. check and the product is value for money and used for sports purpose by walking,Tuch panal is very tuff not easy,Very good product I like this watch I wear it full day and I purchased it to wear in my job time.,Ok ok,Really liked this product at this prize. Must buy,Okay,Easy to use, good touch screen and value for money and good battery life.", "img_link": "https://m.media-amazon.com/images/I/41YwW+O-SKL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/10WERUN-Bluetooth-Smartwatch-Wireless-Fitness/dp/B09RFB2SJQ/ref=sr_1_367?qid=1672895857&s=electronics&sr=1-367"}