{"product_id": "B07JF9B592", "product_name": "MAONO AU-400 Lavalier Auxiliary Omnidirectional Microphone (Black)", "category": "MusicalInstruments|Microphones|Condenser", "discounted_price": "₹478", "actual_price": "₹699", "discount_percentage": "32%", "rating": "3.8", "rating_count": "20,218", "about_product": "4-pole jack is compatible for laptop which has only one audio male jack (input/output), iPhone android Smartphone, PlayStation 4, this mini microphone is specially designed for smartphone, tablet, laptop, PS4 or Skype, WhatsApp, FaceTime talking, YouTube recording, Podcasting, webinar|The pin is thin enough to directly plug into your mobile 3.5mm headset jack even wearing a phone protector, High-quality and omnidirectional function, easy to use, Reception : High-quality Voice Technology|It picks up sound equally from all around the microphone, allowing for versatility when mounting and ensuring a high degree of user-friendly operation|With the help of 78 inches long cord, it makes the podcasting at a distance with your mobile much easier and easy clip on your tie or shirt collar for sound recording because of sturdy metal clip|An Extra 3-pin Adapter for DSLR: If you are going to use this mic with DSLR, camera or other device with 3-pin jack, please use this adapter.", "user_id": "AHQ4Q75NBEWOM4OWOXUZW7V247NQ,AEQCAMSZJTMNIKXAPXCKT5XLOWIA,AGCHPEKLU5ZFHDV7K3QYXNJQP6JA,AFFXN6T5QGDHRUO24P4PM56E7AAA,AGUPZJ4VI66F5L3GN2VT6QDZEAJQ,AFVIFCKLO7ADXYQAQ2T74HUJEBEA,AFRCL2UST67EVGUTDLV2JGI4OKUA,AFCCTAOXYH2XQNESLRQRH72G27ZQ", "user_name": "ˢᴰ82ˢᶜ ✔️,Manish Rautela,Sai kiran,Dinesh S,Uttam,Shahrukh,ADITYA UBARHANDE,Deepak Kanwaliya", "review_id": "RKBKQKSEET7CC,RQM34GWJC0DPJ,R1PJNXT9PME2I1,R2VL3P4XIHJFY,R2HZEV0BNY3064,R3HBAZIE8PAIXC,R3LFVYT98WRBZ1,RJPAKDZRUJIDF", "review_title": "loud & clear,Avrage in budget range,Best for beginners,Good for price,Very nice mic in this price range,In budget,Product Good, Packaging damaged.,Gzzzbbbbb mic 🎤", "review_content": "at Rs.319 it's a great deal. I use it for mobile vlogging.,Noice cancellation is not working,Value of money 💰,Good mike, worth money,Very nice mic in this price range.,After seeing many microphone. I found thisI bought it becuase of its good ratings and reviews and in a buget price. This is best for beginners,The first time I had ordered this mic, I received in a amazon plastic bag and the product box inside was completely damaged and was sealed using cello tape. Also, the mic seller sent me was damaged and had low quality audio. It was a duplicate.But, when I replaced, I received the packing in a cardboard box but still the inner box had a few damages.The mix received inside was good.Here is a detailed review of the mic:1. The quality: Quality overall nice. The wire might seem filthy and weak but in reality when I tested it, it was indeed a bit durable. It can easily sustain a bit of a pull and twist. Just mind the spots when the wire meets the audio jack and the mic2. Sound quality: Sound quality is really nice. BUT BUT BUT... before you think of buying it, read the paragraph below (of noise cancellation). The mic catches sound equally even if you are from far away or close to it.3. Noise Cancellation: This is a major point. I used to mic a lot for testing purposes. Let me share my experience. I tested it in different environments.a. In a closed room with AC and total silence: In such environment, you will get crisp sound like a boom microphone. But, you will also receive a bit of white noise or background static noise which you can easily reduce using the noise reduction feature.b. In a room with ceiling fan on and moderate noise: Still seems good but not great. Your vocals would still be crispy and clear but the background noise will increase. Still if you use nice noise reduction software (like Audacity) it will sound great. Adding background music to your video would help.c. In a room with standing fan on and high noise: Not recommended at all. Not only this mic but any mic would capture a TON of noise. To express statistically, there will be atleast 40% noise of wind whooshing in the background.d. The same high noise room with windows open: You will die doing noise reduction. Not gonna lie, the background noise increases by 60 times.  DONT TRY THIS.The pop filter or the sponge on the top of the mic helps a lot. When you are speaking close to the mic, a lot of air goes in while speaking. So, when the \"filter\" is attached, the output sound does not have air whooshing but with the filter removed, the output sound is only air.Now, to sum up...Mic is overall good. Noise cancellation is not great but yeah, for the price range, it is the best!Recording tips:1. Record in a silent room with A/C or else turn on the fan at the least speed so it doesn't make much noise.2. Use the collar clip to place the mic, don't hold it in hand. ( I mean this is common sense :-P )3. If transmission lines (electricity wires which are above the head) go from close to your room, I would recommend changing rooms.Now, the reason for this is that sometimes, the mic can catch electromagnetic intefrerence.  This maono mic won't catch it but I recommend this for generic mics.4. Do noise reduction in Audacity. It is very effective than the inbuilt noise reduction tools in video editors. Also, it is very easy.Also, BOYA BY-M1 MIC SOUNDS ALMOST THE SAME AS THIS MIC. There is only like 2% difference in noise cancellation. But, I would still give both of them 3 stars for noise cancellation.THAT'S IT!Hope you understand what I mean to say.Peace out.,Nice 🙂", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/413viCgpI+L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Maono-AU-400-Lavalier-Microphone-Black/dp/B07JF9B592/ref=sr_1_237?qid=1672903006&s=computers&sr=1-237"}
{"product_id": "B086394NY5", "product_name": "TABLE MAGIC Multipurpose Laptop Table Mat Finish Top Work at Home Study Table (TM Regular- Black) (Alloy Steel)", "category": "Computers&Accessories|Accessories&Peripherals|LaptopAccessories", "discounted_price": "₹1,399", "actual_price": "₹2,490", "discount_percentage": "44%", "rating": "4.3", "rating_count": "11,074", "about_product": "The 18-in-1 multipurpose table 6-height quick adjustment Min- 54cm (21.25â?\u009d) Max-73cm (28.75â?\u009d) surely accommodate all age group. Quick and effortless 3 angles adjustment of top, no tool required to assemble or adjust height and angles", "user_id": "AE5JR5HPVSNYE3USXPC5DD5QZPEQ,AGTCKJGZ3Z6MWRYDZBR3BBJSFYZQ,AFFOKWDBWHTD73ESMLG5EHU6D64Q,AEBJF5IZ4I3DJKCO5DFA6UPGX3NA,AG7BFEWBPUBPVFTK47EIJDAYUBNQ,AG37JNOSIVJOXSZEPVVPPBFCS56Q,AHIF77XCTU4RPZQLTOMGSXQAJIQA,AFUHQIJJYON4KDALBU5NF4TOUAFQ", "user_name": "Parul Walkey,Kirthivasan,Ashok.,Deepika,kavan,Mohan,Saikumar,Hari C.", "review_id": "R21VW93DSBYENF,R3MKRK9JVBJ22C,ROBLP3CK320DX,R14L8HWTVI4YOT,RT2C0KDRUBKGV,R3JUJ27CXBI0QN,RO4BI7QVTST6E,R1NSRWB0V1BQKD", "review_title": "Not sturdy enough but good.,Product looks good for the price,Good One,Good quality in this range....,Budget buy,Good,2 problems i noticed,Incorrect steps order", "review_content": "It was easy to assemble. The manual explains the procedure of assembly for both with and without resting pad. And the height can be adjusted accordingly. Just felt it is not sturdy enough.,The product packaging was good and clean. While assembling, I could see there are minute scratches. Other than that, it looks good and sturdy!,Good One , using for office work and my wife using for vegetable cutting purpose also.,https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/61uDjA3dINL._SY88.jpg,Could have been more sturdy and the fittings attached to the table top are easily felt which feels cheap. Pro's are: Good for WFH and if you have budget constraint. Angles and height adjustment is best. You can easily adjust the height to any chair you are using.,Good,,", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/411ZrOollDL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/TABLE-MAGIC-Midnight-Adjustable-Multiple/dp/B086394NY5/ref=sr_1_238?qid=1672903006&s=computers&sr=1-238"}
{"product_id": "B00NH11PEY", "product_name": "AmazonBasics USB 2.0 - A-Male to A-Female Extension Cable for Personal Computer, Printer (Black, 9.8 Feet/3 Meters)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹199", "actual_price": "₹750", "discount_percentage": "73%", "rating": "4.5", "rating_count": "74,976", "about_product": "One 9.8-foot-long (3 meters) USB 2.0 A-Male to A-Female high-speed extension cable|Extends your USB connection to your computer by 9.8 feet; for use with printers, cameras, mice, keyboards and other USB computer peripherals|Constructed with corrosion-resistant, gold-plated connectors for optimal signal clarity and shielding to minimize interference|Features shielding that provides protection against noise from electromagnetic and radio-frequency signals, keeping your signal clear with less loss of bandwidth for higher performance|Typically, the Male A connector plugs into your computer and the Female A connects to the cable you need extended|1 year limited warranty", "user_id": "AGBX233C7B7D7YZEL7ZLFWMQKFDQ,AFKSU4D3IE4KNDBVVBEA3AHDD2YQ,AHJK4PVBRGDX4N5LYA4EKHULJOPQ,AFW6NV5N3FUXV3CNUACPSYC5AB3Q,AGOCMOZJWGI5VHFT2RZLTQFZLKPQ,AGX3GCRGFU4IHAJZRUP655EEGSQA,AEG5JOZOUBWEAZOGQQR6YDVPTL6A,AGUQYXAUPX5VOWYZTIWXMUIGVGCQ", "user_name": "Pravin Kumar,Maestrov,rag,Mukundha2good,Amazon_Shopper,Sonic,Pratap,Amazon Customer", "review_id": "R1C8MVU3EIX56Y,R10RUXC7JD5S4I,R1AFBZ5PYTHO1Z,R3GQL7YKAFJMEN,R3B6H5JPG134KN,RUG04XHXRXK95,R2Q1OYOIJI5673,RJX2WGB0X99SY", "review_title": "Nice,good,Paisa vassol,Sturdy and long.,Good for the price and great quality.,Works as expected,Good,Good", "review_content": "Sufficient length,excellent build quality ,good alternative to generic cables,Strong cable, the cable ends are nearly like rubber. GOLD coated. Cable is also of high thickness.,Why I bought this ?I have DVR rack, for DVR which is far above the reach limit hence I need a mouse to be connected to the USB port of the DVR which is in the rack above reachAny alternatives?Wireless mouse didn't work well with my particular DVR, had lots of lag,  hence I had to resort to a USB port extender with ample lengthResult :Very sturdy cable able to connect to my DVR and connection is stable .Amazon basics is very reliable.,This cable is good for any device that needs extension over USB 2.0 like printers, TVs, gaming consoles, keyboards etc.The build quality is good. Cable material is soft so it will not break. Connectors are gold plated and will not rust.But remember, this cable will not give USB 3.0 speeds even if you connect it to a USB 3.0 port.,For Usb 2.0 , any usb 3.0 if used will behave as usb 2.0Type: ADirection: female to maleFunction: extension of length of usbBuilt: average  not cloth/fibre braiderLength: as mentionedWorks for all connections: yes [including pc\\printer\\console pen drive etc ],Product is as per description,Good as expected.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41Fqm0bR7PL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AmazonBasics-Extension-Cable-Male-Female/dp/B00NH11PEY/ref=sr_1_239?qid=1672903006&s=computers&sr=1-239"}
{"product_id": "B017PDR9N0", "product_name": "GIZGA Essentials Portable Tabletop Tablet Stand Mobile Holder, Desktop Stand, Cradle, Dock for iPad, Smartphone, Kindle, E-Reader, Fully Foldable, Adjustable Angle, Anti-Slip Pads, Black", "category": "Computers&Accessories|Accessories&Peripherals|TabletAccessories|Stands", "discounted_price": "₹149", "actual_price": "₹499", "discount_percentage": "70%", "rating": "4.1", "rating_count": "25,607", "about_product": "Double leg is made of high qualified at the bottom of the antiskid foam material, by using two width, can be flat on the table|Using high-quality environmental engineering plastic material, effective to reduce travel weight|Portable and folding universal stand for 7-10 inch Tablet PC|Joints using automatic spacing device, adjust the Angle is not adjust anywhere, can be directly which can adjust the Angle|Also can solve the problem of tablet can only be placed horizontally cannot be put vertical|This stand can unfold and stand up as trIpod to hold tablet PC at perfect typing angle and better angle of view and better watching effect effect|0", "user_id": "AHSVH7UVP3JM3CKGD7QPMP5ZXTNA,AHPQISIB2DAWTJO3NBJYFMEDERFQ,AHEVYUNLYXJXL5LUWGSH4XBESUJA,AEKJOTUYTW5GOZPGXAN7FOMQ6SUQ,AGYRWNDZCQ4RHAQ6YZIBCQDFMH7Q,AGEMPEOZMB2CNDKH3XBKWQ4NT6PA,AG37JNOSIVJOXSZEPVVPPBFCS56Q,AHHTWGSVW6ENNVUTEPAFHRLQJPFQ", "user_name": "Atul Modi,Akash gahlot,RAHUL RAMAN,Drashty N.,Dr. Gilbert Ignat,Soumitra Deb,Mohan,Mathivanan", "review_id": "R3ZXPPAOL3P9C,R50YC789QBGLM,R17IHHWVFSBEZZ,R3VH5ITHUL3GUT,R36V21B0F30IAW,R22ISA1UVT45QP,R3RD0LCTRTMC3M,R1TWNRM3JLQ2JF", "review_title": "Okay product in picture,Good for students,Nice product,Portability,Great product at this price,Just working,Nice,Good", "review_content": "When you use its okay product.,I am using and don't find any problem 🤠,Nice product, good quality and easy to manage,The best thing about it is that its super light weight and small.. so its wasy to carry almost everything,Go for itGood for landscape mode,I liked low price.,Nice,Ok", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41wL36XZGXL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Generic-Multi-Angle-tablets-Samsung-paperwhite-Phablets/dp/B017PDR9N0/ref=sr_1_240?qid=1672903006&s=computers&sr=1-240"}
{"product_id": "B07NC12T2R", "product_name": "boAt Stone 650 10W Bluetooth Speaker with Upto 7 Hours Playback, IPX5 and Integrated Controls (Blue)", "category": "Electronics|HomeAudio|Speakers|BluetoothSpeakers", "discounted_price": "₹1,799", "actual_price": "₹4,990", "discount_percentage": "64%", "rating": "4.2", "rating_count": "41,226", "about_product": "Experience the true immersive sound with a pumping driver delivering 10W of audio and connect to the music that you love|Its powerful 1800mAh battery offers a playback time of up to 7 hours. Impedance 4Ω, Sensitivity (dB) 89dB±3DB, Frequency Response 2.4GHz-2.480GKHz. Memory Card Supported : Yes|Stone 650 is IPX5 rated offering protection against water and dust. Charging Time 3.5 hours|Its integrated controls allow for an easy user interface, ensuring that nothing stands between you and your favourite music|It offers dual connectivity via its Bluetooth v4.2 and AUX|1 year warranty from the date of purchase", "user_id": "AFOPJWBWQAT3U43C3O3HJE7MJJCQ,AEWBG5DA5BABI4GNKJHLAY3IOTPA,AE5BBOZWRMK46CA2IDKPBVIQIFAQ,AHZRZRBWNNDHG2KXXLPRZVBTHTUQ,AHVOFX6HOS5RQTDPP6UONVCRODLQ,AFURZKQOYCUW7VM4OARS72JDTB3A,AHKCSY3JWTOFWMOBQZX7KXDDMQFQ,AE74526CGYUJIWO3DRBFRBTN2I3Q", "user_name": "VSMS,karthik,Latheesh Reddy,Mayank g.,Sachin Kushwaha,Rahmatullah,brahmas_bull,annaladasu jeevanababu", "review_id": "R2HAE08L30C2AN,R3F8JOBWK5R0I9,R1MNK92W012DJ0,RRLP9GLVLYZF1,R3ODRY6PH6VBRV,R24O2F7357YB8L,RJ13RMYUVYNIW,RZN6P7BA3HCH5", "review_title": "Sound Quality : Boat Stone 650 vs Nakamichi Speck vs Boat Stone 200,It's just a speaker with less sound,Okay to buy,Sound is not much loud in maximum volume,Boat rocks always,Excellent 👌,VFM PRODUCT BUT THERE'S MORE TO IT. READ ON!,Excellent sound quality, i like this speaker sooooooo much 👌👌👌", "review_content": "This is review is primarily focused on sound quality.The term Bass is used losely. One doesn't expect true Bass from such small drivers.SHORTER VERSION:Boat Stone 650: Very loud. Loud and somewhat uneven bass. Mids are a bit supressed. Somewhat muffled midrange. Decent treble. A loud bassy speaker.Nakamichi Speck: Barely louder than the 3W Stone 200. Mids clearer than 650. Bass much much lower than 650. If looking for VFM rule this one out, unless this is on a big discount and others aren't. Overall fairly even sound, at a questionable price and volume.Boat 200: More bass than expected of a tiny 3W speaker, but lesser than Speck, and way lesser than 650. Excellent midrange and terble. Much lounder than what you may expect of a 3W speaker. Amazing speaker in a tiny package, with insufficent bass.LONGER VERSION:I have had the 200 for years and many have asked me to order it for them. It is an excellent tiny satisfying package. The midrange, vocals and treble is excellent, and matches speakers several times it price. If bass is not what you are after, you are unlikely to find a better package even at a much higher price point, especially if you care for even sound.(By Even Sound, I mean all relevant frequencies produced fairly well - no major suppression or enhancement)I checked the others as I usually hear music on a semi-pro system, and the insufficent bass (lower-mids) bothered me.Nakamichi USED to be a Japanese company making very high end tape decks in the 90s so the benchmarks were high (now it is a China based company). The 25W raised expectations further. As said, it is barely louder than the 3W Stone 200. It is fairly even sound, but not a significant enough improvement in bass over the 200. If you don't care about the money, and want something better, than the 200 with even sound, this could be it. The mids and terble, are a tiny bit better in the 200. Speck also has a larger battery, giving substantially longer backup, and better water protection (useful if you use yours in the smallest room of the house :) )The Stone 650 is miles ahead in bass and loudness. if that is what you care for, amongst the 3 - your choice is simple. The bass is uneven, however. All three speakers have memberanes in the inner shell acting as passive bass radiators. One should not expect much nuance in bass from those. If a thump is what you care for - yes it is certainly there (for the size). With somewhat uncontrolled bass, the midrange is compromised - somewhat suppressed and somewhat muffled. No, it is not major, and many mgiht not even really notice it much. The transiton between mid and lower-mids/bass isn't great. One usually doesn't expect as much from such speakers, but the Boat Stone 200 set the bar high - very high.Keep the boat stone at an angle such that the drivers (speaker) are in the direction of your ears. It makes the midrange a bit better. Reduces the bass a bit, but makes the sound more even. Tough it is impractical to keep it so, it makes the sound a lot closer to what I desire.SOME EXTRAS:Placement of these speakers makes a big difference. Keep them about 6\" away from a wall (ideally a corner) for enhanced bass and fuller sound.If you look at teardown videos, you'll notice that the 650 has much bigger magnets than the others. It is a heavy speaker. I like that, since it keeps it stable and the rubber on the side helps further. It is well designed, except the + and - volume buttons should have been interchanged for intuitive use.The 650 can also be placed vertically. That too changes the sound. Lesser bass, and possibly a bit clearer on the whole (reduced bass = less intrusion into the mids, in such speakers)Speaker characterics change subtly over 100 odd hours of use. Often quite prominent in the first hour, so do not form an opnion before running them in for about an hour.Conclusion:Nakamichi Speck: More even sound than the other two, not at all as loud as expected, better waterprof rating, bigger battery, high priced, despite Chinese - Buy if you don't care for the money, volume and are okay wihtout much bass.Boat Stone 200: it is a star! Excellent even sound, however the lack of bass as compared to the others pulls it back. If you are on a budget, or if you don't care much for bass (especially for lectures/documentaries or vocal music) this is brilliant. I have used it for long.Boat 650: Heavy. Loud. Lots of bass. If you can deal with the somewhat (and it is not big) unevenness and slightly muffled sound - it is a good package.For my needs, I added the 650 to my equipment list, while keeping the 200.PS: This was my way of giving back to the community for the numerous reviews I have gained from.,Sound,Its okay to buy,Sound is not much loud, its below my expectations,1. Low price2. Awesome sound3. Battery life should be more so cutting down 1 star but overall good4. Gives feeling of home theatre5. Multiple connectivity is also good.,Loved the product,,", "img_link": "https://m.media-amazon.com/images/I/41rfSd9spqL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Stone-650-Wireless-Bluetooth-Speaker/dp/B07NC12T2R/ref=sr_1_241?qid=1672903007&s=computers&sr=1-241"}
{"product_id": "B07WKBD37W", "product_name": "ESnipe Mart Worldwide Travel Adapter with Build in Dual USB Charger Ports with 125V 6A, 250V Protected Electrical Plug for Laptops, Cameras (White)", "category": "HomeImprovement|Electrical|Adapters&Multi-Outlets", "discounted_price": "₹425", "actual_price": "₹999", "discount_percentage": "57%", "rating": "4.0", "rating_count": "2,581", "about_product": "[SLOW CHARGING] Input: 100-240W / Output: 100-240W 6A MAX / Tear Off the Plastic Film From Surface Before Use|Dual USB Ports DC5V 1A 10W, Work with All Phones and Laptop Cameras,Indoor Use Only.|Accepts Plugs From More 150 Countries with USA/EU/UK/AU/CHINA/JAPAN Plugs,Equipped with Built-in Safety Shutters,Include 1x Universal Adapter / 1x Instruction in English and Chinese (Cable Not Included)|Different Input Plugs Tightly Connect into 1 Adapter, Equipped with Built-in Safety Shutters|This Charger Adapter Plug Converts the Power Outlet Only, It Does Not Convert Electrical Output Current and Voltage", "user_id": "AGNE5T4E7SEMJUDM4COI6JBNJQBQ,AES63PZGZP33ZVO55CCO2WYML7NQ,AHQYGDH4CNFRYRTPCENNJNJHULTQ,AEMDF6YAXYO7WQUIAFGEULA7NWWQ,AFDV4H4KLTJ55TV4USUXZQ3SM47A,AHHGXR7CKVXIJ2ZT7XLLXW4DK7DQ,AEBMBHYSJBU324NU4URUAU4RHB2A,AEYMLF2UAU4DY2LCCDIDPFEIAAAA", "user_name": "Ehsan Ul Haq,Abhishek rajput,Nishant Malik,ruhi a.,jasmitha,Sunil W.,B. Bibo,monyag", "review_id": "R186EFJU37UPS6,R2KC2H7A99Y8J6,R25FE16IQR653P,R1Q6E8EBLHDKEC,RNH0MZ907JI2S,R18J8NK2242FA2,RC7ZMZ000I0FQ,R3LF4N05QHM907", "review_title": "Material not worth,Stable for use,Overall product is good,Durable, travel friendly,Adapter,Useful product for international travellers,Doubtful for Durability and sturdiness,very good product", "review_content": "I can say costly, although it can do the job,I like the modal and size,,i bought this one year ago, just reviewing now, i carried this to Europe and UK. It's still working good. very good product.,my adapter fallen from charging point its not working,Useful product for international travellers but a little in the expensive side,Quality of the product is not upto the mark, I have uploaded some pictures pls guys check this before you buy.,very good product verified the purchase", "img_link": "https://m.media-amazon.com/images/I/31w-19-3fSL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/ESnipe-Mart-Worldwide-Protected-Electrical/dp/B07WKBD37W/ref=sr_1_242?qid=1672903007&s=computers&sr=1-242"}
{"product_id": "B08JMC1988", "product_name": "boAt Stone 180 5W Bluetooth Speaker with Upto 10 Hours Playback, 1.75\" Driver, IPX7 & TWS Feature(Black)", "category": "Electronics|HomeAudio|Speakers|OutdoorSpeakers", "discounted_price": "₹999", "actual_price": "₹2,490", "discount_percentage": "60%", "rating": "4.1", "rating_count": "18,331", "about_product": "Stone 180 comes equipped with 1.75\" Dynamic Drivers for powerful immersive sound|Its power packed 800mAh battery ensures extended indulgence in musical bliss with up to 10 hours of play time, Charging Time : 1.5 Hours|The speaker offers 5W of premium High Definition sound|Stone 180 supports instant wireless connectivity with latest Bluetooth v5.0|Connect two Stone 180’s and turn the scene right around with double the volume at the same clarity level, get the party started anywhere, anytime with the boAt Stone 180|It is IPX7 rated which offers protection against sweat and water.|It offers dual connectivity via Bluetooth & AUX.|1 year warranty from the date of purchase", "user_id": "AEJYXUANEWSM2G7VHRZDANCYLPYQ,AGGUTNEUBYL4DWFU3VO3SR64QPKQ,AHFDICPWOMD7PR4EWYPOT5JZTX3Q,AFUTBH6P5GKM7JEHII7LKYB3XKDQ,AGNHQQDJF2WSXFFIAY5RS22DBECA,AH26TJQO7WSE7QTSY7DWLILS4QSQ,AH6F53CHVVYPMBUDQWTG3LJZVCCA,AEF6JSVY55DHBPROF6AK72DB43ZQ", "user_name": "Meghana,Udit narayan gupta,R.sasikumr,Sweta Chopdar,Amazon Customer,Samisha Malik,Arhaan Khan,Pallab Das", "review_id": "R16I46MPR0NO8S,RC8A7CPLOKIQ1,RXMRIDNTYYGO0,RBD55BYULL457,R2CDPRTPCIO5H4,R2GWMPGA1WXZ80,R1C7OH3WXNJHJ,R3N6TUU2QT818A", "review_title": "Stone 180 is good as a portable speaker.,Good but not that much ok sound,Nice,Battery life,Poor battery life,Not have loud sound,Value for money...,Average", "review_content": "Bought at 800.Sound quality is good enough.Easy control buttons. It would be better if button are given in a different colour rather than in same colour.Looks good in colour, shape and size.Best part is the battery as it lasts longer.Suggested to buy this at a cost below 1000.,It is good but battery life is dam not good if u play in full volume only 3-5 songs will be played and when comes to bass sound goes down,battery wast,It's battery life is good, atmost 4-5hrs.But sound quality is not as I was expecting but it's ok.,Can buy for picnic and small drives,Not have loudsound,Good connectivity and sound quality is also good according to value cost of product,Good for carry", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41aZf9i-QzL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/boAt-Stone-Bluetooth-Speaker-Black/dp/B08JMC1988/ref=sr_1_243?qid=1672903007&s=computers&sr=1-243"}
{"product_id": "B09GFN8WZL", "product_name": "Portronics Ruffpad 8.5M Multicolor LCD Writing Pad with Screen 21.5cm (8.5-inch) for Drawing, Playing, Handwriting Gifts for Kids & Adults, India's first notepad to save and share your child's first creatives via Ruffpad app on your Smartphone(Black)", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|GraphicTablets", "discounted_price": "₹378", "actual_price": "₹999", "discount_percentage": "62%", "rating": "4.1", "rating_count": "1,779", "about_product": "Easy Electronic Writing|Environment Friendly|Single-Tap Erase|Long Battery Life", "user_id": "AGMR74PGVNG5IU7X25GJGDAT63TA,AFZHVPBS7NVVW2M7U4TXWIQBRKAQ,AHOARBR5RTZEZWDSDTRGIBNM7TJA,AH3PPZMEFKEJLVVCX3FZ264SEY4Q,AHAFEMDFYHJDWIR4CF4JD3HIA6ZA,AHOQRYDRLIO5O3MPE76LHWANC7EA,AFANGSCZERSUTYMODCZNYRH7NL4Q,AFBIER33V2UVWGHQNBRTHEVLIW6A", "user_name": "HIREN PARMAR,Yateesh Rajput,Bhubanananda senapati,Gaurav R.,Sumit Jain,Siddiq,Shreya Srivastava,Sharon M V", "review_id": "R20Q4B16AEFTPT,R1BG411LZ5XP61,R1FHFXAGKZ127T,R1LFPZC0A29D8D,R1PIOZ70CD7P9D,R1ID5DTYN1L39B,RCKVFOB5KX6F3,R3PCRI9KDXF4QD", "review_title": "Average,Value for money product,Nice product,very nice product... screen should be little bit more bright,Product looks Good,Nice product, easy to use and perfect delivery,Overall nice,Good", "review_content": "Product quality is not that much good you have to work with lite hand if you put your hand on it and starts drawing or writing it will cause bending in pad,Overall nice product,Nice product,brightness was not upto the mark,https://m.media-amazon.com/images/I/71GD+NNhszL._SY88.jpg,Nice i will give 4 star,Overall product is nice but screen is a little bit smaller but in this price range it is okay...go for it guys!!!!!.....,Worth it.", "img_link": "https://m.media-amazon.com/images/I/31NR4qCjJyL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Portronics-Ruffpad-Multicolor-8-5-inch-Handwriting/dp/B09GFN8WZL/ref=sr_1_244?qid=1672903007&s=computers&sr=1-244"}
{"product_id": "B095X38CJS", "product_name": "BRUSTRO Copytinta Coloured Craft Paper A4 Size 80 GSM Mixed Bright Colour 40 Sheets Pack (10 cols X 4 Sheets) Double Side Color for Office Printing, Art and Craft.", "category": "OfficeProducts|OfficePaperProducts|Paper|Copy&PrintingPaper|ColouredPaper", "discounted_price": "₹99", "actual_price": "₹99", "discount_percentage": "0%", "rating": "4.3", "rating_count": "388", "about_product": "Made at the renowned Fabriano paper mill in Italy.|Acid free paper.|Vibrant color pallette,Soft surface,80gsm.|Ideal for photocopies, laser and inkjet prints, fax, dividers, covers, collages, craft & punch craft; suitable in particular for office and schools, and all technical paper uses.", "user_id": "AG7MI6MZP3GMUTO65QNUR25VP7VA,AHBZCVGYU7BO7DCSNDWCXK5GQP2A,AECMWB3HNGTTXL2CN4FR6NFXD5GA,AEDRNOENRBIMTJ75EUOOTKRN7YOA,AE5GXCIX32PZKCLESSPQFXILAPNA,AHM3VIGOFAIX3B5LBTVFIH3JPL2A,AGN44TXNKAN6TOS4VEW5N347GCNA,AHZZISWHBQV4TL3MKOJTH22IUNIQ", "user_name": "kashif,sezhian,Dinesh K.,Jenifer,Harsh,suresh,Madhu,Amazon Customer", "review_id": "R2ETD6AVA4AFF1,R3CUOW1DUP8N92,R3NYD5UBRVJDWP,ROK6ZCMA5J3HR,R3GWUP5VQM4PIW,R2DBDFFUMF72A7,R3CTPZMQDFCSGL,RDDDVU6EMW3OP", "review_title": "Good,Heads up,Good product,Bright in color  good product 👍🏻,Nice dark colors...,black  and dark blue paper not supplied  as it should be also there making it 4x12,Quality is too good,Nice bright colour", "review_content": "Good value of money if u have students at home,Liked it,Good product,Product was good 👍🏻value for moneySheets thickness was good bright in color,Value of money...,black  and dark blue paper not supplied  as it should be also there making it 4x12,These papers are of excellent quality. I've used many colour sheets before for school projects and the colour used to fade while applying glue. But these color sheets dont have that problem. Definitely must buy if you are looking for a A4 size colour papers for school projects,Quality is good... Especially for kids project... Got it timely", "img_link": "https://m.media-amazon.com/images/I/41WggyozHQL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/BRUSTRO-Copytinta-Coloured-Bright-Printing/dp/B095X38CJS/ref=sr_1_245?qid=1672903007&s=computers&sr=1-245"}
{"product_id": "B07ZKD8T1Q", "product_name": "Cuzor 12V Mini ups for WiFi Router | Power Backup up to 4 Hours | Replaceable Battery | Ups for Wi-Fi Router and Modem | Ups for Router up to 2A | ups for uninterrupted wi-fi", "category": "Computers&Accessories|NetworkingDevices|Routers", "discounted_price": "₹1,499", "actual_price": "₹2,999", "discount_percentage": "50%", "rating": "4.5", "rating_count": "8,656", "about_product": "Replaceable Batteries: No need to keep buying new UPS every year. Whenever backup drop's let us know. We will pick up the unit, replace it with a new battery, and ship it back within 48 hours. This will be done at Rs599 only.|Doorstep pickup warranty: For 1 year from the date of purchase, your Cuzor ups will be picked up, repaired, and shipped back free of cost. We know your time is important.|Please note if your power adapter is either 12V-0.5A or 12V-0.75A, Please do upgrade to 12V-1A adapter for better performance..|Is not compatible with NetLink, Syrotech, Alphion 100C, 1524, BDT-121 UT-STAR ONT4842W Routers", "user_id": "AF757N27JM5UZFJ3TS5FVGBYVMDA,AEMZHQJZLLZE7YLSPHME5ZJUOQ6A,AGTQADVKZIITNOSSU2VHYAEEZ7WQ,AG5QL2X7ZDWB3GK34SRUZTAXKO2Q,AFVEPSR3NXA6IPMGBTDRZNB6TY7Q,AFDLI3P4HU4RJGHXBV5X4UBM7ZLA,AGSYEEI6BBNNWJDYAHK22EYCPKQQ,AGNR2DWHR4DRJVRRUOZTUU4EY5RA", "user_name": "Subramanian M,krupasindhu,Amazon Customer,Arun,Siva sbs,Johny Depp,Abhishek Kumar Singh,Mr. G", "review_id": "R322EU1EPO0EFK,RKIITDXE4AGW3,R2MPRUBHGVAK2R,R13E9GP8EQCMZ3,R2ID65YG8CVX9K,RX6LRL2BB59G,R1K208FSP9EL6F,R1QH3BPFU8VE89", "review_title": "Cute one,Received today and installed.Observing performance.,Provides 1-30 to 2 hours backup,Perfect modem and router UPS,Nice product with some drawbacks,Shandaar Jabardast Zindaabad,As expected,Excellent product for apartments with DG backup.", "review_content": "Working as described but too early to comment .,Easy to install and performance under observation.Request to hold return instruction and reordering for replacement,No manual intervention needed, it works seamlessly when power cuts happened, Provides 1-30 to 2 hours backup,I bought 4 of these UPS for my home and it works perfectly as explained. No drop in internet speed while on UPS. Modern and router never disconnect also.I have tested this UPS without electricity for 3 hours, by that time electricity came so don't know about full backup.Good UPS and works fine.,TLDR1.battery backup good.2.Small comfyCons1.IT REBOOTS THE WIFI EVERYTIME WHEN THERE IS POWER CUT,Superb product, when it stopped working, the manufacturer got is repaired and sent me back. After that, the backup is also good around 2.5 hrs.,Working as expected so far. On power cut automatically switches to ups mode. It gives me backup for around 6 hours for my huawei router. After few months of usage will update the review accordingly. 1 year home pick up warranty is the usp for this device.,We do not have a inverter installed because our apartment building has DG backup. But it took a few seconds for the DG to turn on due to which my router turned off. So this device works perfectly well to cover the few seconds of no electricity. It may last for hours as they advertise. I had to buy a power splitter cable because I run the media and router both with this backup device and they both work perfectly fine during powercuts.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31VtFl2O33L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Cuzor-Router-Switching-Moisture-Resistant/dp/B07ZKD8T1Q/ref=sr_1_246?qid=1672903007&s=computers&sr=1-246"}
{"product_id": "B07G3YNLJB", "product_name": "Crucial BX500 240GB 3D NAND SATA 6.35 cm (2.5-inch) SSD (CT240BX500SSD1)", "category": "Computers&Accessories|Components|InternalSolidStateDrives", "discounted_price": "₹1,815", "actual_price": "₹3,100", "discount_percentage": "41%", "rating": "4.5", "rating_count": "92,925", "about_product": "240GB 2.5-inch internal SSD, SATA 6.0Gb/s, with blistering speeds of 540 MB/s Read, 500 MB/s Write.|Enjoy the efficiency of Next-Gen Micron 3D NAND: Crucial BX500 uses only a minimal amount of power and still delivers a high price-to-performance.|Upgrade to a drive you can count on: The Crucial BX500 has been thoroughly Tested, and Proven that, it secures your most important files on a drive with established dependability and the advanced features BX-series SSD's which is are known for.|Avoid unintended data loss when the power unexpectedly goes out. This built-in feature of our new NAND protects your data swiftly and efficiently, so if your system suddenly shuts down, you keep all your saved work.|Improves battery life because it’s 45x more energy efficient than a typical hard drive and it can operate in an input voltage of 4.5V.", "user_id": "AGHW3JDEF6JIRC4HB43UDMKOFXZQ,AF4N3Q6OEXVBSAHPK5NVJRGEZT5Q,AGM7YFUBLKUQPYVYZQDDPI3RXSZA,AHECHFXUUNHLH3RQ6ESN5GCUHGPQ,AGGTMAPT4WBWP2C62I6CGW22QNCA,AH42ECAG6LPCU22T5BYN5OXQO74A,AEYY76T7GEFE75ZEMXWPKW5H3LEQ,AF6SAPRZH3XU4YBLVMC6THTXAPCA", "user_name": "Shaikh Faisal,SISODIYA NANUBHAI,Aaryan Jagtap,Mr. Saddi,Arul,SOURAV DAS,Tejas,Bithika Paul", "review_id": "R34WAR6NQSVZBI,RGG00MCOD3B6A,R2RO4Z1CBF2G1I,R1BPV52HUSVZF8,R3IZK8U5HI1XOS,RE0OUI8Y9LSQY,R3IDL21XUYVUUK,R2YEAFFD5E02TL", "review_title": "Absolutely worth the price,Best product on low value, definitely gofor this,Works the way it says,Economical. Very light. Quite sleak. No good robust packing.,Good one!,The Best,As expected quality from a company like crucial. 4.5 Star Rating,Best in class ssd", "review_content": "After I changed from my slow 500gb HDD to this SSD feels like I was living in a stone age. My PC started to run as smoothly as I could have ever imagined. Although I am not a gamer but can differentiate the performance of my experience. One who wants to try out the SSD should have this one as the perfect choice,Confusing which one buying but after buying this one is best and speed up my pc. Packaging like no value for money box is band from corner,I found the start-up of the SSD slower , like if u turn on a pc the first thing that kicks in motherboard then GPU/ cup and right after that the SSD in this case i found the SSD took about 2 seconds and a delayed response to startup ,but when ever it didn't start it was quick , don't know probably an issue with my psu or something,Hands down, Go for it.Quite nice, sleek design.Build material is plastic.But one thing I found odd is that the HDD cover that when I put on it and when applied screws then the screws was very hard to put. Last holes were a little misaligned. But after a little bit of force it fits.,Bought this product in Nov 2022. Easy to install and the performance is good.,I installed into my 12yr old desktop, now my i3-540 is showing it's level best. Compared to my old HDD, it's superb to use.Go for it without any second thought.One suggestion, if just buying to boost performance and for desktop, go for 240GB version to keep the OS and keep the existing HDD as well attached as extended internal drive.,Used to upgrade the speed and performance of my old laptop. Works as expected,At first i would like to suggest to look for the rating of the seller selling electronic products, before ordering this i ordered a similiar product crucial ssd500gb but instead i got a toshiba hdd of 500 gb that too loaded with photo and word document of some guy. I contacted amazon and they refunded me right away. Then i placed this order after searching for rating of this seller, which i found legit.. The SSD is good, i installed it in my asus laptop, the laptop is running with 10gigs of ram, i3 gen8 processor, and this ssd, after installing it boot up within 20-30seconds, whereas my previous hdd takes nearly about 3-5minutes.", "img_link": "https://m.media-amazon.com/images/I/31foPNxmwsL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Crucial-BX500-240GB-2-5-inch-CT240BX500SSD1/dp/B07G3YNLJB/ref=sr_1_247?qid=1672903007&s=computers&sr=1-247"}
{"product_id": "B00P93X2H6", "product_name": "Classmate Pulse Spiral Notebook - 240 mm x 180 mm, Soft Cover, 200 Pages, Unruled", "category": "OfficeProducts|OfficePaperProducts|Paper|Stationery|Notebooks,WritingPads&Diaries|CompositionNotebooks", "discounted_price": "₹67", "actual_price": "₹75", "discount_percentage": "11%", "rating": "4.1", "rating_count": "1,269", "about_product": "The cover design of the notebook is subject to change, it depends on stock availability 1 Subject Notebook - Unruled, 200 Pages, Spiral Binding, Soft Cover, 240mm x 180mm Notebooks for every subject for hassle-free note-taking during classes or lectures Classmate uses elemental chlorine free paper This notebook consists of high quality papers Country of Origin: India", "user_id": "AH6NK74TCKWVMLPVFEC44ZLT546Q,AEUNLUIL7UEDSBOHDA52EP3CT43Q,AGKEIYGWTR5DFWUXTQK2GJCADGAA,AHYDGBIJQH2XC4SMUNVX2HGKOELQ,AGERLRPT3Z7WUSIERUPQ3NNUYGBQ,AGBVV6FOZ3OTCYR6XQ7UZL5OOF5A,AEBHFCOMRX6G22X3JLSCKHLXPTOA,AFZZKKAWBJWFT7ZNDHWFPI2LJTLA", "user_name": "Nafisa Nehar,Narinder K.,Mayank,Harsh Raj,Dr.G.K.H.KRISH,Soumava Chakraborty,Sahid,RAJU ACHARJEE", "review_id": "R3QLOAFS794JE2,R3N8H6JX73IGQM,RR2G573NOMISE,R1710I0LBXO0RZ,RSAY82S1YEY1A,R3T3F038IAP2Z5,R2E19RVGQBXFIY,R20HG64QT9A05Z", "review_title": "it's nice. simple and easy.,It's good but I ordered avengers printing I got other one,Not A4 size,Nice product but not value for money,Money not wasted.,Good For Day-To-Day use,medium size notebook,Good for note", "review_content": "I liked because it was aesthetically pleasing.I thought it was thicker. But overall it ok. Go for it.,You can buy but don't go for printing,It is a short copyYou can use it as a diary😀,Like its sharpness and style,Liked it,Product is good ...but I thought it is a A4 pad. But o k..Small but Good.,,Notebook is good", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51o0rLZiIjL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Classmate-Pulse-Spiral-Notebook-Unruled/dp/B00P93X2H6/ref=sr_1_248?qid=1672903007&s=computers&sr=1-248"}
{"product_id": "B0798PJPCL", "product_name": "Portronics My buddy plus Adjustable Laptop cooling Table (Brown)", "category": "Computers&Accessories|Accessories&Peripherals|LaptopAccessories|Lapdesks", "discounted_price": "₹1,889", "actual_price": "₹2,699", "discount_percentage": "30%", "rating": "4.3", "rating_count": "17,394", "about_product": "Elegant Portable: Very attractive design and finish. Legs can be folded completely to make it highly portable. Voltage: 5W. Connector:USB 2.0. Materials : MDF Board|Strong and adjustable: Vertical Extension of Legs and Angular Adjustments (0-30 degrees) of Top, it has Soft Notches given on one side of flat-top to prevent things from rolling down when tilted, Laptop Stand with In-built Fan|Compatible: Size and strength ensures that all Laptop Models can be mounted on it, separate place to keep mouse with mouse-pad|Laptop protection: Cooling and Noiseless Fan speed of 1800 RPM protects your laptop from Heating up while using|Cleanliness and anti dust: Smooth Top can be wiped with moist Clean Cloth without damaging the top|This cooling pad laptop table can be used with almost all models of laptops available today up to the size of 17 inches.|Manufacturer Detail: Imported by Portronics Digital Pvt. Ltd. B-76, Wazirpur Industrial Area, New Delhi - 110052", "user_id": "AH4RET52ZMGRWFVZDYIC3ANTDNZA,AFZF624S3KR3ETF5MQRA2CTEEOOA,AFVQA4IJSHO64L2W67VXGZLWDGKA,AG2H434HPEN5BMI4TKNQGUCQE77A,AHPMZZOSE5TCIKKBOGRDOKZVJLMA,AEJBFSMMLP6KY56NRUUCZB6WVIEA,AGTJ7HNPS6WJFXFLM7ZFLLVPUUZQ,AH556SFTL3M6YI6NWOTRTGHA4WRA", "user_name": "Nayeem ur rehman,Selvam_saravanan_reebok,Kriss G.,Amazon Customer,Subbu,Pranav,Victoria,Shashank Khandelwal", "review_id": "R3MDF3ZNTMFS3M,R14ZE6MPCOTRV6,R3E4CVN1BSCB0O,R2Z8KROCR44X60,R386VV5RV4L5UI,R2VCH24UHL9UA3,RP810P9RDWC3G,R2EIJACLUEEYUJ", "review_title": "Nice Product,Good one,Nice to have!,5 star (i gave 4 btw) just 1 con and its huge for me,Good table to work from bed,Laptop Table.,Best stand available,Like it", "review_content": "i bought it around 2000 rs and i have been using for around a month. i feel this is good product and nice for office work from home. the space is good for laptop 13 inc and remaining space can be used for phone and other small utilities. Fan i haven't tried because i have macbook.,Great useful one for WFM persons .especially my wife like it thank u,Great produce. Easy to use. Comfortable.,u cant use mouse on this table if ur laptop is 15.6... initially it was fine but after 15days of usage .. when i connect my mouse for gaming or editing its not comfortable..... like mouse on bed and laptop 1 ft above,It helped me a lot for my 2 months working from bed. They can improve on sturdiness a bit, but overall good quality product and better price than all other products. Fits good for 15 inch laptop without mouse. I used mouse on bed as it wont fit on the same table after keeping my 15 inch laptop. Gr8 angle adjustment. I recommend it for friends and family,I like this product, but if it has 2 fans it would so nice because 1 fan is not enough for heavy work or more hours of work. And also fans place if it’s some what moved to the right side instead of mostly to the left side, then the laptop gets the air correctly so laptop don’t get much heat.,I am writing this review after using this table for 8 months ,it is very convenient ,the table doesn't shake even if we use it on bed ,corners of the table are smooth and th material is really of good quality,And the fan is really handy ,Even i use the use this table as a cooling pad by folding and the legs and just put it on the table ,but only when we are watching videos and not typing ,ot else it will be shakey ,Over all I am happy ,that my money didn't not got waste because i search for a table there are other brand for even less price like 500/-,but I choose this thinking that it is a once time investment and i need to buy and item which is durable and i bought this ,and i am happy with my decision,I like it , only thing is little bit smaller than others and i don't find any use of fan.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41lS2bd15fL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Portronics-POR-895-Adjustable-Laptop-Table/dp/B0798PJPCL/ref=sr_1_249?qid=1672903007&s=computers&sr=1-249"}
{"product_id": "B09GFWJDY1", "product_name": "ZEBRONICS Zeb-Evolve Wireless in Ear Neckband Earphone with Supporting Bluetooth v5.0, Voice Assistant, Rapid Charge, Call Function & Magnetic Earpiece, with mic (Metallic Blue)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹499", "actual_price": "₹1,499", "discount_percentage": "67%", "rating": "3.6", "rating_count": "9,169", "about_product": "Metallic Wireless Neckband Earphone for Make Calls & Music Playback|Seamless Connectivity with Bluetooth Version 5.0|Voice Assistant Support: Ok Google & Hey Siri|Rapid Charging Technology with Type C Port|Can be Connected via 2 Devices Simultaneously with Dual Pairing Feature|Calling Function with Built-in Mic|Flexible Neckband with Magnetic Earpiece", "user_id": "AFVD56LA6WDD3SSROFLFQVHLSHJA,AFKGFQ6SM5VJVVFZM7RNLTQ4QFMQ,AFZ2XU2PKUJGH3N6MCYNRFGVUU5A,AHY6XDQNLICAHSOUPBE47XD3UDTA,AE7PU2TS7JOYITZOCZV5YQ2D4LVA,AFDQY2YWCKPDNXKZDTLPJAQ4JO7A,AHOSX5HUOCDZZKOMGTHESXDP4BQQ,AGUBBQWRKM3QWTTVHVOYM4IYMDFQ", "user_name": "Vibhor sharma,Eshaan tripathi,Arun R,Vikrant Khatri,Mahir,JASVINDAR SINGH,Mahaboobsaheb s.,aasim khan", "review_id": "R1ZVVISXKO1JOK,R1ZPSHX28L5WL0,R1CDARD5LUVUAJ,R1HCEZCBOONRT6,R3LW1RYTWDVNZK,R14K7AW0ZFZRGD,RZ3JLZP8FSO3I,R12VALC47YCIOT", "review_title": "Best at this price range.,Value for money,Value for money,Little bit compromise with make & connectivity, rest all perfect 👌,Nice,Nice,Good,Good product", "review_content": "This is an amazing Bluetooth earphone for its price 500 it's good sound,good battery but only problem is there it's band as its flexible it dosent stay at place when in neck they go over another. Otherwise it's an amazing earphone. If your budget is low then buy this it's good.,Bought this product 2 months ago and it is working perfectly fine . Only sometimes it connects to more than one device . Else all things are good,Purchased this product for it was available for immediate delivery. The product appears cheap, but holds well. Sound quality is alright for basic requirements,,Nice Bluetooth 👍👍,NICE PRODUCT IN 450 RS,, BATTERY BACKUP IS AWESOME,,FAST CHARGING,,,SOUND IS ALSO VERY GOOD,,ONLY BASS NOT AVAILABLE AND TYPE C PORT IS NOT AVAILABLE IN THIS NECK BANDOVERALL GOOD PRODUCT,Sound and connectivity is very good but after 5 month it's not charging. No use for long life. Not a good product,Worth", "img_link": "https://m.media-amazon.com/images/I/31gZM-XkOtL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/ZEBRONICS-Zeb-Evolve-Supporting-Metallic-Blue/dp/B09GFWJDY1/ref=sr_1_250?qid=1672903007&s=computers&sr=1-250"}
{"product_id": "B09MZ6WZ6V", "product_name": "INOVERA World Map Extended Anti Slip Rubber Gaming Stitched Mouse Pad Desk Mat for Computer Laptop (Black, 900L x 400B x 2H mm)", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Keyboard&MiceAccessories|MousePads", "discounted_price": "₹499", "actual_price": "₹999", "discount_percentage": "50%", "rating": "4.4", "rating_count": "1,030", "about_product": "Large size design makes it provide plenty of room to place your mouse, keyboard and other desk items while you are playing games or working as well as protecting your desk.|The silky smooth surface help to move with high speed and pinpoint accurately. Anti-slip rubber backing offer heavy grip to prevent the mouse pad from sliding around the desk.|The mouse pad is made of natural rubber material and the durable stitched edges, which can ensure long-term use without wear, deformation and degumming. It will provide you with a comfortable experience.|Its thick comfy and foldable design, you can carry this mouse pad with you everywhere you go. Its anti fraying stitching, prevent damage from spills or rough use.|Size: 900L x 400B x 2H mm :::: Color: Black :::: Material: Rubber, Neoprene|Package Include: 1 x Gaming Mouse Pad", "user_id": "AGRGIE4WRRX3CUQLN2RJDIJE3HSQ,AE7QGXIB227O4GIHLSTP2Z6VENCA,AEULY7BU52WW7X5U6TUNDBO2BU3Q,AFFHWVYKVSRM37YO4YB3Z6IMFLYA,AER5JFSJPXWDBT3VSBEHV6VVVIHQ,AF4TKZNEXBR44GBBFYI6D2I4KKFQ,AFO3ZXLJKCVDKFHGSXAFA6AYDE5A,AERWXGUBL74M7E5ZZ255BQBB6S6A", "user_name": "f1rstmehul,Kalyani Ramasubbu,sourin roy,Sujit,Milan Bhanderi,Shivam Agarwal,Manav,Karthik", "review_id": "R116YMD72TSY5Z,R258CFU2YKTK58,R24DFHVPXSIU8W,R24XEY7CTDRFXZ,RRVW4AYAAM5V4,R1HRIY8O1PGOO5,R2CGJ2P2BBLM08,RK1J2BJVDS8SY", "review_title": "nice design.,Worth the buy,Pretty good,Nice product.,Jordaar,The product is an averagely good product,Good enough,Awesome", "review_content": "nice design and print. But hard to differentiate between the ocean and nonocean areas, the color shading of countries could've been better otherwise all is good.,Had Purchased this recently for a secret santa gifting , Worth the price and also the other person liked the product too much,Expensive but nice product,I was looking for a desk mat which is anti skid and this product match the expectations. I tried few other mats which was mentioned anti skid and also price was almost double of this mat price but it was not at all anti skid. This is good in this price.,In terms of looks and use, bows are useful and bows are beautiful,The product has matched my expectations by 7/10. the same could have been improved in terms of finishing and quality of the product,Good enough in this price,Very pretty and good quality Mat. Can easily recommend this to all.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41ep+i03RsL._SX300_SY300_.jpg", "product_link": "https://www.amazon.in/INOVERA-Extended-Rubber-Stitched-Computer/dp/B09MZ6WZ6V/ref=sr_1_251?qid=1672903007&s=computers&sr=1-251"}
{"product_id": "B094QZLJQ6", "product_name": "Seagate One Touch 2TB External HDD with Password Protection – Black, for Windows and Mac, with 3 yr Data Recovery Services, and 4 Months Adobe CC Photography (STKY2000400)", "category": "Computers&Accessories|ExternalDevices&DataStorage|ExternalHardDisks", "discounted_price": "₹5,799", "actual_price": "₹7,999", "discount_percentage": "28%", "rating": "4.5", "rating_count": "50,273", "about_product": "Digital Storage Capacity - 2TB; Safely and easily manage 2 TB of photos, videos, movies, and more with hardware encrypted password-protection|Form Factor - 2.5 Inches, Hardware Interface - USB 3.0, Drive RPM - 5400|Password protected - Yes; Get an extra layer of protection for your data with the included 3 year Rescue Data Recovery Services|The perfect external hard drive for Windows or Mac, simply back up files with a single click or schedule automatic daily, weekly or monthly backups. Reformatting may be required for use with Time Machine.|The perfect compliment to personal aesthetic, this portable external hard drive features a minimalist brushed metal enclosure|Edit, manage, and share photos with a four-month membership to Adobe Creative Cloud Photography plan and one-year complimentary subscription to Mylio Create.", "user_id": "AG7XDPNSDQFE7CPVN7ODSPVOAD4Q,AF54QC7SIVQCZ4D2KIEIC4GESBFQ,AFNCBTSEMD3A4C34GITDLZIGOSZQ,AESAFKWCY522JNXNL3GMD7K6W6KA,AEJQ7NWZITDPI44AMIPQPK7DQLCQ,AEUJXKO6WMZSLPCK7OD2FF3LV5BQ,AEH5I544J65UH4UBNRET43YVAXOQ,AHVWI4H6HLGS3KQDKNQWF2HFGEUA", "user_name": "Amazon Customer,Jayesh B.,Sunil,Kaling246,biswaboka,prabhakar,Shekhar saini,Mohsin chouhan", "review_id": "R2X0Z7BS12ZYFD,R1CZP476IRR94Y,RF43347JSIPWZ,R24SRHM43OZ36M,R3UV9O11G5O7EC,R1B2U1Q7GBEMF3,R1A1W7XEE0YP4V,R15MT5JTR5BOXS", "review_title": "sometimes writes are little slow, otherwise fine,great product,Worth 100%,The only thing I was being deprived of was it's color.Instead of blue,I got a grey one.,Good product,Good product,Not with password and mailio softwares  this product not work properly,In the what u expect go for it ....", "review_content": "sometimes writes are little slow, otherwise fine. light weight and very easy to carry. Good product.,great product,one of the finest External hard drives at this price and features and protected...,https://m.media-amazon.com/images/I/71jy6bO7YqL._SY88.jpg,Good product but Price should be little less,Light weight,All condition are well but sofftware are not in built . Uncompleted this product,Best i get.. in the segment... Next is depend on performance", "img_link": "https://m.media-amazon.com/images/I/41BWhztt6EL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Seagate-Touch-External-Password-Protection/dp/B094QZLJQ6/ref=sr_1_252?qid=1672903007&s=computers&sr=1-252"}
{"product_id": "B07L3NDN24", "product_name": "ZEBRONICS Zeb-Fame 5watts 2.0 Multi Media Speakers with AUX, USB and Volume Control (Black)", "category": "Electronics|HomeAudio|Speakers|MultimediaSpeakerSystems", "discounted_price": "₹499", "actual_price": "₹799", "discount_percentage": "38%", "rating": "3.9", "rating_count": "6,742", "about_product": "Zeb-fame is a USB powered 2.0 speaker that supports an AUX input|The 2.0 speaker also comes with volume control and produces scintillating sound experience even while being compact|Drivers 5.2cm (2.04-inch) x 2|Impedance 4 ohms|Output Power (RMS) 2.5Watts plus 2.5Watts|Country of Origin: China", "user_id": "AEGWP42GIGIOVDTY5DG2A6E4AY5Q,AFAQCBEHAIWL5F5W5PTWK2V7U4TA,AG5M7MJQX6OLPQ2CFRNGKTC26IZA,AEFRDOHS5FREPDSZU6FPMMH5QXPA,AGUCBTQJ5SB74KLB7QHID3VMEQHQ,AH5FRUHWJN6LLDA3WQUHV7DSE3FQ,AG2DJXFBQPAWRGKC2LLG4IUWWJNQ,AG2VPNDAAPKBRHLK4L7CWYBZPNAA", "user_name": "Asraful,Sagar prajapati,Mahesh Kumar Tiwari,Amazon Customer,Manav bhanderi,Tarun,Yallaling Maruthi,Rahnuma", "review_id": "RQ03WWKIJ86VR,R3S0S1OUOOTNC2,R2EEZPKARXPCYZ,R1INKZP3Y4L085,R2CLAZMKKPEP0Y,R3TCUV39Q5GMP7,RZO17F76OW8H9,R201RFHN6XKRPR", "review_title": "Thik thak he,wired,Sound boss,cheap and best temporary speakers,So loud,Bass,BEST QUALITY SPEAKER,Very nice", "review_content": "Nice product,short wired atleast give 2 meter wire,Sound quality  is good,Was looking for a laptop speaker for remote work for few months, something sounds louder than my laptop. I bought this with very very low expectations. BUT!!, Sound quality is not that bad. okay for casual music and podcasts listening. sound is fine and clear in 60%volume range. Vocals are clear. bass is neither present or absent. Enough for desktop listening while working. Max volume is useless. Still great buy for the price. No complaints.,Good product,Bass is not high,Love it,", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51X7oG9862L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zebronics-Zeb-Fame-Multi-Speakers-Control/dp/B07L3NDN24/ref=sr_1_253?qid=1672903007&s=computers&sr=1-253"}
{"product_id": "B08WD18LJZ", "product_name": "TVARA LCD Writing Tablet 8.5 Inch E-Note Pad LCD Writing Tablet, Kids Drawing Pad 8.5 Inch Doodle Board, Toddler Boy and Girl Learning Gift for 3 4 5 6 Years Old, Black", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|GraphicTablets", "discounted_price": "₹249", "actual_price": "₹600", "discount_percentage": "59%", "rating": "4.0", "rating_count": "1,208", "about_product": "Perfect for kids, students and businessman. Great help for homework, homeschool, note taking, shopping lists and etc|No radiation and glare, good protections for eyes. Easy to use and easy to erase, this drawing tablet is a great gift|This works on basis of reflected light. The more brighter the ambient light the better it will look. It will now show up in dark rooms. The harder you press the darker the line. Use only included pen. Do not use any sharp objects to write.|No paper and never need to charge. This doodle board saves trees, reusable and durable, it is a paperless smart device|Suitable for all ages: This writing board is completely used by children for writing, arithmetic, spelling and learning assistants, and it is also the best writing board for adults to take notes and memorize information in the office. In addition, it is the best family message board for sending messages to family and lovers. Most importantly, it is the best learning for children at home. It is an ideal gift for children aged 3-13, perfect for birthdays, Diwali, Christams and any occasion.", "user_id": "AFNCX33YXD6T4LAWBFYXN6RR7LZQ,AGOJ5KXS5VV6NQS3XHAGRDZ7S2BA,AFWEWWOEAAHDSL4SLZGRNGT57HDA,AFNGBQYXHSKNKA4E6M7RBIESDL2Q,AG52N6UOIS5XRAI7K6RRCGIIGGYA,AFNUG7NKSURNWMYX4JL5T7CL53XQ,AEDDSZIS6P2DL7Z4MHVXUKLW73QQ,AFFTXR2YGTS2NVJHQAAWSV7UNBPA", "user_name": "Uthiranathan,Scuba_3d,Amazon Customer,archana,Nithin,Annie Thomas,ziya malik,Surendra verma", "review_id": "R3SIBLYM5T5AFY,R1YQKXTIBLGEMJ,R2XT2VFFBQ2UR1,R2ONCZT1YUWAWU,R3OTWNGHV08YRV,R3B9Q9MFSBVIRZ,R1LDGC41ZEL8NC,R3KE4RPQT1E3NR", "review_title": "Product is good,Lots of fun for the price,Good to use,Handy,Concept is good,Lightweight,Good for children,a best device for your child to make them intrested to study and practice.", "review_content": "Product is good. But the brightness is not that much enough.,Very good and engaging tablet for small kids. Totally worth the money,Lightness , average bright,Very economical nd handy for kids,The concept is good but product quality is not the best,Good for gifting. Value  for money.,Nice product,this is so affordable, or i would say it is so cheap. with this cheap priced device your child will become more intrested through the study.pros & conspros1:- best and unique2:- great device to gift to your children3:-affordable for any kind of person4:-long battery life and easy to change the battery5:-comes with a lock6:-nice writing experiencecons:-1:- not Bright2:-if you want to erase tiny thing or a word you have yo erase all3:-get scratch or lines on the screen after writing.overall this is a valie for money product. you can gift.", "img_link": "https://m.media-amazon.com/images/I/518mUXLlFZS._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/TVARA-Writing-Tablet-Inch-Note/dp/B08WD18LJZ/ref=sr_1_254?qid=1672903007&s=computers&sr=1-254"}
{"product_id": "B09CMM3VGK", "product_name": "Ambrane 60W / 3A Type C Fast Charging Unbreakable 1.5m L Shaped Braided Cable, PD Technology, 480Mbps Data Transfer for Smartphones, Tablet, Laptops & other type c devices (ABLC10, Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹179", "actual_price": "₹499", "discount_percentage": "64%", "rating": "4.0", "rating_count": "1,933", "about_product": "Stay ahead and never miss out with a 3A and 30W fast charging for your devices.|It supports Quick Charge 2.0/ 3.0 technology to keep your devices boosted up.|Its L-shape provides durability and comfort while you charge your favourite gadgets.|It comes with upto 60W flash charge support to make you always stay ahead.|Crafted for convenience, it allows you to charge and sync data with just one cable.", "user_id": "AGHYCMV7RJ5D76UEZDZJPPEUGU5Q,AGKG3U55NSBTQ4QBDCGLUGSEEICA,AEK7TJPOW2SWCHCQOA7OEGXDZPCA,AH4QNGP7K2SO6FBWTS4Y274VHV6A,AH6CX2UTCOW6LXS74QK3TCQOHRIQ,AG4T75DAKCNZ6EPYPMKBGV6J54JQ,AF4GBAADHEMI3ZLPBAIZWYWN7GJA,AGOMXFNBIQBEWLN4JDC65FDPTBDQ", "user_name": "Rishabh,Amazon Customer,Darpan chauhan,Kumar Ketan,Amazon Customer,jayaprathap,Nirmal,Mihul pandey", "review_id": "R223OIZPTZ994S,RATMJ847EPDQX,RHWJXUIB7QJY4,RKKX7CGMNCZLA,RL8AFQ3JO8B1N,R152XS08W2OG38,R2RS0DMJ29X2W6,RLLQ8T7VXWR65", "review_title": "Good product,Good for charging, bad for data transfer,Wait  to get mexmum discount.,The cable quality is best and charging pin is at right position to stand 👍🏻,So far super,Good,Good but issues with design,Maine ₹99 me liya hai offer me or ye worth hai.", "review_content": "The cable build quality is good for normal charging its great cable but doesn’t support quick charging,Works for charging but other applications are hit or miss.Example my external keyboard doesn't work with it!,Best quality and length of wire was qute good and durability also good .,The cable is awesome and no charging issue till now.... Because it is a braided cable... Chance of it damage are very less... Overall... I like the product 🤞🏻,Using this cable from past 40 days to charge lg g7thinq and samsung s21fe.  So far super,Good,Seems durable but there is a problem with the design that the pin is not long enough / base of the pin is too thick that i couldn't insert it into my phone's charging port without removing the case!,Over all quality bht achhi hai bs jo braided material use hua hai wo nylon nhi hai cotton type ka hai lekin ₹99 me 1.5m cable k hisaab se bht achhi hai majboot hai or charging bhi thik hai. Maine chapti wali buy ki thi jo photo me dikh rhi hai lekin delever ye gol wali hui jo ki jada better look deti hai. Agar ₹150 me mile to mt lena utne layak nhi hai.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41cCZ5EPnvL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Ambrane-Charging-Unbreakable-Braided-Connector/dp/B09CMM3VGK/ref=sr_1_255?qid=1672903007&s=computers&sr=1-255"}
{"product_id": "B06XDKWLJH", "product_name": "Western Digital WD 1.5TB Elements Portable Hard Disk Drive, USB 3.0, Compatible with PC, PS4 and Xbox, External HDD (WDBU6Y0015BBK-WESN)", "category": "Computers&Accessories|ExternalDevices&DataStorage|ExternalHardDisks", "discounted_price": "₹4,449", "actual_price": "₹5,734", "discount_percentage": "22%", "rating": "4.4", "rating_count": "25,006", "about_product": "USB 3.0 and USB 2.0 compatibility. Formatted NTFS for Windows10, Windows 8.1. Reformatting may be required for other operating systems. Compatibility may vary depending on user’s hardware configuration and operating system.|Fast transfer rates|Improve PC performance|High capacity in a small enclosure|WD quality inside and out|Manufacturer Detail: 47300 3, Jalan SS8/6 Sungei Way Free Industrial Zone, 47300 Petaling Jaya, Selangor, Malaysiamporter Details: 1. Rashi Peripherals 2. Ingram Micro 3. Redington India Ltd|Country of Origin: Thailand", "user_id": "AHQM673VAJUI7R3VMP4NWML4CZLQ,AG7HW2RWBBMIKW45MHWWO3MJPAMQ,AHAMXU574LIAJQEZIHZFB2VF6XEA,AEVK6SQSDGDCBJF4OM2Z24SXE36Q,AEOOR2OZ72WSRAVRX42ADEZNXQSQ,AG7NKDJ76WUK3JVPQ72NHUHHKWFQ,AFLID5BXTJU4P2YML63YQCJDCP2Q,AFI6OXAAZYUPZN5I4RP7TC66JK6A", "user_name": "Mastercard,Krupal Gajjar,Sanket,lional,Atteng Eric,Deepu prasad,swetha,Abinash J.", "review_id": "R3JLT7LH2SOF0V,R2KT1SVXND1VWG,R24OK0MVA1SNAD,R28CT5JQ1R02CZ,RYKHQ54JHJYQB,RF0NNFS6PEPAV,R2I21A2MTQV7JX,RZ5JP629DU70F", "review_title": "Good for my work,Worth it,Hard disc is not detecting,Good hdd with a 1.5 tb storage.....really cool and fast,Faster data transfer,Nice,Reasonable price,Sleek design", "review_content": "I have purchased for my camera assceres like battery small lens and cables.  I totally satisfied for the purchase,WD Harddisk is faster as compare to others. It is light weight. Design is good. Performance is very nice,I want new hard disc,Really good portable hdd with 1.5 tb storage and speed of 112 approx mb/sec,Data transfer speed is very faster than expected. It runs very smoothly and size is very small. So its easy to cary and moving.,Nice,,Got a little scratched product ( * Not noticeable in normal view and just 1 scratch so not complaining. Got this for 3100-3200₹. Storage capacity showing 1.37tb means rest of it maybe for system backup. Took 47sec to transfer 4.16GB data from laptop to drive through 3.0 usb. Happy with the product at first look. Let's see kaise chalta h.. you can go for this under 3600₹ bcz no one is giving you 1.5tb at this range and remember 1.5TB means you will get less than 1.4 and 1TB means less than 960gb, That's how it is 🙂.", "img_link": "https://m.media-amazon.com/images/I/31YZ2ZYT66L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Elements-Portable-External-Drive-Black/dp/B06XDKWLJH/ref=sr_1_256?qid=1672903007&s=computers&sr=1-256"}
{"product_id": "B01J1CFO5I", "product_name": "Redgear MP35 Speed-Type Gaming Mousepad (Black/Red)", "category": "Computers&Accessories|Accessories&Peripherals|PCGamingPeripherals|Gamepads", "discounted_price": "₹299", "actual_price": "₹550", "discount_percentage": "46%", "rating": "4.6", "rating_count": "33,434", "about_product": "Speed-type surface mousepad is designed with the use of great technology and craftsmanship especially for professional gamers. Non-slip rubber base|Mouse Mat Size: 350mm x 250mm x 4mm|Fit for all gaming mouse, regardless of sensitivity settings|Quick response for consistent in game control|Incredibly smooth and fast|Mouse moves quickly across the entire surface with zero hindrance|Suits gamers who need to hit targets faster and more efficiently", "user_id": "AG6LARJ3IHDAIRVVN6WW4Q6JTPJA,AGRR4GPFNWDS7BAR4XXDSLRWHS7Q,AENVIGC6PVWFL7WNAH2VXOSK5AQQ,AHIWMQ35DZ32I2NXFG3FZGQ5WUVA,AGJGE65PDHD3YRNJZX7AJC2OYYFQ,AFWQUAD7B6KQ6EMMOUGFBPXWFAYQ,AG6NHOI4HQRYJYKR7M2DERXZNMIA,AFW5XNPYWYUD54B4GHGBC7JTMYHQ", "user_name": "Jayaprakash,Keshav Rana,Mohit prime,Aman singh,Yogesh K.,Ngiantseng Thowmung,Akshaya Rao,Dinesh jumani", "review_id": "R3358EO9V9WHQ0,R18X1NBWPX45CL,R34LKJ4RXUSRS3,RXXQRRV1RLLF8,R2EEDDUJ9LA2DH,R3BA5G740XADYD,R2LB699Y251V7J,R2O7189IATRJH2", "review_title": "Good product,Good quality,Good,Great mouse pad,Good worth the money.,Works flawlessly for many years,Nice mouse pad,Quality", "review_content": "Quality of product is above average.,Good quality product,  little bigger than expected,  please check the size before buying.,Value for money but need to see it's durability, just got the item,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71YNj3dABEL._SY88.jpg,Its HUGE well at list i didn't think it be this big worth buying it, its durable and looks great.,Writing this review after 3 years of using almost every day, no tears or undoing of the stitching. Works as intended.,I bought this mouse pad 2 or 3 years before and it's really good. Had no issue while playing games. You can consider this movie pad if you want 👍🏻,Best quality... And size is also according to my need.. best product at this price", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41NYfAbBY2L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Redgear-MP35-Speed-Type-Gaming-Mousepad/dp/B01J1CFO5I/ref=sr_1_257?qid=1672903007&s=computers&sr=1-257"}
{"product_id": "B07J2NGB69", "product_name": "Lenovo 400 Wireless Mouse, 1200DPI Optical Sensor, 2.4GHz Wireless Nano USB, 3-Button (Left,Right,Scroll) Upto 8M Left/Right & 100K Scroll clicks & 1yr Battery, Ambidextrous, Ergonomic GY50R91293", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹629", "actual_price": "₹1,390", "discount_percentage": "55%", "rating": "4.4", "rating_count": "6,301", "about_product": "Take out the mouse, insert the USB, and click away. Your connection stays strong with the 2.4 GHz USB receiver. And when you’re done, dock the receiver in the mouse itself|Long hours are no match for this well-designed mouse. The Lenovo 400 Wireless Mouse is ergonomically sculpted to keep you comfortable even on days you’re burning the midnight oil|The Lenovo 400 Wireless Mouse meets our rigorous test standards and is a sure bet, with a battery life of up to 12 months and left/right buttons that last up to 8 million clicks|Supports Operating Systems above Windows 7|Take out the mouse, insert the USB, and click away. Your connection stays strong with the 2.4 GHz USB receiver. And when you’re done, dock the receiver in the mouse itself|Note : In case of Wireless mouse, the USB receiver will be provided inside or along with the mouse|Long hours are no match for this well-designed mouse. The Lenovo 400 Wireless Mouse is ergonomically sculpted to keep you comfortable even on days you’re burning the midnight oil", "user_id": "AG3P4IMSW644U3FQ2765XNZFNC3Q,AGDKW4WQN3ZJJ4CVYLNXLCK5CNIA,AHU5TPA2UXOKQ4DDHN5RNZVBZLYA,AFHAATSERIT56U7QXWGJIL4MO3KQ,AFX5VVJ6G4NBFDWPMRQBFLYWEW6A,AFUUXVY2MHW6RYIDUUOPR2HDA5OA,AGZRENIZWCVXGLGXBQR4KWQZK6AA,AEBZFCW7Z2OSX3FS2DVMINPUZ6KQ", "user_name": "abhilash n.,Tk,Mayur,Ajay,himanshu kumar,Harikumar,Raja,Syammie", "review_id": "R3WA8CHZXMRJR,R22MH6ZS821G9A,R1FIRMYTZRF479,R112HB5700T6SG,RJFBAWAVEG383,RUM1Z3OU0DSOB,R23D5V15U3KQAT,R270Z7KVYYU4Y7", "review_title": "Not to the mark.,Ok.,Good Product,Good but lack some features,Best quility,Nice,Good for money,Just as expected.", "review_content": "Had zero expectations when bought it. Neither disappointed nor am I happy.The most important flaw there are times I forget to switch it off. it stays switched on throughout. If you have a big palm then it is going to give you aches after a few hours of use.Rest is all good.,Product is fine at this cost,It's smooth,Its a good wireless mouse but sometimes lags when I do heavy tasks like video editing.It doesn't have sleep feature LED glows all the time.Don't have low battery indicator light.,Best mouse,Nice,Good,Working as it should be. No issues with reception and latency.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31C+JNS-7PL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Lenovo-GY50R91293-Wireless-Mouse-Black/dp/B07J2NGB69/ref=sr_1_258?qid=1672903007&s=computers&sr=1-258"}
{"product_id": "B00MUTWLW4", "product_name": "Logitech K480 Wireless Multi-Device Keyboard for Windows, macOS, iPadOS, Android or Chrome OS, Bluetooth, Compact, Compatible with PC, Mac, Laptop, Smartphone, Tablet - Black", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Keyboards", "discounted_price": "₹2,595", "actual_price": "₹3,295", "discount_percentage": "21%", "rating": "4.4", "rating_count": "22,618", "about_product": "Type on Any Device: A new type of wireless computer keyboard for your desk that also works with your tablet and smartphone; connect with any Bluetooth-enabled device with external keyboard support.|Easy-Switch Dial: Simply turn the dial of the Logitech K480 keyboard to switch typing between 3 connected Bluetooth wireless devices, you can work with Windows, macOS, Chrome OS, Android, and iPadOS.|Familiar Keyboard Layout: Find all the shortcut keys you use the most, but in a space-saving design that lets you place your mouse close to you, for less arm reaching and better posture.|Integrated Cradle: A cradle to hold your phone or tablet at just the right angle for you to read while you type; fits most phones and tablets up to 0.4 inches thick and 10 inches wide.|Reliable Power: This portable, wireless Bluetooth keyboard comes with 2 pre-installed AAA batteries which can last up to 24 months (2) and is compatible with wired, wireless or Bluetooth mice.|Durable and Spill-resistant: The wireless and compact keyboard K480 is also spill-resistant (1) to survive small accidents; it’s a reliable and durable partner for your desk at home, or at work.|COMPATIBLE DEVICES - PC: Windows 7, Windows 8, Windows 10, 11 or later ; Mac: Mac OS X or later ; Chrome OS ; iPad or iPhone: iOS 5 or later ; Android tablet or smartphone: Android 3.2 or later.|Upgrade to Logitech K780 Keyboard: For more productivity and comfort, try the K780 keyboard with number pad for efficient data inputs, Bluetooth/USB, scooped keys, and cradle to hold your phone.", "user_id": "AH6LPYJT5UBJ7CIEWVHDCNQAGWZQ,AFG4CVSEFXYGJMIHZKX7JGGLCSZA,AFEXNZMRCU4SZFDGWRO6P4CMOGRA,AEUTWNKAMWBUEKXPNPWLZAV2PASA,AE4WVGQ3VRHKHQN3CNM7NCZL3BBA,AGQA6CD2EAQHTFTTONWV6IBD4PLQ,AHXVDMVAJ3EJF56HHLY7CHZK5ULA,AESCIZFPXLL5RG2IAYQEL5V2KNDA", "user_name": "Nikhil M.,Quader,Amith Bipin,Preet Shah,gaurav bagde,Anubhav S.,nirmal,ABDUL BASITH", "review_id": "R1AJ6U452B6VPM,RAPJSV76BEX8A,RZV4F09ALESRQ,R14QZDM2M04IAH,R23U8C99ZSTVP,R17KECO74AO7FC,R3HC5G436ZWUNB,ROOYF4SUB0DMH", "review_title": "Very very very good in terms of ergonomic,Good keyboard but have some cons,Good For Daily Use,Easy to use, hard to carry,nice,Excellent, Durable and connects to any gadgets including IPhone,Not suitable for all,Absolute Rubbish -> Moderately Good Product", "review_content": "I bought it when I watched an instagram influencer showed this product and wanted to try hands on this.Quality wise it's really good and since it's made by Logitech which has been in the market from too many years in PC Accessories - so less doubtful about it's durability. The best features once you pair your 3 different devices to this keyboard using bluetooth, switching connectivity is super fast - like you won't feel any lag in connectivity. The instructions strap helps to well understand this product. I bought at 2.6k, but I know it's price had dropped to 1.7K during Diwali Sale.Things I hate about this product -- I felt it would be light-weight but it isn't.- Buttons are rounded (but yes gives mechanical keyboard feel which is great)- For gaming, buttons are too close to each other so your hands will take sometime to adjust and also the arrow keys are slim which don't matter because as gamer you rarely use arrow keys (it's always WASD), but yes will be problematic if you play FIFA where there is extreme usage of arrow keys.So, 4/5 for overall experience.,Good portable keyboard. I can list out the pros and cons.Pros -1. Good Connectivity with Macbook pro latest OS2. Macbook keys are mapped properly as expected.3. Portable4. Simultaneous connectivity with 3 devicesCons-1. Not an ergonomic keyboard. Its flat and doesn't have any option to incline up.2. Dont have backlight keys. You can not see the keys in dark room.3. Keys are slightly hard to press, I think due to rubber dome.4. Enter key, I feel, is smaller which cant be sensed without seeing the keyboard.Overall, my purpose got fulfilled as i am able to use it with my Macbook pro after struggling with logitech R270 combo.,The keyboard is really good and it has a good built quality and the only con is that there is no indication of whether the caps lock is on or off.,Pros: easy to use, keys feels like mechanical keyboard. Can connect 3 devices. Supports Mac and windows. Place holder for mobile devices ( However, I use it to place a pen)Cons: Expensive. Very heavy ( feels like Macbook air). There is lag in connection whenever you turn on your laptop.,price is litter high,What an excellent product I got my hands on. Smooth working and connect to 3 different gadgets at the same time and u can work on any of them. Buttons are of good size so typing is easy and fast. The inbuilt holder for gadgets is really solid and helping. And it's connect to IPhone also.,Only uses for typing if horizontal view is suitable to see what we typingThink twice before buying,Not working properly on macbook pro! Switches to junk characters frequently which is really frustrating!How did I fix ?The keyboard switches to symbol/junk characters when the option key is pressed. So, I had to disable the option key in the keyboard and live with it!Apart from that above problem, It's a good looking keyboard. The keys are smooth to handle. Due to its container for tablet/phones, the product is not as compact as you might be expecting.", "img_link": "https://m.media-amazon.com/images/I/41hzQslWQlL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Logitech-Multi-Device-Bluetooth-Keyboard-Black/dp/B00MUTWLW4/ref=sr_1_259?qid=1672903007&s=computers&sr=1-259"}
{"product_id": "B08QSC1XY8", "product_name": "Zoul USB C 60W Fast Charging 3A 6ft/2M Long Type C Nylon Braided Data Cable Quick Charger Cable QC 3.0 for Samsung Galaxy M31S M30 S10 S9 S20 Plus, Note 10 9 8, A20e A40 A50 A70 (2M, Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹389", "actual_price": "₹1,099", "discount_percentage": "65%", "rating": "4.3", "rating_count": "974", "about_product": "{3A/QC 3.0 FAST CHARGING and DATA SYNC} : This USB C cable supports QC 3.0 Fast Charging and Data Syncing, max current 3.0A and transfer speed up to 480Mbps. Built-in 56K pull-up resistor and strong metal connections provides reliable conductivity and stability.|{Nylon Braided Tangle-free Design} : Premium Nylon Braided Type C Cable/Lead adds additional durability and tangle free with a tested lifespan of 10000+ bending test.|{SAFE & RELIABLE} : High-purity copper wire features anti-oxidation and anti-rust, which will keep long-lasting fast charging performance. This Type c cable fast charging has safety certification, you have no need to worry about this cable quality at all.|{What You Get} : Premium Nylon Braided Cable 6FT(2M) and our friendly customer service.", "user_id": "AHMKXORT3VNMB75C3EUBYMFYELFQ,AEKJRELVNMICYPOYTKMVF52YX2WQ,AHQPBXZSJ3XZILPJVXE4BN7ZL26A,AGELSEJKLWPVNPXQ7DGK63PEQF5A,AGGBXJFPXZVOJMMB6MMQOPLCJWGA,AEWA5TH6PMRZXMFY5MHCIU2MNFHA,AHPDFQLNLMNV5X4QNH6J7IUMREAQ,AGKQKPUOEC3LQR7GHBQYAHPTU4SA", "user_name": "Pratyush Pahuja,Thiyagarajan,yeses,Amazon Customer,Ajinkya,The Scarred Man,KULDEEP GUPTA,Abhishek Thapar", "review_id": "R2S0AYWUV349HP,R35OW9CYQNAYHY,R3B3DDF1D5NULK,R3LZQDRMNS5CZO,RUGI31F4HDHOV,R24GFJRFT12S6S,R231AEG1IO02JM,RD31MI3UMAXP8", "review_title": "Great Cable, Charging Speeds Could Be Better,Good,A good cable.,One of the best type c cable,Works as intended.,A good buy. The extra length helps a lot.,Good,Ok", "review_content": "Not charging as fast as I'd have expected. Maybe something wrong with my unit. However, the cable overall is actually pretty decent. The material is great, it doesn't bend out of shape very easily, and looks (and feels) premium. The length is definitely a plus!,Good,A sturdy cable for mobile charging.,It's been 1 month that i am using this charging cable, works very well with S20 FE 5G. Thumbs up.,Braided cable is sturdy and built well. Long cable adds extra reach and is tangle free.,A good buy. The extra length helps a lot.,Good product,Ok", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/419QKVTxaSL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Charging-Braided-Charger-Samsung-Galaxy/dp/B08QSC1XY8/ref=sr_1_260?qid=1672903007&s=computers&sr=1-260"}
{"product_id": "B017NC2IPM", "product_name": "RESONATE RouterUPS CRU12V2A | Zero Drop | UPS for WiFi Router | Mini UPS | Up to 4 Hours PowerBackup | Battery Replacement Program | Router UPS Compatible with 12V <2A Routers, FTTH, Modem, Set Top Box, Alexa, Mini Camera", "category": "Computers&Accessories|NetworkingDevices|Routers", "discounted_price": "₹1,799", "actual_price": "₹2,911", "discount_percentage": "38%", "rating": "4.3", "rating_count": "20,342", "about_product": "Un-Interrupted Internet, Up to 4 Hours : Seamless WIFI during power cuts, as you work, play, shop, study, entertain from home. Up to 4 hours of power backup for your WIFI or ADSL router.|Zero Disconnects, Designed for 24x7 Use : Plug & Play, Install in 30 Seconds, optional wall-mount. No More disconnects of VPN, WebEx, Zoom, Skype, Netflix, Any Desk during power-cuts whether it’s a minute or an hour.|Intelligent Charging & Safety First : CE, RoHS, BIS, 6 Safety Circuit Protections. Intelligent charging for longer battery life|Compatibility & Best Performance : Compatible with most 12V < = 2A, WiFi routers and DC devices. If your AC/DC Adapter is at 12V 0.5A please change it to 12V 1.0A for best performance.|Not Compatible : NetLink, Syrotech, Alphion 100C, 1524, BDT-121 UT-STAR ONT4842W (Please buy CRU12V3A for these models as they draw higher power though rated at 12V and <2A). Self-Check Compatibility : Please check the Router power-ratings behind the Router before your purchase. Our customer care is available to assist you", "user_id": "AEV2RFEWLJIWQDBU7FMHAUJT7PQQ,AGN4RT66HR52VG2S2I5B4LUDEZNQ,AGTTKLYUVR5XG4LXI6QWACQJJKRA,AF7EAJ3DVQJ5OV7EN7NI4ZCTUKOQ,AGCEQDLYNNIX24BEH2YDCDOSQJGA,AFZU2DMK45O2USJ3FVBIXTNRZXYQ,AHDAF6TAAIC7SNQVJIBHZSWZHPGA,AEOA3NB4DXSDU3E345Z7DFFTZLTA", "user_name": "JAYASHANKAR VB,SHAHABAAZ SHEIKH,Ranjan,Nilanjan,Mohd Aniz Bijal,Srikanth Bhattu,Saif Shaikh,Govind R", "review_id": "R3IAV5LSI3J7ME,RQRYBRNF648MR,R2TVUO2ZZ7TXFC,R1KGPK8S5IYLBR,R40G9679B3M95,R1BV2CXD5S6CGL,RNE99IXSFU1NV,R3OVGAKIXHYTLX", "review_title": "12V2A RouterUPS,Decent Product,Product quality,Effective and functional,Works with jio 12v 2.5A,Good product but not supported for my Wifi,Amazing product very helpful at times off power cut.,Good one to buy", "review_content": "The 12V product will not work with most type of modems. It's always better to purchase their 12V3A product. I have used 12V2A product for 9 months and it stopped working after that. When I contacted the customer care, they told me that I should have purchased there 3A product. Anyway they have provided the warranty. Also provided an option to upgrade the product to 3A at a discounted rate instead of replacing the current one.,The product is good. Will require an additional Y splitter cable.,Product is very good,using since 2nd Dec 2022, no issues.,Value for money. Effective in cutting off and cutting in, during an outage. Normal router can be supported by up to 2-3 hours on this, even after 2 years of use. If there is not much power outage, recommend to at least switch off power supply a couple of times every month and have the battery support this for a couple of hours,Purchased ups 12v3A, Works fine with jio fibre (12v2.5A) and provide good backup, but little costly as compare to ups 12v2A (which is not compatible with my jio fibre.,I ordered 12V, 2A model for my Digisol wifi.After installation the product was turning off once the power goes.So i called Resonate customer care and they told as your DIGISOL wifi is not supports 12v 2a  and they suggested to buy a 12V 3A ups.Before purchase please call Resonate customer care,Amazing product very helpful at times off power cut.,This is best to avoid power cut issues, pretty decent power backup for home wifi", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/318egjvJ0mL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Resonate-RouterUPS-CRU12V2-Backup-Router/dp/B017NC2IPM/ref=sr_1_261?qid=1672903007&s=computers&sr=1-261"}
{"product_id": "B00N1U7JXM", "product_name": "3M Post-it Sticky Note Cube, 200 Sheets (4 Colors x 50 Sheets) | 3\" x 3\" Size | For notes, reminders, study, school and organizing", "category": "OfficeProducts|OfficePaperProducts|Paper|Stationery|Notebooks,WritingPads&Diaries|Notepads&MemoBooks", "discounted_price": "₹90", "actual_price": "₹175", "discount_percentage": "49%", "rating": "4.4", "rating_count": "7,429", "about_product": "Material: Paper; Size: 3\"x3\"|Colour:Multicolour|Add creativity to your communication|Bring variety and personality to your note|Colour code your tasks", "user_id": "AFCNMPYF3HBJZ3FYMKXQAMR55OSA,AFW6KM45ORMBEVYBQ4QMSGG2ODOQ,AEWQF6RZYLNE6KZGF7DKK3C7IVGA,AFSLFJUEJHEFU5FAYUPIW2DZZR4Q,AEFUZZHV62AGF5NW5JJMEQI5TJ2Q,AGYOCAXRDRTOABD7L7HRINORYK6A,AFGWCA57CSCLUTCHHHRQOHUZALAQ,AF5DDVYNOENPTAMINHPTVCNWPCZA", "user_name": "Deepak kumar,Ahsan Shaikh,Karan Khanna,Sagar Nemade,Fazeela Fazzii..,Manoj,Sujoy Singha 93,Mani", "review_id": "R3JRQ21J8LHK67,R2100TLJUT7YQM,R12XEPS4NQ1XIR,R2QO6YC2WQ78Y4,R3HTM8I9Y12U7R,R2X56GH9II23XQ,R975UDYN89ORH,R1G9Y353J4EWAK", "review_title": "Adhesion,Good product,Does not stick,Nice sticky note,good,Not up to the mark,Worth to sticky,GREAT....", "review_content": "It's a good product but the paper sometimes  dosent  stick on surfaces for more then 2 times.,Nice sticky notes,Pros: Quantity and ColorsCons: the adhesive strength is almost non existent.Its just paper cut outs,Has 3M adhesive,good,Not up to mark,Worth to sticky.. helped me a lot in remembering mindmaps,", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41yNejBMf+L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Post-Cubes-sheets-colours-inches/dp/B00N1U7JXM/ref=sr_1_262_mod_primary_new?qid=1672903007&s=computers&sbo=RZvfv%2F%2FHxDF%2BO5021pAnSA%3D%3D&sr=1-262"}
{"product_id": "B08HQL67D6", "product_name": "OFIXO Multi-Purpose Laptop Table/Study Table/Bed Table/Foldable and Portable Wooden/Writing Desk (Wooden)", "category": "Computers&Accessories|Accessories&Peripherals|LaptopAccessories|Lapdesks", "discounted_price": "₹599", "actual_price": "₹599", "discount_percentage": "0%", "rating": "4.0", "rating_count": "26,423", "about_product": "【MULTI-PURPOSE LAPTOP DESK】- OFIXO Laptop bed tray is perfect lap desks for work, watching movies, reading books, study, games, eating-all could be done in the bed. The foldable laptop desk is suitable for almost all sizes of laptops, tablets and phones. You can also put the laptop bed table on the sofa, floor, couch & perfect for online school classes & work from home from the comfort of your bed.|【USER FRIENDLY | COMFORTABLE | NON-SLIP DESIGN】- With scientific engineering design and curved sturdy edges makes this table very strong and durable.|【CUP HOLDER & TABLET SLOT】- OFIXO lap desk is designed with a solid cup holder for possible cup tipping, avoiding soiling your bed or couch. The long slot on the lap desk serves as a holder for smartphone, tablet and pen, making the table helpful for work and entertainment.|【BUILT-TO-LAST】-The foldable laptop table is made of medium density fiberboard (MDF) and sturdy solid board and imported decorative upper. Our laptop desk is durable and scratch-resistant. Besides, it has well-coated metal legs and ergonomic round edges that maintain stability. The laptop bed stand is very light and easy to carry, allowing you to easily complete work on the bed, sofa or floor.|【FOLD OUT DESIGN |SAVING SPACES| FOLDING SIZE】- The foldable laptop desk does not need to be installed and can be used directly when opened. The laptop portable lap desk is very practical, you can put it on the bed, sofa, or on the floor, when you go out camping, you can also bring it, and it can be used as a small picnic table.", "user_id": "AHTBDJ3J72O3A3NQNV2OUTOXP36A,AFPYH3UF3GB4RNX3MX46AXFM2FTQ,AFDER5KTHQQR7JFESKR2BGL7N3FA,AHOVXBUFOZ5ZU5QYL5B26JZ6M6SA,AFSJ6X7ZQ3N3TLGPUCWW5U2DP73A,AHQAQBNZHEDXSAPJK3W3S2BAIDYQ,AGHPAJL4PEZZNE6X6JAKEBI2UG5Q,AH7BGAGRTSO5HVQAS4TWUXAV3G5A", "user_name": "Sonubhai,Sujili v,Mohammad Maqsood,Mohammed Jafir Ashraf,Asirvatha ravi,saif khan,Jeni,prolay", "review_id": "R3O03EUB6UY68T,R1FMMOPHEXIHKO,R23PAXUWIYVJ2W,RSUWXFVM9EBIO,RGNGF6Z9XB5LH,R1KF7DT0S28EXC,RC4T7CRXKZKTB,R1WY5QNGHALX9Z", "review_title": "Value for money,Good,Everything is good but prize is higher side,It's good product, easy to use, but not for kids,Very good,Good product at this price,Very good product in very cheap price,good product,  i am satisfied", "review_content": "its value for money , its good for students and for causal writers , overall best build quality , stable , and sturdy .,Good,Prize is higher side!,It is a very good product for WFH and study, but the edges are very sharp. Couldn't read for a long time. Hands are scratched. So it is not a good product for kids.,Very good,Stability sturdiness are quite impressive.,Easy to handle,good product,  i am satisfied", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41tWgm56a0L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/OFIXO-Multi-Purpose-Foldable-Portable-Writing/dp/B08HQL67D6/ref=sr_1_264?qid=1672903007&s=computers&sr=1-264"}
{"product_id": "B09RKFBCV7", "product_name": "Fire-Boltt Ninja Calling 1.69\" Bluetooth Calling Smart Watch, Dial Pad, Speaker, AI Voice Assistant with 450 NITS Peak Brightness, Wrist Gaming & 100+ Watch Faces with SpO2, HR, Multiple Sports Mode", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,999", "actual_price": "₹7,999", "discount_percentage": "75%", "rating": "4.2", "rating_count": "31,305", "about_product": "Fire-Boltt is India' No 1 Wearable Watch Brand Q122 by IDC Worldwide quarterly wearable device tracker Q122.|【Bluetooth Calling Watch】- Fire-Boltt Ninja Calling smart watch enables you to make and receive calls directly from your watch. This smartwatch features a dial pad, option to access recent calls & sync your phone’s contacts|【SpO2 & Heart Rate Tracking】- Track Real Time Heart Rate on the go on this smart watch. Featuring Blood Oxygen Tracking (SpO2) with optical sensors that give almost acurate results|【1.69 inch HD Full Touch】- Best in class HD Full Touch Screen with a 240*280 pixel HQ Resolution smart watch with call function . Smooth functioning and easy swipes making life better.;|【Built In Speaker】- Listen to your favourite songs on the watch itself, with the built in speaker talk while you walk and even enjoy songs on the run|【AI Voice Assistance】- Command your watch and let the magic happen. This special technology is in the Fire-Boltt Ninja Calling Smartwatch|【30 Sports Mode】- Fire-Boltt Ninja Calling best Smart watch comes with 30 sports tracking feature. Track each acitivity with true efficiency and crown that medal.|【Socially Active】- Activate your social life while you balance your work culture. Never miss out on any event, meeting, birthday or trends, allow all the notifications to be displayed on the smartwatch and rock each party", "user_id": "AGDI3CM73SM6W3GZTPAXJ23GNXUA,AF2WVFRQZPM6MC653VXOF46XYNSA,AERSG63VY4JYAZNAFLHC5YBE7QYA,AGD7FEEGW5JL5H2DY4PAHXBXEOBA,AEYPXM7M4FENXD3QMAU2DHWJQSMA,AFR23LRVE7CTSLJBHQFDNYMX5HFQ,AHSNDUCUGAHGPOTD4PIVFRZK3GBA,AEV2ZXYQ2Q4ZKT5EADCYWVI62Q5A", "user_name": "siddhi kamat,Reshma Sagar,Mahima singh,Sayantan,Akash Tyagi,Prerna Hazarika,Benjamin,Abhishek kumar shah", "review_id": "R2ATT3WQL0UB7P,R1VHI2ZGJSCFVO,R1UHC2M2KPN7W4,RL2IQ53WUNMXA,R2ZU0WUMZ3CLX6,R3C01TBTCD6UB0,R17G6J6XU7GMYG,R2TLAX7VNYS983", "review_title": "Value for money Product,Watch start button,VALUE FOR MONEY,Budget smartwatch,Watch is good,Good watch.Lekin jab recive Kia,watch on tha.Alarm pm me set nhi hota hai,Only am me hota he,Good watch,Amazing watch amazing colour! Just bought yesterday, will share feedback again after the usage.", "review_content": "I've been using the watch for a while now and I got to say I love it. The battery lasts around 4-5 days not 10 days, you do get around 10 day battery life if you disable all features of the Watch. Overall I like the call quality and display touch.,I got this product today and watch is great in budget and performance there's only one major problem that the button is not good but the other things are like speaker mic display etc. Are good.,The watch is good but the product that I got was defective after talking to the fire bolt company they give me new watch watch is value for money go for it.,The watch is stylish sleek and built quality is good.in this price range it's a catch,All over good but volume increase and decrease not working while play the music.,I gv this feedback after using 3 months.. good watch. Lekin jab recive kia, watch on tha☹️ pm me Alarm lagana bohut zaroori hota he. But nhi lagte he. Sirf am me lga skte hai. very disappointed😖 baki battery backup is good 👍 looks achcha hai👌comfortable hai,It’s a good watch but not switching on right now due to some issue,Amazing watch amazing colour! Just bought yesterday, will share feedback again after the usage.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41W4O2H532L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Fire-Boltt-Bluetooth-Smartwatch-Monitoring-Assistant/dp/B09RKFBCV7/ref=sr_1_265?qid=1672903008&s=computers&sr=1-265"}
{"product_id": "B08KHM9VBJ", "product_name": "Airtel AMF-311WW Data Card (Black), 4g Hotspot Support with 2300 Mah Battery", "category": "Computers&Accessories|NetworkingDevices|DataCards&Dongles", "discounted_price": "₹2,099", "actual_price": "₹3,250", "discount_percentage": "35%", "rating": "3.8", "rating_count": "11,213", "about_product": "CREATE A HOTSPOT - Connect up to 10 Devices simultaneously. Supports Wi-Fi 2.4GHz|ENJOY TRUE 4G SPEED - 4G LTE, Enjoy Fast Internet. Download speed upto 150 Mbps & upload speed upto 50Mbps. Enjoy even on non-4G devices. Operating System : Windows 7, Windows 8, Windows 8.1, Windows 10, Mac OS X 10.7, 10.8, 10.9, 10.10, 10.11 or Later|POWERFUL BATTERY - 2300 mAh battery, Stay connected up to 6 hours* & 300 Hours stand by time|Expandable Memory Capacity: 32 GB|WiFi Speed is subject to Airtel 4G network availability. Airtel my wifi is network locked(Work only with Airtel Sim) and is available at a special promotional price for Airtel customers. Kindly visit the nearest Airtel store for Sim activation|Depending on the network and environment, the battery can last for a maximum of 6 hours working time on 4G and 300 hours of stand-by time", "user_id": "AFUKXJCLJNJK6S47HUN4KLGPFHCQ,AEYU436CG3CVTGML3U4BQLM24X7A,AHWGO3DOMU5Q5D2THPQOCILMEL2A,AEC6ANESUDELYRB2T3RKNZCOXMMA,AFO5GWF5MXFJW7SF3RKUTJXPB32A,AF7P2QHPYH6Z2KS5K2V2MTRPHOOA,AEHAJER6YJ6UB74W534EA2CA355Q,AEQ4D3BU3IY4OTLZQAL6VTAOWUKQ", "user_name": "Sancha Bir Subba,K.R.Kotian,MANASH,M.Suresh,Amazon Customer,Pratik B.,Velu_Vadeo,Sudipta Dhar", "review_id": "R1YI2RI1JC36SO,R3K5ZW63M5MIRN,RK2GIVBNOGOZ3,R25A4JO66YW0TS,RVQD2WX9EIW0W,R35YIQ96ZXOU58,R393HAUNLQT4YD,R1ULBGLCI3H1YU", "review_title": "Missing Cable, User Manual and Weak Network,Good,Nice,Home use product only,Good,Not usable for office work,Easy to use.,Bad experience", "review_content": "I have received this product with a torn packet, missing cable and user manual. It seems incomplete product. And the same airtel sim gives me a strong network but here I foud it slower than my mobile network. It's fine, it might be the problem of network, but the cable shouldn't be missing. It seems someone taken while shipping because I got the packet broken. However, I received the WiFi with battery. And I use my own cable to charge it.,Overall satisfied,Nice working,I faced Much tower problem,It is better than mobile hotspot, but it's battery backup is not good.,Even with a 4G SIM the network speed is really low and connection is patchy. Its ok if you are using it for personal surfing but not a good fit for office work.,Satisfied with the product.,When i connect only 1 device then ok. But when multiple device connecting, it is hitting abnormally within 1 minute. Then backup reduce maximum 3-4 hours.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31pnooau8vS._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Airtel-DigitalTV-Hotspot-Router-ongle/dp/B08KHM9VBJ/ref=sr_1_266?qid=1672903008&s=computers&sr=1-266"}
{"product_id": "B01IOZUHRS", "product_name": "Gizga Essentials Laptop Power Cable Cord- 3 Pin Adapter Isi Certified(1 Meter/3.3 Feet)", "category": "Computers&Accessories|Accessories&Peripherals|LaptopAccessories|LaptopChargers&PowerSupplies", "discounted_price": "₹179", "actual_price": "₹499", "discount_percentage": "64%", "rating": "4.1", "rating_count": "10,174", "about_product": "This is a polarized power cable designed to connect a wall socket and your Laptop/notebook power brick. The female connector plugs directly into the device while the male connector plugs into a standard outlet.|COMPATIBLE for All 3 pin Laptop Power Cable Cord|Fits most branded- Laptop Adapter/ Chargers: Universal AU 3-Prong AC Power Cord 3 Pin Adapter Cable. Fit most Laptops, Game Players, Cameras, Printers, AC Power Adapters or Chargers.|It converts back and forth between 3-prong Power Plug and 3-Prong Laptop Power Cord.|Overload protection:Overload protection with high quality wires.Anti-Interference feature with better Isolation materials, better quality rubberized texture Cord", "user_id": "AG62NLRIFTN2XEHSJ6HFEUWLNUFQ,AF52BVFW4ASG3V7VPP4S4BZII6DA,AFAS6QTXL5CPXZ6RHDRQP5FDQ5XA,AFIUCL2BAVOF2TKHTDO6SILLENFQ,AGYRHFW4K32QEH7TATXEH565CBZA,AHQH5PRVD42NW5O7FLDL2ETIBOXQ,AHSXVV5G4YWE5XMUXSP6ST7S3Y7A,AGRQAZ4YPQE4JGYOYPWSYCYOLQPA", "user_name": "Chetan C.,Bhasker,Heet Kantharia,Kavitha  R,Roy b s,GG,Chirag Kathuria,Neeraj Ram rakhyani", "review_id": "R2CQA45JW6KW09,R175UKN3MEJOV5,R25CE9M9A1ZKSG,R39ODDV5YDGF8T,R2W5LI9FGSKNYU,RVVK1C0RQFZYV,RT8EWW3VVXA67,RL4FCGDFPX5JP", "review_title": "Good product, Cheap and works well,good one,Nice charging power.,Nice,Good,It's a cable,Durable,Laptop cord", "review_content": "The cable looks exactly as it is shown in the picture. I can't say about durability of this product because I have purchase this on 15th December 2022After 3 to 4 months I will update my review about the durabilityAnd the cable works fine,good one,Used it for a long time had no complains.,Good,Thanks,Works well,Perfect for laptop charging,It's good to have it for 200 rs. Delivered in 3 days", "img_link": "https://m.media-amazon.com/images/I/41nub-26HfL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Gizga-Essentials-Laptop-Adapter-Certified/dp/B01IOZUHRS/ref=sr_1_267?qid=1672903008&s=computers&sr=1-267"}
{"product_id": "B00CEQEGPI", "product_name": "Logitech MK270r USB Wireless Keyboard and Mouse Set for Windows, 2.4 GHz Wireless, Spill-resistant Design, 8 Multimedia & Shortcut Keys, 2-Year Battery Life, PC/Laptop- Black", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Keyboard&MouseSets", "discounted_price": "₹1,345", "actual_price": "₹2,295", "discount_percentage": "41%", "rating": "4.2", "rating_count": "17,413", "about_product": "Easy to Use: This wireless keyboard and mouse combo features 8 multimedia hotkeys for instant access to the Internet, email, play/pause, and volume so you can easily check out your favorite sites.|Comfortable Mouse: This compact wireless mouse is designed to be equally comfortable for both left- and right-handed users, plus its smooth cursor control allows easy navigation on most surfaces.|Favorite Wireless Combo: MK270 brings together familiar typing, wireless freedom, and long battery life; no wonder this is the world's top-selling combo(4).|Durable and Resilient: This full-size wireless keyboard features a spill-resistant design (2), durable keys and sturdy tilt legs with adjustable height. Wireless range: 10 m|Type in Comfort: The design of this keyboard creates a comfortable typing experience thanks to the low-profile, quiet keys and standard layout with full-size F-keys, number pad, and arrow keys.|Reliable Plug and Play: The USB receiver provides a reliable wireless connection up to 33 ft (1), so you can forget about drop-outs and delays and you can take it wherever you use your computer.|SYSTEM COMPATIBILITY: Windows XP, Windows Vista, Windows 7,Windows 8, 10, 11 or later USB port.", "user_id": "AF6FWJDVYLDXCQ3XUAMYDIMTDE3Q,AEVREAMLELSSIBFZAFMHJZHZOCEQ,AHFQHRUOXMDEODCDMN7DAH7O3XUQ,AFMEP5XCM2UPBSXEMETTX2WKYZXA,AHP5XVXHFNOISFJBZ3NQX75EC5QA,AGHNC3MCDVNFBHJE57OTC7AOT6YQ,AEYTSGFWZ4ZRHMCUB3CPKEWFHMEA,AEDKRMDACO4VWC4ERJ42X6USUNTQ", "user_name": "Jaldeep,karan,Kalyanchakravarti Nemana,Swapnil S.,Aman Kumar,Sanjay Tikoo,Yogendra B.,Sitanshu kumar", "review_id": "RUGMBPEU1O5TW,R8ZNW2WNUSCA3,R19M1F36BH6M45,R3CP5684696DX2,R4F8T565MXCHD,RRBQIRD7QU74J,R2WL65WCEQTHQX,R7D8YGIM2DO6R", "review_title": "Great keyboard, average mouse.,Good for daily use,Mouse is too small in size to use and getting pain,Must buy this for normal use,Noisy and not Ergonomic,Great Product,Well suited for ordinary and official usage.,Nice Product", "review_content": "EDIT: This doesn't change my review (actually, it probably makes it lean even heavier towards the 4 star than 3 star rating) but I actually sat on the keyboard while it was on my chair (I'm an absolute unit of a dude weighing 120kg) and the keyboard wasn't affected at all. I'm genuinely surprised.First of all, I'd give this a 3.5/5 instead of the 4 but I rounded it up instead of down because there's more to like than dislike.Product was delivered promptly but the packaging was in rough shape. When I unpacked it, the keyboard had three missing keys (iirc it was left Alt, Z and the Windows keys). I turned over the box and dumped everything and voila! The missing keys fell out. Not off to a great start but I slapped those keys on (which was very straightforward meaning that replacing keycaps in the future will be relatively easy) and plugged in the receiver to my laptop. No setup or 3rd party software necessary, it just started working instantly. Pretty seamless.I only use the keyboard when I connect my laptop to my TV and I'm sitting at a distance, I use my laptop's keyboard otherwise. I absolutely love the keyboard. I was expecting it to feel wonky and cheap but it actually feels decent. It's not super premium but it's much better than what I was expecting for the price. It has flip stands on the back to raise it and an on/off switch if you want to conserve battery. The keys themselves are full sized, and as someone with larger hands, I really appreciate it. The curve around the space bar looks cool but I don't think it adds anything ergonomically. The typing experience is nice, the keys have enough feedback to them (not mechanical levels obviously, but still satisfying enough). The Caps Lock key has a little raised bit to it so you can feel it without looking at it and don't accidentally hit it while typing, neat little addition. The shortcut/media keys on top all work fine with Windows 11. There's not much else to say about the keyboard. It should be more than sufficient for everyday office/browsing/school tasks and will be good and comfy for people who type a lot. Do not buy this expecting a gaming level keyboard with antighosting, etc or buy it expecting to have the durability of a true mechanical keyboard. I was initially going to mark it down for not having any backlight at all but given the budget, that's understandable and acceptable. Overall, I very much like the keyboard and find it to be above par for what you pay.The mouse, on the other hand (no pun intended), is mediocre at best. The build quality is not good; it does not feel good when you use either of the click buttons, you can feel the inner mechanisms groaning, like it's gonna fall apart at any time. The mouse also starts lagging randomly. The lag only lasts a couple of seconds but it occurs enough to be an annoyance. Also, it just doesn't feel good in your palm. I have an Amazon Basics mouse that I purchased while I was in the US for $7 (~520rs) and that thing feels so much sturdier and better built than this. It also has no lagging issues and the clicks feel smooth even after a few years of use.As an overall package, I would say it's decent for the price. There are lots of other sets in this price range and I picked this literally because of the Logitech branding since I own a few other Logitech products and enjoy them a lot. The keyboard is doing all the heavy lifting here and carrying it's mouse friend. I hope they improve the mouse going forward because then, this would be the best combo in this range. As it stands right now, it's fairly indistinguishable from its competitors.Recommended for - people looking for an affordable wireless set for everyday computer work and people who type a lot.Not recommended for - gaming or any form of power users. It might work for single player games like city builders, grand strategy, RTSes, etc but I would not recommend it for any form of shooters, especially online. The mouse simply isn't up to task.,,The Keyboard is good and working nice. for me the Mouse is too small and not able to use properly and getting pain after using for very less time only. it will be good if the mouse is in regular size. Also the mouse is lagging a bit even after changing the settings.,I using this product since one year not any problem found.Even battery cell not change,I don't really know if it's worth the cost or not. But, I mainly prefer silent typing and mouse clicks. Ergonomic is also a must as I use these for long hours.Currently, I use logitech m590 mouse which is really awesome and makes almost no noise at all.,Great Product,I have been using this product for 2years. It's battery is great, still running. The keys could get hard with time, therefore i had to use WD-40 to lubricate them. After 2years, some random keys have stopped working, such Del, Semicolon, Numpad-3. The mouse's right click isn't functioning anymore. The left click has irritating double click issue. So not suited for FPS games. Speed and connection is adequate, no lag noticed. The keyboard collects a lot of dust so better to cover it. Ergonomics are great no issue with that. If you're looking for a longer size keyboard for approx. 2years of proper functioning for daily or official use, then it is a good purchase. Mouse is small and comfortable, even for left handed people. Keep in mind the keys WILL become stiff over time.,I purchased it for my personal use , which includes mostly working, it has good connectivity both for keyboard and mouse . I have not faced any issue with it. I have not tested its performanace.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41X6hey-ExL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Logitech-Wireless-mk270r-Keyboard-Mouse/dp/B00CEQEGPI/ref=sr_1_268?qid=1672903008&s=computers&sr=1-268"}
{"product_id": "B08B6XWQ1C", "product_name": "DIGITEK® (DTR-200MT) (18 CM) Portable & Flexible Mini Tripod with Mobile Holder & 360 Degree Ball Head, For Smart Phones, Compact Cameras, GoPro, Maximum Operating Height: 7.87 Inch, Maximum Load Upto: 1 kgs", "category": "Electronics|Cameras&Photography|Accessories|Tripods&Monopods|TripodLegs", "discounted_price": "₹349", "actual_price": "₹995", "discount_percentage": "65%", "rating": "4.2", "rating_count": "6,676", "about_product": "The mini tripod works with most Smartphones, GoPro, DSLR and compact cameras|High quality tripod equipped with non skid rubber feet for extra solid grip , even in a tilted position.|Digitek Portable Mini Tripod with 3 Leg Base for All Mobile phones", "user_id": "AGSYXGAGS3QPCXMCULCHPZHVZY3A,AGYI2ZNVO366FOQR4EPOZRQFKZHA,AGSQMFOIENJJKSUCLBBILKW2Y3SQ,AG43V5KMRNBDZHB6JZNM2RSJGEHQ,AEKKUECOGRGJJGSMDTDUTI2JKL5A,AHIACMMGVA72WI7Z7AH44ID3AVUQ,AG3WWBPMVIMZILVOZGYXYAA5M6UA,AEB3YEBRITFKRFWRJ6F7VGPIR6FQ", "user_name": "Rajesh singha,Bhavesh,Sivanath,Akanksha suvarna,honest user,DEEP Sadhukhan,Debjit Chowdhury,Kuldeep Rai", "review_id": "R2DRK3ADKHLE1X,R27UPOY045409N,R2L4TR6OY6H27M,ROT0JJ2ZLKMPF,R1N6J3UIYH39UI,R18Z1ZRI0LMRT,RV22EDSI7F9WX,RAUA868KW5M5W", "review_title": "Good for office and watching movie,Product review,It's worthy to buy,It's fine,nice item,Overall Good,Best for Beginners,Small size but still sturdy strong . Useful for bigeners.", "review_content": "Very premium and good material use,It's good but one thing I don't like it that phone mount is not good it has broken when I tighting the mount to tripod and when you remove your phone  then you will be seeing some of the scratch or something like this on the back cover.,Good product specially for first time usage people and it's worthy for the price,It's good but after few times using it can't take the weight... but overall it good. I liked it.,good stand .good quality and  finishing also good worth the price.,Overall Good but little high price,This product is best for beginners.  Have some stability issues which you couldn't expect in this price range. Definitely you can go for it..,", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31Vt3iyEaIL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/DIGITEK-Portable-Flexible-Compact-Operating/dp/B08B6XWQ1C/ref=sr_1_269?qid=1672903008&s=computers&sr=1-269"}
{"product_id": "B01DGVKBC6", "product_name": "FEDUS Cat6 Ethernet Cable, 10 Meter High Speed 550MHZ / 10 Gigabit Speed UTP LAN Cable, Network Cable Internet Cable RJ45 Cable LAN Wire, Patch Computer Cord Gigabit Category 6 Wires for Modem, Router", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|EthernetCables", "discounted_price": "₹287", "actual_price": "₹499", "discount_percentage": "42%", "rating": "4.4", "rating_count": "8,076", "about_product": "✔️HIGH-PERFORMANCE INTERNET CABLE IS CAT6 RATED - The Ethernet cord with 24 AWG CCA wire provides universal connectivity for LAN network components such as PCs, computer servers, printers, routers, switch boxes, TV, Gaming Devices, network media players, NAS, VoIP phones, PoE devices, and more.|✔️UPTO 10 GIGABIT SPEED - This FEDUS rated cat 6 lan cable is 24 AWG with 4 pairs (8 conductors). Suitable for 1 and 5 Gigabit speed up to 328 feet and 10 Gigabit speed up to 165ft depending on the installation environment. Bandwidth tested up to 550 MHz. Supports PoE, PoE+, and PoE++ (IEEE 802.3af/at/bt) up to 60W and 300V DC.|✔️THE RJ45 METAL-SHIELDED CONNECTORS WITH GOLD-PLATED CONTACTS - Metal-shielded shell eliminate cross-talk and prevents electromagnetic interference (EMI) that be caused by nearby power lines or appliances, molded strain-relief boots, and Snagless molds resist corrosion, provide durability, and ensure a secure connection; CCA Ethernet cables enhance cable performance and comply with specifications for communications cables|✔️FLEXIBLE AND DURABLE - RJ45 cable with high bandwidth of up to 550 MHz guarantees high-speed data transfer for server applications, cloud computing, video surveillance, and online high-definition video streaming|✔️LIFETIME FRIENDLY CUSTOMER SERVICE ? 6 Month worry-free warranty. Each Cat 6 internet cable goes through rigorous testing to ensure a secure wired internet connection with exceptional speed and reliability. If for any reason you are not satisfied with the item, you will get a replacement|✔️QUALITY CONTROL - Each Cat 6 internet cable goes through rigorous testing to ensure a secure wired internet connection with exceptional speed and reliability.", "user_id": "AGFSOG7QWOQRQTDVWUVK4WPOPHSA,AG6UPQFCRHSQODIOVIMER3P47VQA,AFY66NURTOX762MUCC6G4QMEBE3Q,AE3NPJLVC2YRPBNFICNMX5ZB6MEA,AGAZYH7WC2DAX4C5Q2IJ3QNNTXKQ,AEBVNEPJTREFKWKSVGGA4OTLKF3A,AGCLISGESOSSRSZW6ATE4IHBDFZQ,AH6BK2HIRJPBQKUMSL42RVA2UCVA", "user_name": "K. Vijay Kakulavarapu,Samuel Nesa Kumar. L,Nelson,Abid,Manav,Saurabh yadav,George V.,joseph", "review_id": "R3J8OMTJB5P038,R1ZFZHJQD4WTQL,R3U6Q310IX6DDS,RON8WF9GCAV06,R3A03VLDTWQIFH,RL4BDAUF747PA,R1RUG6JNEQNLSV,R3TQ0TEJ67VL2V", "review_title": "Very good performance,It's been more than a month and it's been working good till now,good quality,Good,Nice one,Excellent,Cable outer surface is oily based,Genuine and good cable👍", "review_content": "Really it is solid and effeciant. Net signal is very fast,It's working fine,value for money,Nice product 👍,Idk but my WiFi signal from the router is unstable. I called and got it check from service providers also. But as of now product Seems to be good,Very good quality with good speed,Not good,Everything great from packaging to cable quality", "img_link": "https://m.media-amazon.com/images/I/51jNo4QNTNL._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Technotech-Ethernet-Network-Patch-Cable/dp/B01DGVKBC6/ref=sr_1_270?qid=1672903008&s=computers&sr=1-270"}
{"product_id": "B008FWZGSG", "product_name": "Samsung Original Type C to C Cable - 3.28 Feet (1 Meter), White", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹599", "actual_price": "₹599", "discount_percentage": "0%", "rating": "4.3", "rating_count": "355", "about_product": "USB Type-C to Type-C cable with universal compatibility|1m Length & Reversible design|High Speed Data/Charging with USB 2.0", "user_id": "AEQWVGESA7TDGK7KZ4DAJQGYH32A,AECGAMNNIMW5QOPOBXRYQAKMQGEA,AEA5X2W76STDCKVMFZ2WP7H7QFUA,AEWMPOUFVOFZ3WMJGHLOYQ7VGUJQ,AGLVW6SUWTW35HT5AYQR4CKA5IOA,AFSU7KWDY4KGQSFFCRXJ4IPJREAQ,AHS7DI2FACP3P3FNVH7263NLW2TA,AELNHGVCLQTWAEFDH244JJZZSVAQ", "user_name": "Verified Buyer,Avishek Majumdar,Drowna roy,mahaboobali khan,Aamir,PRAHLADAN K N,Abdulkadir,raja", "review_id": "R2Z9ENI1BK4EAB,R2JTBG4GO7WPMG,R3GKCN4UH999M8,R3EGXE69JQH9AG,RCX9JVSY2ISRL,R1UVGU3RQMOG49,R2VQFSALVKRALF,R1M45F72399D3L", "review_title": "Good,Genuine product,Not first charge this cabil,,Nice cable but known durability,Got a used type c to c cable and the xable was damaged,The product is Genuine and Good,Abdul kadir,Good", "review_content": "Buy it,Received in good condition and is working properly,This price cabil not good,  and also short,I am using from 2 months and charging the phone in good way and it's really value for money.. i recommend this cable.,https://m.media-amazon.com/images/I/71CEI3G+BLL._SY88.jpg,The cable is perfect for 3A charging devices . Support super fast charging and can be used in vehicle chargers and adapters. sturdy and durable for daily use,Best cable i have ever used by amazon .worth it . Guys just take it,Good Quality.but over priced", "img_link": "https://m.media-amazon.com/images/I/11ICusapw3L._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Samsung-Original-Type-Cable-Meter/dp/B008FWZGSG/ref=sr_1_271?qid=1672903008&s=computers&sr=1-271"}
{"product_id": "B08JD36C6H", "product_name": "Kingston DataTraveler Exodia DTX/32 GB Pen Drive USB 3.2 Gen 1 (Multicolor)", "category": "Computers&Accessories|ExternalDevices&DataStorage|PenDrives", "discounted_price": "₹349", "actual_price": "₹450", "discount_percentage": "22%", "rating": "4.1", "rating_count": "18,656", "about_product": "Large loop easily attaches to key rings|Practical cap protects the USB plug|Multiple colour options by capacity|Backed by a five-year warranty, free technical support and legendary Kingston reliability", "user_id": "AHOSVRPAZVI6XRKDHV4VQKRHMV4Q,AETMXBXXZHMQXZEJUFTS4VEBC6HQ,AFK63ZR76EMT36E6263UOQCDR5FQ,AE5BEDOHJHOGLXFPGD7XGENYUXCQ,AFZS47FK76MBKOKQHQ2BEYNB2ZEA,AH3QHP5V7G52L5SDIIAFE3TN3VGA,AGFHSRASMHH6HVE5ZRM7FL7MUBOQ,AFHV7P56J3ZHPKSNHAQSO4YCETBA", "user_name": "Dip J D,NJ,Kailas h rasal,bhoobalakrishnan,shekhar,Sekar,Ankit kumar,Ujjwal Murmu", "review_id": "R30EQTCL98LVFB,R28SCUN7KMQ9JC,R15H3DOQB6XN75,R2JG1LT0NXKUR1,R3C08PZFZRT41X,RP577JII0SXT0,R2IB02FZ1RPV0T,RA7EY4YTEQ2E", "review_title": "BEST VALUE,Good product,Good,Good,Very good product by Kingston. But size of pen drive may reduce.,Nice product with 5 years warranty in 250 rupees,Good product,Not up to the it's Specs", "review_content": "USB 3.0 pendrive in USB 2.0 Price.However, on connecting to USB 3 in some devices, particularly desktops and All-in-Ones are getting disconnected due to overcurrent protection.However USB 2.0 is not having any such issue.In USB 2.0. READ Speeds are great. Write speeds are average 10-12 MBPS.I am using it as bootable device using ventoy.BEST VALUE for 32 GB.,Worth buying.,Good product,Good one...Lovely design,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51IP02tmcwL._SY88.jpg,Value for money. Nice branded product,Value for money (speed is approx 13mb/s),It was a value for money purchase but it was not up to the mark. The transfer speed is not upto its 3.2Gen 1 Specs.I would say OK Ok. I got it for 249rs. With additional GST TAX Etc. Etc. It's total price was 289rs. I bought it from Appario PVT LTD.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/21e4IoLXBFL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Kingston-DataTraveler-Exodia-DTX-Flash/dp/B08JD36C6H/ref=sr_1_272?qid=1672903008&s=computers&sr=1-272"}
{"product_id": "B00E3DVQFS", "product_name": "Duracell Rechargeable AA 2500mAh Batteries, 4 Pcs", "category": "Electronics|GeneralPurposeBatteries&BatteryChargers|DisposableBatteries", "discounted_price": "₹879", "actual_price": "₹1,109", "discount_percentage": "21%", "rating": "4.4", "rating_count": "31,599", "about_product": "Duracell Rechargeable AA 2500 mAh batteries are our #1 longest-lasting per charge (for rechargeable AA size, per charge in same device)|Duracell Rechargeable AA 2500 mAh batteries stay charged for up to 12 months, when not in use|Unused Duracell Rechargeable AA 2500 mAh batteries are guaranteed to last 5 years|Duracell Rechargeable AA 2500 mAh batteries come pre-charged, ready to use|Duracell Rechargeable 2500 mAh AA batteries can be recharged 100's times|Ideal for wireless video game controllers, baby toys, wireless electronics and more|They are available in AA 2500mAh and AAA 900mAh sizes", "user_id": "AGC2PMSRLC3GK54AGSC3K4VQRNJA,AE6JJW7YL5O4AMNXCKPOXXC6PA3Q,AH4Y6H6PRTHH24FVECTXBUOCALYA,AELPPLMH55RVXKCSXTVPBOVOIX2A,AGOFVAWAS7B25ZHWYBLYIXX6FXBA,AG4HRUL6S4S7W4SSANHGXJKEBNKQ,AFI6J7FM55FQVJBAEQHVPNNQSKQA,AH3HPLFU4X7HBCFKBJZU2NOF24XQ", "user_name": "Rajendra Singh,SUBRATA MUKHERJEE,Abhay Meshram,bahlung,Pragnesh Patel,Mithu khan 9732,Koushtub goel,Rovin Singh", "review_id": "R2JBBXANAGGS7E,R1YGEHICFHX12U,R3HUGR7IWPGRAN,R1KVE2R9JJGTG,R1F56P7OJH1IMZ,R3AWFIALUK2HLQ,R2LMBFFKJ27EKX,R175DY4RNX6VZB", "review_title": "Good performance,Good backup,Good,Slightly larger than ordinary AA,Good product,Good product,Less durable,2 Year Old Product Delivered..", "review_content": "Using it from last 4 or 5 months. Each cell running long, fast charging..,Newly purchased, Giving good backup,Thanks.,I bought this for my point and shoot camera, I've been using use and throw Duracell battery which work perfectly. But when these arrived they don't fit in my camera. I ask amazon for a replacement thinking they could be defective, when the replacement arrived, the same thing happened. The batteries wont fit in my camera. Thinking my camera must have some problem I bought ordinary AA (non-rechargeable) from nearby shop and they fit inside nicely. I've added a photo to compare the slight size difference too. So keep in mind about this if you plan to buy.,Good product,Very good product,but seller don't send me product bill, then how to claim my guarantyee this product..over all good product.,Company claims more than its actual durability,2 Year Old Duracell Battery Delivered. a new level slip is inject with old level slip.. old level slip Mfg Date Is 11-2020", "img_link": "https://m.media-amazon.com/images/I/41PBiq0KGUL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Duracell-Ultra-5000688-Rechargeable-Batteries/dp/B00E3DVQFS/ref=sr_1_274?qid=1672903008&s=computers&sr=1-274"}
{"product_id": "B0B4HJNPV4", "product_name": "pTron Solero T351 3.5Amps Fast Charging Type-C to Type-C PD Data & Charging USB Cable, Made in India, 480Mbps Data Sync, Durable 1 Meter Long Cable for Type-C Smartphones, Tablets & Laptops (Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹199", "actual_price": "₹999", "discount_percentage": "80%", "rating": "3.9", "rating_count": "1,075", "about_product": "Universal Compatibility: Solero T351 USB charging cable connects USB Type-C devices with USB Type-C devices like laptops, hard drives, power banks, wall chargers, car chargers, etc.|Ultimate Speed Charging: The built-in superconductivity copper wires enable a secure and real 3.5Amps output to charge your device at a super-fast charging speed.|Fast Data Sync: Comply with USB 2.0 Type C standard, this USB 2.0 C to C cable support data transfer speeds up to 480Mbps, which allows you to transfer 100 songs every 5 seconds.|Ultra Durability: Connectors with molded strain relief enable this Type-C cable to resist 10,000+ plug and unplug tests. Premium PVC cable exterior enables it to withstand 10,000+ bending tests.|1 Meter Long: Engineered & tested for compatibility with all USB-C devices, ensuring safe charging. Its flexible design offers users a tangle-free experience. 6 months warranty from the manufacturer.", "user_id": "AF477BP57JM7Z4JD4PYB2K33R6AQ,AGTDD34Y77OB36JNYQWQDN7MHECQ,AG7POKBSWQUO4VOYD4HDWYKMMJ4Q,AFZS6H2ZFJEJHRWIJ3IYL7V6KRPA,AHCYM2ECKI2MNOIDHDG4PT6IIN6A,AECZ4IP3TBM4EUG52BZAOQV3EKIA,AH6RQDXZYKAUPNBOYC4NAZERTFOQ,AFTVETL4HGH4KRUF4NXGJUEDPBAQ", "user_name": "Placeholder,श्रीPKजी,Gauri salkar,aQeel,Ashish Raj Arora,Ankit,Amazon Customer,Ramamoorthy Jaykumar", "review_id": "R1Q323BB35OP30,RJ0CSQUUWFF9W,R23OB4XMH3S9QD,R1K5FQR6CYMQAV,R3QMD6JDUGQUCI,R1R5LTMWOXI38M,R241G3F07D3OBH,R1O7BQ61DXRVWW", "review_title": "The metal pin is losing it's strength,Sahi h bs 44 rupe ki and dilivery charge 40,Good Charging cable,Good sturdy micro usb cable with good charging speeds,Cheapest micro USB cable in the market,boat is better than this,I bought this for 199rs best charging cable for all mobiles,Good", "review_content": "It's a good data cable and I recommend it to purchase,the only issue was the metal pin is not fixed firmly so it has become loose,otherwise no issue,must purchase,https://m.media-amazon.com/images/I/615SgnWv1ML._SY88.jpg,Charging cable which is sturdy it's not a fast charging cable but the three outlets does the job.,Good sturdy micro usb cable with good charging speeds. Please don't raise prices,Nice product, a simpla microusb cable,😂,Best for this price,Good one", "img_link": "https://m.media-amazon.com/images/I/41wN7jooz0L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/pTron-3-5Amps-Charging-480Mbps-Smartphones/dp/B0B4HJNPV4/ref=sr_1_275?qid=1672903008&s=computers&sr=1-275"}
{"product_id": "B00BN5SNF0", "product_name": "ENVIE® (AA10004PLNi-CD) AA Rechargeable Batteries, Low Self Discharge, AA 1000mAh Ni-CD (Pack of 4)", "category": "Electronics|GeneralPurposeBatteries&BatteryChargers|RechargeableBatteries", "discounted_price": "₹250", "actual_price": "₹250", "discount_percentage": "0%", "rating": "3.9", "rating_count": "13,971", "about_product": "Functional design: International Standard universally compatible 4 pcs of rechargeable Ni-Cd batteries. Batteries needs to be charged before first use|Capacity:Best in Industry 1000mAh capacity batteries with no memory effect so they can be charged or discharged as needed without loss of capacity|Discharge: Batteries are equipped with low self discharge mechanism to hold charge upto 80% for 12 months without use|Compatibility: Envie AA Batteries are compatible with numerous devices including Remote Controls, Electronic Toys, Flashlights, Torches and various other devices. Batteries also support Quick Charge mechanism which can be done via any smart or quick charger|Environment friendly:Envie batteries provide you a safe and stable highy protected environment friendly energy solution", "user_id": "AEF5RCDWM36RUTBBON7LXA26PTCA,AGLAZIZLDXX7FKDCSJ6ZLKSHW47A,AGUL3ZHFKXB2FHBKW6EMPCOZBV6A,AGGJYZTRMD5LELUKQE5ZNVQ326BA,AHTOUZO3OWX3CDI6OWWD2QY3NYWQ,AHY7SA7H5WSKZPBFECKTY6UWHFAA,AFE7A5UHWCAOYQVYDUDDHOUJFMMA,AHXG6CXWUZKDMM5DNC6BELMP26QA", "user_name": "अशोक वैष्णव,Satish,KBK,rajendra,BuyerOfProducts,Manjush Mohan,M.A.SAMAD KHAN,laxman pallikonda", "review_id": "R2VFXFP75ZPQF6,R31BYR22O09BLQ,RKMFDAV9I8Z3,R3VO2OQU0NX1GE,R3H4WLHQYRTZ3H,REW2CYD532JB3,R1QTUL5N1ZE9S3,R15FMRVH2UDP2X", "review_title": "कुछ खास नहीं बस ठीक ठाक है,Not good for regular use,pathetic battery back up,good,Does as it should,Very pathetic battery - never buy,Worth buy,Good, but 1.2 v please check when buying", "review_content": "बैटरी के रेट ठीक हैं डिलीवरी ज्यादा है 40 रुपएटोटल 290 ₹ देने पड़े,Charging does not last for more than 3 days with out use after full recharge,battery does not last even one week even in wall clocks,charger is not good because no idicate light after battery fully charge,Get higher wattage..... 1000 too less and required constant charging.,Not even last for 1-2 month in wall clock . Battery leakage is another problemPls don't buy and waste money instead go for good mah and good brands,I have tried changing once only it's ok,1.2 v please check when buying", "img_link": "https://m.media-amazon.com/images/I/41tcZ6fcJML._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Envie-1000-4PL-Ni-CD-Rechargeable/dp/B00BN5SNF0/ref=sr_1_276?qid=1672903008&s=computers&sr=1-276"}
{"product_id": "B09SGGRKV8", "product_name": "ZEBRONICS Zeb-Buds 30 3.5Mm Stereo Wired in Ear Earphones with Mic for Calling, Volume Control, Multifunction Button, 14Mm Drivers, Stylish Eartip,1.2 Meter Durable Cable and Lightweight Design(Red)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹199", "actual_price": "₹499", "discount_percentage": "60%", "rating": "3.6", "rating_count": "2,492", "about_product": "Get the detailed trebles, thumping bass and warm tone vocals with the ZEB-BUDS 30 3.5mm stereo earphones. The 14mm drivers are designed to deliver audio suitable for all users.;Compatible with smartphones, tablets, Laptops etc.,|In-line microphone supporting calling function, so you can take calls on the go with just a single button click.;High quality microphone provides you with clear audio while on calls.|Control volume with the easy to use volume control buttons, provided along the in-line control pod. It also has a multifunctional button to play / pause / control calls.;Get the advantage of 1.2 meter long and durable connector cable, to connect with Laptops and tablets.|Enjoy music, movies, games and binge watch series for long hours, with the comfort of lightweight and stylish in-ear designed eartips.;The earphone has a cable management joint, so you can wear it without tangles.; Available in multiple color variants to suit your style.|Warranty Description: 6 Months; Size Name: Free Size", "user_id": "AFOBWTUOP4PHZ5K7XW4SPJWKDIKQ,AFYMFZN2MFKODDI25OZKLO36LCHA,AFRJ7RO4QSGVXMGOMAYKDF4NV5GA,AHH3N6GR7D7M2TQEMQ2YQZ6E3VSQ,AEWMKIKL7BPEMHC27IUYWYM2T7IQ,AEE7B7WVQ7D4AVZ3PNCXJEA36ZWQ,AGJ7O6CXXXUN72WOV5JID7X7ZBMQ,AFFDNRHZZZB4RCDML523QW3BV24A", "user_name": "Kohana,Sameer,Rishabh singh,Sourav Ghosh,SUBH,N T HARI HARAN,Gurujeetsingh Pardeshi,SB", "review_id": "R3H500MXJWRGI,R23WZ2PU1E2ZTM,R26VZERXGYOH61,R6BH0WP7AU7K5,R3Q5DCTI9MGLIN,RKLM5089QQVNH,R12GPK5AS5ZUZN,R1DMSSN400Y30K", "review_title": "You want to buy an apple-like earpods w/o having to pay the apple price.,Fragile!,Nice auido quality but poor build quality,LOW BUDGET PERFECT CHOICE,It's good,decent purchase,Worth it,Good for the price.", "review_content": "Then this one is for you. It's actually well made and the colour options are pretty catchy. I basically wanted some no silicon tips wired earphones for laptop& cell phone calling. Didn't want to pay more than necessary when I saw these for 200/- grabbed them cause I saw some pretty good reviews and honestly they are good for the money. Love the design. The volume buttons work. Good for casual music sessions. Mic is good too.,They are very good for the price point. But the build quality is just bad. I bought it because it had volume control, even high end earphones lack those nowdays. But the button enclosure feels like cheap plastic and will break easily. It has huge drivers don't get me wrong 14mm for earphones this price is no joke. The bass is also quite good. Go for it only if you have budget restraints.,The quality of sound is good but it's build quality. The wires are very delicate and prone to get bend and break,Sound Quality-GoodMicrophone Clearance-GoodWare Quality-Good & long ware.Design-GoodI Recommends to you....Only i believe amazon.... They will never broke my trust.,Best product in this price.,decent one for the price. so far no issues,Totally worth it ☺️,a Bit loud and the cables are very thin. But for 199 it's good .", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31CndDabh2L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zebronics-Zeb-Buds-30-Multifunction-Lightweight/dp/B09SGGRKV8/ref=sr_1_278?qid=1672903008&s=computers&sr=1-278"}
{"product_id": "B07XLCFSSN", "product_name": "Amazonbasics Nylon Braided Usb-C To Lightning Cable, Fast Charging Mfi Certified Smartphone, Iphone Charger (6-Foot, Dark Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹899", "actual_price": "₹1,900", "discount_percentage": "53%", "rating": "4.4", "rating_count": "13,552", "about_product": "Fast Charge: When Used With An 18W Or Higher Usb-C Wall Charger With Power Delivery You Can Charge Your Iphone To 50% Battery In Just 30 Minutes - Supported Models Include Iphone 8, 8 Plus, X, Xs, Xr, Xs Max, 11, 11 Pro, 11 Pro Max, Ipads, And More. High-Speed Data Transfer: Up To 480 Mbps For Transferring Music, Movies, And More In Seconds|Durable Friendly Design: Built With Top Rated Materials And Tested To Withstand Up To X Bend Cycles And Features Textured Grooves On Connector Ends For Improved Grip|Certified Chip: Apple Mfi Certified Charging And Syncing Cable For Your Apple Devices With Improved Chipset To Ensure Full Compatibility|This Cable Is Not Compatible With Standard Usb Chargers / Laptop Ports. Works Only With Type C Adapters And Laptop Ports. Please Check The Port Of Your Adapter Before Buying The Cable.|Connector Type: Usb Type C", "user_id": "AF2IRSQZKMBGX44YDNUPYRHWXOZQ,AF6VSSXOI3Y4PZCNRJ3L27NCXPYA,AHQKC4MLLVOPBTKJFDBGTXFRKLYQ,AGX5ELLH3KJJ4CY2DJJOXDSOEI6Q,AGJ23TWSY6YFMAVSEAOAUEWO4QLQ,AFOHB4M2RWSUQ3SSZWPMD2FPH6PQ,AFVHKKOI25DAQSETPL7Z5W5SIVUA,AE55WJERHR4C7SEAIWX4JJHFSZBA", "user_name": "Wraith,Krishna Engineering,Kindle Customer,Deeps,Chintada Bhaskar Rao,FH,Vasudev,Done Chandra Mouli", "review_id": "R213ILI3XNVHQ0,R1LZN1V8UCR9IU,R1EBFTZINSJ0LG,R3BKR3VZ1U81LW,R5OJ20F8H5T8U,R1FKQR9LSBVLH2,R3R8UN7IQY7EIT,R2WBDNEW6HCVSH", "review_title": "Good,Worth to buy,Great value for price,Good product,Nice product.,Reliable and worth it!,Much more sturdy and durable than Apple cable,Good", "review_content": "Good budget mfi certified lightly cable for this price . Update usage review after 3 to 5 months .,Better than the original one in matter of robustness and durability. Better in prospect of charging . It is far better in durability from the original apple wire. Do not think more you can buy blindly worth to buy and it is mfi certified so you IOS device not damaged. But small negative point is packaging quality of the product.,The charger is a great carry on accessory while travelling without risking the original charger.Price is also very affordable and charging speed is very good with good adaptor or power bank.,Good product , can recommend all , only thing I see as issue is the material,, the cable threads peels off when stick to a Velcro materials. Other wise good product, charges very well like original,Nice,Reliable and worth it,The cable shipped in box made by Apple felt less sturdy and reliable after using one or two times and felt it would break more quickly at the lighting port and had to order Amazon basics cable which is miles better and apple MiFi certified,", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/3183iGEWksL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AmazonBasics-Apple-Certified-Lightning-Charging/dp/B07XLCFSSN/ref=sr_1_279?qid=1672903008&s=computers&sr=1-279"}
{"product_id": "B09RZS1NQT", "product_name": "Sounce 65W OnePlus Dash Warp Charge Cable, 6.5A Type-C to USB C PD Data Sync Fast Charging Cable Compatible with One Plus 8T/ 9/ 9R/ 9 pro/ 9RT/ 10R/ Nord & for All Type C Devices – Red, 1 Meter", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹199", "actual_price": "₹999", "discount_percentage": "80%", "rating": "4.0", "rating_count": "575", "about_product": "[USB C To USB C Cord 1M] With This 1 Meter USB C Fast Charger Cable, You Can Enjoy Convenient Charging for Your USB C Laptops, Tablets, And Smartphones. Perfect For Used on Sofas, Beds, In the Car, And Other Places.|[6.5 Amp USB C Cable High-Speed Data and Charging] Our Type C To Type C Cable Perfect Match with All 60W 45W 30W 18W 15W USB-C Power Adapters, Support Pd 3.0 And Qc 3.0 Fast Charge for Your Devices. Data Transfer Speed Is Up To 480Mbps Of USB 2.0. Note: Not Support Video Transfer.|[USB C To USB C Fast Charging Cable 6Ft] This Newest USB C To C Cable Support Warp Charge For One plus 8T, One plus 9/9 Pro, Too Fast Charge For MacBook Air 13 Inch 2020/2019/2018, For MacBook Pro 13/15/16 Inch 2020/2019/2018/2017/2016, For iPad Mini 2021, For iPad Pro 12.9/11 Inch 2020, For Google Pixel 6/6 Pro/5/4A/4 Xl/4/3A Xl/3A/3 Xl/3/2 Xl/2, For Samsung Galaxy S21 Fe 5G/S20 Fe 5G/Note 20 Ultra/Note 20/S20/S20+/S20 Ultra, Galaxy Z Flip 3, Galaxy Z Fold 3, And More Devices.|[One plus 8T Warp Charge Cable] Wrapped in Premium Silicon Coating, High-Quality Pure Copper Core, Prolong Bending Lifespan. Both USB C Connectors are Designed with An Advanced Emark Chip for Higher Efficiency & Safer Charging for Your One plus 8T. Output Delivery At 6.5A 10V Max, 65% Charging Capacity Only Takes 30 Minutes, Saving Your Valued Time.|[What You Get] USB C Super-Fast Charging Cable and One Year Worry-Free Replacement! If You Have Any Issues, Please Don’t Hesitate to Contact Customer Service.", "user_id": "AHUH7OYN3LAUATF5EGA575WCDI6A,AFQRX6TAM6CHKARXIXR25X4Y2K2A,AFIAYICSN46TZ373SYU2DLQH7MHQ,AE7O44O3ZCU6YCS56X4UBNSMN2DA,AG7KTA6KY5FALZELPIEMQBXP6TYA,AFW2YA3CWHADWVPZJRCSYJJ2O3YA,AGOGMKLERURWSCD4RIH53WPEVTWA,AHXAYZML25KY3YMOTME234UUGWXQ", "user_name": "Anmol,Vani,Tejas Jha,Rishabh Gupta,Nik,Harsha,Thota Srinivas,Lokesh", "review_id": "RW294SCHB5QTK,R24AGC1O5RVWYI,R3NT7AA2V3I2FB,R2WGLZMFMUHY4G,R34ZQBSQFAGSQB,R26YQ2I8VG8AXE,R1M1FEBTZ4UHXZ,R1QV3OMDYZ42VP", "review_title": "Worth it!,Good one,Robust and effective.,Good,Good,It's a good product under 199 rupees It's neatly packed and has good quality built,Nice product,Worth the price", "review_content": "It does the job really well. No complaints regarding the charging power. At a price of Rs. 199/-, it is worth every buck. Although this cable is a bit shorter than the original one, but the original OnePlus cable is around Rs.900/-. So there is a huge price difference, and it does the same job as the original one.,Useful for “c” type charging. But not suitable with all adapters or USB points. Serves the purpose.,Sturdily built. Does its job well. Charged my Samsung Galaxy M51 quicker than the original cable. Hope it stays the same going ahead.,Liked the charging speed disliked the length. On iPads this is awesome but it’s is not 6 foot long so this the only point to think otherwise it is the best cable,Good,Everything is good including connectivity and stuff,Nice product..im using this for my car,This product is nice and worth the amount...I recommend it to anyone who are looking for this kind of cable", "img_link": "https://m.media-amazon.com/images/I/41P2EdQI1ZL._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Sounce-Type-C-Compatible-Smartphone-Charging/dp/B09RZS1NQT/ref=sr_1_280?qid=1672903008&s=computers&sr=1-280"}
{"product_id": "B084BR3QX8", "product_name": "LAPSTER Accessories Power Cable Cord 2 Pin Laptop Adapter and Tape Recorder 1.5M", "category": "Computers&Accessories|Accessories&Peripherals|LaptopAccessories|LaptopChargers&PowerSupplies", "discounted_price": "₹149", "actual_price": "₹999", "discount_percentage": "85%", "rating": "3.5", "rating_count": "2,523", "about_product": "Compatable with Philiphs tape recorders and Emergency light charging|2 Pin Laptop Adapter and Tape Recorder laptops adapter, Camera, Printer, VCRs, DVD Players, and many other non-polarized devices|Note: - Not for trimmer", "user_id": "AGI4CCISF6KU62HQAT2VM4GNNNJA,AFRVEW4OKSGZ2FNKMBGZK6CXRLHQ,AH6KDBZ4SDILJZNKGSFMW3NOWMGQ,AFHBK5CYQFTCGBI3AI5RVFZ5XCVA,AGWF4RTHPA35XFXCZZGOORF3KOTQ,AFU6A2VUU2NNOTDQNVKBCY7B5ISQ,AGBFCJ255MTTPSXYPTKWN7BLY6BA,AGB4BQGMMGUSJ2SMZJDCF7WTQSQQ", "user_name": "vinu,Goutam Banerjee,Rajeesh P,Sheeja Mol,Suman,anupam kumari singh,Sourabh,Amazon Customer", "review_id": "RTD1L3LGGMBG3,R1C6Z9AXP9ICQM,R3IAQHMHSD92O6,R1SH5KG6YVLJ0H,R2ST8W6PO0TBDR,R1SD1W9T3GM23X,R3J5HRLH5MG85E,R302A87U6XE21L", "review_title": "very good product,The replaced item is fine and working good,Nice experience,Good Product For PlayStation,Poor insulation,Nice,Serves the purpose,One of the pins were broken", "review_content": "good product value for money,,Good product,Works Well With PlayStation 3, Must Try.,It shorted from the inside. There was no visible damage outside but the cable shorted from inside and sparks started to fly during ordinary use,Nice,Looks sturdy and better quality than the market ones,One of the pins were broken when received and I could see that inside the pins its not metal instead looks like porceline and outside alone a thin ss covering is given. poor quality", "img_link": "https://m.media-amazon.com/images/I/41Cdc4mU7RL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/LS-LAPSTER-Accessories-Adapter-Recorder/dp/B084BR3QX8/ref=sr_1_282?qid=1672903008&s=computers&sr=1-282"}
{"product_id": "B09VC2D2WG", "product_name": "Portronics Ruffpad 12E Re-Writable LCD Writing Pad with 30.4cm (12 inch) Writing Area, Single Tap Erase, Smart Lock, Long Battery Life, India's first notepad to save and share your child's first creatives via Ruffpad app on your Smartphone(Black)", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|GraphicTablets", "discounted_price": "₹469", "actual_price": "₹1,499", "discount_percentage": "69%", "rating": "4.1", "rating_count": "352", "about_product": "[LATEST IMPROVED TECHNOLOGY] : Portronics New RuffPad 12E LCD Writing Tablet uses the Newest LCD pressure-sensitive technology and lets you draw thick and thin lines as per your preference based on the pressure on the stylus. It comes with a large 12 inches display. The LCD screen is totally safe, radiation free, glare free, non-toxic, light-weight, comfortable and perfect in your or your little one’s hands.|[REUSABLE & ENVIRONMENT FRIENDLY] : The RuffPad 12E lets you do your bit for the environment by saving paper, pencils and erasers but it does not make you compromise on your creativity. The RuffPad 12E is erasable and re-usable making it the ideal tool for you or your child to harness their creative self. Use it to cultivate children's writing and painting ability and interests.|[LOCK FUNCTION] : RuffPad 12E comes with and Anti-Erase Lock button that helps you save your or your child’s precious creations and prevents accidental deletion of your written / drawn contents or drafts.|[SAVE YOUR DOODLES] : Keep creating and saving your doodles on your smartphone with the Ruffpad available in the IOS and Android stores to look at your notes and doodles from your smartphones.|[GREAT FOR ALL AGES] : RuffPad 12E can be put to multiple uses no matter who you are. It is a must have for kids, designers, office goers and is ideal for gifting. Children can use it for writing, arithmetic, spellings or to learn to draw and doodle. Adults can use it to take notes and memorize important information in office. Designers can use it to save their ideas and drafts, no matter where they are.", "user_id": "AE376Y5V3WTFCERMS7ZVYUZCFNUQ,AF5GSV6GVHTLGBTN2NIS23BQN7HA,AEQ57W6KFWU72BECDAK5CJ3OML5Q,AEZLUYRORWZXFHOSF2KN4GKOOATQ,AGNLOWKPE2OQVARLP6ZDG5ZHQQUQ,AFQBZXNFOTEDURZEUQ4GBITKZ7CQ,AFQZ4Z5IE2BDZPQJ7OBQS6FXMWZQ,AFY2KVXOARKAYSSSHYAZXMKB7ZKA", "user_name": "Manish Kumar Pandey,Kayal,Nilesh kamble,Princedarji,AMIT PORWAL,Naman Khokhar,Rohan Narvekar,Yusuf Saifi", "review_id": "R2IVS0EXZ8BPG6,R2QAT75MT7S765,R383L7XTQG2UD9,R1NGVP9RH0O5FM,RGCUCD1BJZ3QB,R11NVDOMRAN1N9,R4JGI2NFX4AOT,RL8266FZ4TCDG", "review_title": "Fine for beginners but brightness is low ...increase brightness ..,Good,Size and brightness,It is good for rough work,Very nice & satisfactory,Very low brightness,Na,Nice product for this price", "review_content": "Achha product hai ...thoda brightness badhane ki jarurat hai ...,After heavy usage for 10days,Pros:1.Battery last2. Brightness depends on the brightness of the place we're using it3. Smooth and Addictive4. Attracts you to scribble something on it5. Best time passMy 3years old boy loves to doodle so to avoid him scribble on everything I bought this for him. Now he lovesssssss to write on it. While other children addicted in mobile📱 I'm proud of my kid 😂 but the misfortune is... It addict everyone so when my son busy playing with other toys we started using it.Cons:1. Color started fading i could see some dark blue at bottom as it's somewhat green colour while writing.2. If we write our palm will be visible in this slate. it's really a drawback. Even if we cautious about it, we're helpless.3.Delete button print gone in a day4.Easily get scratch,Size want to big and need more brightness over product is awesome,I like this product,Very nice & satisfactory,Brightness is very low and depends on the ambient light in the room. Otherwise a great product.,Na,It’s a nice product to use and save paper and for this price range I guess it’s the good option.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41t4-FpawsL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Portronics-Ruffpad-Re-Writable-Writing-Battery/dp/B09VC2D2WG/ref=sr_1_283?qid=1672903008&s=computers&sr=1-283"}
{"product_id": "B09163Q5CD", "product_name": "Verilux® USB C Hub Multiport Adapter- 6 in 1 Portable Aluminum Type C Hub with 4K HDMI Output, USB 2.0/3.0 Ports, SD/Micro SD Card Reader Compatible for MacBook Pro 2016-2020, MacBook Air 2018-2020, Type-C Devices", "category": "Computers&Accessories|Accessories&Peripherals|USBHubs", "discounted_price": "₹1,187", "actual_price": "₹1,929", "discount_percentage": "38%", "rating": "4.1", "rating_count": "1,662", "about_product": "[ 6-in-1 USB C Hub ] -- Verilux USB C hub comes with all the basic features you'd expect, including 1 x 4K@30Hz HDMI port, 1 x USB 3.0 Ports, 2 x USB 2.0 Ports, 1 x TF card slot, 1 x SD card slot. No software and drivers are required, plug and play. This USB C hub turns your device into a mini workstation, providing you with a sleek and productive study space or workspace.|[ Ultra HD 4K HDMI Video Transfer ] -- HDMI port supports a large screen Liquid crystal TV or displays compatible with 4K Max output. Mirror or extend your screens and directly stream video to HDTV, monitor, or projector.The full functional USB-C hub is compatible for PC, laptop, iPad Pro, Samsung Phones, and some tablets. Step into a new world with vivid 4K images, enjoy the immersive gaming experience on a larger screen through this Type-C hub.|[ Super Speed USB 3.0 & SD/TF card reader ] -- USB 3.0 offers an ultra-fast transfer rate up to 5Gbps, files would be transferred in seconds.USB 2.0 ports,you can connect keyboard, mouse, or thumb drive to your USB C device.Built-in SD and TF slots easily access files from universal SD card and Micro SD card;(Note: Don't support 2 cards reading simultaneously.) With the highest speed, it is easy to transfer photos shooting or videos by your camera from cards to the laptop in seconds.|[ Universal Compatibility ] -- Verilux USB C HUB is compatible with the latest laptops, tablets and smartphones with USB-C connection: MacBook Pro/ MacBook Air 2018/2019/2020, for Google Chromebook Pixel 2016/2017,for Dell for XPS 13/15,for iPad Pro, for Samsung Galaxy, etc.If you have any questions, please do not hesitate to contact us.(Note:Support Macbook M1 chip,but not support M1 Pro chip&M1 Max chip)|[ Ideal on the Go] -- This compact and slim Verilux usb c hub is your ideal work helper during the business trip. Take your USB multiport hub with you wherever you go. Light weight, compact travel format, easy to carry in laptop bags or backpacks. The anodized aluminum surface looks stunning, and it dissipates heat fast and safely. Plug and play, no software or drive required.", "user_id": "AEKIHWXMZFS67F2COXCDUERH5PXQ,AEEOKIYMOYNGBWPWP3FJDCRYUCMQ,AFSV27BUBBO4RXKL2XTBKTIPEOSA,AER7VVMGX6M6QAMBZFMCQ6A7MZAA,AE5GTUXFCCPSGKHOEKPPBZXXFH3A,AE23WGYTUMB5R6JJMBU4V43JIW7Q,AFNMQJFHA6ZOCOGA7SINBVYAUIPQ,AEXW3VTOJOMHJUJV5ZQILFLJYNQQ", "user_name": "Vignesh,Aniket,Nitish Kumar,Amazon Customer,Yusuf,Nageswararao,Ashish,Bhupendra", "review_id": "R2OQSICTGUIV9L,R972JSI8VWR33,R135GA3VHX1SD1,RCK3L91V5KB3H,R344OPOOMTSVT8,R2QZCWEELOUVY0,R1CSJT44WVD786,R3UFTGEYELMOS2", "review_title": "Value for money.,Value for money,Price could be lesser,Ideal for new MacBooks,Average and overpriced,Meet the expectations,So I got the product on 11th August 2022. This is the initial impression of the product.,Ok ok product", "review_content": "Used for more than a month. Works (HDMI, USB) well so far. Not tested the MicroSD slots.,Build quality is great. I'm using this with my MacBook it works fine . While using this adapter Amazon prime videos can't play in 1080p resolution on monitor it says the devices not support hd . Other ports are working fine not a problem.,I took this for my macbook m2 pro 2022 edition and it is working perfectly,all the ports are working fine till now ,it's been 2 month i am using it , length of the wire is little small it could be little big and the price is also little high it could be under 900rs ,then it will justify.,If you bought a MacBook Air or Pro recently and wondering what to do about all the missing ports - USB, HDMI etc, this is your one stop solution.I tried on my MacBook Air M2 and it works like a charm. I connected, various pen drives, disk drives and a 128 go flash drive - all worked fine.Very reasonably priced compared to other options, yet has a fairly good look and feel.,Everything working fine but it doesn't works with Macbook's HDMI when try to connect one plus TV as an extended screen( different displays on both) but works fine if used as second screen with common display.,Solved my problem,I got the product on 11th August 2022. This is the initial impression.1) Packaging - The package I received was in good condition. it had a pre wrapped plastic on the box. No complaint about packaging but one thing to note is that 'No Brand name on the packaging.' Although when you open the product , the brand name is there on the product.2) Build - Wire length is small to my opinion. It has a metal build finish and looks premium and sturdy. Wire quality is also good but at this price should have provided braided cable.3) I have tested this product with 3 usb ports connected - a) Mouse b) Keyboard c)External 2TB SSD. SSD does not get disconnected when all 3 usb are connected. For confirmation i did a 2 gb file transfer and No disconnections were noticed.Note : The Speed of the data transfer is low. I did 2 gb file transfer and was getting the max speed of  39MB/s with the SSD connected through the usb hub.Although when I did the same file transfer by directly connecting the SSD to the laptop port, i got speed of 111 MB/s. So if you want to do lot of file transfer better connect it directly and not through the usb hub.So far initial impression are good, let see how long it last.,Sometimes not detected by MAC and quality is not that good", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41qTZXl3KaL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Verilux%C2%AE-Multiport-Adapter-Portable-Compatible/dp/B09163Q5CD/ref=sr_1_284?qid=1672903008&s=computers&sr=1-284"}
{"product_id": "B08K9PX15C", "product_name": "Zebronics Zeb Wonderbar 10 USB Powered 2.0 Computer Speaker with RGB Lights", "category": "Computers&Accessories|Accessories&Peripherals|Audio&VideoAccessories|PCSpeakers", "discounted_price": "₹849", "actual_price": "₹1,499", "discount_percentage": "43%", "rating": "4.0", "rating_count": "7,352", "about_product": "The 2.0 speaker has a versatile design that can be used in 2 ways either it can be set as one horizontal soundbar unit or as a vertical 2.0 speaker setup that not only makes the design very efficient but also hasslefree.|USB Powered. Frequency response: 100Hz-18kHz|Volume control, Separation ≥50dB|RGB lights|3.5mm Earphone/mic compatible. Note : Connect the usb side to either laptop or through adapter to any power source and 3.5 mm pin to music source. For detaching the the speaker they just need to slide the product that will result in 2 satellite speakers .|The 2.0 speaker has a versatile design that can be used in 2 ways either it can be set as one horizontal soundbar unit or as a vertical 2.0 speaker setup that not only makes the design very efficient but also hasslefree..S/N Ratio ≥60dB|USB Powered. Frequency response: 100Hz-18kHz", "user_id": "AFC7Q5Q64XM2Y64FT7Y3L2YVALRA,AG7C5TFPIBMWQQC2SY4UPPRF6T6A,AEV3DHIQIEUNDUMXEPHJBVZ3VMHQ,AF7WOI76RSO6HPHORY46KHV2KARQ,AGLMQEABF4OCKPYA6Y4H6ITQQMXA,AEEXZXEWCWYDJLF6GTCY2Z26BNCQ,AEBEEV5D2QU7YGXUN4BJIK4UUFMQ,AHGY7QPVZJPTLRLC4ZAY2N4EISNQ", "user_name": "Balamurugan Trivandrum,prathmesh sawant,Praveen Stakez,Dhananjay Thackeray,Gyan Bhooshan Dubey,Ranabindu mondal,Nilesh,Ganesh S A", "review_id": "R2USVKN5VQX7ZL,R36O11JTBG8NKH,R1OC5OKQ1ZHRT4,R1DSMD8RKWG5SN,R1NRFX7JSECICX,R37FILR40ZQ5CU,R2XJMXNKVIUUL5,R3AGSJ4P5W4OG4", "review_title": "Nice product from Zebronics... Using for laptop,Gr8 product need more sound quality,Sound,Best Product 👍,Sound bass,Value for money. Wired and aux quality is poor,Compact speakers for PC/Laptop,Worthy for our money", "review_content": "Zebronics Product is always good. I bought this product for my laptop and using everyday for watching movies, hearing Songs...,,The sound is awesome as I recommend this for music purpose as it has medium base but rest of all its awesome,,Sound quality is good .....laptop mai aacha use hota h ....mobile se bhi connect ho jaata h ...pr Bluetooth ni h isme ....charging cable bhi h isme ....mtlb 2 usb port chahiye chalane ke liye,,Wonderful and compact speakers for desktop setup. It completed my gaming setup as my monitor dont have in built speaker was in search of good speakers. These are good in terms of gaming, binge watching or any purpose. liked the design as it splits in to two which gives good sound effect. Totally worth the price.,Good product and good quality.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31ikDjsSOML._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zebronics-Wonderbar-Powered-Computer-Speaker/dp/B08K9PX15C/ref=sr_1_285?qid=1672903008&s=computers&sr=1-285"}
{"product_id": "B083RD1J99", "product_name": "HP Wired Mouse 100 with 1600 DPI Optical Sensor, USB Plug-and -Play,ambidextrous Design, Built-in Scrolling and 3 Handy Buttons. 3-Years Warranty (6VY96AA)", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹328", "actual_price": "₹399", "discount_percentage": "18%", "rating": "4.1", "rating_count": "3,441", "about_product": "Work on your terms with an ambidextrous, contoured design suitable for both left and right-hand use.; Wire in within seconds with quick USB plug-and-play connectivity.|Experience astounding accuracy with 1600 DPI optical sensor that works like a charm on most surfaces.|The control is in your hands – get clicking seamlessly with 3 handy buttons and built-in scrolling.|In it for the long run - enjoy 3-years manufacturer warranty on the device from the date of purchase.|Operating System: Windows 10", "user_id": "AFTUS3YZBNWUVW7FV7AQ4O532UNQ,AGREMFD5IKQE5NK2YCOQ4XNUTUDQ,AHHCU7EJOMSMPWWIYKX5AYZMZL4Q,AFMCUIC3C5CHX6MWTMK6NM5UDCLA,AGA3HQYJUDXUSMKY2XA7VMWANUWA,AFPORMGJWOHUS73RCALK7AQLVLSA,AE4YLPCDLNTQVAY55PYV3LYJYUSQ,AF7LYQTIS45CKK5MJKT4D2B7VWAQ", "user_name": "Rakesh Roshan Koul,Vikas Kushwaha,GR Talwar,Sunil Yadav,Amazon Customer,Aarav Agrawal,Tushar Jain,Amazon Customer", "review_id": "R28LVJV0VALRCQ,RUMWHXUP5WKO2,R3D5OM30BEDYE0,R2X9E8CREU3PI8,R1DWE4B2XWK08G,R27HOGDG67KNQO,R1QYLVRY3M6HLE,RA2K9X6CPRLS3", "review_title": "Good Quality Mouse,good,Good product for its price and warranty.,Not the best but does the job,Okayish,Go for it,really a good mouse in 250,not proper size ,it should be Littel big", "review_content": "The product is working smoothly with soft slight clicks. Lookwise is stylish at some extent. Handy in use, portable and flexible product. Better product at this price range. If you are looking similar product at this budget then go for it. This is just the initial review at this time. The detailed review will post soon depending on the usage and work. But at this time, I recommend this product.,good justiff its price,Bought two mouse both of them were delivered on time. I have been using them for few months now and they are working fine. Comes with the basis functions, built quality is good and you get 3years warranty which is great for the price.,Ok for normal office use.,Wouldn't say great but okay for the price tag. Overall good for work purposes.,Its a very nice mouse, giving me above 25 cps,And yeah if youre looking for a cheap gaming mouse than go for it. The build quality is very good and having a matt finish.,i got this in 250 and definitely in 250 it works very good, the wire is also long enough and if you love wired mouse....it is good in 250,not proper size ,it should be Littel big", "img_link": "https://m.media-amazon.com/images/I/214VmJYxx9L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/HP-Wired-Mouse-100-6VY96AA/dp/B083RD1J99/ref=sr_1_286?qid=1672903008&s=computers&sr=1-286"}
{"product_id": "B09Z7YGV3R", "product_name": "Anjaney Enterprise Smart Multipurpose Foldable Laptop Table with Cup Holder, Study Table, Bed Table, Breakfast Table, Foldable and Portable/Ergonomic & Rounded Edges/Non-Slip (Black)", "category": "Computers&Accessories|Accessories&Peripherals|LaptopAccessories|Lapdesks", "discounted_price": "₹269", "actual_price": "₹699", "discount_percentage": "62%", "rating": "4.0", "rating_count": "93", "about_product": "LARGE, STABLE, PORTABLE FOLDING TABLE: The folding size of our laptop desk is about 60cm(L) * 39.5cm(W) * 27cm(H) such that it fits upto 11-17inch laptops and also a space for mouse. Built-in iPad stand groove for holding ipad or kindle. Our table comes with a table cup holder to keep your favorite drink within reach.. Size Name: Medium", "user_id": "AGSPAJCL6J6YDXIAPE76RI7HR5AA,AFU6BZRZSMJBHGEYA6E7O2UZEWXQ,AEZ56Q4ETISVJMCTD6W2Z672HIPA,AFBQMEOHKDRW6CJJFN2X6BVFQ2XQ,AEUDP3SKTHEQV7VQ7TV6PCVWJUMA,AG5OWHWYJUE7GK5HV47FTXCLUL4Q,AEADGYDCRKJZHYV73SEXX5CODVVQ,AFEPF3H7CZCWZW2M4ZVRLD7HTTIA", "user_name": "varshini Mani,giri babu,priyanka singh,Geethanjali Arivudainambi,Aftab ahmed,Zahwa Husain,Amazon Customer,Raghu", "review_id": "R3VZ6Z283J13QS,R1A8F37C7OKF8,R2RQS98AMZ4NJG,R1DGW1VG83PPCR,RURU97F6DP2YP,RKZFNA3ZOCH42,R2OOZRPNVR6EVK,R4KKHOLNKM7XN", "review_title": "Honest review,Cushion grip is coming out,Mast h ! Jaisi dikh rhi same ayi ,majboot bhi h,PHONE HOLDER IS USELESS,product quality is good as per price u can buy it,Go for it!!!,This bed table is very good. Go for it.,Not sturdy on the bed. Cheap material used", "review_content": "Yeah here is the honest review.... Looking good..Quality is OKAY... Not an defective product... But I'm not satisfied with the phone holder... It is too straight, because understand the reality,every one will like and feel comfortable when the phone holder is little slope...that comfort is not there... And i added the picture of my vision of the phone on the holder...too straight...It is 😣difficult to see and write... The phone holder is the main purpose for what I buy this... But that is not suitable for me...but the quality of the table is good...,Cushion grip is coming out,https://m.media-amazon.com/images/I/71289Z63rOL._SY88.jpg,The tab/phone holder is not useful ...phone/tab holder doesn't give an angular slant for clear view...it also has a small diameter that could not hold broad tab or phone..,quality stability light weight easy to carry  these r some good points of product,,Such a nice bed & studying table. This is very comfortable. You must be buy.,It's not sturdy on the bedMaterial is cheap. Not as expected", "img_link": "https://m.media-amazon.com/images/I/51ucu0nCeSL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Anjaney-Enterprise-Multipurpose-Breakfast-Ergonomic/dp/B09Z7YGV3R/ref=sr_1_287?qid=1672903008&s=computers&sr=1-287"}
{"product_id": "B00N3XLDW0", "product_name": "ENVIE ECR-20 Charger for AA & AAA Rechargeable Batteries", "category": "Electronics|Cameras&Photography|Accessories|Batteries&Chargers|BatteryChargers", "discounted_price": "₹299", "actual_price": "₹400", "discount_percentage": "25%", "rating": "3.8", "rating_count": "40,895", "about_product": "LED indicator: Two LED indicators show the charging process of its corresponding slots but will not turn off once fully charged|OPTIMIZED MULTI-BATTERY CHARGING SYSTEM: Designed for a broad spectrum of Ni-Cd and Ni-MH rechargeable cell sizes, this battery charger comes with LED indicator that shows the charging status of its corresponding slots.|AUTOMATIC CURRENT SELECTION: Compatible with 2-4 AA/AAA Ni-MH/ Ni-Cd types rechargeable batteries this charger automatically selects the charging mode based on battery type and capacity.|HIGH-END SAFETY: This charger is BIS certified which means it provides guarantee of quality, safety and reliability of the product. Integrated high-performance protected circuit automatically short-circuiting.|SUPPORTS INPUT: 220V AC, 50Hz , SUPPORTS OUTPUT: AA/AAA 2.4V DC 240mA , AA20Max2 AA20Max4 , AAA 120mAx2 AAA 120mAx4. It works best with Envie batteries", "user_id": "AGLAZIZLDXX7FKDCSJ6ZLKSHW47A,AFBQNIYHQELPL3AS3CI5Y7MWAJXQ,AHCQZGA4PP2US5BBID5MH7DGIRCA,AHBAFNJWDQVW7JM7YGQOHNOCVM6A,AHJBDYJIPK5LBAZKUJ5QEN2SGAWQ,AGPESJMSSBWG5JO3AUJN4IZKD7TA,AEDY3GIDR2RJL5RYJ3TZYZ5MUJ2Q,AGF22A6YFPOU5427WPDKHGBCDTJQ", "user_name": "Satish,Anonymous,AJIT SHRIPAD GADGIL,Lovejeet Singh Randhawa,jaiganesh,millon das,Jincy Thomas,Venkat Kumar", "review_id": "RXTFUL32UVMBF,RKILLVCVGFROD,R2JYW5X6BHMXBV,R18M0I706P5O3,RCG0RE5G16O10,R1CRK2KTT4Z4C5,R28M2PKJ99LPKF,R35HIF5EVQDYIM", "review_title": "Not as per Description,It's not a 2800mAh battery. It's 1800mAh. They are fooling you with the name,Design problem of getting overheated,It is good medium speed charger,Good,Ok Chinese?,Good,Fast Charging", "review_content": "Batteries does not charge as per the description, I have charge for more than 8 Hrs for full recharge /to be used properly, after the 8 hrs charges the charging does not last for more than 3 days with out use,I noticed when I got the batteries that they are so much lighter than normal batteries and was suspicious. But after using it heavily, this battery runs out so much quicker than my other 2800mAh battery. Then I saw the back of the case and it was written there it is 1800mAh battery.Everything else works fine as intended but I don't think they should be deceiving customers by giving another product and advertising something else. That is fraud behavior. But for price of 1,099 it is justified.,Getting overheated when charging is on for 1 hour fear of getting melted the body,Good mid speed charger,I am impressed,No Chinese goods are my favourite.,I like the product, am using this for keyboard.,Charging the battery in hours time 1.5 to 2 hrsGood to have oneI am using this charger to charge my existing rechargable batteries both AA and AAA", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31Dj+5AQcJL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/ENVIE-ECR-20-Charger-Rechargeable-Batteries/dp/B00N3XLDW0/ref=sr_1_288?qid=1672903008&s=computers&sr=1-288"}
{"product_id": "B07Z53L5QL", "product_name": "ProElite Faux Leather Smart Flip Case Cover for Apple iPad 10.2\" 9th Gen (2021) / 8th Gen / 7th Gen with Stylus Pen, Black", "category": "Computers&Accessories|Accessories&Peripherals|TabletAccessories|Bags,Cases&Sleeves|Cases", "discounted_price": "₹549", "actual_price": "₹1,499", "discount_percentage": "63%", "rating": "4.3", "rating_count": "11,006", "about_product": "This Case is Specifically Designed To Fit The New iPad 7th Generation /8th Generation 10.2\" 2020 model. Please Confirm Your IPad Model Prior Purchase.|Keeping Your Convenience In Mind, This Case For New iPad 10.2 inch is Designed To Give You The Best Utility and User Experience Possible.|Perfect Fit and Precise Cut-outs Ensures Easy Access To All The Ports and Buttons On Your New iPad 7th generation So That You Rarely Need To Remove The Case.|Built with Highest Quality Material, This Case For Protects Your New iPad Against Scratches, Bumps and Accidental Drops Keeping Your Precious Device Safe and Sound.|Sleek Design and Classy Look, This Case For New iPad is Crafted with Elegance That Surely Will Be An Add-On To Your Style While On The Go.", "user_id": "AEZTXYO6KQGB5TJF4C2QF4Q337ZQ,AEMDPSOBAW7LQQ7RCDG65VFSK3HA,AHR3OXVD5W52Q2MYS737HKHMTCHQ,AGWIRVRBLNDID5X4KTAFBTZU2U2A,AFYA6RUSF2C4PVOBWDACACIU2SBA,AH6ZRK276VT5ZAI6TDZ442AS57BQ,AHQTD5TF5VW5IPOSAGIZ7VYFB66A,AFC4X5UHL2LN4PBS2TWOMIZ2GHAQ", "user_name": "Neha,Amazon Customer,Rajat yadav,Vivek,Joy B Hans,Periyakaruppan,Avinash,sejal ghuge", "review_id": "R8BSHHFRCZ0MJ,R1FFF30F0OPJ84,R2FNCOSNHKOTQI,RPWUK2BJQ0G68,R3F280BE2HYWNR,R2MM29A786UNMO,R20FESVOJ2K0RP,R3IX2AJH4QZL8U", "review_title": "Nice cover,Value for money product.,Good,Worthy,Snug fit 😃,Fits perfectly | Looks stylish | Lightweight,Nice flip case,Beautiful product received", "review_content": "Nice cover but no place for stylus. Then why give stylus pen along with cover if no place to place the stylus?,Value for money product. You get free pen , cheap through but it works. I wish this cover has option to store the pen.Front of the cover looks expensive and top notch however the back plastic feels cheap.Still good buy at its current price.,Case having good quality nd durability need to test, nd pen quality is okok, works well with ipad but afcourse apple pencil is the best.,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61RDUgqA0wL._SY88.jpg,Pros1. The case is superb, fits well.2. Looks good too with transparent back3. Is very lightCons1. Might break in a single fall2. Doesn't work as ipad stand3. Gets dirty fast.,The product (black color) well suits my space gray color iPad that gives a rich look. It fits perfectly (power volume buttons, charge earphone ports). It is lightweight. Backside is translucent and strong enough. The magnet is good but less effective if you fixed tempered glass in ur iPad. Stylus pen is moderate. Worth the money go for it. It looks durable will update after few months of usage.,Flip case quality is good but pen is useless,Good quality product receivedWith pencil with it", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31bMTTJF1xL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/ProElite-Smart-Generation-Stylus-Translucent/dp/B07Z53L5QL/ref=sr_1_289?qid=1672903010&s=computers&sr=1-289"}
{"product_id": "B00P93X0VO", "product_name": "Classmate Pulse 6 Subject Notebook - Unruled, 300 Pages, Spiral Binding, 240mm*180mm", "category": "OfficeProducts|OfficePaperProducts|Paper|Stationery|Notebooks,WritingPads&Diaries|WireboundNotebooks", "discounted_price": "₹114", "actual_price": "₹120", "discount_percentage": "5%", "rating": "4.2", "rating_count": "8,938", "about_product": "The cover design of the notebook is subject to change, it depends on stock availability|6 Subject Notebook-Unruled, 300 Pages, Spiral Binding, Soft Cover, 240mm*180mm|Six subjects! One notebook! Only the best from Classmate|Classmate uses eco friendly and elemental chlorine free paper|This notebook consists of papers", "user_id": "AGPGSHGMGBF6GBOQ7ZXUBQ3IFZJA,AGCTDYXDS2ERAZO6ACV6JTFOHIZA,AHRUFDHGCKZGKT54AVRPZEUTNROQ,AHMN43SPXNEJP5O5QDLMZJXUAECA,AEUDSXTROWKKBDOIXDIPXVUR5GAA,AGM6G35OHG5KQMIRRXHX72G3LK2A,AFRS67BBE6ROLU6SGM626FXNLFNQ,AEEJ44O5YFDJ7ILQI74U7XMNEFIQ", "user_name": "Aditya Chatterjee,Raksha,shubham s.,Lucky mir,Shar,Soham Papinwar,AJJU BABA,Suman sutradhar", "review_id": "RFFLKG1LJ0XOI,R8X3CAMJEQANF,R31072TMP1DQYQ,R1YNKT2ZV9UMI9,R39R9TDUJOXVNW,R310CKEQ2EYBD8,R2ZRRP5SOEP2S6,R2FADI2UFYIDMF", "review_title": "Great Build Quality!,Great condition,Nice,Good experience,Good purchase,Just not A4.,GOOD ONE,It useful but buy it only when the price is under 100. Then u will get the profit.", "review_content": "The covers are sturdy, flexible and compelling. The back of the notebook has a nice texture to it as well.I would say that the quality of the pages is well above par and it does feel great when writing on it.It's particularly helpful for students who take notes of separate subject's lectures on the same copy and they are eventually scrambled up if not maintained properly. It's also beneficial to students who create notes mostly using charts, tables, diagrams and the like as there's division after 24 pages and you can't write as much in depth. Definitely good still!,The books are in great condition and worth the price. Only thing different is the cover, nothing else. Worth for 114rs which i paid 🙌🏻,Good notebook,Quality is good but its size is small compared to my normal notebooks  . Overall a decent product.,A very good quality book,,NOTEBOOK KI SIZE CHHOTI H , OR WITHOUT LINE KE PAGES H , MERE ACCORDING TO YE 8TH CLASS TK KE BACHCHO KE LIYE THIK HAI,", "img_link": "https://m.media-amazon.com/images/I/51LTAUNKg9L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Classmate-Pulse-Spiral-Notebook-Unruled/dp/B00P93X0VO/ref=sr_1_290?qid=1672903010&s=computers&sr=1-290"}