{"product_id": "B07P681N66", "product_name": "TP-Link AC600 600 Mbps WiFi Wireless Network USB Adapter for Desktop PC with 2.4GHz/5GHz High Gain Dual Band 5dBi Antenna Wi-Fi, Supports Windows 11/10/8.1/8/7/XP, Mac OS 10.15 and earlier (Archer T2U Plus)", "category": "Computers&Accessories|NetworkingDevices|NetworkAdapters|WirelessUSBAdapters", "discounted_price": "₹1,199", "actual_price": "₹2,199", "discount_percentage": "45%", "rating": "4.4", "rating_count": "24,780", "about_product": "High-Speed Wi-Fi —— 256QAM support increases the 2.4 GHz data rate from 150 Mbps to 200 Mbps, 200 Mbps on the 2.4 GHz band and 433 Mbps on the 5 GHz band, ensure you fully enjoy fast AC Wi-Fi.|Dual Band Wireless —— 2.4 GHz and 5 GHz band provide flexible connectivity, giving your devices access to the latest dual-band Wi-Fi router for faster speed and extended range|High-Gain Antenna —— A 5dBi high-gain antenna greatly enhances the reception and transmission signal strength of the USB adapter|Supports the Latest Operating Systems —— Fully compatible with Windows 11/10/8.1/8/7/XP, Mac OS 10.15 and earlier|In an unlikely case of product quality related issue, we may ask you to reach out to brand’s customer service support and seek resolution. We will require brand proof of issue to process replacement request.", "user_id": "AHDFR3PDKEBV72HXRL3RJJLS3YYA,AHYUZ2BLKNN6UJLFYWCXCEFZTOVQ,AHBST4ZJ5665DV2TCR4W4J2OI3DA,AGHPOFCHZ73Q2Q2IFTCJLUSEL2NQ,AHOMYGLSLJLCOT7Z24PZSVJY3LJQ,AESJE2EZD7S7WOYBN7RE7ZF3J2MA,AF23GXF525XSMXPJBEHP4SPKOZNQ,AFX5NHAAOUKKENAT6GWNKY3X5YTQ", "user_name": "Anonymous,Sugam Agrawal,Diganta Gogoi,Amazon Customer,Saigal84,Sonal ashish,Arbind Kumar,Neeraj yadav", "review_id": "R2GUL8IL005EGF,R3NZCVYJBN0CPD,RHUJOS46Q51UG,R1ZW4PQHUECROJ,R7F86XL2S6MY,R1JRRVOFWQAC4C,R2WZHK2E301YV,R10J01VHCKFB42", "review_title": "Works flawlessly on Ubuntu 22.04 (if installed correctly),Best for kali. Do not read another review.,Nice product,From 0 to 70 …,Good External Wifi Signal Provider,Superb,Awesome and easy to use,Good product", "review_content": "I am using this on an old Mac Mini, since the Broadcom proprietary drivers aren't available and the replacement B43 drivers don't allow for sufficient download speeds, at least in my experience. I got this device up and running with Ubuntu 22.04 with Linux 5.15.0-56-generic.Google search for \"morrownr/8821au-20210708\" and use the driver on Github. I'm using the product \"TP-Link AC600\" btw. If you are using the other variant sold on Amazon, use lsusb and find out which network interface you are going to have to install drivers for. GIYF.I will admit, this is probably going to be hard for someone who is not generally comfortable with a shell, bash for example. But even though I had never used dkms or iw before, the Github repo along with the build tools available in the jammy repo made it easy enough to get the device working (read the GitHub Readme).To be sure I first got the drivers working in a local Ubuntu VM using Guest Additions to connect to the USB device directly from the guest OS, which also worked.Ultimately, I installed the OS on the host and setup the drivers using USB tethering. I then got the same download speed using this device I was previously getting on my other network interfaces on Windows and Mac, but now on Ubuntu.The device itself is a bit sensitive to the antenna direction when it comes to the impact on download speed. Have been using for about a month now without complaints.,Do not go for reviews that say that it do not support kali. Me and some of my friends all are using it for Wi-Fi hacking and it works really well, it also supports monitor mode. If you are having issues in connecting it to your Kali machine then just go through the web surf a bit and you will find relevant articles on how to connect this TP link adapter to your kali machine. There is also a driver of realtek which you might need to install to make it work in your kali machine.I have given it 4 stars just because the performance if not good as the Alpha adapters which is reasonable for this range of price but in this range and for as a beginner it is the best adapter you can buy.,Nice product. Working fine. My PC is now 5G  Price is too high so giving 4 star,Got the Wi-Fi in one of the rooms from 0 to 70%. Has been working well since a month now. Good alternative to a repeater if only a single device needs to access the Wi-Fi from a corner.,The product is very nice and have good Wifi signal. Using this for over a month now, no complain. But when it for the first time, you need to install the driver on your desktop/laptop from the TP link website to make it operational, which is not very well explained in the manual.,This product is very good,I have buy this product because my laptop don’t support wifi 5ghz band, in 2.5 ghz I receive 30-40Mbps speed only but my broadband plan is 150Mbps.1. Easy to use plug and play windows 102. Good signal i am using another room from router no signal drop , I receive full signal.3. Little bit expensive but go with this because of good signal.4. I receive 170Mbps + download and 110Mbps upload speed on 5ghz and my broadband plan is 150Mbps.I highly recommend this product.,i purchase this product for company use and this is a very good product.", "img_link": "https://m.media-amazon.com/images/I/216Q4FqmZVL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/TP-Link-Wireless-Adapter-Archer-T2U/dp/B07P681N66/ref=sr_1_54?qid=1672909126&s=electronics&sr=1-54"}
{"product_id": "B0711PVX6Z", "product_name": "AmazonBasics Micro USB Fast Charging Cable for Android Phones with Gold Plated Connectors (3 Feet, Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹179", "actual_price": "₹500", "discount_percentage": "64%", "rating": "4.2", "rating_count": "92,595", "about_product": "Micro usb charging cable for android phones|Supports up to 480 mbps data transmission speed|Ideal for charging android phones and tablets or connecting pc peripherals such as hard drives, printers, and more|Gold-plated connectors resist corrosion for signal purity|Smaller connector designed to fit smaller spaces|Compact connector head works with nearly all cases|Improved charging capability up to 2100 ma", "user_id": "AF7IXQKBUL6NEIQG4R53LMJJUGXQ,AFODI4XXHXHBFFUHK7N5LVKWEXTQ,AGNONTMQDE5KLLDEEB57Z3C5WAEA,AFW6NV5N3FUXV3CNUACPSYC5AB3Q,AEW6KBDGJEWIOQKAW3FP74GMV6TA,AEGT7WPGXXMSH5J3LZLL6CPJ7QMQ,AEKCUG7WMX6KMP6VFBWI3ICW5CBQ,AF2544C4RGIBQX7Y4JMKMSMXMRRQ", "user_name": "Neeraj Vishwakarma,Siddharth,SD1908,Mukundha2good,manjunath h,Vidhi Nigam,Amazon Customer,Tarun Gupta", "review_id": "R22EUJ1B1AM0OU,R2K89RVGN8N9MO,R177X9L6ND6OA7,R2YU5RDRT44DE6,R1K5FLRLAUZLKF,R1HAZS2PLM3RRQ,R3EX1BCG3VPANF,R1C72DNWTJGUI2", "review_title": "Using it with my QC 3 Charger .So far- So good.A Quality cable with a sturdy construction & troublefree performance.,Awesome product go for buy it 👍,Execellent,Sturdy micro USB cable for Old phones,Super,Product description says 3 feet it's hardly a foot length wire.,Good,Excellent quality cable", "review_content": "ABOUT  AMAZONBASICS:xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxAmazon Basics was launched in 2009 & is Amazon’s own inhouse brand for fast moving small electronic consumer goods.Here amazon uses its massive collection of sales data to launch products that are in huge demand & already exist in the market- but at lower prices. Simply put up a similar replica for something successful but at much affordable prices.If something isn’t an immediate hit, Amazon pulls it and moves on.Amazon otherwise is like an online marketplace where it provides a portal for various sellers to sell their product BUT with amazonbasics - Amazon is selling its own product at its own marketplace .Here it derives the benefit of eliminating any intermediate distributors or retailers & hence amazonbasics branded products are available for a lower price attracting bulk customers online.As an additional benefit, Amazonbasics products are delivered free to prime members & are covered under amazon warranty for all and hence any claim or replacement procedures are highly streamlined & immediately taken care of.ABOUT OUR PRODUCT ( REQUIREMENT vs ACTUAL):xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxI recently purchased a new Qualcomm 3 Qbix car charger & was looking for a cable with USB A to Micro B connector. I listed my priorities under various heads to come up with a conclusion and let us compare the actual product based upon my initial requirements:1.) DATA EXCHANGE:*****************************Since it was to be primarily used for fast mobile devices charging in car, Data exchange capability was not much of my concern. Preference though would surely have been a USB 3 but it didn’t bother me if I could only get a USB 2.0 too.ACTUAL PRODUCT: I did try to copy a movie file just for the sake of testing data exchange and I found it to be pretty well. I did not capture any speed data but then we all know speed of data transfer also varies with the type of data being transferred. The more variety of data being transferred simultaneously the lower will be the speed.2.) LENGTH OF THE CABLE :**************************************Again since I could not afford to have a lengthy loop of cable bunched around my gear knob, I preferred to keep it short & simple hence my only lookout was upto around a meter or below.ACTUAL PRODUCT: The cable came nicely packed in a paper packet and was precisely 0.9 meters or approximately 3 feet long. The length was sufficient for me to plug-in any of the mobile devices to my car charger at the drivers or the side passenger’s seat.3.) TANGLE FREE/ FLEXIBILITY/ STRENGTH STANDARDS:**************************************************************************I am not particularly a fan of those stubborn braided wires which are so hard that they retain the shape in which they are bent. I wanted something that was thick yet flexible enough to acquire a circular shape when bunched.ACTUAL PRODUCT: The cable received looked exactly as shown over the site with good flexibility , reasonable thickness & a sturdy intermediate cable. The whole construction of the cable due it’s cable size & flexibility is almost tangle-free.The associated cable was not exactly thick but can’t be termed as thin or delicate too. It’s not the thickest I’ve seen but then thickest doesn’t always means most durable. Given my application it’s more than just suitable.The overall built & quality of the cable & insulation looks promising enough to last few years. Even if used for other than car charging it looks durable enough to last long.I had further shortlisted mansaa & an amkette cable for the same purpose but they were too long for my requirement.4.) COMPACT MOULDED CONNECTORS:*********************************************************Had an inclination towards moulded connectors to avoid any issues where the connectors break open exposing the terminal PCBs.ACTUAL PRODUCT : There are no complaints regarding the connectors of the actual cable. The connectors are perfectly moulded without any joints or risks of splitting open. The connector casings are further quite compact at terminals to fit in comfortably at scarce spaces.The connector ports are sturdy enough both at USB A & micro B ports. The micro B port pins lock securely onto the charging mobile devices which is quite good.No signs of loose construction.Being Gold-plated is more of a misleading & fancy term(in this case) as most of the metal ports designed today already have a corrosion resistance & nobody is going to use them in saline sea water anyways.5.) AVAILABILITY OF TIES/VELCRO STRAPS :***********************************************************As per my intended use in a car where compactness was of paramount importance, I expected an included cable tie or a Velcro strap would be a nice add-on to properly adjust & arrange the cable as per requirement.ACTUAL PRODUCT: This I miss the most in the provided actual cable, there is no provision of an included strap or cable tie through which I could adjust my required cable length easily.6.) DECENT CURRENT HANDLING CAPABILITY:******************************************************************On the newest QC 3.0 certified chargers the current transmission can go up to 3.4 amps in certain cases hence the cable needed to have a decent current handling ability.ACTUAL PRODUCT : The actual cable has a nameplate rating of handling up to 2.1 amps against demands at new QC 3.0 chargers that could go up to 3.4 amps. Here, let me clear out that the latest QC chargers vary voltage to current ratios to achieve desired fast charging  & thus it is not like a continuous flow of 3.4 amps is there, it keeps on reducing hence cable ratings designed for a continuous current handling of anything above 2.0 amps would sufficiently work with QC 3.0 chargers.Have tried it safely multiple times charging my Samsung S7 from 10 % without the cable getting hot.7.) WARRANTY:************************Comes with a 1 year warranty as expected. Not the best in the industry but reasonable.OTHER OBSERVATIONS:*************************************Apart from the above listed features, the other details of the actual product received worth mentioning are:8.) The cable is manufactured in China & imported by amazon warehouse dealers under the brand name & philosophy of amazonbasics.9.) The cable has a manufacturing date of Oct 2017 & it was imported to India in Dec 2017.10.) The cable has a MRP tag of 495 bucks however I purchased it online for 269 bucks.being a prime member shipping was free.11.) A customer care toll free number & email is also printed over the label for registration of any consumer grievances.FINAL VERDICT:xxxxxxxxxxxxxxxxxxIt has been few days since I have received & been using this product. So far everything from construction to performance seems to be convincing enough to recommend it and for a price of around 260 I suppose, its worth it.Will surely update if any malfunction is observed.,Worth for buy!,The quality that amazon basics at times give at cheap prices is beyond imagination. simply superb, goverment shouldnt hinder amazon products , amazon products rather gives competition to local qualityless products which consumers are forced to buy beacause they have no quality competition. Make in india is good, but if the make in india products are simple cheap copies of branded products without any investment in R and D, without R and D make in india would never be successfull and ousting companies like amazon will only lead to loss for consumers , govt should infact encourage such competition.,Amazon basics provides one of the best cables available for charging your phone or connecting devices.As an past customer of many cables from Amazon this cable doesn't also disappoint,Supports fast charging for all my Samsung phones.I use Samsung a9pro 2016, Samsung s8plus 2017, which this cable is compatible with .Very sturdy, thick and very long. 6 ftVery affordable pricing. Thanks AmazonI also use a USB c cable for my Samsung s20fe.,Super,Product charging is ok.. however it's mere 1 foot in length..  the vendor could have mentioned  correct product description.. there is no need to mislead.. too early to say performance as I have received it today.,Good,I have bought many cheap chinese micro usb cable in Rs 50 and Rs 100 of ubon and of many other chinese local companies,and none of them worked properly.Finall i decided to go for this.And it is charging as well transferring data, without any issue and i am very happy with my purchaseMy advice : Dont buy, cheap chinese local cables of.You will have to throw them in dustbean after some time.Better buy this one.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31iESA2h2gL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AmazonBasics-Micro-Charging-Android-Phones/dp/B0711PVX6Z/ref=sr_1_55?qid=1672909126&s=electronics&sr=1-55"}
{"product_id": "B082T6V3DT", "product_name": "AmazonBasics New Release Nylon USB-A to Lightning Cable Cord, Fast Charging MFi Certified Charger for Apple iPhone, iPad (6-Ft, Rose Gold)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹799", "actual_price": "₹2,100", "discount_percentage": "62%", "rating": "4.3", "rating_count": "8,188", "about_product": "Added Protection: An additional layer of protection has been added to the Lightning and USB ends to improve durability and reduce fraying;", "user_id": "AFWJSD4AVIM6DC3YA63G2QPENQSQ,AGKSW3FNH3REYN3OKPKJN4KWXLMQ,AEI7HJU4RFV6NR5WSRDQV5ZSRYSA,AGFN3SLEECW6DYL2CVGLIHJCVVHA,AGY7ZX7WDDSGAZJBPPS3MCIL7U7A,AEX422U2J6S45PAKDJIFJB7WNVLQ,AEHU6ETDR7HVQOGLKITDETHZEO7A,AE7VL5JTR7ZZ67UPBM6KP2NYEOYQ", "user_name": "Arun verma,Arv,Aashna Nasta,Harshitha,Sunny Panchal,Snigdha Mallik,None_123,Ravindra J.", "review_id": "R1Q0PEVL6X8WZJ,RW0MMI9AUXK5J,R2F3ACPBFRCFSK,R2SB3XYC8XHNUQ,R5L8G10EKZ9ZR,R3W2X53D3BLIBR,R29J3JSPZYQYCM,R35I0ZZH2J58P7", "review_title": "Good product but costly,It’s really long n sturdy no homo 🔥,Takes longer to charge than the regular cable,Quality is really good,iPhone X pink charging cable long one ☝️,A good purchase,It charges fine for me,Absolutely fantastic USB👍👍👍", "review_content": "It cost should be under Rs. 500,Buy it,Color is as per the photo but takes longer to charge. Also doesn’t charge on all sockets.Seems to work better when plugged in directly in the laptop.,Length of the cable is long so that you can happily use it for long distance as week and quality is really good,1 meter pInk charging wire for iPhone X long and strong one for use..,I have been using this lighting cable for almost a month now and the cable turned out exactly as it was shown. I took the rose gold one that matches my phone’s color. Although the metal ends of the cable was rose gold, but the whole cable was pink, which I didn’t like. I went for the 2m long cable so that i can use it conveniently even if it is charging. Though it’s kinda bulky, yet serves it’s purpose. Charging speed is fast and efficient just like the original cable had. Also quite durable and sturdy. My Apple’s original lighting cable had some problem while charging so I purchased this one after watching many YouTube videos and reviews. It was indeed a good purchase.,It’s long and good,It’s a superb product in terms of sturdiness, looks, and charging speed.", "img_link": "https://m.media-amazon.com/images/I/31kw1RgU5yL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AmazonBasics-Nylon-Braided-Lightning-Cable/dp/B082T6V3DT/ref=sr_1_57?qid=1672909126&s=electronics&sr=1-57"}
{"product_id": "B07MKFNHKG", "product_name": "VW 80 cm (32 inches) Frameless Series HD Ready LED TV VW32A (Black)", "category": "Electronics|HomeTheater,TV&Video|Televisions|StandardTelevisions", "discounted_price": "₹6,999", "actual_price": "₹12,999", "discount_percentage": "46%", "rating": "4.2", "rating_count": "4,003", "about_product": "Resolution: HD Ready (1366x768) | Refresh Rate: 60 hertz | Viewing Angle: 178 degrees|Connectivity: 2 HDMI ports to connect set top box, Blu Ray players, gaming console | 2 USB ports to connect hard drives and other USB devices|Sound : 20 Watts output | Powerful Stereo Output | Power Audio, Music Equalizer|Display: A+ Grade Panel | IPE Technology | True Colour | Cinema Zoom | Slim Bezel | Cinema Mode|Warranty Information: 1 year warranty provided by Visio World from date of purchase|Installation: For requesting installation/wall mounting/demo of this product once delivered, please directly call Visio World support on (Please visit brand website for toll free numbers) and provide product's model name as well as seller's details mentioned on the invoice|Easy returns: This product is eligible for replacement/refund within 10 days of delivery in case of any product defects, damage or features not matching the description provided", "user_id": "AFIU4APGHOFMXEOVMSQMYKMZ46QQ,AEOFYPCJJQYCKISUR6EC66IZH23Q,AFZSMXS2MILXOSTT2ZEJDE3W7TLQ,AFREYXJZFUSZT7YHDJ4JOF67O6VQ,AGMQDZGGSEBXX4KBJOBAGIFI36OA,AHJ7INNUX3KZSEZRJKFMRJAX7TZA,AGYTCTSUZJJZTK2XVADTQI5MYUFQ,AFZHLQMILG47ZESR5TLNB5QK66HQ", "user_name": "Amazon Customer,Yousuf,Raja Laxman,Pooja Thapa,Selva Vellingiri A,Nikhil Padwal,Bipin,sandip", "review_id": "RFZ1X95QMXWFZ,R1P8SL54VCWSMQ,RSWY4LT0L7TCL,R2GEJ1MJF28QVM,R2K5NT5XE6LM6T,R26BYG85S4SSVY,R3HB3IY6922TUM,R3A3CEQUX9QMFE", "review_title": "Firestick plugging in issue, otherwise a good deal,Cheap & Best Product,Low budget led tv,Nice tv,Very. Good,Why is the installation guy asking for installation charge?,Good Budget Tv,Good TV but after using it for 9 days, has found a flaw", "review_content": "I got this for 6k. At this price point, I believe the TV provides decent quality. You shouldn't expect amazing quality anyway from a 1366x768 screen resolution. The audio is also okay. Beyond 50 the audio starts cracking.From a viewing distance of 6-8ft the quality looks good.PLEASE NOTE: you will STRUGGLE quite a bit to directly add a firestick to the HDMI port. They have given some other ports right next to the HDMI ports because of which the firestick doesn't have proper space to fit properly unless you really shove it in there. My suggestion is to get an HDMI extender for it.Overall, I'd say, for a small room, it's a 7/10.,Value for money, Satisfied with the product till now,This Led tv low budget Good 👍 Performance but picture & audio not good,https://m.media-amazon.com/images/I/61QvXYP2McL._SY88.jpg,Good,Tv is great but the installation guy asked me for 400₹ paid installation... Misleading information but again for this price it's good tv. Don't pay installation guy you can do it yourself,,I will give it 4 stars out of 5. I bought this 32 inch VW at 6150 after discounts. Picture quality and sound quality is good.I added firestick to it and it voila became smart tv. The connections to attach these usbs are at the bottom part of the tv which is slightly different from other tvs.So far, working as it should.Revising this after 9 days, the tv is not responding to switch off button. This is happening more when i watch the tv for a few hours and then when i switch off the tv with the firestick remote, the yellow colour indicator down below does not turn red, instead it remains yellow. As far as screen is concerned, the tv's screen changes to black whitish, seems to me that the tv goes into hibernation or sleep mode. This is a fault of the tv as a normal tv should swith off completely and the indicator should turn red. i have called technician tomorrow and if he checks and if he agrees, then i should get a replacement as i got still 2 days time to replace it.Just a helping note for people buying this tv: if you are going to connect firestick to it, as it asks for the brand name of the tv, you can select VU and it will perfectly work on your firestick. Thanks and enjoy!", "img_link": "https://m.media-amazon.com/images/I/418GxB04szL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Visio-World-inches-VW32A-Ready/dp/B07MKFNHKG/ref=sr_1_58?qid=1672909126&s=electronics&sr=1-58"}
{"product_id": "B0BFWGBX61", "product_name": "Ambrane Unbreakable 3A Fast Charging Braided Type C Cable    1.5 Meter (RCT15, Blue) Supports QC 2.0/3.0 Charging", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹199", "actual_price": "₹349", "discount_percentage": "43%", "rating": "4.1", "rating_count": "314", "about_product": "Compatible with all Type C enabled devices, be it an android smartphone (Mi, Samsung, Oppo, Vivo, Realme, OnePlus, etc), tablet, laptop (Macbook, Chromebook, etc)|Supports Quick Charging (2.0/3.0)|Unbreakable – Made of special braided outer with rugged interior bindings, it is ultra-durable cable that won’t be affected by daily rough usage|Ideal Length – It has ideal length of 1.5 meters which is neither too short like your typical 1meter cable or too long like a 2meters cable", "user_id": "AF36YUJUEUU3SA42PFAULM2F5RYA,AESE26BMILSD6E4AVO3YM76G4UPA,AFFB6IUQ46CEIYZ2U7OAYVKAL5RQ,AGHGLXUVEHN4NFA3CCYIUFWBIC4A,AELBYFRFAGLMXQQJKVDUWO7QX2VQ,AHF4A3ZGP7G6JLXAAJ77O2QDJSEQ,AEGZCGGDNS4ZRNPG3CDULRVB5Z5A,AE4YGDAAZX7ZDDGP4BTONW72CMIA", "user_name": "Vipan Agnihotri,Hitender singh,Anuj Chauhan,Mufti Abul Hasan,Amazon Customer,MDR,Jai kumar,Rohan Wakade", "review_id": "RQAF3Q7KCEGHP,R3CBLDFSRTKKYA,R3PZ3ENFIS7IJG,R2ACW4FTIVQJ77,R3K8YFINS1P9XN,R16G76XSWF9WTZ,R3O8ZTH4RRO02J,RXCDPPX5ZV2WX", "review_title": "Good product,Strong and powerful,Useful product.,Very nice 👌 👍 product,Good 👍🏻,Good,USB,Strong buid , study design , charging speed ☹️", "review_content": "quality is ok ok only,Well go for it good cable,Useful product in this price.,Very nice,Good,Charging speed supports up to 25V,Product quantity is excellent but very slow charging,Cable is absolutely good looking , strong , durable. But not support fast charging as I expected , I checked speed with stopwatch , I am using Realme phone , with my original realme 20w charger and original cable the time takes to charge 68% to 69% is 34 sec. But with this ambrane cable it takes 1 min 32 sec to charge from 69% to 70%.Little disappointed with charging Speed , overall product is goodHope this review help you guys !", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41rbKciLrcL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Ambrane-Unbreakable-Charging-RCT15-Supports/dp/B0BFWGBX61/ref=sr_1_59?qid=1672909126&s=electronics&sr=1-59"}
{"product_id": "B01N90RZ4M", "product_name": "Tata Sky Universal Remote", "category": "Electronics|HomeTheater,TV&Video|Accessories|RemoteControls", "discounted_price": "₹230", "actual_price": "₹499", "discount_percentage": "54%", "rating": "3.7", "rating_count": "2,960", "about_product": "Universal remote control|Ensures long lastinga and consistent performance|Sturdy built", "user_id": "AEOM4KLP4SKKVSOCAMP7ORLGPGUA,AE4VKQV43AJEZDWE4WVJWFDY6RVA,AGAUULKME2K6WYOHPLL5XT5XLQGA,AFP5TMKVX6PTNYNMLHFCVDXCTN4A,AGNYTWD4ORSSUWNGICU3TRNRMRIA,AGQCT5HPQJXUN2FVZNCBSEQIYDPQ,AHWMHRT7TOMXLYI3XYM4K4OY3NEQ,AEXIFRBO4546MRMJHYKE2AH26VCQ", "user_name": "Jacob.,Dinesh Ahuja,Ashith,Pravin Chavhan,Anil kumar sharma (Lucky),Customer,Debashis Sengupta,Sridhar", "review_id": "RJ19CW7WCSFUI,R3W3PK017U6SIG,RJB32KHP5D5O3,R3POHJCTG2XX71,R1EKLLUH4KRRS9,R2S00YTPGW362,R24N5IPVE7LGCM,R2ZOR8P02Z5J8F", "review_title": "The button contacts are not very good.,Okay for temporary use,Seller: Smart Place Store; Remote Not original,It's below average,Ok,Tata sky remote,Tatasky remote.,Working one, but parts are flimsy.", "review_content": "The button contacts are not very good.,Doesn't look as standard and durable as original product,Purchased from Seller: Smart Place Store;Remote works but low build quality. Not original.,Material is very average,Works as described,Not meet expectations,but O K.,It's a good product.,Parts are likely to break even in case of small fall.", "img_link": "https://m.media-amazon.com/images/I/315GdnF+LcL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/TATASKY-Universal-Remote/dp/B01N90RZ4M/ref=sr_1_60?qid=1672909126&s=electronics&sr=1-60"}
{"product_id": "B0088TKTY2", "product_name": "TP-LINK WiFi Dongle 300 Mbps Mini Wireless Network USB Wi-Fi Adapter for PC Desktop Laptop(Supports Windows 11/10/8.1/8/7/XP, Mac OS 10.9-10.15 and Linux, WPS, Soft AP Mode, USB 2.0) (TL-WN823N),Black", "category": "Computers&Accessories|NetworkingDevices|NetworkAdapters|WirelessUSBAdapters", "discounted_price": "₹649", "actual_price": "₹1,399", "discount_percentage": "54%", "rating": "4.2", "rating_count": "1,79,691", "about_product": "300 Mbps Wi-Fi —— 300Mbps wireless speed ideal for smooth HD video, voice streaming and online gaming|Design —— Mini-sized design for convenient portability with a reliable high performance|SoftAP Mode —— Turn a wired internet connection to a PC or Laptop into a Wi-Fi hotspot|·  WPS —— Easily setup a secure wireless connection with one-touch WPS button|Compatibility —— Supports Windows 11/10/8.1/8/7/XP, Mac OS 10.15 and earlier, Linux|Interface —— USB 2.0|In an unlikely case of product quality related issue, we may ask you to reach out to brand’s customer service support and seek resolution. We will require brand proof of issue to process replacement request.", "user_id": "AGV3IEFANZCKECFGUM42MRH5FNOA,AEBO7NWCNXKT4AESAN443HQH35FQ,AE7GD3VRRYQEAHDR7FXJIR23INYA,AHPAW24BI5X2GCX5M2LHI72VSJJQ,AE2VXY4CFO36MDSIMPG43XHNF4GA,AHHQEKUNVETALN7DTRHUQ2WAWEKQ,AFMIFTNTUD5PIHGONWOTRMMZ5EBA,AHOJBIZVVIIFJKRREY4B6ESVA4KA", "user_name": "Azhar JuMan,Anirudh Sood,Hari Krishnan PS,Akash Jindal,PRADEEP,Rajesh,Divya Kothari,abhijit", "review_id": "R1LW6NWSVTVZ2H,R3VR5WFKUS15C5,R2F6GC79OYWUKQ,R3QZ19MECGWG9A,R2MPU42MYK7GPO,R33DVXFB4VYPZZ,R1SQ7OGFR4JRUR,R1S5F9QI0M1VBZ", "review_title": "Works on linux for me. Get the model with antenna.,Does what it say but other brands available at lesser price,Easy Handle,Great product,Perfect working,Speed is perfect,Great Design, Build, Connectivity Range, Packaging and other features but no linux support since v2,Very good", "review_content": "I use this to connect an old PC to internet. I tried lubuntu 20 and ubuntu 22, it worked out of the box in both, didn't have to do any setup. There's an extender cable so you can place this in a comfortable place. Get the model with antenna because otherwise you'll have range problems if you're not directly in line of sight from your wifi router.,The wifi dongle is a simple plug & play device, will start catching available networks right after you plug it into your USB port, no additional installations/ softwares requires. Signal strength is good.... just wonder what would be different in other adapters of lesser known brands which are available at a much more competitive pricing, hence a star less.,Pros:*Easy to use & Portable*Can be connected to Mobile Hotspot and used in PC( Budget Friendly)*Less installation process*No heating issues & Good Coverage*Best alternative for USB Tethering (phone's battery may get damaged for long term run with Tethering)Cons:*Internet connection speed varies at times, also depends on your modem or cellular connection*Issues occur while installing via CD, which is available along with the product( Installation driver can be downloaded from TP-Link site)*Needed to reconnect the adapter every time system is turned ON*Will not work if your software has some issues, so encountered any just update your system(worked for me)*Support Center is worse, calls are unattended most of the times or just visit nearby storeConclusion:Brought this @499/-Ideal for users who don't need very high speed internet usage,a good alternative for USB Tethering and are on Budge(1080p Youtube videos can be easily played with this without any interruptions),wifi connectivity is a great good result for me. however, some jitter problems did exist.,This is perfect device to connect wifi. Go for it.,This wifi adopter is good working,(Pictures attached)Size/Design:  ★ ★ ★ ★ ★Build Quality: ★ ★ ★ ★ ★Packaging:  ★ ★ ★ ★ ★Software:  ★ ★ ★ ★Speed:  ★ ★ ★ ★ ★Connectivity:  ★ ★ ★ ★ ★Experience:  ★ ★ ★ ★ ★Warranty:  ★ ★ ★ ★ ★Size and Design:The best part about this is that it is very compact in size and very sober and elegant in design. This is a big plus as it is easy plug in and use, add to it the good sober design.Build Quality:The build quality is undoubtedly superb. Just no qualms about that, at all. When held, it doesnt give off that cheap and flimsy product-like feeling. It is good sturdy with its build quality.Packaging:This part is also a big plus as the item was well cushioned and packaged with all the necessary items that ensured that no damage could have been caused to the product during transportation. This ensures that I as a customer have received something not damaged internally already.Software:This is actually good but not great part with the product.The good part is that a CD has been provided with it along with a manual.The not great part is that NO LINUX SUPPORT has been given from Version 2 onwards. This is bad, really.Speed:It easily supports net speeds upto 300 Mbps. Practically speaking, I have tested it at my home and it easily supports net speed of over 100-150 Mbps without a sigh.On testing I found that it did connect to 5GHz network, without any issue.Connectivity:Please mark its not feet its metres. Multiply metres x 3 to get the distance in feet.It easily connects to my laptop or phone from 7 metres across one room. So thats 21 feet. I mean even our old bluetooth used to connect to about 15 ft.So 20-25 feet is not at all an issue with this. This is the big plus I found with the product.Experience:From this point of view, so far except the linux non-compatibility issue, I found no other flaws with this product.So overall its a great product.Warranty:Its 3 years so I am assured that atleast for 3 years I am tension-free and not just 1 year, contrary to most electronic items today that only provide 1 year warranty with their items.,Best adapter I have bought ever. Works nicely seemless connectivity", "img_link": "https://m.media-amazon.com/images/I/41jxZkzNcnL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/TP-Link-TL-WN823N-300Mbps-Wireless-N-Adapter/dp/B0088TKTY2/ref=sr_1_61?qid=1672909126&s=electronics&sr=1-61"}
{"product_id": "B09Q5SWVBJ", "product_name": "OnePlus 80 cm (32 inches) Y Series HD Ready Smart Android LED TV 32 Y1S (Black)", "category": "Electronics|HomeTheater,TV&Video|Televisions|SmartTelevisions", "discounted_price": "₹15,999", "actual_price": "₹21,999", "discount_percentage": "27%", "rating": "4.2", "rating_count": "34,899", "about_product": "Resolution : HD Ready (1366x768) | Refresh Rate : 60 Hertz|Connectivity: 2 HDMI ports to connect set top box, Blu Ray players, gaming console | 2 USB ports to connect hard drives and other USB devices | Dual-band Wi-Fi|Sound : 20 Watts Output | Dolby Audio | Dolby Atmos Decoding|Smart TV features: Latest Android TV 11, OnePlus Connect Ecosystem, Google Assistant, Chromecast, Miracast, DLNA, Auto Low Latency Mode | Supported Apps : Netflix, Youtube, Prime Video, Hotstar, SonyLiv, Hungama, JioCinema, Zee5, Eros Now, Oxygen Play|Display : Bezel-less Design | LED Panel | Anti-Aliasing | Gamma Engine | Decoding of HDR10+, HDR10, HLG|Warranty Information: 1 year comprehensive warranty and additional 1 year on panel provided by the manufacturer from date of purchase|Installation/Wall mounting/demo will be arranged by Amazon Home Services. For any other information, please contact Amazon customer support | Wall Mount is not included in the box and will be charged extra at the time of installation", "user_id": "AFUT7ANZTZYGLXU65EQ2D5OP6UMA,AGT7YYJVUC6ZHRKQHVUQZMDNLXEA,AE7OMK3IQJR2U2JZE2HQ4BKSPA6A,AGCRCU432TIF4J2EL7GBEWOIULGQ,AERQBL3BISJQVHO3RLOOA4HKZX5A,AHIWNZ2HBQAHVE4OWODM6WH4PMOQ,AH2347WTE3DZ3TIZUB5LCLZPAYEQ,AHIH3QL5XONYJWEXF7VKLFHZBDJA", "user_name": "ATHARVA BONDRE,Sujitkumar Thorat,Chandrasekara rajasekara reddy,J vasanth,Placeholder,roshan,Boopathi,Rajesh", "review_id": "R3COVVOP2R7Z28,R2T6WHEO2ONNDD,RUFFV2QR43OCM,R2LK4WPIHJ7WDA,R6IPR9FHZ5BOT,R3DU4LFGTAIEMN,RVHHM5FW31JN1,R1QA870NJWIODF", "review_title": "Worthy and most affordable - Great TV,Good product,It's really worth the money but,Better product in this budget,Product review,nice tv,Best product,Budget friendly TV", "review_content": "This OnePlus TV is great if you want a affordable and middle range features TV. I got it in the offer and it was totally worth it.Pros:-1. Sound is awesome - 100% satisfied with the quality of sound. Dolby Audio 20W speakers are really great for sure affordable TV.2. Size and slim - It is slim and looks stylish. Very light weight and handy to install.3. Easy to install and mount to wall.4. Tye software installation and set up is very easy and anyone can do it at home.5. It gets integrated with mobile apps, remote, WiFi networks very quickly and easily.6. The overall sign up process and app installations are quick and automatic.7. It supports all the smart features like Netflix, Prime and YouTube. It is easily installable and sign-in to start using quickly.8. It is also easy to scan the Setup box channels and start viewing them.Cons:-1. Picture quality is 776p. It's average and not very clear. But it is worth the price range. I'll not complaint as the cost of TV is very affordable and this quality is justified.2. Bluetooth and WiFi connection can disconnect sometimes and cause some issues. I encountered this disconnect issue and had to reset complete device and do the complete sign up again.Rest all is very good and loved this product. I feel it was worth ordering. If you are looking something is medium range and only need it for your old parents and don't have extensive smart use then 100% go for this.If you want to use a lot of smart features and OTT platforms and watch movies, and sports then go for better version with full HD and 4K quality. This TV will not give good experience for sports due to less picture quality but it's very good for daily family shows and TV channels.One last thing I want to express and I'm ver disappointed about is this.I got my order delivered on Friday and I scheduled my installation for Saturday. But nobody turned up that day and I had to reschedule it for Tuesday morning, and even today nobody turned up. I got a call from Amazon to reschedule it for Tuesday evening and still, nobody turned up.This is very very bad and irresponsible service by OnePlus and Amazon. I'm very disappointed with the service and highly criticize this behavior. A company should always take care of its customer satisfaction and you have failed in doing this.What do you guys expect us to do? Wait for 5 to 6 days to get my TV installed even when it's been delivered and wait for you guys to come after so many days. Even when I'm having my smart TV delivered to my home, I have to wait and not enjoy it because you guys have not done your job properly.At least keep some decency and respect the customers who are paying a big amount and ordering a big item from your company. You should take care that the money I spent has been worth it and not facing any issues. Highly disappointed with this behavior and service.,Good product,Connectivity is faster,But performance is little bit slower,,The biggest problem I face is it don't have a aux cable so I'm not able to connect my sound bar......the HDMI port is useless it won't work .so,i connect it via bluetooth but the problem is that it won't connect automatically, everytime I on the tv i need to connect it manually it's a basic feature which is not provided in this tv then another drawback is that it was fast at the beginning now it's been 4 months and it's super laggy .....even after the update its just the same.....yeaa but in this price range the picture quality is outstanding......that's all,Good quality in picture and volume is little bit low other than that product is nice. Budget friendly, I'm happy with this .,After a few days, the TV will perform slowly and the  remote  is very very sentence,thank you amazon and oneplus,1. Sound is good2. Easy installation3. very Slim and less weight4. Voice recognition is good,LikeBudget-friendlyDislikeWiFi connectivity range is poor.Many times gets disconnected.Color depth not that good.", "img_link": "https://m.media-amazon.com/images/I/512YHGuR4RL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/OnePlus-inches-Ready-Smart-Android/dp/B09Q5SWVBJ/ref=sr_1_63?qid=1672909126&s=electronics&sr=1-63"}
{"product_id": "B0B4DT8MKT", "product_name": "Wecool Unbreakable 3 in 1 Charging Cable with 3A Speed, Fast Charging Multi Purpose Cable 1.25 Mtr Long, Type C cable, Micro Usb Cable and Cable for iPhone, White", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹348", "actual_price": "₹1,499", "discount_percentage": "77%", "rating": "4.2", "rating_count": "656", "about_product": "Fast Charging Cable that can be used to charge your smartphone or Tablet or Earbuds or speakers etc...|3 in 1 Fast charging Cable is the best solution for your Travel needs. Just carry a single charging cable that can charge all your electronic Gadgets|The Multi purpose charging cable has 3 charging ports that includes type c cable fast charging 3.0 and Micro usb and charging pin compatible for iphone|The Charging Cable has 12 months of Brand Warranty. Register in the brand website with in 10 days of purchase to avail the warranty. Wecool dot com|Convenient Length cable. The Car charging cable has 1.25 Meters length that is very convenient to use while you travel", "user_id": "AGH3POHLPXABF3I4ASSGTRXAUPPA,AEHVZHMJQYG456XUPYSWK7PWAJAA,AFBPPGDHU5S2IR5WEPYWGR4ABK4Q,AGEYWCB2JWQR7C3RF2SEK26PTK2A,AGWXGUALH6VESAYTZGWBZBUDTWFA,AHCG74BCEDINDMRYYF2QPYY3OHJQ,AHHGEASO3BOC2ET23MDU64DKQ5OQ,AF7TKY6E2EO7NSSPHFYFGE4FJDOA", "user_name": "nisar,Pralipta Kumar Sahoo,Vimal kumar g s,Amazon Customer,Amazon Customer,Amith Kumar M,Ekant Sharma,K R S", "review_id": "R25WW5K08CGVXV,R1229K72SC8VW6,R3G7X6LSJFGFXP,R19IPICAE9A24Q,R1J0JL7TOG1YNE,R37NLAA34276Y9,R13G1K0IPVB3EA,R188FGJWORTDSC", "review_title": "Nice,Awesome,Quick not charger🤏,Expensive at this price,Multiple mobile can’t be charged at a time,THIS IS FAST CHARGING ON BOTH MY SAMSUNG PHONES AND IPHONE TOO. Go for it !!,Excellent quality!,CHARGING CABLE", "review_content": "Good,Got a nice product,Quick not charger🤏,Cable is very good and looks durable but the pins quality are not good, infact iPhone pin keep coming out even with small movement, You can drive and charge simultaneously. Type C is good and the other pin is very hard to insert but workable.,This not a fast charger and can’t be used for data transfer. Multiple mobile can’t be charged at a time,This works as expected. It is working for both my Samsung phones and the lightning cable also works perfectly..,I loved this product for my car. It's long and quite valuable for charging three mobiles together in one go.,GOOD PRODUCT.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/313uqx3djjL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/WeCool-Unbreakable-Charging-Purpose-iPhone/dp/B0B4DT8MKT/ref=sr_1_64?qid=1672909126&s=electronics&sr=1-64"}
{"product_id": "B08CDKQ8T6", "product_name": "Portronics Konnect L 1.2Mtr, Fast Charging 3A Micro USB Cable with Charge & Sync Function (Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹154", "actual_price": "₹349", "discount_percentage": "56%", "rating": "4.3", "rating_count": "7,064", "about_product": "MORE DURABLE- Konnect L Micro cable is unique in terms of design and multi-use and is positioned to provide the best comfort and performance while using|HIGH QUALITY MATERIAL- TPE + Nylon material to make sure that the life of the cable is enhanced significantly|COMPATIBILITY- Compatible with most Android smartphones, windows phone, tablets, PC peripherals and other micro USB compatible devices|CHARGE and SYNC FUNCTION- It comes with Fast Charging and quick Sync Function|LONG CORD- The Cable is extra thick 1.2 meter long, optimized for an easy use for your comfort at home or office", "user_id": "AFDCSF36NJYXASQOJCQWFQTN7SDQ,AGHRDOQP7F74DK6KEXSY2NLLKZVQ,AF7HUEJWED3ZUCLTT2MNQDL5BQOA,AH62QNZEYJYC6LNXAJ4BXL6JZZEQ,AFMQH2YLIY5ST5VNIUADLQYIUNAA,AF5TLUDL3JKYZS74QEAMDMPXC3ZQ,AF57UETI4YHWNPSAOF2OVMNVV2JQ,AHNI4LKKPLQLDFCWJZ24SX4BGT7Q", "user_name": "Arun S.,Jeevan Prasad,mitesh,Tasmai Agrawal,Parvathi,Mohammadnaeem Surajwala,Suriya,Amazon Customer", "review_id": "R2ACU430AWSQ15,RZFPMZJQG4VEF,R2P7VTDLLMDOA3,R1B9M17A3N27E2,R4LNZP9RCX3H3,R3TL5BYHCMQSB3,R1B2BRD05LJZX4,R2WQKUAV6WUQ06", "review_title": "It's working,It's gud 😳,Cable quality is good.,Durable and Works Well,Good data cable same as shown in pic,Portronics knonnect L 1.2 mtr Micro USB cable,Ok,Great quality", "review_content": "Working fine,very good this data cable,Performance of this product is good enough.,Have been using it since quite a well. It is doing an excellent job. You can also avail the warranty by just messaging the serial number on whatsapp. Super happy with the overall performance.,Good data cable same as shown in pic. I brought this for my Nikon d5600 photos transfer to system.,Superb product...👌👌👌,Better,Seems to fast charge at 2A , not tried anything higher, but its a very sturdy cable should last for a long time", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31pQZsxPR4L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Portronics-Konnect-POR-1079-Charging-Micro/dp/B08CDKQ8T6/ref=sr_1_65?qid=1672909126&s=electronics&sr=1-65"}
{"product_id": "B07B275VN9", "product_name": "Airtel DigitalTV DTH Television, Setup Box Remote Compatible for SD and HD Recording (Black)", "category": "Electronics|HomeTheater,TV&Video|Accessories|RemoteControls", "discounted_price": "₹179", "actual_price": "₹799", "discount_percentage": "78%", "rating": "3.7", "rating_count": "2,201", "about_product": "This is Generic Airtel Tv Remote|Universal configuration with any TV|Shining black colour with LED indicator", "user_id": "AED54H4JXQGZT6GANH6PJN4SNU7Q,AF652OHBGHAEER2HLOH45T6E65CQ,AFJLA3VGFKFSX3VC6UC4ZAYVR4DQ,AFGQN6RWDATMEVHEO5POPH6VYFRQ,AENYOOBQJZGYT4GNQRR3YEKI7KAQ,AHKZN2KHHR7CQWCGJDX26C5TBHXQ,AHMJ5EEDULQII3FGSNR7PSHQABVA,AEA4764BEJKLL5UEYQ75K6TRRD3A", "user_name": "Periyasamy,Madhusudhanan,S Salman palka,Sumit,Syed Amir,Arun Nihalani,Gaurav tyagi,LK", "review_id": "R3MXMT6V18JJ1P,R1BQE9L2M5L12J,R369X3BEG4QPC4,R1ZBU0U8R5KBQD,R1A0NYJ6MOX3U3,R3RYEYCYNV47BZ,R28TZ1RZWX14PP,RNGN2ZRL685Z5", "review_title": "Simple and good,Satisfied!,Good one,Light weight, good working,ok,Poor quality! Stopped working after a month!,Not able to connect,Works well with Airtel DTH", "review_content": "Nice,Works very well with Airtel DTH. The pairing is as same as every Airtel DTH remote. All the buttons works properly.,Nice,Good substitute for original. Nice product,ok,Poor quality! Stopped working in a month,This remote will work only for the new TV and not able to connect even follow all the procedure mentioned on guide.,You need to sync with original tv remote to make volume, power, mute and av buttons work. You can Google the same its very easy.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41v00lhhdbL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Airtel-Digital-Remote-Compatible-Recording/dp/B07B275VN9/ref=sr_1_66_mod_primary_new?qid=1672909126&s=electronics&sbo=RZvfv%2F%2FHxDF%2BO5021pAnSA%3D%3D&sr=1-66"}
{"product_id": "B0B15CPR37", "product_name": "Samsung 108 cm (43 inches) Crystal 4K Neo Series Ultra HD Smart LED TV UA43AUE65AKXXL (Black)", "category": "Electronics|HomeTheater,TV&Video|Televisions|SmartTelevisions", "discounted_price": "₹32,990", "actual_price": "₹47,900", "discount_percentage": "31%", "rating": "4.3", "rating_count": "7,109", "about_product": "Resolution : Crystal 4K Ultra HD (3840 x 2160) | Refresh Rate : 50 Hertz|Connectivity: 3 HDMI ports to connect set top box, Blu-ray speakers or a gaming console | 1 USB ports to connect hard drives or other USB devices|Display: Ultra HD (4k) LED Panel | One Billion Colors | New Bezel-less Design | Supports HDR 10+ | PurColor | Mega Contarst | UHD Dimming | Auto Game Mode|Sound: 20 Watts Output | Powerful Speakers with Dolby Digital Plus | Q Symphony|Smart TV Features : Prime Video, Hotstar, Netflix, Zee5 and more | Voice Assistant - Bixby & Alexa | Tap View | PC Mode | Universal Guide | Web Browser | Screen Mirroring|Warranty Information: 1 year comprehensive warranty plus additional 1 years on panel by brand from date of invoice|Installation: For requesting installation/wall mounting/demo of this product once delivered, please directly call Samsung support on (Visit Brand website for tollfree numbers) and provide product's model name as well as seller's details mentioned on the invoice|Easy Returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description", "user_id": "AHDIDVECFGA6OQRNUBPUO6366UGQ,AFSII6HTAHTHGXERUNDOISNWZUNQ,AF64ON4HPPVD43H6PK3CHPTTYSSQ,AELNBR4H6235Y7NVYNCGNABDIDFQ,AF35OXRSRJ335IGMNW5FYCJDLHOA,AE3CFONNMANNC5QPYIAXV67EUYUQ,AHCWRQHRUAVMTMUH5NYNB3P4NWEA,AGKZVBLHK472MSGAAUABFRZL7SYQ", "user_name": "Binu,Sabjan,Ramkapil,User,Amazon Customer,ganesh,basavaraj huggi,Mangesh Borkar", "review_id": "R3RUBB6REUGTT,R281851EB9L5G6,R4ATJJVUY9JO6,R18455FQDOCS3H,RLZ80A5MC1F5G,R2DYRNTDPPD8A5,R3IFT4P8VHQGL3,R1DSJOGV3DFZK2", "review_title": "Best(Branded) Budget TV,A high-quality 4k Smart TV from Samsung,Received Defective,Got Replacement,Nice product but,Tv is good,Best budget tv,Value for money. Samsung is always good,Value for money product", "review_content": "Before finalizing the AUE60 55\", I visited Croma and Vijay Sales to check for the same TV or similar models for their features and picture quality. I was told AUE60 & AUE70(the models listed here as Crystal 4K and 4K Pro) are E-commerce exclusive models, not available offline. I was shown AU7700 which has the same processor, panel and features, but was listed at 65K for the 55\" version. I liked the picture quality, and decided I'll get the AUE60 since it shares so much with AU7700, and save ~20k.Why I went for AUE60  vs. AUE70 - I knew I wouldn't be needing a voice assistant, and wanted to save 3k. I knew even if I wanted a voice assistant, I could plug in Fire TV/Mi TV box and get those features later on. Delivery was pretty hassle free, the delivery executive unloaded the TV in the room I asked for, and opened the box to inspect the TV for any physical damages. Samsung technicians came in a few hours later, installed and gave a demo.Sound:Per other reviews - sound from speakers is apparently bad, but in my case, I found it satisfactory. I have it wall mounted in a 10X12ft room, and the TV's speakers sound better compared to Bose Soundlink Speakers that I connected it to via Bluetooth.Picture:The Panel's great, but nothing worth raving about. Gray uniformity isn't great(i.e. gray tones won't be perfectly uniform across the whole panel, there'll be darker zones towards the edges/corners based on backlight placement). Blacks aren't perfectly black - and they're brighter than you'd expect from a VA panel, but this isn't noticeable at all when the room is lit. No backlight bleed. Colors are as good as I'd like them to be, and the panel does get noticeably bright for my taste, even when brightness is turned down to 40%. 720p content is watchable from >8ft, 1080p is good(I'd say better than I expected), and 4K is well, 4K.Connectivity:I have a 35 Mb/s broadband  connection and all content streams in 4K when available, without stutters. The TV has Bluetooth 5.0, and works with TWS and Neckband earphones fine(I use Oppo Enco W51 and Boat Rockerz 330) - there's no noticeable latency, and volume can be controlled through the remote itself.Apps & Features:Has all the standard slew of streaming apps I needed - Netflix, Hotstar, Prime, Apple TV+ & YouTube. All of them stream 4k content, except for Hotstar - which only streamed 4K a few times. 1080p is still very watchable, and not really a deal breaker. No Dolby Vision support - which I made my peace with considering the fact that 99% of budget TVs in the market can't produce the contrast you'd expect out of DV content anyways, so why care. You get HDR, and HDR content is definitely better looking than non-HDR ones in terms of colors and vibrancy. I planned to use the TV without cable, but the TV does come with some channels like Republic TV, Bloomberg, 9XM, etc., these stream in 1080p, so a great bonus to have.Remote:Very basic RF remote, unlike Bluetooth ones on most new TVs. The remote's looks pretty sleek and stylish, but that's about it. Biggest gripe - typing to search for things within apps is a pain in the behind, you'll need to use the D-pad to navigate on an on-screen keyboard. You can control the TV using Samsung's SmartThings App, but guess what - you can't even use your phone's keyboard to type in when controlling through the app - this is something that can be added through an update, but it's not there yet.Attached pictures are all of 4K content. Resolution might get scaled down after I submit the review, but you can still get an idea of the TV's design/looks, Panel colors and contrast, etc.I'd say I'm really happy - and given the chance, wouldn't change my decision. It's a Samsung TV, so end of the day, if it produces a decent picture, and lasts a couple of years more than I expect, I can overlook all other cons. I'd highly recommend the TV if you have the same expectations from your next TV.,,Placed order on 18th Dec'22 received Defective product, updated to Amazon service they replaced with new product today(27/12/22).will post long term review.Pros: Picture Quality, Design (thin n Bezel less)Cons: Sound (bit okay),upsacling of SD channelsOver all Satisfied.,Have been using it since month now.-Picture quality is amazing. 4.5/5-As always installation service from Samsung was seemless. 5/5-smart features are good this model don't have voice recognition. I don't require it so its fine. 4/5-Audio quality is not good. It's clear but loudness is not sufficient if installing in big hall. It also lacks base.Purchase a sound bar separately if buying this model.,But the picture quality is ok-ok.,Best tv product in given price range,Value for money. Samsung is always good,Value for money product", "img_link": "https://m.media-amazon.com/images/I/41Tz1YnJkoL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Samsung-inches-Crystal-Ultra-UA43AUE65AKXXL/dp/B0B15CPR37/ref=sr_1_67?qid=1672909126&s=electronics&sr=1-67"}
{"product_id": "B0994GFWBH", "product_name": "Lapster 1.5 mtr USB 2.0 Type A Male to USB A Male Cable for computer and laptop", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹139", "actual_price": "₹999", "discount_percentage": "86%", "rating": "4.0", "rating_count": "1,313", "about_product": "Plug & Play|Stable & Reliable Connectivity.|Special grip treads designed on wire ends for easy plugging and unplugging; plug-and-play.|Connector : USB 2.0 Type A Male to Type A Male|High quality USB 2.0 high speed cable. Usually used for some external drive enclosures or cameras.|Compatibility with USB 1.0,1.1 , Supporting data transfer rate at up to 480Mbps|High quality thin USB type A adapter M/M is designed for Data Transfer and fast Charging, ideal for hard drive enclosure, printer, modem, scanner, camera etc. Interference Free", "user_id": "AF42EMTPEJAL4LNEPPX77TN77UHA,AHBMZRY43T2GTYDVNFMUVASIBTPA,AECCRE6ZTCPFGPVWDNY3IYYHCMOQ,AHOURK4XKLPPC4VHEDJ25NP64NPQ,AFC5K7RQQYKFB5PV47KAX2CHVIIQ,AHEVOBT5PFXMIS5A7GAXRG52XARQ,AHNOMOD65QU6QKFP3AMH5QPGQO6A,AGN2VH6RTYG5CM3YVH34VGYJFO4A", "user_name": "pruthvi natraj,Phani,Amazon Customer,TechDevoteeIndia,Devanand S B,Anuradha Banerjee,xxxxxxxxxxxxxxxxxxxxxx,chintan", "review_id": "RZJR37WFGXR9B,R39X6O18GM16TM,R18ZQ09EKVWZ9R,R3NHUC9S00KIR8,R30ZSNYE78E0O2,R2LVRBREQ4EFDM,R1UJ8BCYXWICT8,R34RH86MGL4HFB", "review_title": "A well-priced product.,Lenthy cord.,Product is working as expected.,Lengthy cable, works for car dashcam,Product is okay but they give 50rs for giving 5 stars.,Misleading length (1.2m), rest fine,Good Product,Good", "review_content": "i am writing this review after 2 months, the first cable had a cut and had to be replaced, the second cable is working fine, no issues, using it to charge me PS3 controller, works fine, at a good price, planning to pick up another one as a spare.,Product OK.,I bought this cable to charge my 10w Bluetooth speaker and its working as expected.,It's lengthy and usable for car dashcam.Quality is average and micro type B end does sit very tight.Otherwise, it's all good.But keep checking price of amazon basics cable of this type , price drops many times. That's better quality.,This is one of the good product in this price range. Quality is okay,Using it for my laptop cooling pad. Overall build looks sturdy, but longevity cannot confirm. Also, YOU CANNOT CONNECT 2 PCs USING A MALE TO MALE USB. THAT IS NOT HOW IT WORKS. Stop writing negative reviews after using this cable for something that it was NOT intended for.Can confirm that it is ~1.2m as most other products and not 1.5m as the seller claims both in title and on stickers on the product.No review mentions this. But I needed a 1.5m length for perfect use. So disappointed as I have to rotate the cooling pad and use it (cable falls short by around 15cm).,It works well. The cable is soft and flexible. In all probability, it will last long also.,But pover quality", "img_link": "https://m.media-amazon.com/images/I/310WOJIrwjL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Lapster-Type-Cable-computer-laptop/dp/B0994GFWBH/ref=sr_1_68?qid=1672909126&s=electronics&sr=1-68"}
{"product_id": "B01GGKZ0V6", "product_name": "AmazonBasics USB Type-C to USB Type-C 2.0 Cable - 3 Feet Laptop (0.9 Meters) - White", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹329", "actual_price": "₹845", "discount_percentage": "61%", "rating": "4.2", "rating_count": "29,746", "about_product": "Connect Usb Type-C Enabled Devices (Macbook, Chromebook Pixel, Galaxy Note 7 Etc.) With Standard Usb Type-C 2.0 Enabled Devices And Accessories (Smartphones, Car/Wall Charger, Multi-Port Adapters Etc.)|1 Year Limited Warranty|Up To 480 Mbps Data Transfer Speed; Power Output Up To 5V, 3 Amp|Certified By Usb-If To Be Compliant With Usb 2.0|Type-C Port Is Half The Width And One-Third The Height Of A Standard Usb-A Connector (Slightly Larger Compared To Lightning Or Micro-Usb Ports)|Ideal For Charging And Powering Usb Type-C Enabled Devices, As Well As Syncing Data, Photos And Music|Reversible Design - Easily Insert The Connector Into Any Type-C Enabled Device (Does Not Matter Which Side Is Up)", "user_id": "AEITVIFC7WZAEQDIVWPB4KUGKLRQ,AHQVFZCGAMMHEBBOY4SXBSRF3ZDQ,AECB6RAIS3NCSRCNMUWNZAQARNMA,AE43KS43Y6L62UBGG6K64AD5OISA,AGCBWB4YSTCDFAERTYIJ52KVW6EQ,AGPWASWUND4PQYWAP6ICZEPQCWZA,AFHT4L657CBTBKZ2UZEYQBAROXNA,AFQEZSS2I5IGAKZY3Y3CGDZLCJIA", "user_name": "harpreet,Y Kiran Korneli Reddy,Kadir,SP,Mr Sab.,Rupesh Singh,Abdul Maktedar,Anshita", "review_id": "R37S13YALMRPGK,R2OU2YTGFEMJHE,R25SDG11W8EAU9,R2W38EQOY97N87,R2U8MOGE4JDKBF,R2CN3CX7SGEWDK,RX74XLMFH35PD,R1B861YJE8YL2B", "review_title": "Its ok product not too good not bad,Cheap and best,Performance,Works well,Not working with Fast Charger,This Type-C cable is awesome😍.,Does not support display,Good", "review_content": "Not too good not too bad,If you have the trust of Amazon basics then go for it. I am writing this review after using it for 18 months. Still as sturdy and durable as the new one.,Nil,Used it for a fortnight till now in my car for mobile charging. Works well.,Not working with Fast Charger , if you are planning to use with normal charger , its pretty good . Product quality too its GOOD.,I'm using this cable since 1 years and currently this cable is running perfectly without any problems.If you want to buy best type-c cable then without thinking buy it.,Does not support display only work to connect network and charging,Good and useful", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/414y0iu5NUL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AmazonBasics-USB-Type-C-2-0-Cable/dp/B01GGKZ0V6/ref=sr_1_69?qid=1672909126&s=electronics&sr=1-69"}
{"product_id": "B09F9YQQ7B", "product_name": "Redmi 80 cm (32 inches) Android 11 Series HD Ready Smart LED TV | L32M6-RA/L32M7-RA (Black)", "category": "Electronics|HomeTheater,TV&Video|Televisions|SmartTelevisions", "discounted_price": "₹13,999", "actual_price": "₹24,999", "discount_percentage": "44%", "rating": "4.2", "rating_count": "45,238", "about_product": "Resolution: HD Ready (1366 x 768) | Refresh Rate: 60 hertz | 178 Degree wide viewing angle|Connectivity: 2 HDMI ports to connect set top box, Blu-Ray players, gaming console | 2 USB ports to connect hard drives and other USB devices | 3.5mm to connect your headphones | Bluetooth 5.0 to connect Bluetooth speakers, earphones and TWS earphones|Sound: 20 Watts Powerful Stereo Speakers | Dolby Audio | DTS Virtual: X and DTS-HD | Dolby Atmos pass through ARC port|Smart TV Features : Android TV 11 | Chromecast built-in | PatchWall 4 with IMDb integration | Kids Mode with Parental Lock | 75+ Free Live Channels | Universal search | Language Universe (16+ Languages) | India's Top 10 | Miracast | Supported Apps: Prime Video | Netflix | Disney + Hotstar | YouTube | Apple TV | 5000+ apps from Play Store | Auto Low Latency Mode | Quad core processor | Dual band Wi-Fi | 1GB RAM + 8GB Storage|Display: A+ Grade LED panel | Vivid Picture Engine | Detailed Picture Controls | Ultra bright screen | Dynamic contrast | Dynamic backlight|Warranty Information: 1 year comprehensive warranty on product and 1 year additional on Panel provided by the brand from the date of purchase|Easy Returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description provided|Video capture format :avi, mp4,Included components :1 led tv, 2 table stand base, 1 user manual, 1 remote control, 4 screws,resolution :720p", "user_id": "AG6WSLLXZY52HSQUY5PRCXTCYQYQ,AHGJ2DNFP3OJWO73XW2R7TDXI7WA,AGIC6PASSVB4T3KTZHK6ADD23GCA,AH4TEK5IQCC2BSF2KSQNKQEXAPLA,AFJIYRZTBOJBOWYQ5RNA36DBBXOA,AGCRWRS4RJYVGVKINV3VAR4CGDWA,AEGPWBXEAWPF6XRT7EZJOYJQA6DQ,AF5BU6DZ446HN4DTCO7W7AWXBJBA", "user_name": "prateeq,Suraj Chand,viswanath Raju,Ramamoorthy,Nitesh singh,Adnan,Kailash,Chandani Dinodia", "review_id": "R3CR9H6ABJ4Q4O,R2S5VBYYN51ELA,R1U0718A15KBBU,R9YRKNJ667H1E,RAWMG4UI4CZD3,R877Y6K5MW32G,RC458V57ETXDN,R2VOHT3T6361C5", "review_title": "Worth the price,Mi Smart Tv 32\" :- 7/10 average.,Worth using since 1.5 years,expect more from mi,Worth for money.,Good product,It’s good,Go for it without thinking twice.", "review_content": "Worth the price. I use the local cable providers set up. With my previous tv (Samsung) I was not facing this problem.  The only problem I am facing is each time I turn off the tv from the mains, I have to go to the settings and turn the settings on to tv speaker settings despite no other speaker or WiFi or blue tooth or cell phone being in the proximity. As a result I have stopped turning the tv off from the mains. I just use remote control to put it on stand by. BUT THIS IS A PROBLEM IN THE LONG RUN,,Display is very good. Sound is average iam using soundbar so no issues for me. Don't know how long it will last due to my previous mi 55 4 pro panel gone in 2.5 years. Bought this tv with 2 year warranty on panel.,improve the software response and improve the picture quality. worth for money for this budget (4K).,I have used 2-4 days. Picture quality looks good and impressive. Go for it..Hope long-term quality is also good.,This tv is very good but in this one thing bad is tha this tv some time get stop while playing only YouTube video but otherwise it's a good product,It’s good and value for money,Amazing pic and sound quality. 4K quality at this price. It's really good .", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41611VFTGwL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Redmi-inches-Ready-L32M6-RA-Android/dp/B09F9YQQ7B/ref=sr_1_72?qid=1672909126&s=electronics&sr=1-72"}
{"product_id": "B014I8SX4Y", "product_name": "Amazon Basics High-Speed HDMI Cable, 6 Feet (2-Pack),Black", "category": "Electronics|HomeTheater,TV&Video|Accessories|Cables|HDMICables", "discounted_price": "₹309", "actual_price": "₹1,400", "discount_percentage": "78%", "rating": "4.4", "rating_count": "4,26,973", "about_product": "HDMI A Male to A Male Cable: Supports Ethernet, 3D, 4K video and Audio Return Channel (ARC)|Connects Blu-ray players, Fire TV, Apple TV, PS4, PS3, XBox one, Xbox 360, computers and other HDMI-enabled devices to TVs, displays, A/V receivers and more|Cable allows you to share an Internet connection among multiple devices without the need for a separate Ethernet cable|Meets HDMI 2.0 standards (4K Video at 60 Hz, 2160p, 48 bit/px color depth) that supports bandwidth up to 18Gbps and backwards compatible with earlier versions|Note: Supports Max resolution of 4K@60Hz, for display issues downgrade resolution & gradually increase resolution for compatibility/display issues.|Cable Length: 6 feet (1.8 meters) - 2 units; 1 year limited warranty", "user_id": "AEYJ5I6JZZPOJB6MGWRQOHRQLPSQ,AFY5TVFOMVHGBPBTIJODYDQRZM5Q,AE3O6366WGEQAANKJ76QETTUQQTQ,AEQIJCPWSBCDKUO5VROXXHWX3PPA,AGVIAQK2HQ47P7UVXHW2NBAEU7YQ,AE3D5CJ2GDUP5SQ3AAYMVAGDTX7A,AH77IQRYD54XCRMCO7XEAIAYCLPA,AEA2HQHMFG3ZGJFOLLJQ65WKIZUQ", "user_name": "Rishav Gossain,Shashank Mallamraju,Purnendu,gunasekaran desomayananam,Anto RK,Sukrit Basak,Manoj Kumar,Sethuram.S", "review_id": "R1FKOKZ3HHKJBZ,R2WNMZI1EXTA0H,RCA1M3W4RIXUR,R3BKCLL6D7ZLIX,REVSR0ILY3547,R15W5KMQB95IV5,R10PB68FRUHT5V,R3TLCE9JSBU3UP", "review_title": "It's quite good and value for money,Works well,Hdmi cable,Value for money,All good,Gets the job done,Delivery was good,This one was my need to purchase", "review_content": "I am using it for 14 days now. The experience is pretty good as of now. Picture quality is also not bad. Don't expect something out of the world at this price point. But you can go for it if you have a tight budget.,Initial impressions: works as said, glad I didn’t go for cheaper options (not that it’s too costly) just plug and play. Will update if it screws up,The hdmi cable is good to watch movie,sports and its gives better quality while connecting your laptop with TV and play 🎮.I loved it,Works as expected. Length of the cable is short and it was mentioned also satisfied my requirement. If you need more length better look other options.,All good,It's the best HDMI cable at this price range. No problems yet. Just go for it !!,I was expecting this to be delivered on time and it was delivered on time.Product is good as i have tried other cables and wires from Amazon basica brand.,Good one", "img_link": "https://m.media-amazon.com/images/I/41eJqkFjCRL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AmazonBasics-High-Speed-Cable-2-Pack-Black/dp/B014I8SX4Y/ref=sr_1_73?qid=1672909128&s=electronics&sr=1-73"}
{"product_id": "B09Q8HMKZX", "product_name": "Portronics Konnect L 20W PD Quick Charge Type-C to 8-Pin USB Mobile Charging Cable, 1.2M, Tangle Resistant, Fast Data Sync(Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹263", "actual_price": "₹699", "discount_percentage": "62%", "rating": "4.1", "rating_count": "450", "about_product": "[1.2 M LONG DURABLE CABLE] : The Konnect L is about 1.2 M long and this feature allows for maximum convenience of the user. Not only is the cable length ample it also is durably built which ensures that no matter how roughly its handled no harm is done to it!|[20 W PD QUICK CHARGE FOR 8 PIN USB] : The Konnect L cable for 8 pin USB is an efficient cable for Apple smartphones charging and is as powerful as its Apple counterparts. You can plug in your smartphone for lightning speed charging!|[TPE & NYLON BRAIDED CORD] : The cable has been designed for optimal results and keeping this in mind it has been built with TPE and has further been nylon braided to ensure longevity and safe upkeep.|[TANGLE RESISTANT] : Isn’t it frustrating when we are in a hurry to charge our devices, and while pulling out the charger find it all entangled up? This is why we came up with this feature that will not only make charging hassle free but also ensure the cable’s longevity.|[FAST DATA SYNC] : Sync data from two devices with accuracy and ultra speed. The cable allows zero glitches and ensures distortion free exchange of data. You can use the cable to transfer large amounts of data continuously from one device to another!", "user_id": "AF6SKHWKK53BMAI6UVJA5FJMLK3A,AHIWSTMUSIYZAZQAMOLMPJHR7NMA,AHYDC5KBSNP2LD5ZV5SXO3CQSCDQ,AGACLGW4IBQOHLA6UJBIUNGVBRMQ,AGFX4BFHOC6FXDFPD2O24RCD32NQ,AGMXX5UGO3VXFAN2HOVYOWQYTRYA,AGNGZAPY5HMB7OOQAXQ3MH5OLVSA,AHR4VQLVSWORK3A35U3QA6IOEEBA", "user_name": "Thenmozhi,manish,Brajesh Jha,sushil kumar,Prasanth,Vishal Mehra,LmcX,Prashant Parkhe", "review_id": "R1LG3XV2XYCQQB,RPVNHPEU1HG9F,R1MD4LW015PP00,R5RCZRA2XSJVU,R1TPVT7TXNNW2,R1GYI0Y69RU13,R3S5U7BJ1KTKAU,R3F02OAHFU646V", "review_title": "Iphone User,Overall good,Perfect price, perfect fit,Good,Worth,Perfect replacement for Apple cable,At this price it's a steal.,Good cable with decent price", "review_content": "Good braided cable. Long length. Quick charge. I m using XR. This cable value for money. But chager apple OEM. Portronics type c to lighting  cable worth.,It’s easy to carry and the build quality is quite ok charging speed to almost equal to original oneGiving this review after 1 month usage,Great fit connector, l shaped connectors are convenient and better than some higher priced products.,good,Best product at this price range go for it🔥🔥🔥 and the software shows product will be genuine 🔥 most recommended braided cable for  products,Wish apple made this product as it is easier to hold the phone while charging,Superb quality and supports good charging speeds. Type c to lightning 20w at this price (250Rs) is a steal deal. Nobody is giving this quality at this price,Good cable available at a decent price of Rs. 312.ProsGood design.L shaped connectors will help keeping phone and power bank together in bag or pocket without causing and damage to the charging pins.Does fast charging and compatible with all fast charging power adapters.", "img_link": "https://m.media-amazon.com/images/I/41x3iKbD-+L._SX342_SY445_.jpg", "product_link": "https://www.amazon.in/Portronics-Konnect-Charge-Charging-Resistant/dp/B09Q8HMKZX/ref=sr_1_74?qid=1672909128&s=electronics&sr=1-74"}
{"product_id": "B0B9XN9S3W", "product_name": "Acer 80 cm (32 inches) N Series HD Ready TV AR32NSV53HD (Black)", "category": "Electronics|HomeTheater,TV&Video|Televisions|StandardTelevisions", "discounted_price": "₹7,999", "actual_price": "₹14,990", "discount_percentage": "47%", "rating": "4.3", "rating_count": "457", "about_product": "Resolution: HD Ready (1366 x 768) | Refresh Rate: 60Hz | 178 Degree wide viewing angle|Connectivity: 2 HDMI Ports to connect set top box, Blu Ray players, gaming console | 2 USB Ports to connect hard drives and other USB devices | 1 VGA Slot to connect your Laptop/PC | 1 Headphone Jack | 2 AV Input Slot | 1 RF Slot|Sound: 20 Watts Output|Display: High Definition | Dynamic Contast | Intelligent Signal Calibration | 16.7 Million Colours | Digital Noise Reduction|Warranty Information: 1 year comprehensive warranty provided by the manufacturer from date of purchase|Installation: Installation/Wall mounting/demo will be arranged by AHS Team. For any other information, please contact Amazon customer support|Easy Returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description", "user_id": "AFXQSBDW6232K22UMJWF5PMYX5RQ,AG4IENR3HNMEINBTJS3PET6VQY3Q,AEYIYXI67FZ3H57OBTA2BGZBGTHQ,AFUSP4NL7DIIS7CADTLDHGFLNOMQ,AEJG6XAZFMVQ7NRKCXG3ZCC3DIVA,AFIS3N547NISE4TGX3YU6F4X2AGQ,AGIJM2HE6GKI3I75OJ7PODHPP67Q,AGNXWXFWLOYZAYJ5PRIM2NB57E4A", "user_name": "ARUN KUMAR A V,Ankesh kumar pandit,Pradeep,limugha sumi,Amar,syed akrampasha,Ganesh, Tamilnadu,T Karthikeyan", "review_id": "R3FTW5HNPCX66C,RM7IFDV9KNC2O,RK9JKA9U9LZ49,R15UN38LGPS71W,RCBVF30PUU6UT,R1I75CYBWWYB2G,R2Z5R4CWX4B3KB,RX4O8WQ6VY2AS", "review_title": "Value for Money,Good product,Great excellent picture quality,value for money,Worth for the money,Good,100% Value for money,Value for money", "review_content": "Regarding rate I liked very much and reasonable.  Regarding the product Acer Company is manufacturing Computer Monitor and are best in quality.  So that, I prefer this company in buying TV,Its been 1 and half month using this product and have no complaint regarding the product some of its plus points are.1. Picture quality is good with clear sound quality2. We can easily connect any pan drive or otg to this Tv and access your content in tv.And Points in which it need improvement:1. Its does not support some audio format that.2. If we connect smartphone through OTG to TV it doesn't support the same3. Also we always have to use TV remote to start the TV. It doesn't start automatically when we on the swith, we have to press power button on remote each time to start this TV.Overall a very good product.,Picture quality is very good 😊,Bought this TV on amazon sale, value for money at this price, the picture and sound quality was okay, not that bad. If you want to buy a 32'' TV at an affordable price then go for this one.,Nice,Good,I purchased this tv two days before and now it's running. I observed the followings towards my experience.1. 100% value for money2.  Good design and finish3.  Great picture clarity.  I am using  Jio Fiber + Netflix4. Sound Also clear and smooth but little  Bit improvement needed.5. Package packed well as advertised.  Remote + Batteries + AV wire + warranty  Card + Manual.6. Promptly Delivered. 0 damage.7. Refresh Rate is 60hzOverall Recommended.,Picture quality is good.sound also good.value for money. One can purchase at low price.", "img_link": "https://m.media-amazon.com/images/I/51FicDnawaL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Acer-inches-Ready-AR32NSV53HD-Black/dp/B0B9XN9S3W/ref=sr_1_75?qid=1672909128&s=electronics&sr=1-75"}
{"product_id": "B07966M8XH", "product_name": "Model-P4 6 Way Swivel Tilt Wall Mount 32-55-inch Full Motion Cantilever for LED,LCD and Plasma TV's", "category": "Electronics|HomeTheater,TV&Video|Accessories|TVMounts,Stands&Turntables|TVWall&CeilingMounts", "discounted_price": "₹1,599", "actual_price": "₹2,999", "discount_percentage": "47%", "rating": "4.2", "rating_count": "2,727", "about_product": "Full motion cantilever mount|Fits 32inch-55inch flat panel display|Vesa compliance 100x100 to 400x400mm", "user_id": "AGZU6C2XL3X2B4NEWLQJDSJ75QGA,AHY62YAUHMMGFKSBGCECVGKXY2UQ,AEMGDIDXCHHDMTAJHRNXBUWISFQQ,AHQNYNRXESALGWMUFS6ITFGOVGMQ,AH7GOHZT6M5G6ELWPDTVZVKRZ7ZA,AEHIRIOGHJKVTFYHFZVQ322CMZMA,AFUU5Q42TD7WLXRGKOBMRGUZWRFQ,AFUV6WMMWSY6UM3P6ATQ6SME3H7A", "user_name": "Prashant Pradhan,Raghavendra Shetty,Shiva prasad,James.faihriem,MANI TEJA,Christopher R,PG,Gangadhar Kotapatti", "review_id": "R9GNL4OF49DH6,R2I0MJPJI6FOIE,R732VQVZLKUGL,R3L55JQKYQUMNC,R2MN9LXLLTNJ58,RY71WCYL05RXL,RPFUVX3Z31TRO,RO7LRFL67Z505", "review_title": "A nice & sturdy product.,Assembly,nyc hairdryee,Good,Fits perfectly!!,Not suitable for 50inch and above 😟,Worth buying,Worth", "review_content": "Its a good product.  Used for 42 inch TV, had to get it installed by a TV mechanic.,Gud for 40inch above tv,best,Awesome,Nice and sturdy!!The quality of the product is outstanding.,The Stand is not suitable for 50inch and above.,Arrived in good condition. Quality of mount is excellent, heavy and sturdy. It has paper manual, with clear steps and tools required for installation. Installation was easy and quick. Happy with this purchase.,55inch to can handle this", "img_link": "https://m.media-amazon.com/images/I/41+mgWz7knL._SX300_SY300_.jpg", "product_link": "https://www.amazon.in/Model-P4-Swivel-32-55-inch-Motion-Cantilever/dp/B07966M8XH/ref=sr_1_76?qid=1672909128&s=electronics&sr=1-76"}
{"product_id": "B01GGKYKQM", "product_name": "Amazon Basics USB Type-C to USB-A 2.0 Male Fast Charging Cable for Laptop - 3 Feet (0.9 Meters), Black", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹219", "actual_price": "₹700", "discount_percentage": "69%", "rating": "4.3", "rating_count": "20,053", "about_product": "Connect USB Type-C enabled devices (MacBook, Chromebook Pixel, Galaxy Note 7, etc.) with standard USB Type-A enabled devices (laptops, hard drives, power banks, wall/car chargers, etc.)|Ideal for charging and powering USB Type-C enabled devices, as well as syncing data, photos and music|Reversible design - easily insert the Type-C connector into any Type-C enabled device (does not matter which side is up)|Type-C port is half the width and one-third the height of a standard USB-A connector (slightly larger compared to Lightning or Micro-USB ports)|Up to 480 Mbps data transfer speed; power output up to 5V, 3 Amp|Certified by USB-IF to be compliant with USB 2.0 Standard", "user_id": "AHVZCQP5SYIVGZJK4LRP55ZXWETA,AF6YDBL3KYIK3LBKKDIHUMOLKN4Q,AHKL2U5BIK4ZODWORRJ5RWNLL2TQ,AFKZHMXRXMRTVZLMHATTD53AVKRA,AGFTWXF3QWIHMPN7SMTSHB6HNJ7Q,AE4G376L73UNPWICYOSYO2KNXYJA,AHGFA5MNVOFDMIL3322YZ6IOA5VA,AGUR3CFYVZUMDJQIESKOIQOGV7AA", "user_name": "Hremant,Anjaneyulu,Madhav,NOTTADRIS,Deepak,P,M.SASIKUMAR,S.Suresh", "review_id": "R1BC08IFG4REKS,R1FJKIHIO54SOW,R3JR48W2CI480,R3JH7SHSXDT1GT,R35QWAY83WL8H6,R25N2U90N2A5AS,R19AK3DT3JOE82,R210WJI15JCSRE", "review_title": "You can trust on this one,The best usb cable,Wel build just like original .,Nice!!,Working perfectly,Basic,Good,No issues", "review_content": "Previously bought amazon basic USB type A cable and i didn't last long, but this USB C product seems manufactured with high quality materials. Supports fast chagrining, data supply etc. just go for it,Exllent,Very satisfied with this purchase, just like orginal quality . Will buy again in future .,My sister is using this cable to charge her phone and the cable is durable and good enough for my sister's phone. Love it!!,I bought it to use Android Auto on Tata Altroz car by connecting to my one plus nord 2T mobile.I have been using this for more than a week now. It's working perfectly..I am happy with the product so far.,Basic,Great product money worth,No issues", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31-BRsjrvDL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AmazonBasics-Type-C-USB-Male-Cable/dp/B01GGKYKQM/ref=sr_1_77?qid=1672909128&s=electronics&sr=1-77"}
{"product_id": "B0B86CDHL1", "product_name": "oraimo 65W Type C to C Fast Charging Cable USB C to USB C Cable High Speed Syncing, Nylon Braided 1M length with LED Indicator Compatible For Laptop, Macbook, Samsung Galaxy S22 S20 S10 S20Fe S21 S21 Ultra A70 A51 A71 A50S M31 M51 M31S M53 5G", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹349", "actual_price": "₹899", "discount_percentage": "61%", "rating": "4.5", "rating_count": "149", "about_product": "🥇【Kindly NOTE before you purchase】:This is a USB-C to USB-C cable, which means it has the same USB C or Type C plug on both sides, please keep a note that this cable is not a USB-C to USB-A cable. Besides, you may need a USB C wall charger to charge your device. This product DO NOT support video output and monitor connection.|🥇【65W High Speed Charging】: Build-in updated smart chip, which makes this USB-C to USB-C PD cable strong enough to support max 3.25A current 65W power through, as well as support fast charging for more Type-C devices. You need a USB C wall charger for your device to charge and we would like you to recommend to use the original wall charger.|🥇【Compatible Devices】:This USB C to USB C cable compatible with Samsung S20, S21 Ultra, A71, laptop Macbook, Samsung S21 S22 S20 FE 2022 A71, A51, A33, M51, M31, M31s, M33, M53, Macbook Air, Macbook Pro, Macbook Air M1|🥇【Military grade material】:Strong military fiber, the most flexible, powerful and durable material, makes tensile force increased by 200%. Special Strain Relief design, can bear 10000+ bending test. Premium Aluminum housing makes the cable more durable|🥇Warranty: Oraimo offer 365days warranty .Oraimo develops cool and creative smart accessory for young people around the world, enableing them to explore more excitement.", "user_id": "AEOIHOJD3O5MYSVWZOBDUJGYWZGQ,AF6LAYTAGSTBKL2QUF3WFB6OMCPQ,AHKXH7KSF7CPJCJMHB6B35VPTETA,AFELQLNWTS4QJNCCA4ZDTWHVORJQ,AGGE54AKRMX2XMQWQQTSUOPL7CHA,AG7ZAJNX4XZ5LTA4NLWBHTCX2V5A,AGYSVNZMQT5LOVKHSCYDE7OAPKVA,AHAI6EM7F7W3GV3SUIDSKWTBJOSA", "user_name": "Ravi Shankar,Prakash Luhariya,bhavesh sabalpara,Anup Roy,Hasibul seikh,Manoj Kumar,Amazon Customer,DEEPAK  MAZUMDAR", "review_id": "RDFETF8YFDP96,R3604ERFM30Q4D,R1CB3GDRVBHAIG,R29H4558OA57RW,R2C4V03DG7EDWE,R20CNK6VJGER17,RXZLH38FGBU9K,R3E6TE6HH92GC3", "review_title": "It worked well for some days later it is not working , I want it to replace.,Extremely fine,Superb product,This is very decent, quality is super good!,Good,Awesome Product Quantity & Value For Money,Go for it..,Be(a)st in the market.", "review_content": "It worked well for some days later it is not working , I want it to replace.,Nice,Superb product with white lights at both ends when charging. colour and quality feels very premium..,https://m.media-amazon.com/images/I/81u-AB650VL._SY88.jpg,Good,Good Build Quality. Nice Product & Highly Recommended.,Good quality and looks beautiful... I will surely recommend,( After using it for 3 weeks). I use Samsung M51, few months back my USB Cable was torn, so I wasn't able to fast charge. It took a decade to charge from 20-90%. Samsung original cable was too pricey and too flimsy, so I was searching for something durable. While browsing through the product page I was skeptical to place an order, as the company claimed too many features in such a low price. Keeping the negative thoughts aside I ordered it anyhow. The product was delivered well in advance, which made me happy.I unboxed and plugged in the cable, to my surprise the cable delivered everything that the company claimed. The ends have aluminum casing which makes it durable and away from regular wear and tear, it has LED indicator on both ends which turns on when the charger is plugged to the phone. Also, the box that it comes with has a secret code that you need to scratch to reveal which helps to check its authenticity.It easily fast charges my phone in an hour. Overall, I'm very happy with the product.I highly recommend this cable to anyone who needs a fast charging Type C to C cable.Will update this review if any change is observed.", "img_link": "https://m.media-amazon.com/images/I/41gztmbiIgL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/oraimo-Charging-Syncing-Indicator-Compatible/dp/B0B86CDHL1/ref=sr_1_79?qid=1672909128&s=electronics&sr=1-79"}
{"product_id": "B0B5ZF3NRK", "product_name": "CEDO 65W OnePlus Dash Warp Charge Cable, USB A to Type C Data Sync Fast Charging Cable Compatible with One Plus 3 /3T /5 /5T /6 /6T /7 /7T /7 pro & for All Type C Devices - 1 Meter, Red", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹349", "actual_price": "₹599", "discount_percentage": "42%", "rating": "4.1", "rating_count": "210", "about_product": "FAST AND STABLE CHARGING: Flexible USB type c cable, broad internal cabling made of copper and nickel ensures that power reaches your device much faster. 60% charging capacity in around 30 minutes with the original charger adapter.|EXTRA TOUGH, EXTRA SLEEK: Our premium, intricate flat wire not only makes the cable durable and long lasting to suit a variety of everyday connection needs but also ensures it lasts several times longer than standard cables.|RELIABLE AND SAFE: The smart chip inside it can intelligently identify the current required by your device to prevent it from overheating and overcharging.|HIGH SPEED DATA SYNC: Supports data transmission at up to 480 Mbps, which can save a lot of time when transferring data such as files, photos, music, movies, videos, etc. between your phone and other devices.|WIDE COMPATIBILITY: The Type C cable is compatible with all the latest android smart phones, earbuds & tablets with type c ports. On the other end, USB Type A connector can be used to charge your phone from any standard wall charger.", "user_id": "AGE6O2NLNA3NUGORPU4SDK2S23QQ,AEXZDEFVFQ3LW6DKHRGXLPWF63DQ,AHU4FNYTFWSGG5TMN53LED2U7X2Q,AEH463ZLT7U67XS3DWK2Y27GLVWQ,AGOXDFXDUHGRNK5JD2YNYIZ72AEQ,AEDLXBJM6UISEM4SXR6YUIY4KNCQ,AGHUNVKMP4YTSSYUDMEX3JJJ5I3Q,AH5IBUYCUMQE3ZLKBJ3PLWNMXDIQ", "user_name": "Satyanarayana,mohd irfan,Pankaj,Shirish Shivarkar,Thomas,datta DG,NB SHOP,Vijay", "review_id": "R27HJ954EMEOQK,R2EPGPZGPWXR4I,R1KUXERHI948E7,R1YRGKI6652QR,R3DCUTJ6CQCASZ,R11TECZ2LD0OKP,R276HYHWQ5B09O,R2HOVRWP63K3OL", "review_title": "Good.,Good product,Ultimate product,Good Product,Not that good. But ok for the price.,Fast cable,Fast charging 👍,Best Alternative to Original Cable", "review_content": "Working well and fast Charing as claimed. Pice is at highside. Good item.,Good working worth of money 💰,It is an awesome cable i got it from Amazon. Do charge my phone in a fast way.,The cable is good in quality and charges fast , got it in good deal in the sale .,It's not a fast charger. It says fast charge but it takes forever to charge. But the wire is strong and durable.,Super fast,Charging very fast👍Good product 👍,Works for both DASH and WARP Charging. Good build quality.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41SNaWjuZWL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/CEDO-OnePlus-Charging-Compatible-Devices/dp/B0B5ZF3NRK/ref=sr_1_80?qid=1672909128&s=electronics&sr=1-80"}
{"product_id": "B09RFC46VP", "product_name": "Redmi 108 cm (43 inches) 4K Ultra HD Android Smart LED TV X43 | L43R7-7AIN (Black)", "category": "Electronics|HomeTheater,TV&Video|Televisions|SmartTelevisions", "discounted_price": "₹26,999", "actual_price": "₹42,999", "discount_percentage": "37%", "rating": "4.2", "rating_count": "45,238", "about_product": "Resolution : 4K Ultra HD (3840x2160) Resolution | Refresh Rate : 60 Hertz | 178 Degree wide viewing angle|Connectivity: Dual-band Wi-Fi | Bluetooth 5.0 | 3 HDMI ports to connect latest gaming consoles, set top box, Blu-ray Players | 2 USB ports to connect hard drives and other USB devices | eARC - Dolby Atmos Passthrough eARC HDMI port | Optical Port|Sound: 30 Watts Output | Dolby Audio | DTS Virtual: X | Dolby Atmos pass through eARC | DTS-HD|Smart TV Features : Android TV 10, PatchWall 4 with IMDb integration | Quad core processor, Built-in Wi-Fi, Chromecast built-in, Ok Google, Auto Low Latency Mode, 2GB RAM + 16GB Storage, Miracast | Supported Apps: Prime Video, Netflix, Disney + Hotstar, YouTube, Apple TV, 5000+ apps from Play Store,|Display: 4K LED Panel | Dolby Vision | HDR10 | HLG | Reality Flow | Vivid Picture Engine | MEMC|Warranty Information: 1 year comprehensive warranty on product and 1 year additional on Panel provided by the brand from the date of purchase|Installation : Wall mounting/demo will be arranged by Redmi service partner. For more information, please call Redmi support on Toll Free Number (Please visit brand website for toll free numebrs) and provide product's model name and seller's details mentioned on your invoice. The service center will allot you a convenient slot for the service.", "user_id": "AG6WSLLXZY52HSQUY5PRCXTCYQYQ,AHGJ2DNFP3OJWO73XW2R7TDXI7WA,AGIC6PASSVB4T3KTZHK6ADD23GCA,AH4TEK5IQCC2BSF2KSQNKQEXAPLA,AFJIYRZTBOJBOWYQ5RNA36DBBXOA,AGCRWRS4RJYVGVKINV3VAR4CGDWA,AEGPWBXEAWPF6XRT7EZJOYJQA6DQ,AF5BU6DZ446HN4DTCO7W7AWXBJBA", "user_name": "prateeq,Suraj Chand,viswanath Raju,Ramamoorthy,Nitesh singh,Adnan,Kailash,Chandani Dinodia", "review_id": "R3CR9H6ABJ4Q4O,R2S5VBYYN51ELA,R1U0718A15KBBU,R9YRKNJ667H1E,RAWMG4UI4CZD3,R877Y6K5MW32G,RC458V57ETXDN,R2VOHT3T6361C5", "review_title": "Worth the price,Mi Smart Tv 32\" :- 7/10 average.,Worth using since 1.5 years,expect more from mi,Worth for money.,Good product,It’s good,Go for it without thinking twice.", "review_content": "Worth the price. I use the local cable providers set up. With my previous tv (Samsung) I was not facing this problem.  The only problem I am facing is each time I turn off the tv from the mains, I have to go to the settings and turn the settings on to tv speaker settings despite no other speaker or WiFi or blue tooth or cell phone being in the proximity. As a result I have stopped turning the tv off from the mains. I just use remote control to put it on stand by. BUT THIS IS A PROBLEM IN THE LONG RUN,,Display is very good. Sound is average iam using soundbar so no issues for me. Don't know how long it will last due to my previous mi 55 4 pro panel gone in 2.5 years. Bought this tv with 2 year warranty on panel.,improve the software response and improve the picture quality. worth for money for this budget (4K).,I have used 2-4 days. Picture quality looks good and impressive. Go for it..Hope long-term quality is also good.,This tv is very good but in this one thing bad is tha this tv some time get stop while playing only YouTube video but otherwise it's a good product,It’s good and value for money,Amazing pic and sound quality. 4K quality at this price. It's really good .", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41w1didcczL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Redmi-inches-Ultra-Android-L43R7-7AIN/dp/B09RFC46VP/ref=sr_1_81?qid=1672909128&s=electronics&sr=1-81"}
{"product_id": "B08R69VDHT", "product_name": "Pinnaclz Original Combo of 2 Micro USB Fast Charging Cable, USB Charging Cable for Data Transfer Perfect for Android Smart Phones White 1.2 Meter Made in India (Pack of 2)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹115", "actual_price": "₹499", "discount_percentage": "77%", "rating": "4.0", "rating_count": "7,732", "about_product": "[SYNC & CHARGE] : Ideal for charging and powering Micro USB port devices, as well as syncing data, photos and music.|[EASE OF USE] : Smoothly insert the Micro USB connector in a right way in your device.|[SYNC DATA] : Transfer data at high speeds.|[WARRANTY] : 6 Months hassle free warranty from the manufacturer.", "user_id": "AEGZSNGSJJAEMJ3RRNVZTKUILOHA,AGX46OTZ7C4VDXH4UA7ZAZIZUMYQ,AEDLLY6JXNCVYIW227SBCPVYHNUA,AGTJ44UNO6K5X567YLQPYGN3TV4Q,AFYCBABBI2GCQRSCKIRHPLQNO72A,AG55XGEMTFKS7BXQTNFKHFTMMW5A,AGQYGAK76B74HUWOOUOFTXH2LAZA,AHFHIY2KE5PQIJ6H7PKV6N7OLIZA", "user_name": "Vijayan C V,Sanjay P.,keshav,Dharemesh K.,Amazon Customer,Rajesh,Sagar Yadav,Vaibhav", "review_id": "R2VUNGNI96EEJ7,R2JGNI2T5LVFRQ,R9ISXRV6DA0OY,RZFW11UFTCBVH,R1WGHB13Q2OLYA,R11ETJ640KDIRW,R2IA54QBAYAGND,R23Y3AD6E6GE9N", "review_title": "Very good product and met my need.  Thanks,Decent value,Nice quality… trustable…,Just well in this price.,supports 2.4 amps fast charging,Nice,Nice.,Value for money", "review_content": "Liked the product.  Accurate to my usb apparatus.,Good value,Till now i had purchased about 20 cables both micro and c type for myself and my family in this last one year. Its all because this brand wins my trust by provinding great quality with reasonable price,na,tested with 2.4 amps charger and phone. gives full 2.4 amps power to phone.the cable LOOKS thick and it has nice texture. despite that, i am sure it is not very durable. the usb connectors are extremely sturdy and they dont bend or flex. the wire will break before the connector does!!warning: usb micro connector has a strong hook. be careful while plugging and unplugging, or you may damage your device.very cheap and usable cable for 120 rs,Super power,Nice product.,In this price this is the best one", "img_link": "https://m.media-amazon.com/images/I/41gFqSHngyL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Pinnaclz-Original-Micro-USB-Charging/dp/B08R69VDHT/ref=sr_1_82?qid=1672909128&s=electronics&sr=1-82"}
{"product_id": "B09RWZRCP1", "product_name": "boAt Type C A750 Stress Resistant, Tangle-free, Sturdy Flat Cable with 6.5A Fast Charging & 480Mbps Data Transmission, 10000+ Bends Lifespan and Extended 1.5m Length(Rebellious Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹399", "actual_price": "₹999", "discount_percentage": "60%", "rating": "4.1", "rating_count": "1,780", "about_product": "The boAt Type C A750 cable is compatible with smartphones, tablets, PC peripherals, Bluetooth speakers, power banks and all other devices with Type-C ports.|It ensures 6.5A fast charging for all the latest charging protocols and data transmissions with rapid sync at 480 Mbps|The convenient flat cable design makes it tangle free, sturdy and invincible against external damage.|Its ultra-durable PVC housing shell housing and extended tail protection makes it last longer to give a 10000+ Bends Lifespan.|boAt's Type C A750 cable offers a perfect 1.5 meters in length for smooth & hassle-free user experience.|2 years warranty from the date of purchase.", "user_id": "AFJVYK4FXVGRSTSLGVUE5JGB2NVA,AEVJIJSEUXPBRKOQ2PB4JNBUTFRA,AGRLDCPA7VJZZTV4GUIODVQ3DTHA,AEUDATTJUCKFQ5ETVLUU57ZZ3XXQ,AEGR6ZYWXPEZWM7JUEBWQHAOPS2A,AEETOHX32FYDRI6SIAW7L76Q2NHQ,AELSOXQRZBOFSSY4HJUR4Y7ASQBA,AFJ6ALITTDOSUNPSFLRGDVIAEWBQ", "user_name": "livin sebi,Anand k.,Rahul Pandita,Fazil Mohamed,Steve,Shivasunhith,Varun Kumar,Advaid Haridas", "review_id": "RMEKYV7XWTWKV,R1PYVXH6MGUQLU,R3FUT08S34HBHW,R2X57Q7030Q9DG,REPXGC5R2LG85,R399JBQZ8JKDKC,R1N2RQSGT02EZJ,R1NGVE16U4ZUIR", "review_title": "Better..!!,Charging speed is not guaranteed!,Exactly as advertised,Excellent warp charge cable,Nice,Amazing cable,Best fast charging cable,Really a good cable, Recommend", "review_content": "Yeap this cable support 65w fast charging tested on my 65w brick of realme 7 pro..Cable and pins quality looks good.Since i couldnt find original cable for 65w charger of realme i was searching for long time for a good one...,Charging speed depends on number of factors and only in best condition it will go above 50 watts and the brand only claims that 65 watts fast charge if only you use the brand's inbox charger . For me personally I tested out at multiple occassion using it for a month or two I never got speed above 38 watt and i tested it with the cable that I received from the box and it also gave me the same speed so buy carefully if you're conditions are good and you get speed more tha 50watss then only you should buy it or you should go with 3A/4A cables as they are cheaper and more durable braided cables,The cable supports fast charging (I'm using a OnePlus 65W charger) as advertised. If it could have been round and braided instead of flat ribbon cable, that would make it more durable. In my experience, braided cables are easy to wrap and store when not in use and they dont get frayed easily. My cable stopped fast charging after two months of usage but warranty support was excellent, I submitted the cable at a nearby centre and a new cable was shipped within 3 days. I've been using Boat Cables for about 6 years now (a cable from a Moto G4 phone is still with me and in use)  and will stick to them.,Got the original one, but there are fake cables being sold, so beware.It warp charges as it supports 6A power supply. The cable is long and sturdy compared to the typical OnePlus cable in the box. The price of original OnePlus cable is 890 mrp but this i got for 400 and is not unlike other third party wires. Definitely worth it. 👍🏻,Best in price segment and durable material tangle free alsi,Amazon send me a used product but the cable is super and support fast charging and the quality is also good but they sent me a used product by others if not it's super product and 3 year's of warranty on it just buy it,Very good quality fast charging cable, getting good quick charging through laptop also.Flat cable design makes it more durable.,I have a OnePlus 7t with 30 Watts charge,My original wire had been destroyed few years ago and was searching for a cable with 6v-5a for fast charging, I had buyed many wires but the phone was not charging as fast as 5he original one. This wire has a good build quality and can do 65 watts (6.5a).", "img_link": "https://m.media-amazon.com/images/I/41jlh3c7UbL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/boAt-A750-Tangle-free-Transmission-Rebellious/dp/B09RWZRCP1/ref=sr_1_83?qid=1672909128&s=electronics&sr=1-83"}
{"product_id": "B09CMP1SC8", "product_name": "Ambrane 2 in 1 Type-C & Micro USB Cable with 60W / 3A Fast Charging, 480 mbps High Data, PD Technology & Quick Charge 3.0, Compatible with All Type-C & Micro USB Devices (ABDC-10, Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹199", "actual_price": "₹499", "discount_percentage": "60%", "rating": "4.1", "rating_count": "602", "about_product": "Stay ahead and never miss out with a 3A fast charging speed for your devices|It supports Quick Charge 2.0/ 3.0 technology to keep your devices boosted up|Its sturdy design and braided cord are tough enough to withstand 10000+ bends|Crafted for convenience, it allows you to charge and sync data with just one cable|It is widely compatible with all types of Micro USB & Type-C enabled devices", "user_id": "AHH2TIJJ2IGD5H3DJO3FROUHRRSQ,AF37X7ZH7JPA6H5Q64NV6QFIBCYA,AFKT7LV4XE6XJ2VTHCBHPQECW2RQ,AE7GGDNBOHD2JQ2X5JPD666SAQOQ,AENNAVVG4GBJKDQKJXQUEKQKTXGQ,AFPSO7EYQBYVEJGD4TAT7YFCM6UQ,AFV5W5BR6PKGHPIG3J6TNFK7BSXQ,AHILALAA7Q6SQRTFJVLT75P37FXQ", "user_name": "Gopal krishna rout,Customer,Amazon Customer,AMAN KUMAR,Amazon Customer,Ghanshyam Hemade,Satyam Pandey,Amazon Customer", "review_id": "R37D7HJR4MR520,RPXR67LNCQALE,R1K9WE1GDB2PP0,R34PZ2AX727RPD,R2HALNEM14EW7P,R3D6EV6X38WU4Q,R2NCR8UX28VRH4,R3PTXRLR7MPN25", "review_title": "Good product,Its good, but micro usb doesn't fit my phone.,Good and useful item,It is very best cable,good,2 in 1 Charging Cable.,Sturdy cable overall,Nice & Best Charger Cabel", "review_content": "Product is good , and also it's  strudiness .But no fast charging in this cable , it's normally charging . I love it because it's supported in micro usb , or type c . Over all good .Pros / advantage :- -1) 1.5 meter wire  2) more durable3) supported dual mode type c , micro usbCons / disadvantages:- normal charging , not fast charging,Though it is braided, but it is not strong like boAt. But it's okay to use it. Supports turbocharging.,Working well after months of use. Only thing is that if there is slight pressure, the C -type adapter will come off from the micro usb head. So better to see that the cable is not stretched when using the C type adapter. Otherwise working fine and very convenient for me since i usually have a phone with C type charging and a small Tab with micro USB charging when i travel. I need to carry only one cable now with my powerbank. Will recommend.,Best cable,good,Both Micro USB & Type C mobile connector's are getting charge.Good Decision to purchase this product.,Cable is a good fibre braided with good length.The connector also has a tight fit, sometimes you have to apply a bit force to remove(ig it'll wear off after usage).In comparison, boat has a better quality i would say if u get that in offer as it has metal braided cable and better quality microusb pin.,I like the product bcuz it's help me to charge both phone Type C & Micro Cabel", "img_link": "https://m.media-amazon.com/images/I/31x3IUfMneL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Ambrane-ABDC-10-Charging-Transmission-Compatible/dp/B09CMP1SC8/ref=sr_1_84?qid=1672909128&s=electronics&sr=1-84"}
{"product_id": "B09YLXYP7Y", "product_name": "Ambrane 60W / 3A Fast Charging Output Cable with Type-C to USB for Mobile, Neckband, True Wireless Earphone Charging, 480mbps Data Sync Speed, 1m Length (ACT - AZ10, Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹179", "actual_price": "₹399", "discount_percentage": "55%", "rating": "4.0", "rating_count": "1,423", "about_product": "Fast Charging Cable - The cable can support upto a charging speed of 3A making it the optimal cable for Quick Charge / Rapid Charge and Turbo Charge devices.|Reversible Connector – It has reversible type c connector that can be plugged in any direction, upside or downside.|Durable Cable- Using only premium quality materials and a tough, durable PVC Coating, the Ambrane USB cable is built for connecting and disconnecting over and over again without signal loss.|High Speed Data Transfer- 480 Mbps data transfer speed allows you to sync the data to the computer or other USB devices within few seconds.|Genuine USB Connectors- We use only certified and high-quality connectors ensuring not only the safety of the connected device but also reliable charging and high-speed data transmission.", "user_id": "AGU76WKSU62DUNTPCMTC4FCUNRTQ,AEOVR6JEQTAC77BXE5AJMWJGG5PA,AFIFHW5QMFMTWXNZ2JORBMINL3CQ,AG36G3XPHERLKRDG7XYQ2IWJWPIQ,AFEOAY5PB4XEYIOL6DY5WJBOYSKQ,AF2EHSXFZWWS2YEN22DV2ZCJDZZA,AGUFRJ5TPSUUBZBNRWHDRJV4VMQA,AGYEIMSVEDOLA2OV3DIOGX2IMCBA", "user_name": "Actual user,Shanti lal Gurjar,Gowthami,Amrut K.,chetan tandel,Mwnzil brahma,Amazon Customer,Karthik", "review_id": "R8QBCR9MM1LGY,R3VN8XDH215N7I,R341EQRY87EZP,R3HHTVIHY2U1FO,RNA87JCGRTQJU,RZ12R7OYYP0KX,R2GZZ3WYE0JJYA,RHE3HXKSONROE", "review_title": "GOOD,Thank you  Amazon very good charging cable,Good,Very good product,good quality,Very Good Product,This is fast charging USB!,Simply perfect at the price of below 100", "review_content": "Everything is fine but it is bulky and hard, it should be softer and thinner.....,Thank you  Amazon very good charging cable 👍,Good,Good one,quality is good. worth for 150-200 ₹. short but durable.,Very Good product . Satisfied..,This is fast charging C pin USB!You can purchase it.,Nice product at price of below 100", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31l-eZHBfKL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Ambrane-Charging-Neckband-Wireless-ACT/dp/B09YLXYP7Y/ref=sr_1_85?qid=1672909128&s=electronics&sr=1-85"}
{"product_id": "B09ZPM4C2C", "product_name": "TCL 80 cm (32 inches) HD Ready Certified Android Smart LED TV 32S5205 (Black)", "category": "Electronics|HomeTheater,TV&Video|Televisions|SmartTelevisions", "discounted_price": "₹10,901", "actual_price": "₹30,990", "discount_percentage": "65%", "rating": "4.1", "rating_count": "398", "about_product": "Resolution: HD Ready (1366 x 768) | Refresh Rate: 60 hertz|Connectivity: 2 HDMI Ports to connect set top box | 1 USB ports to connect hard drives or other USB devices | IR Port to control connected devices like DVD / STB Players|Sound: 16 Watts Output | Powerful Speakers with Dolby Audio|Smart TV Features : Android R 11 ,Packed with amazing smart features such as Google Voice Search, Google App Store and Built-in Chromecast. Google Play Store, YouTube, Google cast, Netflix.|Display : LED Smart TV | Ultra bright screen for flawless picture quality even in bright rooms|Warranty Information: 2 year comprehensive warranty provided by the manufacturer from date of purchase|Installation: For Installation, Wall Mounting, Demo Of This Product Once Delivered, Directly Contact Brand Support (Visit Brand website for Toll free numebrs) and Provide Product's Model Name And Seller's Details Mentioned On Your Invoice. The Service Center Will Allot You A Convenient Slot For The Service", "user_id": "AFRONQAZPYZARLWLDQM2VXS7ZTIQ,AGA5INGXTDEODK7X55L4WXF6DJNQ,AHTI2CPD7SANQV7GK4FHIKCWJ7VA,AFUYGZVKVTGAEIOV2UCYF5JPXSCA,AHFVYKQ2L4PSG4EKGA4GLQKQT2NA,AENTXYVP4NNTWTHTYFRTOOY2MEAA,AGJS36PNW27URDEUJGCT2OLR3Z6A,AFG6LFTPXXKNHXVGXPDM6P3CCAHA", "user_name": "Nilesh K Salvi,Amazon Customer,Wippingstone T.,Nareshkumar kangula,j.shahulhameed,martin stanly,shekha p,Paavanaarun", "review_id": "R95AYORS91NWX,R345JC4508EPTU,R20E3IUW7O236Z,R2QP52L8FNG8EN,RS73FA8EPYION,R134725GEKQE0F,RSQ14DVNFLV3C,R2OSJ4YOGUTXNR", "review_title": "Good, Value for Money,Picture quality was nice....over all product nice,Till today everything okay,Y,Good,Outstanding Performance,Must buy,Value for money", "review_content": "Everything is good. Just one suggestion, when TCL is giving its own channel, then it should have some content. What it does, it will route me to another OTT platform for which subscription will be required to be taken.,https://m.media-amazon.com/images/I/61mPJN3sH-L._SY88.jpg,I like picture quality, sound,Good,Good,Excellent, very nice.,Almost one month of usage , tv is far better than mi TV. Our 40\" mi horizon edition got complaint 3 times in 2 years of warranty period and finally they didn't replaced, third time display gone  after 2 days of warranty.So never go for mi. TCL picture quality and sound quality is very good. In this price range a must buy product.,Good", "img_link": "https://m.media-amazon.com/images/I/51ow6bmLWIL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/TCL-inches-Certified-Android-32S5205/dp/B09ZPM4C2C/ref=sr_1_86?qid=1672909128&s=electronics&sr=1-86"}
{"product_id": "B0B2DJDCPX", "product_name": "SWAPKART Fast Charging Cable and Data Sync USB Cable Compatible for iPhone 6/6S/7/7+/8/8+/10/11, 12, 13 Pro max iPad Air/Mini, iPod and iOS Devices (White)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹209", "actual_price": "₹499", "discount_percentage": "58%", "rating": "3.9", "rating_count": "536", "about_product": "[High Compatibility] : This iphone data cable supports with iPhone 6,6s,6 plus,6s plus,7 7 plus ,8 8plus,x,xs,11 pro max,12 mini pro max,13 mini pro max iPad Air, iPad mini, iPod Nano and iPod Touch|[Fast Charge&Data Sync ] : It can charge and sync simultaneously at a rapid speed, Compatible with any charging adaptor, multi-port charging station or power bank ,for fast charging ,fast adapter is must.|😍【Durable Spring Protection】：The easy-to-break connection port is protected by spring, which is a flexible and durable cable.You can use it with confidence.|【 Ultra High Quality】: According to the experimental results, the fishbone design can accept at least 20,000 bending and insertion tests for extra protection and durability. Upgraded 3D aluminum connector and exclusive laser welding technology, which to ensure the metal part won't break and also have a tighter connection which fits well even with a protective case on and will never loose connection.|【 Good After Sales Service】-Our friendly and reliable customer service will respond to you within 24 hours ! you can purchase with confidence,and every sale includes a 365-day worry-free Service to prove the importance we set on quality.", "user_id": "AEBHZQJ4R2TZ57GOCSTMIP53F4JQ,AHSESHUAGEFQ62M3KYV3EK5K77FQ,AFB3MTOE4VW2XO6RTJGIWJYH5OBQ,AF7CJCAKRIAY4BVN77BTSZYXXIZA,AHW6UBYJXSPOMQVGP74VQ74BO55Q,AGIAEJN4RPI6Z5ABV733VJMBUZLA,AHUELVJPFM3FEIMF2DE7OTNQD5VQ,AHPVTM2FDYB3YW3MXB523JWJTLQA", "user_name": "Vinay,Amazon Customer,Naveenkumar Vemula,sumit,Ajay,vivek rajpooot,drravish,8309-873146", "review_id": "R2LX1M52C4KNJA,R2BXIXVBJUUUEC,R19EYLO6N0AKLG,R2PGJZAQVR5XQE,R20A9E5E100YPR,RTSX75DFGY3VC,R1WGYKGMT7EHPY,R1ZXKR6UFH5VNW", "review_title": "Value for money,Nice product,timely delivered with good packeging,Good in quality,Quite nice cable,  Go for it,Good product , value for money,Worth buying,Nice", "review_content": "Packing is good .. they have sent a box for itAlso the quality looks good and decently fast chargingGood product for the price paid,Nice product,nice charging cable for low cost.,Highly recommended,Quite nice cable in this price, charging my iPad smoothly  Go for it,I like the product and resnable precise.,Worth buyinh,Nice", "img_link": "https://m.media-amazon.com/images/I/41KmCJuybRL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SWAPKART-Charging-Compatible-iPhone-Devices/dp/B0B2DJDCPX/ref=sr_1_87?qid=1672909128&s=electronics&sr=1-87"}
{"product_id": "B0BCZCQTJX", "product_name": "Firestick Remote", "category": "Electronics|HomeTheater,TV&Video|Accessories|RemoteControls", "discounted_price": "₹1,434", "actual_price": "₹3,999", "discount_percentage": "64%", "rating": "4.0", "rating_count": "32", "about_product": "Compatible For Amazon Fire TV Stick (3rd Gen, 2021) | Compatible For Amazon Fire TV Stick Lite | Compatible For Amazon Fire TV Stick (2nd Gen) | Compatible For Amazon Fire TV Stick 4K | Compatible For Amazon Fire TV Stick 4K Max streaming device | Compatible For Amazon Fire TV Stick Plus (2021)|This is voice remote control, you need to pair it first before you use, and below is pairing steps: Press the Home button about 8-30 seconds until the LED starts to rapidly flash amber, then the remote should automatically pair with your device.|With standard navigation and playback controls, you can quickly skip to your favorite scenes.|Alexa funtion make it easily to find, launch and control all existing content you want, such as play music, view sports scores, check the weather, see live camera feeds, and control compatible smart home devices.", "user_id": "AEC5PUIW4OSIDDQED7WLXG2S7TOQ,AGVXOHPJT64ZRYKHIDKVJSJGK6CQ,AFQHWSQ7JR7VCM4SWXXIOB4V3VDA,AFXWZKJCBIHCQFOR2RFYUE7UQDSA,AGD7VGYGPRKMQY3XXC4U3XIDF5CQ,AH23AKG5YNJYJ4Y6OYI5H6UBQMLQ,AGKNJPIVMVEHKL6ZFBAQ3CTFZ2KQ,AFR7B35PQ2DLHGMFBSCRIUUVLRWQ", "user_name": "Dharminder Singh Singha,Gnana Prasad Gopathi,arun kumar,Hariram,Santosh,vinayak,apparao saripilli,Neha Chaudhary", "review_id": "R35LMI5GBW0RX3,R35IGWMP7EV49V,R3KQ92E1PGHL45,RZU6RWH3LJNWV,R2KYY1GC45E5SL,R3M55L4CWCO99H,R3W4I9B0JTZJH4,R30ELP5YFHQ2F3", "review_title": "Good Product,Good product for my fire Tv,Over-all food,Good product,Product quality is very good and so is the customer service,It’s good,worth buying,Remote is working fine", "review_content": "Works well on my 4K Amazone fire TV stick as well as 2nd Generation Fire TV Stick.If your original remote is got damaged. Buy this one. But price is a bit high. Should have been available for Rs. 800/-,Liked it and and it suited very well for my fire tv,The representative are very friendly and supportive,Product was good ..Customer service was also good.,It been a month since I started using this product, the product is good but it lags a lot it was the same before but I thought since it is new over time this would get resolved but it’s still the same, it takes time to perform an action most of the times. It not up to the expectation. That is the reason why I am changing the review. Thanks,It works with fire stick lite and to my surprise volume controls are also working which was missing in the original one. Setup is also quick.,working as expected , support is prompt.,This remote is good as expected, shared manual is very simple to follow. I am happy with this product.", "img_link": "https://m.media-amazon.com/images/I/31C4z2M8TiL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Basesailor-2nd-generation-Firestick-Remote/dp/B0BCZCQTJX/ref=sr_1_88?qid=1672909128&s=electronics&sr=1-88"}
{"product_id": "B07LGT55SJ", "product_name": "Wayona Usb Nylon Braided Data Sync And Charging Cable For Iphone, Ipad Tablet (Red, Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹399", "actual_price": "₹1,099", "discount_percentage": "64%", "rating": "4.2", "rating_count": "24,269", "about_product": "[High Compatibility] : Compatible For iPhone X/Xs Max/Xr, Phone 8/8 Plus,Phone 7/7 Plus,Phone 6s/6s Plus,Phone 6/6 Plus,5/5s/5c/SE,Pad Pro,Pad Air 1/2,Pad mini 1/2/3,Pod nano7,Pod touch and more devices.|[Fast Charge&Data Sync ] : It can charge and sync simultaneously at a rapid speed, Compatible with any charging adaptor, multi-port charging station or power bank.|[Durability] : Durable nylon braided design with premium aluminum housing and toughened nylon fiber wound tightly around the cord lending it superior durability and adding a bit to its flexibility.|[High Security Level ] : It is designed to fully protect your device from damaging excessive current.Copper core thick+Multilayer shielding, Anti-interference, Protective circuit equipment.|[WARRANTY] 12-months warranty and friendly customer services, ensures the long-time enjoyment of your purchase. If you meet any question or problem, please don't hesitate to contact us. (10am - 7pm Working days)", "user_id": "AG3D6O4STAQKAY2UVGEUV46KN35Q,AHMY5CWJMMK5BJRBBSNLYT3ONILA,AHCTC6ULH4XB6YHDY6PCH2R772LQ,AGYHHIERNXKA6P5T7CZLXKVPT7IQ,AG4OGOFWXJZTQ2HKYIOCOY3KXF2Q,AENGU523SXMOS7JPDTW52PNNVWGQ,AEQJHCVTNINBS4FKTBGQRQTGTE5Q,AFC3FFC5PKFF5PMA52S3VCHOZ5FQ", "user_name": "Manav,Adarsh gupta,Sundeep,S.Sayeed Ahmed,jaspreet singh,Khaja moin,Anand,S.ARUMUGAM", "review_id": "R3HXWT0LRP0NMF,R2AJM3LFTLZHFO,R6AQJGUP6P86,R1KD19VHEDV0OR,R3C02RMYQMK6FC,R39GQRVBUZBWGY,R2K9EDOE15QIRJ,R3OI7YT648TL8I", "review_title": "Satisfied,Charging is really fast,Value for money,Product review,Good quality,Good product,Good Product,As of now seems good", "review_content": "Looks durable Charging is fine tooNo complains,Charging is really fast, good product.,Till now satisfied with the quality.,This is a good product . The charging speed is slower than the original iPhone cable,Good quality, would recommend,https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81---F1ZgHL._SY88.jpg,Product had worked well till date and was having no issue.Cable is also sturdy enough...Have asked for replacement and company is doing the same...,Value for money", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41xmv3WPs7L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Wayona-Braided-Syncing-Charging-iPhone/dp/B07LGT55SJ/ref=sr_1_89?qid=1672909128&s=electronics&sr=1-89"}
{"product_id": "B09NKZXMWJ", "product_name": "Flix (Beetel) Usb To Type C Pvc Data Sync And 2A 480Mbps Data Sync, Tough Fast Charging Long Cable For Usb Type C Devices, Charging Adapter (White, 1 Meter) - Xcd-C12", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹139", "actual_price": "₹249", "discount_percentage": "44%", "rating": "4.0", "rating_count": "9,378", "about_product": "Durable Pvc Outer Exterior: Pvc Cables Are Versatile, High In Tensile Strength, Flexible, And Good Conductors|Flix C12 Data And Charging Cable Is Equipped With A Type-C Usb Port, The Cable Supports Up To 2.4Amps Of Power Output For Powering And Fast Charging Your Smart Device|Type-C Usb Cable Is 1 Meter In Length, Optimized For Easy Use For Your Comfort At Home Or Office, Helps You To Overcome Distance Restrictions|Charge & Sync, This Usb Cable Can Charge And Data Sync Simultaneously At 480Mbps Speed, Compatible With All Devices With A C-Type Usb Port", "user_id": "AHIKJUDTVJ4T6DV6IUGFYZ5LXMPA,AE55KTFVNXYFD5FPYWP2OUPEYNPQ,AEBWA5I4QFCA3P3OBEPMELBGN4GQ,AHMGAC6QM62UXNEOCZIHLHSXPP2Q,AFHROSCGIXUPV3FYQ7H5QOD46Q7Q,AEAMIR3CMSA32IDEINSJKHRNANTA,AF355FTXYAKFH5NYPRTE7SL3WO3Q,AG5DWPD54QGSLWJ6QUFERLPNAX4Q", "user_name": "$@|\\|TO$|-|,Sethu madhav,Akash Thakur,Burger Planet,Justice ⚖️,indrajyoti d.,Aditya Kumar,E.C.GEORGE", "review_id": "R3F4T5TRYPTMIG,R3DQIEC603E7AY,R1O4Z15FD40PV5,RDVX50PD4CTFE,R3H6WKG0TA5CGU,R3Q3L1KP5QWPV3,RU0LU2PAIIME,R20FTANBPFA653", "review_title": "Worked on iPhone 7 and didn’t work on XR,Good one,Dull Physical Looks,Just Buy it,Go for it,About the product,Get charging cable at the price,Working well.", "review_content": "Worked on iPhone 7 and didn’t work on iPhone XR,https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71qFFAlV9ZL._SY88.jpg,Look-wise, I didn’t like it. Still, I use it for my work.,Product is quite good and is fast charging.Loved it.,I like it . Looks last long.,The sturdiness will depend on the manner of its use. But its speed of charging is great. Very good product for the average income group.,It's great for charging devices with various types of ports. But works best when charging one device at a time.,Good item.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31DDGpem3OL._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/FLiX-Charging-480Mbps-Devices-XCD-C12/dp/B09NKZXMWJ/ref=sr_1_90?qid=1672909128&s=electronics&sr=1-90"}
{"product_id": "B08QX1CC14", "product_name": "SKYWALL 81.28 cm (32 inches) HD Ready Smart LED TV 32SWELS-PRO (Black)", "category": "Electronics|HomeTheater,TV&Video|Televisions|SmartTelevisions", "discounted_price": "₹7,299", "actual_price": "₹19,125", "discount_percentage": "62%", "rating": "3.4", "rating_count": "902", "about_product": "Resolution: Full HD (1920 x 1080) | Refresh Rate: 60 hertz|Connectivity: 2 HDMI ports to connect set top box | Blu Ray players | gaming console | 2 USB ports to connect hard drives and other USB devices|Sound output: 30 Watts Output | Dolby Audio|Smart TV Features: Built|in Wi|Fi | Netflix | Google Play Store | YouTube | Chrome cast | Media center | with Google Voice Assistant | Android 9.O Based OS|Display: A+ Grade Panel | Micro Dimming | True Color | View Angle: 178 degree | 2K HDR10 | 16.7 Million(8bit)|Warranty Information: 1 Year warranty provided by Skywall from date of purchase.|Installation: Brand will contact for installation for this product once delivered. Contact brand Support for assistance @ (Please visit brand website for tollfree numbers) and provide product's model name and seller's details mentioned on your invoice. The service center will allot you a convenient slot for the service.|Easy returns: This product is eligible for replacement within 10 days of delivery in case of any product defects | damage or features not matching the description provided.", "user_id": "AFZBEV4BOWGRSEH2PK7D65ZW66PA,AFXQ3YGENWMRX36NXEBSR2ROPG5Q,AHD5PGE5RBBE2T3G427T32V7OROA,AELM6ILLTWBSXJXOKMNA2GM3DTKQ,AFXYY4Z4QM34XOLVVYKZSNZGBBBA,AFHZLQ2Q3GSCQCWMF4N66DXXVJCQ,AF62LB4BMTMNZXCHTSXSEKCXZFLQ,AE5KLF5JEOL4PMUGKERILYLPDSNA", "user_name": "Naresh Patel,Bhaskar Reddy,Vipin Thakur,Ramdas  Tryambak  shewale,Aijaz Ahmed,ankesh verma,Rakesh kumar,Devraj Nayak", "review_id": "R3MHRRK05RD01A,R14A3U8XTK1D7X,R1F10MFQBXZA8W,RAT511FHTC8Q4,R11FM1DRG1FNOI,R1RZDRQI3RD780,RJS87YIWGG7GF,R2JI1L2FTMA3ZW", "review_title": "Good in this price,Speakers and sound next level,Bad remote,Remote problem,Good quality 👍,Skywall 32 smart TV,Phone se screen chalane fasta hai,YouTube me I'd nhi bana pa raha hun", "review_content": "Overall experience in this price is good.You can change 5 modes of audio.Play Store not support, but their app store has almost all apps, which we uses on tv like Netflix, Prime, YouTube.We can't adjust brightness of tv.,Im giving this review after 6 moths usage,The sound quality was next level,Picture quality also good...,LED is very good but remote is not correct, given bad remote which is not working.,Remote speaker is not. Why? Give me demo for speaker.,Picture quality best and sound,Storage 4GBRam 512MBNot support google playstore,Good,https://m.media-amazon.com/images/I/711DN0Oa2pL._SY88.jpg", "img_link": "https://m.media-amazon.com/images/I/41M9BBMSUdL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Skywall-81-28-inches-Smart-32SWELS-PRO/dp/B08QX1CC14/ref=sr_1_91?qid=1672909128&s=electronics&sr=1-91"}
{"product_id": "B0974H97TJ", "product_name": "boAt A 350 Type C Cable for Smartphone, Charging Adapter (1.5m, Carbon Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹299", "actual_price": "₹799", "discount_percentage": "63%", "rating": "4.4", "rating_count": "28,791", "about_product": "A 350 Offers Universal Compatibility With Smartphones, Tablets, Pc Peripherals, Bluetooth Speakers, Power Banks And All Other Devices With Type C Port|It Supports 3A Fast Charging For Extraordinary Efficiency. Durable Pvc Housing Lasts 6 Times Longer With 10000+ Bends Lifespan|The Cable Supports Data Transmissions With Rapid Sync At 480 Mbps|The Reversible Metallic Aluminium Tip Lets The User Connect Devices In A Carefree Manner|It Dons Premium Cotton Braided Skin That Makes It Sturdy And Invincible Against External Damage|With 10000+ Bends Lifespan The Cable Stays Stronger And Lasts Longer|A 350 Cable Is Designed With A Perfect 1.5 Meters In Length For Hassle Free Usage|2 years warranty from the date of purchase", "user_id": "AHDJJLKORMH72SSEBWOVAKE66EHA,AHEONKS6KOZ4SIOZNOLYFGQBXU4A,AEUPILALWUFFD34CNWRYX4PFQKSA,AEKWBYGLEXUNRAJKVPO6HMF52W7A,AETM4APJU6TQILR5HKP3CSPYQL5A,AFOGCVLE7W7ZM5OW3XW7JXCNSIVA,AFLFHQMJXDKP4FNRZVNDLBCI7ULA,AGLH5KPYCT4MGPQ34MNWKLR6NXEA", "user_name": "𝕵𝖆𝖙𝖎𝖓 𝕮𝖍𝖆𝖉𝖍𝖆,palpandia153,Arvind,Nithyadhakshina,Basha_Neerati,shaker,Amazon Customer,D Ravi", "review_id": "R23CC5VDSVR49B,R1AWZE3731748T,R388KOR9TWPX5H,R2PLH1UHYDQWFA,R1B7Q58I1P83OY,R1C13PY8A3WUC5,RTEAGC48PIYAU,R2E0N8Q0ZQM9N9", "review_title": "Good Stuff... Recommended!!!,Need better quality,एक मजबूत प्रोडक्ट है,Good,best buy of this cable,Best for,Tough,Nil", "review_content": "Good Stuff... Recommended!!!,Need better quality for changing,Good product,I bought it 7 months. Ago it still working in good condition good 😊,good cable to by in budjet,The cable is of very good quality. Charging speed is good for my Redmi k20 pro which support 27 watt fast charging good thing is that the battery backup improved when charge with this cable I’m really surprise I observed this with many time as I test it with with original cable and result is the same. If this is in ur budget then just buy it don’t hesitate,Reliable, strong,Nil", "img_link": "https://m.media-amazon.com/images/I/412XfBAEikL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/boAt-350-Cable-Carbon-Black/dp/B0974H97TJ/ref=sr_1_92?qid=1672909128&s=electronics&sr=1-92"}
{"product_id": "B07GVGTSLN", "product_name": "Wayona Usb Type C Fast Charger Cable Fast Charging Usb C Cable/Cord Compatible For Samsung Galaxy S10E S10 S9 S8 Plus S10+,Note 10 Note 9 Note 8,S20,M31S,M40,Realme X3,Pixel 2 Xl (3 Ft Pack Of 1,Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹325", "actual_price": "₹1,299", "discount_percentage": "75%", "rating": "4.2", "rating_count": "10,576", "about_product": "Fast Charge & Data Sync: Fast charge& data transfer USB A to USB C, conforming to the USB Type C Specification version 1.1, 56kilohm, which ensure a safe charging at 4.8A Maximum. Charging and syncing 2 in 1, data transfer speed up to 480Mbps.|Extreme Durability: Over 10000 bending tests,This type c cable is far more durable than the same price, Premium nylon braided type c cable adds additional durability and tangle free.|Convenient Design:The light and space-saving 1M USB Type C cable, it’s perfect for your Home, the office desk, always keep your space tidy, super easy to carry and convenient for traveling, making your life more convenient.|Wide Compatibility: This USB A to USB C Charger Cable compatible with Samsung Galaxy S10e S10 S10 plus S9 S9 plus S8 S8 plus, Note 10 Note 10 plus Note9 note8, a40 a50 a70 a80 A3 A5 2017, Sony Xperia XZ3 XZ2 Premium XA2 XA1,XZ1, Moto G6 G6 plus G7 G7 power G7 play G7 plus Z Z2 Z3 X4, LG G8 G7 G6 G5 V40 V35 V30 V20, Googel Pixel 2 xl, HTC 10 U11.|Premium Service: Wayona promise you the reliable guarantee for your top rated USB C charger cords rope, and 24/7 customer service for our every client, please do not hesitate to reach us.", "user_id": "AEXK37TSBFHSP2TYE63YPKETWQ7Q,AEKMVX2VDNNX4ZFXI67SGKMJGZAQ,AFEIIEKX6JEHS3CPGCSIYLGCNKFA,AFDYUQAM7Y56P4R5CREI5OBPHSLA,AGEPZSRFODWZ4XUTXO2HNWLJIMJA,AH25HG24NISHLQPFOZA77WS5CUFQ,AFZ7US7H622UBLYL4ZX2XEHT7FHQ,AFDDH5QGUJ2NHJZBIAPEQVUIQCKA", "user_name": "Sunil Funde,Biju Abraham Thomas,Samir,Rahul Sharma,Avninder Singh,Tribhuvan more,N Patel,Bhavy kachhadiya", "review_id": "R10365HEDURWI9,R5RP542IMC4OI,RX2HFWXTTQDTS,R2636VYPMOZV9,RW2Z2YM3K8UV5,RVNGA0FEAXYHI,R2K7MABWMAQE26,R33YS4PO3JWU23", "review_title": "Nice product .,Good quality Braided cable, VFM,Good cord, but has Earthing issue,Ok,Good product. Little bit fast charger for phones like redmi.,Fast charging is working properly,Money value product 👌,Cable a Nice product", "review_content": "Sturdy packing, good product!,Have used this brand cable for my iPhone and iPad before, so when my wife's Samsung charger cable gave up the ghost in less than 6  months, I ordered this. Braided, visibly high quality cable, unlike the flimsy and highly overpriced OEM cables from Apple and Samsung. I have been using my iPhone cable from Wayona for more than 1 1/2 years and still going strong.  Hope this C cable will give a similar performance,I like Wayona chords and especially the long ones. But I get a slight shock - like a static discharge - when I touch my phone while charging with these two cords. Other cords with same charger are okay.,Ok,Cable looks solid and length is also good.Little bit fast charging I observed for phones like Redmi.It also looks solid so I am expecting it to work for atleast 1 year,build quality and fast charging feature,Unbreakable, good quality,Cable a Nice Product", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41J6oGU8w5L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Wayona-Cable-Braided-Charger-Smartphones/dp/B07GVGTSLN/ref=sr_1_93?qid=1672909128&s=electronics&sr=1-93"}
{"product_id": "B09VCHLSJF", "product_name": "OnePlus 108 cm (43 inches) Y Series 4K Ultra HD Smart Android LED TV 43Y1S Pro (Black)", "category": "Electronics|HomeTheater,TV&Video|Televisions|SmartTelevisions", "discounted_price": "₹29,999", "actual_price": "₹39,999", "discount_percentage": "25%", "rating": "4.2", "rating_count": "7,298", "about_product": "Resolution : 4K Ultra HD (3840x2160) | Refresh Rate : 60 Hertz|Connectivity: 3 HDMI ports to connect set top box, Blu Ray players, gaming console | 2 USB ports to connect hard drives and other USB devices | Dual-band Wi-Fi|Sound : 24 Watts Output | Dolby Audio | Dolby Atmos Decoding|Smart TV features: Android TV | OnePlus Connect Ecosystem| Google Assistant | Chromecast, Miracast, DLNA | Auto Low Latency Mode | Supported Apps : Netflix, Youtube, Prime Video, Hotstar, SonyLiv, Hungama, JioCinema, Zee5, Eros Now, Oxygen Play|Display : Bezel-less Design | Decoding of HDR10+ HDR10, HLG | 1 billion colors | Gamma Engine with MEMC|Warranty Information: 1 year comprehensive warranty and additional 1 year on panel provided by the manufacturer from date of purchase|Installation/Wall mounting/demo will be arranged by Amazon Home Services. For any other information, please contact Amazon customer support | Wall Mount is not included in the box and will be charged extra at the time of installation|Easy returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description provided", "user_id": "AGDOVGWZKEQ3M6DA2GHV6WUZT5SA,AGEUXHN7U2Q26CM6TFOTW7GZXFXQ,AHYXZVXUY3QTBP7IBFIUBSZVH2XQ,AGO4OKG6KVBAAE52Q62JBKHRDFFQ,AGOARJLTS744KQC3BTKT5KQVOJUA,AF6XISKAQXTX3Q5RUF2M2VKOJ66A,AEP6PYK2DLTD5UCMURSUNUE4IE5A,AHJSNMHQQWE6LMFRATH5LLJBQQXQ", "user_name": "Abhishek Kumar,Arun prasath,Naveen,Harmit,Placeholder,Precision Engineering,Senthil Kumar B,Sasikumar madurai", "review_id": "R2J3Q3BUHJ2S7E,R2H2ELE1DG24VY,R1U1S7X7BPSZBU,R9XVQWX40D175,REHUMWC9Q9EAG,RLEFI0WUITF14,R1M41TK6XDE47C,RUM8TBPKUE5UF", "review_title": "Decent product. Value for money.,Value for money,Improvements Needed,Everything thing good except the installation experience,Overall taking all aspects TV is good within the price point,Tv installation services,One among the good TVs in the market.,Picture", "review_content": "I am posting this after a few weeks of using the product.Usage: Continuous, OTT only, no Cable/Dish operator.Average daily usage: 6-8 hours.The TV is a great value-for-money product.Installation: The installation was simple and Amazon assisted installation was smooth, timely and hassle-free.Picture: The picture quality is not great when compared with the smoothness of a Sony, LG and Samsung with these kind of specs. Movies and especially hi-res TV series experience was somewhat diluted as most of the times, the output, while in hi-res , wouldn't look like a movie quality which we are used to of watching in the likes of Sony, Samsung LG etc however, with time, you get used to it and only realize the difference when you see the same movie at someone else's better TV.Sound: Sound output is decent. You wouldn't need additional support to enhance the volume as such.Remote: Sleek, sensitive and user-friendly. It's exactly like Amazon's remote.OS: Same as any smart Android TV. Works smoothly without much lags or hiccups. Switching apps from one to another takes a a couple of seconds more than Sony but unless you have used to of those performances, it looks just fine.Standalone and as your first smart TV,  you wouldn't find any reasons to not like the quality and it would like hi-res from the beginning. It is a great value for money product without a doubt.However, if you are considering this as an alternative or second TV after owning the better ones in the past, you will have a hard time adjusting with it.,Picture quality is good for this price, didn’t faced any lag on UI and browsing other apps. Only negative will be audio, definitely need a sound bar if u are a frequent movie watcher. Overall worth for money u spend. But the installation process is just awful, Amazon claiming that a trained professional will visit for installation but neither they are trained nor professionals , just read the installation manuals and installed the wall mount which took 4hours for them to buy the wall mount after charging money. No demo given on Tv as they have no idea about the product, these things making to think twice or thrice to buy a tv through online.,Screen looks amazing but problem is with processor I believe. If 4k content is getting streamed on device then we can observe the green screen flickers(not so often but problem exists), even remote control is not good as it take at least 2 sec to react for the user action.Reason why I believe processor is bad because I do 4k gaming using PS5 and never encountered problem with the screen.,If you buy TV in a small town shop, it will be delivered and installed immediately within couple of hours. When you want to buy a TV from Amazon, you need to wait for it to be delivered for couple of days and it is understandable. The problem is with the installation, they take so much time to install that you end up regretting buying the product. It’s like you are hungry and food is in front of you but you can’t eat. So I ordered my TV on Monday, it got delivered on Friday and it will be installed on Monday because of weekend where as there is no concept of weekend in small towns. If we had the technician details, we could reach out  s get it installed but that also will be shared 4 hours before.Regarding product, it’s good quality and very good for a average user. Heavy duty like games and continuous usage on some store will be challenging, I guess.,This TV gives good results within the budget, should definitely buy if the budget is 30k but most important point like to mention is after sales service and also the installation part.1) The installation guy didn’t arrive at very first day that was scheduled, even after rescheduling he didn’t came for installation purpose. So strictly be aware of this point.2) The TV I got in offer with 3k discount on ICICI card but although the product came out defective, it had dead pixel on the display which is very bad after period of time.3) Even after the fault was from seller as it was defective piece I didn’t got the replacement for the product and it’s totally unfair deal by Amazon and the seller too.Final verdict is the TV quality and feature are good but the service from seller and Amazon that is got was very poor inspite I was prime member. The seller DAWNTECH ELECTRONICS PRIVATE LIMITED gives very poor service and feel bad that in such cases Amazon will not help you. Thankyou,Team,Also to be added TV installation services with product while delivering and unboxing. NO need to other sub-vendor to getting installation and demo. Also dependency on third-party involvement should be less.Bad experience with TV installation stuff.Pls look into this .,Picture quality good. Sound quality  not upto my 3xpectations. Not able to find the real Dolby stereo effect. Remote not upto the mark.4 ⭐ for picture quality, 3⭐ for both sound and remote quality,Good quality picture but it hangs on home screen", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51ovMTXv9RL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/OnePlus-43-inches-Android-Pro/dp/B09VCHLSJF/ref=sr_1_94?qid=1672909128&s=electronics&sr=1-94"}
{"product_id": "B0B1YZX72F", "product_name": "Acer 127 cm (50 inches) I Series 4K Ultra HD Android Smart LED TV AR50AR2851UDFL (Black)", "category": "Electronics|HomeTheater,TV&Video|Televisions|SmartTelevisions", "discounted_price": "₹27,999", "actual_price": "₹40,990", "discount_percentage": "32%", "rating": "4.3", "rating_count": "4,703", "about_product": "Resolution : 4K Ultra HD (3840x2160) | Refresh Rate : 60 Hertz | 178 Degree wide viewing angle|Connectivity: Dual band Wifi | 2 way Bluetooth | HDMI ports 2.1 x 3 (HDMI 1 supports eARC) to connect personal computer, laptop, set top box, Blu-ray speakers or a gaming console | USB ports 2.0 x 1, 3.0 x 1 to connect hard drives or other USB device|Sound: 30 Watts Output | High Fidelity Speakers with Dolby Audio | 5 Sound Modes - Movie, Music, Standard, News, Sports|Smart Tv Features: Google certified Android TV 11 | Google Assistant | Chromecast built-in | Voice controlled Smart Remote | Hotkeys for Quick Access - Netflix, Prime Video, YouTube, Disney+Hotstar | 5 Picture Mode | 2GB RAM | 16GB Storage | 64bit Quad Core Processor|Display : 1.07 Billion colours | MEMC | Wide Colour Gamut+ | Intelligent Frame Stabilization Engine | Dynamic Signal Calibration | HDR10+ with HLG | UHD Upscaling | Super Brightness | Micro Dimming | Blue Light Reduction | 178 degree Wide viewing angle|Warranty Information: 2 years comprehensive warranty provided by the manufacturer from date of purchase|Installation: Installation/Wall mounting/demo will be arranged by AHS Team. For any other information, please contact Amazon customer support | Wall Mount is not included in the box and will be charged at the time of installation|Easy Returns: This product is eligible for replacement within 10 days of delivery in case of any product defects, damage or features not matching the description", "user_id": "AFSMISGEYDYIP3Z42UTQU4AKOYZQ,AF5ILQY4KFDTO5XHHBJ42W5DXCZQ,AFBK3X6D3AHEHSYYXPL4L6JEMSLQ,AFNB6YVNGE6IT3AWQVSIG2TJ5L3Q,AGGKMIGXUM3JRNVY7HZ3JHPJ7WTQ,AFMECPERM2GI2XQJSBWEPZKODISQ,AETPKXNOTUEX5GH7WL7XQHDR5M7Q,AERFCJ6BOMVO5YW5XM5Z2ESOIK3A", "user_name": "Ayush,ROHIT A.,Kedar,Haran,Santosh Ghante,KRISHNENDU,Harindra,sangamesh", "review_id": "R1EBS3566VCSCG,R24MB66WRPSN2A,R25UU2M1B9BO5X,R1NXW7PGVND2LE,R3OSBPH7X9AQUK,R2I8RVEPDM0IMQ,R5RES2LABIW7Q,R3A3IRV8ZWP1U9", "review_title": "Wonderful TV and Awful installation service from amazon,Acer Television Review,It's a good product for that price.,Good for the price,Almost a complete package,Nice Product,Good product,Super designed", "review_content": "About the TV - Wonderful---------------------------------------------------------------Probably the best TV in this price range (INR13000).Good - Google interface, loaded with features, lightweight, 55 watt power consumption, stable designAverage - Sound and Picture quality is quite good but if you compare it with premium brands then obviously not that good.Features- Most of the streaming apps available and compatible- You can connect with WiFi, LAN Cable, HDMI, Set top box, Laptop, USB, Gaming console, Old dish cable, and direct TV antenna as well- Built in chromecast to cast any compatible app directly from phone to TV over same WiFi networkWays to connect phone -1. Via cast feature on mobile apps - no password needed only need to be on the same WiFi network2. Via chromecast app - project only selected media (pics, videos) or entire phone screenWays to connect PC/Laptop -1. Windows cast option - project the entire laptop screen on TV using windows cast option ( need to be connected on same WiFi network2. Via HDMI cableAbout the Amazon installation service - Awful-------------------------------------------------------1. The technician brought a cheap hanging hook that had MRP INR116 on it and asked for INR499 for it without any receipt. He kept telling that it was not for sale and company had sent this specially. However, it clearly had MRP mentioned on it2. I went to market and bought a much better cabinet for just INR200 and for installation of that as well, technician was really adamant to drill the two required holes on top. He just drilled one on top and one on bottom and kept all the other spare screws ( which I had bought ) with him. After about half an hour of arguments, he finally drilled the other required holes. And for all this, he kept cussing me that I wasted his time. There was no assistance from the person who represented the service agency as well.This whole process took me two hours to complete that too with lots of arguments. This was the worst installation experience in my life so far.Bottomline - Please do not avail the 'so called free' installation service from Amazon. It is just a scam. Instead call the acer support. They will do the job much better.,After using it for 2 months, here are it's pros and cons:Pros :1. Great picture quality. It's awesome.2. Blacks are very good and is adjustable.3. Sound with 30db is very good4. Looks great with thin besel5. Remote comes with favorite OTT buttons.6. Content upscaling is very good.Cons:1. Remote could have been better. Can't use DTH remote to turn on both televisison and set top box.2. Remote operation is bit complex.3. Motion technology not great. There is a noticeable blur when watching moving ballson OTT, but it decreases when you switch to DTH.Overall, it's a nice buy at this price point. I think I am getting fairly better picture quality and sound. I am satisfied with the product.,Product has good picture quality. Good product at that price with 25w sound. Applications running smoothly. 3 months older & no issues yet. It's running smoothly.,You get decent features for the price you pay. Screen resolution might be. Set back as you may find pixalation. Overall it's good,I am amazed with the picture quality of this 720p (HD Ready) TV. It is truly an amazing panel. I found it suitable for a viewing distance of between 6 to 10 feet. Any nearer it may not look very crisp and any farther, it will feel like a very small size. The speakers are also very good for the price and can get very loud without any distortions. However, since the speaker is downward firing, the experience will vary based on whether the TV is wall mounted or kept on a stand.The remote is good, voice search works well for me. TV start up takes a long time in my opinion, but I have not compared it against any other 32 inch TV and hence do not know where it stands among peers.5 GHz Wifi works very well even across walls. Only negative aspect I faced is w.r.t the experience of using my bluetooth headphones/earphones. Firstly, the connection sometimes doesn't happen automatically after a  restart - which means I have to remove and re-discover the device thru the menu which is not simple. Secondly, the signal itself seems to be very weak and even at a distance of 8 feet in front of the TV, the signal breaks even if you move your head by 2-3 inches.However, I am still super happy with this TV. I got it for 8k during the launch offer and it is totally worth it and is recommended from my side.,At this price range(₹11499/-)it is good quality product on this market..acer only should work with Sound quality improvement otherwise all ok.Picture quality really impressive,wifi connectivity good,easy to install,boderless screen design is premium and also google voice support is good(sometimes lagging).No major issues found on this TV.Just go for it.,Vellu for money. Good product,Very nice productSave money", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41imW51RweL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Acer-inches-Ultra-Android-AR50AR2851UDFL/dp/B0B1YZX72F/ref=sr_1_95?qid=1672909128&s=electronics&sr=1-95"}
{"product_id": "B092BJMT8Q", "product_name": "Samsung 108 cm (43 inches) Crystal 4K Series Ultra HD Smart LED TV UA43AUE60AKLXL (Black)", "category": "Electronics|HomeTheater,TV&Video|Televisions|SmartTelevisions", "discounted_price": "₹30,990", "actual_price": "₹52,900", "discount_percentage": "41%", "rating": "4.3", "rating_count": "7,109", "about_product": "Resolution : Crystal 4K UHD (3840x2160) resolution | Refresh Rate : 60 Hertz|Connectivity: 3 HDMI ports to connect set top box, Blu-ray speakers or a gaming console | 1 USB ports to connect hard drives or other USB devices|Display: Ultra HD (4k) LED Panel | One Billion Colors | Air Slim Design | Supports HDR 10+ | PurColor | Mega Contarst | UHD Dimming | Auto Game Mode|Sound: 20 Watts Output | Powerful Speakers with Dolby Digital Plus | Q Symphony|Smart TV Features : Prime Video, Hotstar, Netflix, Zee5 and more | Tap View | PC Mode | Universal Guide | Web Browser | Screen Mirroring|Warranty Information: 1 Year warranty provided by manufacturer from date of purchase and 1 Year Additional on Panel|Installation: For requesting installation/wall mounting/demo of this product once delivered, please directly call Samsung support on [1800407267864 / 180057267864] and provide product's model name as well as seller's details mentioned on the invoice", "user_id": "AHDIDVECFGA6OQRNUBPUO6366UGQ,AFSII6HTAHTHGXERUNDOISNWZUNQ,AF64ON4HPPVD43H6PK3CHPTTYSSQ,AELNBR4H6235Y7NVYNCGNABDIDFQ,AF35OXRSRJ335IGMNW5FYCJDLHOA,AE3CFONNMANNC5QPYIAXV67EUYUQ,AHCWRQHRUAVMTMUH5NYNB3P4NWEA,AGKZVBLHK472MSGAAUABFRZL7SYQ", "user_name": "Binu,Sabjan,Ramkapil,User,Amazon Customer,ganesh,basavaraj huggi,Mangesh Borkar", "review_id": "R3RUBB6REUGTT,R281851EB9L5G6,R4ATJJVUY9JO6,R18455FQDOCS3H,RLZ80A5MC1F5G,R2DYRNTDPPD8A5,R3IFT4P8VHQGL3,R1DSJOGV3DFZK2", "review_title": "Best(Branded) Budget TV,A high-quality 4k Smart TV from Samsung,Received Defective,Got Replacement,Nice product but,Tv is good,Best budget tv,Value for money. Samsung is always good,Value for money product", "review_content": "Before finalizing the AUE60 55\", I visited Croma and Vijay Sales to check for the same TV or similar models for their features and picture quality. I was told AUE60 & AUE70(the models listed here as Crystal 4K and 4K Pro) are E-commerce exclusive models, not available offline. I was shown AU7700 which has the same processor, panel and features, but was listed at 65K for the 55\" version. I liked the picture quality, and decided I'll get the AUE60 since it shares so much with AU7700, and save ~20k.Why I went for AUE60  vs. AUE70 - I knew I wouldn't be needing a voice assistant, and wanted to save 3k. I knew even if I wanted a voice assistant, I could plug in Fire TV/Mi TV box and get those features later on. Delivery was pretty hassle free, the delivery executive unloaded the TV in the room I asked for, and opened the box to inspect the TV for any physical damages. Samsung technicians came in a few hours later, installed and gave a demo.Sound:Per other reviews - sound from speakers is apparently bad, but in my case, I found it satisfactory. I have it wall mounted in a 10X12ft room, and the TV's speakers sound better compared to Bose Soundlink Speakers that I connected it to via Bluetooth.Picture:The Panel's great, but nothing worth raving about. Gray uniformity isn't great(i.e. gray tones won't be perfectly uniform across the whole panel, there'll be darker zones towards the edges/corners based on backlight placement). Blacks aren't perfectly black - and they're brighter than you'd expect from a VA panel, but this isn't noticeable at all when the room is lit. No backlight bleed. Colors are as good as I'd like them to be, and the panel does get noticeably bright for my taste, even when brightness is turned down to 40%. 720p content is watchable from >8ft, 1080p is good(I'd say better than I expected), and 4K is well, 4K.Connectivity:I have a 35 Mb/s broadband  connection and all content streams in 4K when available, without stutters. The TV has Bluetooth 5.0, and works with TWS and Neckband earphones fine(I use Oppo Enco W51 and Boat Rockerz 330) - there's no noticeable latency, and volume can be controlled through the remote itself.Apps & Features:Has all the standard slew of streaming apps I needed - Netflix, Hotstar, Prime, Apple TV+ & YouTube. All of them stream 4k content, except for Hotstar - which only streamed 4K a few times. 1080p is still very watchable, and not really a deal breaker. No Dolby Vision support - which I made my peace with considering the fact that 99% of budget TVs in the market can't produce the contrast you'd expect out of DV content anyways, so why care. You get HDR, and HDR content is definitely better looking than non-HDR ones in terms of colors and vibrancy. I planned to use the TV without cable, but the TV does come with some channels like Republic TV, Bloomberg, 9XM, etc., these stream in 1080p, so a great bonus to have.Remote:Very basic RF remote, unlike Bluetooth ones on most new TVs. The remote's looks pretty sleek and stylish, but that's about it. Biggest gripe - typing to search for things within apps is a pain in the behind, you'll need to use the D-pad to navigate on an on-screen keyboard. You can control the TV using Samsung's SmartThings App, but guess what - you can't even use your phone's keyboard to type in when controlling through the app - this is something that can be added through an update, but it's not there yet.Attached pictures are all of 4K content. Resolution might get scaled down after I submit the review, but you can still get an idea of the TV's design/looks, Panel colors and contrast, etc.I'd say I'm really happy - and given the chance, wouldn't change my decision. It's a Samsung TV, so end of the day, if it produces a decent picture, and lasts a couple of years more than I expect, I can overlook all other cons. I'd highly recommend the TV if you have the same expectations from your next TV.,,Placed order on 18th Dec'22 received Defective product, updated to Amazon service they replaced with new product today(27/12/22).will post long term review.Pros: Picture Quality, Design (thin n Bezel less)Cons: Sound (bit okay),upsacling of SD channelsOver all Satisfied.,Have been using it since month now.-Picture quality is amazing. 4.5/5-As always installation service from Samsung was seemless. 5/5-smart features are good this model don't have voice recognition. I don't require it so its fine. 4/5-Audio quality is not good. It's clear but loudness is not sufficient if installing in big hall. It also lacks base.Purchase a sound bar separately if buying this model.,But the picture quality is ok-ok.,Best tv product in given price range,Value for money. Samsung is always good,Value for money product", "img_link": "https://m.media-amazon.com/images/I/41RVzq6GiIL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Samsung-inches-Crystal-Ultra-UA43AUE60AKLXL/dp/B092BJMT8Q/ref=sr_1_96?qid=1672909128&s=electronics&sr=1-96"}
{"product_id": "B0BMXMLSMM", "product_name": "Lapster 65W compatible for OnePlus Dash Warp Charge Cable , type c to c cable fast charging Data Sync Cable Compatible with One Plus 10R / 9RT/ 9 pro/ 9R/ 8T/ 9/ Nord & for All Type C Devices – Red, 1 Meter", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹199", "actual_price": "₹999", "discount_percentage": "80%", "rating": "4.5", "rating_count": "127", "about_product": "-1 meter type c to c cable fast charging cable Convenient for all types of USB C Laptops, Tablets, And Smartphones.|-6.5 Amp USB C Cable compatibility with All 60W 45W 30W 18W 15W USB-C Power Adapters, Support Pd 3.0 And Qc 3.0 Fast Charge for Your Devices. Data Transfer Speed Is Up To 480Mbps Of USB 2.0. Note: Not Support Video Transfer.AM|-USB C To C Cable Support Warp Charge For One plus 8T, One plus 9/9 Pro, Too Fast Charge For MacBook Air 13 Inch 2020/2019/2018, For MacBook Pro 13/15/16 Inch AM|Compatiblity with type c to c cable fast charging cabe is Newest 2020/2019/2018/2017/2016, For iPad Mini 2021, For iPad Pro 12.9/11 Inch 2020, For Google Pixel 6/6 Pro/5/4A/4 Xl/4/3A Xl/3A/3 Xl/3/2 Xl/2, For Samsung Galaxy S21 Fe 5G/S20 Fe 5G/Note 20 Ultra/Note 20/S20/S20+/S20 Ultra, Galaxy Z Flip 3, Galaxy Z Fold 3, And More Devices.|65 watt type c cable is in Premium Silicon Coating, High-Quality, Prolong Bending Lifespan , Pure Copper Core, . Both USB C Connectors are Designed with An Advanced Emark Chip for Higher Efficiency & Safer Charging for Your One plus 8T. Output Delivery At 6.5A 10V Max, 65% Charging Capacity Only Takes 30 Minutes, Saving Your Valued Time.", "user_id": "AHFENRYJG4LPXDTUGEMG335VICSQ,AGSV37DJ5QTUYOXFJNPD4W7GXVFA,AGDEVIAYABTMIJLTYWTUS5M5VBTA,AFKDGUQ5TMGT3PXBDHAWPRE5CACQ,AHWENSYYF2QDH3EX4REMVGBEMMLQ,AGJOGZAGBMX7PBCUAILD2YIM5MAA,AF5EHUH4GWB7JZ3PZ53Z2DOYK5WQ,AHHT4VWMFYSASNW6RH2Q65C6YNDA", "user_name": "Nadhiyarasan,Saurabh Aggarwal,Dibya,Sai Sriya,Sayed,Bhupendra Verma,Yash suhagiya,Manuj Patel", "review_id": "R14ZOPYFHOYYRQ,R1GQH74NUCJZZ7,R1BNWIYBRSI1Z6,R347KU67LE6JEH,RMGA8IGV2WQDX,R2782FIPC5T4KM,R220M468LVHIE1,RA1PNAU355MLG", "review_title": "Super charger in lapster,Best among the rest,Classy product and authentic one,Excellent product,Worked fine ,thank you,Stylish and flexible cable,Amazing,Value for money product", "review_content": "Best quality,The product looks original-like and is perfectly working with my OnePlus 8T. Good Type-C to C buy, recommended over other companies.,its a very good product and yet a reliable and durable cable to get yourself connected,Cable is good and support 65 w fast charging. I am use this cable to my one plus 8t mobile phone. This cable also speed in transfer to data. Cable price is also low. Thanks for seller to provide best quality and durability cable in low price. I am happy for saying this cable is all-rounder.,The product worked  fine for me. Got this at good price,Flexible and toughness is best workAnd also in samsung m31s mobile fast charging,I bought this cable for my nothing phone 1 it's amazing, fast charging is working very well I've tried this also my samsung mobile, and result was fabulous, thanks,Initial impressions are good. It is supporting ulatra fast charging on my OnePlus 9 pro.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/3135yilFsfL._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Lapster-compatible-OnePlus-charging-Compatible/dp/B0BMXMLSMM/ref=sr_1_97?qid=1672909129&s=electronics&sr=1-97"}
{"product_id": "B07JH1C41D", "product_name": "Wayona Nylon Braided (2 Pack) Lightning Fast Usb Data Cable Fast Charger Cord For Iphone, Ipad Tablet (3 Ft Pack Of 2, Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹649", "actual_price": "₹1,999", "discount_percentage": "68%", "rating": "4.2", "rating_count": "24,269", "about_product": "[High Compatibility] : iPhone X/XsMax/Xr ,iPhone 8/8 Plus,iPhone 7/7 Plus,iPhone 6s/6s Plus,iPhone 6/6 Plus,iPhone 5/5s/5c/se,iPad Pro,iPad Air 1/2,iPad mini 1/2/3,iPod nano7,iPod touch and more apple devices.|[Fast Charge&Data Sync ] : It can charge and sync simultaneously at a rapid speed, Compatible with any charging adaptor, multi-port charging station or power bank.|[Durability] : Durable nylon braided design with premium aluminum housing and toughened nylon fiber wound tightly around the cord lending it superior durability and adding a bit to its flexibility.|[High Security Level ] : It is designed to fully protect your device from damaging excessive current.Copper core thick+Multilayer shielding, Anti-interference, Protective circuit equipment.", "user_id": "AG3D6O4STAQKAY2UVGEUV46KN35Q,AHMY5CWJMMK5BJRBBSNLYT3ONILA,AHCTC6ULH4XB6YHDY6PCH2R772LQ,AGYHHIERNXKA6P5T7CZLXKVPT7IQ,AG4OGOFWXJZTQ2HKYIOCOY3KXF2Q,AENGU523SXMOS7JPDTW52PNNVWGQ,AEQJHCVTNINBS4FKTBGQRQTGTE5Q,AFC3FFC5PKFF5PMA52S3VCHOZ5FQ", "user_name": "Manav,Adarsh gupta,Sundeep,S.Sayeed Ahmed,jaspreet singh,Khaja moin,Anand,S.ARUMUGAM", "review_id": "R3HXWT0LRP0NMF,R2AJM3LFTLZHFO,R6AQJGUP6P86,R1KD19VHEDV0OR,R3C02RMYQMK6FC,R39GQRVBUZBWGY,R2K9EDOE15QIRJ,R3OI7YT648TL8I", "review_title": "Satisfied,Charging is really fast,Value for money,Product review,Good quality,Good product,Good Product,As of now seems good", "review_content": "Looks durable Charging is fine tooNo complains,Charging is really fast, good product.,Till now satisfied with the quality.,This is a good product . The charging speed is slower than the original iPhone cable,Good quality, would recommend,https://m.media-amazon.com/images/I/81---F1ZgHL._SY88.jpg,Product had worked well till date and was having no issue.Cable is also sturdy enough...Have asked for replacement and company is doing the same...,Value for money", "img_link": "https://m.media-amazon.com/images/I/412fvb7k2FL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Wayona-Braided-WN3LG2-Syncing-Charging/dp/B07JH1C41D/ref=sr_1_98?qid=1672909129&s=electronics&sr=1-98"}
{"product_id": "B0141EZMAI", "product_name": "Gizga Essentials USB WiFi Adapter for PC, 150 Mbps Wireless Network Adapter for Desktop - Nano Size WiFi Dongle Compatible with Windows, Mac OS & Linux Kernel | WPA/WPA2 Encryption Standards| Black", "category": "Computers&Accessories|NetworkingDevices|NetworkAdapters|WirelessUSBAdapters", "discounted_price": "₹269", "actual_price": "₹800", "discount_percentage": "66%", "rating": "3.6", "rating_count": "10,134", "about_product": "USB WiFi Adapter: Fast wireless transmission at up to 150 Mbps ideal for video streaming, gaming and internet calls|USB 2.0 Interface: Supports high speed USB 2.0 interface for a seamless experience|Advanced Security: Supports 64/128 WEP, WPA, PA2/WPA-PSK/WPA2-PSK(TKIP/AES) wireless security|Nano Design: High performing nano-size design for portability|Easy Installation: Includes quick installation and configuration guide", "user_id": "AGMJ6TDLOVZIR5ZU65TLJFSLG2BQ,AGPK7U5SHXBYBXEWBTRCIAZSB6LQ,AHXYETFF4XMSAI4VAHP24XL5SSTA,AGMUJCTMBNQBOGHL6UPSSF4KSNUA,AGEUQD256CS42A6PDKDB75VZRADA,AHGA46UDDADBRAB5FOHX6XY2DBVQ,AHUVYZMQ6PWI54UXP7SLLS4ZU46A,AHVS66CFEP5AXDC35N4ME4SU4X5Q", "user_name": "SQL,ARUN KUMAR,veer,Ravi shankar,Shivam Kumar,ramesh,Bibin,Hem Roy", "review_id": "R3AZDEK3MQA3RA,RXF3HCCBWV0VB,R6CVYFDUXBS36,R1QMN1WQJIWAB7,R2MOVGGWRV4ZPE,R2Z00XYFTN4T2Y,R294UWCBOTKD8H,R3NPDCAH895UHB", "review_title": "Will not work with new system,Veri good,Ok product,Access wifi signal.,👍,very good,Good Product,8139EU based okayish but low reception", "review_content": "Was working fine with window 10 old computer but is not installable with new system on Window 11,Overall very good item,Easy to install ok signal,This was used to accesd wifi connectivity for desk top, and TV, worked fine,👍,like,Good product, satisfied with its performance.,It worked on most devices where driver could be installed, even worked with linux system too but for the reason I bought simply didn't get solved with it.. though not returning it as it worked in my computer without any issues.", "img_link": "https://m.media-amazon.com/images/I/31mgo4D-kPL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Receiver-300Mbps-802-11b-Wireless-Network/dp/B0141EZMAI/ref=sr_1_99?qid=1672909129&s=electronics&sr=1-99"}
{"product_id": "B09Q5P2MT3", "product_name": "OnePlus 108 cm (43 inches) Y Series Full HD Smart Android LED TV 43 Y1S (Black)", "category": "Electronics|HomeTheater,TV&Video|Televisions|SmartTelevisions", "discounted_price": "₹24,999", "actual_price": "₹31,999", "discount_percentage": "22%", "rating": "4.2", "rating_count": "34,899", "about_product": "Resolution : Full HD (1920x1080) | Refresh Rate : 60 Hertz|Connectivity: 2 HDMI ports to connect set top box, Blu Ray players, gaming console | 2 USB ports to connect hard drives and other USB devices | Dual-band Wi-Fi|Sound : 20 Watts Output | Dolby Audio | Dolby Atmos Decoding|Smart TV features: Latest Android TV 11, OnePlus Connect Ecosystem, Google Assistant, Chromecast, Miracast, DLNA, Auto Low Latency Mode | Supported Apps : Netflix, Youtube, Prime Video, Hotstar, SonyLiv, Hungama, JioCinema, Zee5, Eros Now, Oxygen Play|Display : Bezel-less Design | LED Panel | Anti-Aliasing | Gamma Engine | Decoding of HDR10+, HDR10, HLG|Warranty Information: 1 year comprehensive warranty and additional 1 year on panel provided by the manufacturer from date of purchase|Installation/Wall mounting/demo will be arranged by Amazon Home Services. For any other information, please contact Amazon customer support | Wall Mount is not included in the box and will be charged extra at the time of installation", "user_id": "AFUT7ANZTZYGLXU65EQ2D5OP6UMA,AGT7YYJVUC6ZHRKQHVUQZMDNLXEA,AE7OMK3IQJR2U2JZE2HQ4BKSPA6A,AGCRCU432TIF4J2EL7GBEWOIULGQ,AERQBL3BISJQVHO3RLOOA4HKZX5A,AHIWNZ2HBQAHVE4OWODM6WH4PMOQ,AH2347WTE3DZ3TIZUB5LCLZPAYEQ,AHIH3QL5XONYJWEXF7VKLFHZBDJA", "user_name": "ATHARVA BONDRE,Sujitkumar Thorat,Chandrasekara rajasekara reddy,J vasanth,Placeholder,roshan,Boopathi,Rajesh", "review_id": "R3COVVOP2R7Z28,R2T6WHEO2ONNDD,RUFFV2QR43OCM,R2LK4WPIHJ7WDA,R6IPR9FHZ5BOT,R3DU4LFGTAIEMN,RVHHM5FW31JN1,R1QA870NJWIODF", "review_title": "Worthy and most affordable - Great TV,Good product,It's really worth the money but,Better product in this budget,Product review,nice tv,Best product,Budget friendly TV", "review_content": "This OnePlus TV is great if you want a affordable and middle range features TV. I got it in the offer and it was totally worth it.Pros:-1. Sound is awesome - 100% satisfied with the quality of sound. Dolby Audio 20W speakers are really great for sure affordable TV.2. Size and slim - It is slim and looks stylish. Very light weight and handy to install.3. Easy to install and mount to wall.4. Tye software installation and set up is very easy and anyone can do it at home.5. It gets integrated with mobile apps, remote, WiFi networks very quickly and easily.6. The overall sign up process and app installations are quick and automatic.7. It supports all the smart features like Netflix, Prime and YouTube. It is easily installable and sign-in to start using quickly.8. It is also easy to scan the Setup box channels and start viewing them.Cons:-1. Picture quality is 776p. It's average and not very clear. But it is worth the price range. I'll not complaint as the cost of TV is very affordable and this quality is justified.2. Bluetooth and WiFi connection can disconnect sometimes and cause some issues. I encountered this disconnect issue and had to reset complete device and do the complete sign up again.Rest all is very good and loved this product. I feel it was worth ordering. If you are looking something is medium range and only need it for your old parents and don't have extensive smart use then 100% go for this.If you want to use a lot of smart features and OTT platforms and watch movies, and sports then go for better version with full HD and 4K quality. This TV will not give good experience for sports due to less picture quality but it's very good for daily family shows and TV channels.One last thing I want to express and I'm ver disappointed about is this.I got my order delivered on Friday and I scheduled my installation for Saturday. But nobody turned up that day and I had to reschedule it for Tuesday morning, and even today nobody turned up. I got a call from Amazon to reschedule it for Tuesday evening and still, nobody turned up.This is very very bad and irresponsible service by OnePlus and Amazon. I'm very disappointed with the service and highly criticize this behavior. A company should always take care of its customer satisfaction and you have failed in doing this.What do you guys expect us to do? Wait for 5 to 6 days to get my TV installed even when it's been delivered and wait for you guys to come after so many days. Even when I'm having my smart TV delivered to my home, I have to wait and not enjoy it because you guys have not done your job properly.At least keep some decency and respect the customers who are paying a big amount and ordering a big item from your company. You should take care that the money I spent has been worth it and not facing any issues. Highly disappointed with this behavior and service.,Good product,Connectivity is faster,But performance is little bit slower,,The biggest problem I face is it don't have a aux cable so I'm not able to connect my sound bar......the HDMI port is useless it won't work .so,i connect it via bluetooth but the problem is that it won't connect automatically, everytime I on the tv i need to connect it manually it's a basic feature which is not provided in this tv then another drawback is that it was fast at the beginning now it's been 4 months and it's super laggy .....even after the update its just the same.....yeaa but in this price range the picture quality is outstanding......that's all,Good quality in picture and volume is little bit low other than that product is nice. Budget friendly, I'm happy with this .,After a few days, the TV will perform slowly and the  remote  is very very sentence,thank you amazon and oneplus,1. Sound is good2. Easy installation3. very Slim and less weight4. Voice recognition is good,LikeBudget-friendlyDislikeWiFi connectivity range is poor.Many times gets disconnected.Color depth not that good.", "img_link": "https://m.media-amazon.com/images/I/51F6FClq10L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/OnePlus-inches-Smart-Android-Black/dp/B09Q5P2MT3/ref=sr_1_100?qid=1672909129&s=electronics&sr=1-100"}
{"product_id": "B08HDH26JX", "product_name": "boAt Deuce USB 300 2 in 1 Type-C & Micro USB Stress Resistant, Sturdy Cable with 3A Fast Charging & 480mbps Data Transmission, 10000+ Bends Lifespan and Extended 1.5m Length(Mercurial Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹299", "actual_price": "₹699", "discount_percentage": "57%", "rating": "4.2", "rating_count": "94,363", "about_product": "The boAt Deuce USB 300 2 in 1 cable is compatible with smartphones, tablets, PC peripherals, Bluetooth speakers, power banks and all other devices with Type-C as well as Micro USB port|It ensures 3A fast charging and data transmissions with rapid sync at 480 mbps|The premium Nylon braided skin makes it sturdy and invincible against external damage|Its Aluminium alloy shell housing makes it last longer with 10000+ Bends Lifespan with extended frame protection for strain relief|The resilient and flexible design offers a tangle free experience seamlessly|Deuce USB 300 cable offers a perfect 1.5 meters in length for smooth & hassle-free user experience|2 years warranty from the date of purchase", "user_id": "AEWAZDZZJLQUYVOVGBEUKSLXHQ5A,AG5HTSFRRE6NL3M5SGCUQBP7YSCA,AH725ST5NW2Y4JZPKUNTIJCUK2BA,AHV3TXIFCJPMS4D5JATCEUR266MQ,AGWIGDEMFIIUAOXYY2QATNBSUGHA,AFSTSLQUV4EVEXWKBOLEFHL2H5YQ,AGAKDNBHY2FKX7I4ACRGILU7QL7A,AFNWJUWJRHCC6HN52KMG5AKZY37Q", "user_name": "Omkar dhale,JD,HEMALATHA,Ajwadh a.,amar singh chouhan,Ravi Siddan,Himanshu Goel,Udaykumar", "review_id": "R3EEUZKKK9J36I,R3HJVYCLYOY554,REDECAZ7AMPQC,R1CLH2ULIVG5U3,R2DMKIBGFKBD6R,RC89B5IAJUTR5,R3B3DDON5FH8DS,R13WAEJDI5RS36", "review_title": "Good product,Good one,Nice,Really nice product,Very first time change,Good,Fine product but could be better,Very nice it's charging like jet", "review_content": "Good product,long wire,Charges good,Nice,I bought this cable for Rs.339 worthy product for this price, i tested it in various charger adapters 33w and 18w it supports fast charging as well.,Good,Ok,I had got this at good price on sale on Amazon and product is useful with warranty but for warranty you need to go very far not practical for such a cost and mine micro to type c connector stopped working after few days only.,I like this product", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/4112nea7JlL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Deuce-300-Resistant-Transmission-Mercurial/dp/B08HDH26JX/ref=sr_1_101?qid=1672909129&s=electronics&sr=1-101"}
{"product_id": "B09VT6JKRP", "product_name": "Lapster USB 3.0 A to Micro B SuperSpeed for hard disk cable - short cable", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹199", "actual_price": "₹999", "discount_percentage": "80%", "rating": "4.1", "rating_count": "425", "about_product": "-High performance Micro USB 3.0 hard disk cable connects a portable external USB 3.0 hard drive to a computer for speedy file transfer or syncs and charges tablets or smartphones or USB 3.0 Micro-B port devices|-Super Speed USB 3.0 data transfer cables are compatible with most USB 3.0 external portable and desktop hard disk connector|-USB 3.0 micro b cable offer a throughput of up to 4.8Gbps when used with a USB 3.0 host and device AK9|-Replacement USB 3.0 Cables for external hard disk wire|-Connector A: USB 3.0 A (9 pin SuperSpeed) Male Connector B: USB 3.0 Micro-B (10 pin SuperSpeed) Male Superspeed USB 3.0 hard disk cable A to Micro B (10pin) Quickly transfer data from an external storage device to your PC or Laptop at 10x the speed of USB 2.0", "user_id": "AEC4ANXPPWN4RV5YG4JXEVPUXTHA,AGDQOOPS6XJBBWHH34E4NJJUCN6Q,AE7QAFZ3XNWF3O4BK4WIGFB3JGIQ,AFVQ5YGAAENELAHUFPH2MAVYIWTQ,AHTWP7R2AL6U4QIX73CNJ7Y7BBDQ,AEHQERYQKTKY5OMTF5KOWEIVCSQA,AGHYPI3NVH2LTDBF4N7QXV5CQEVA,AHCA5SEFUQQWPNVIGU2QCAWNMDKA", "user_name": "Vivek Ramachandran,Pavan,Rahul,Push,Yuthika Losalka,Biswas Enterprises,Akash maurya,Prem", "review_id": "R3ET6IRJTU70BS,R3589B83QJ7IR8,R19UEB6ST57UVR,RG7D4BZAWAW7I,R32C8DOWXVBIQP,R14MFGZY1ZD0M6,RD2T9Z6AG9GBY,ROTSX1QO0ZBS6", "review_title": "Does its Job fine,Working perfect,working fine,Disappointed,Does the job.,Nice product with good quality,Good product,Nice Product", "review_content": "As a connector, it does its job fine.,Package arrived on time.. working good. Value for money..,Good buy,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61YX8qeuCgL._SY88.jpg,It's great value, although the wire came folded and i had to untie it and untangle it. It does the job well and for the price it's at, I couldn't ask more.,Nice product with good quality,I'm using this since a long time and this never disappoint me .... must buy and good plastic quality 👍,Value for money", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31Uqr+A2THL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Lapster-Micro-SuperSpeed-hard-cable/dp/B09VT6JKRP/ref=sr_1_102?qid=1672909129&s=electronics&sr=1-102"}
{"product_id": "B09T3KB6JZ", "product_name": "TCL 100 cm (40 inches) Full HD Certified Android R Smart LED TV 40S6505 (Black)", "category": "Electronics|HomeTheater,TV&Video|Televisions|SmartTelevisions", "discounted_price": "₹18,990", "actual_price": "₹40,990", "discount_percentage": "54%", "rating": "4.2", "rating_count": "6,659", "about_product": "Resolution: Full HD (1920 x 1080) | Refresh Rate: 60 Hertz|Connectivity: 2 HDMI Ports to connect set top box, Blu Ray players, gaming console | 1 USB Ports to connect hard drives and other USB devices|Sound : 20 Watts Output | Powerful 2 Stero Integrated Speaker Boxes with Dolby Audio|Smart TV Features: AI-IN | Built-in WiFi | Android R (Certified by Google) | Built-in Chromecast | 64 bit Quad Core Processor | Prime video | Youtube | Netflix | Voice Search | 1 GB RAM + 8 GB ROM|Display: Slim Design | A+ Grade Panel | Micro Dimming | View Angle : 178 degree | HDR|Warranty Information: 2 year comprehensive warranty provided by the manufacturer from date of purchase|Installation: For Installation, Wall Mounting, Demo Of This Product Once Delivered, Directly Contact Brand Support (Visit Brand website for Toll free numebrs) and Provide Product's Model Name And Seller's Details Mentioned On Your Invoice. The Service Center Will Allot You A Convenient Slot For The Service", "user_id": "AGACKHUULXIV2SLNKKA6GWQOP7JQ,AHX6DQRYIJWTTXZ22B35O624OAYQ,AEH6JRDO3GFF5AKVH7SZUP2UPNZA,AH4UFMXJR52M6C4NX7QU4XASBENQ,AFVGMSHRL5NQJERZVEKY4JTQ26VQ,AEQH7UPNWWVMWQAZ2TKCXLZNLVLA,AF2IITAFGAYGRB5HXE2INA4YXL5Q,AEXRM3SMHD5HJC5BMNDNQSEMGLYA", "user_name": "KIRAN BABU BIREDDI,gaurav kumar,srinivasa reddy t,Ram Allways,uday ghatak,M Daniel John,Amazon Customer,Amazon Customer", "review_id": "R2GC03W48T3IJR,R3EL2OA6MMM893,R1GV21LOE1079G,R3RT49SO6YCNDO,R31P7Y321UTDK1,R16ZGZCQ1H0ED3,R217N2SRNQMWHJ,R1H7N6CO2XOFSO", "review_title": "TV looks fine, however I see some lag while selecting the applications,Best TV in the Price range,Good for value,Good build quality,I am satisfied it's service till now if this will continue then it is very good,Affordable price for all,Very good tv,It's good", "review_content": "TV looks fine, however I see some lag while selecting the applications such as Amazon prime etc. I didn’t install any new apps.,Received the TV on time.Good Things about TV and TCL:-1. Quick Response:- After the TV is delivered call the customer care for the installation and within 2 hour technician arrive and installed the TV. After that received call back from the customer care to gather the experience and pinged on whatsapp so that if in future encountered any issue quick help will be provided.2. Quality:- Quality of TV is good and can watch all the contents from the apps in max resolution supported by TV i.e., 1080p.3. Steal deal, during the GIF sale received the TV in 13299 which is just wow price.4. Sound Quality is good.5. Android 11 is good and the extra feature which I find beneficial when compared to my old android 9 tv is the voice search feature which now search the content from another apps also after giving permission which is not working on android 9 tv.6. Bluetooth remote with some extra feature. Bought the TV as already have the TCL s6500 32 inch model back in 2018 when it is launched and tv is working flawlessly and since did not encountered any issue so bought this brand tv again when required second TV.Improvement :-1. Bluetooth remote should have the all apps button on remote instead of TCL menu which my previous android s6500 tv have, due to which have to move with some extra click which is annoying for my parents to use.2. in Bluetooth remote they provide some extra button to move directly to youtube, netflix, tcl channel, prime, guard and media, instead of this some customization be provided so that we can configure the buttons to some others apps as per our personal use. out of these button guard, media and tcl channel are most useless button.3. android tv should come with atleast 1.5gb as with 1 GB variant the tv is little slow and already have many preinstalled tcl apps which we cannot remove so tv experience in little bit slow, however buy the model by knowing this limitation as already using 1.5 GB ram old variant of the same brand.other feature are also these which are cons but those are already mentioned in description and user should be aware of them before buying like one such point is 3.1 star is removed because of point 1 and point 3 as it is not making fluid experience of using android tv when watch all the contents from the apps.,Good for value almost all apps r able to download,Less weight and pretty valuable to the budget... And even customer support also available all time.,Like,Good one for this price. . Thanks to Amazon,Very good product,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61fO-pDJVEL._SY88.jpg", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41mMrtrwgyL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/TCL-inches-Certified-Android-40S6505/dp/B09T3KB6JZ/ref=sr_1_103?qid=1672909129&s=electronics&sr=1-103"}
{"product_id": "B093QCY6YJ", "product_name": "ZEBRONICS ZEB-USB150WF1 WiFi USB Mini Adapter Supports 150 Mbps Wireless Data, Comes with Advanced Security WPA/WPA2 encryption Standards", "category": "Computers&Accessories|NetworkingDevices|NetworkAdapters|WirelessUSBAdapters", "discounted_price": "₹290", "actual_price": "₹349", "discount_percentage": "17%", "rating": "3.7", "rating_count": "1,977", "about_product": "Supports 150Mbps Wireless data transmission rate|Fully compliant with USB v2.0 High-speed mode|Advanced Security WPA/WPA2 encryption standards|IEEE 802.11 b/g/n client|Access Point mode for Hotspot|Miniature Design", "user_id": "AFOYOG3YKIOLPTLR3RZNRGUHHEAQ,AENFRNJLSQPJICHCPKWOMUBY6RZQ,AGFJSRWCBODKCJT6UZRNZJGS7REA,AGEJSKUSIVTSJWJU7VP34MUN2TAQ,AG4MIJFPUX7ACHTA37OTFR2POWAQ,AGKBVK7XMXHCSEHT2ENTPCTVRBIA,AGGNPDA4Y5XGITWNNOOODFOYXUDA,AEUAAKEA5FFOZ66HNIUQI3OJQDQA", "user_name": "Mohseen Qureshi,Karan,Pranav Anand,Muthukumar,Banda Srinivas,ONam,Sudhakar P,Ben", "review_id": "R32XZQTB1BP0J8,R2NHRHTL743ZMA,R10FKRAEORI9L,REVEDLADDDB1V,R36GKVZB8QEVRH,R2GVIPC51M5OO6,R353OSCK8VF5E3,R30ADKRID5GLDX", "review_title": "Good product,Best produced,Working well as of now,Money worth,Good equipment,Writing after one month use. Working okay no issues till now,Nice product,Easy piece of great product", "review_content": "Working very nice ok,Sahi paise ke hisab se sahi kam karta hai,So, the WiFi adapter is working well as of now. It has a CD for installation. However, it self installed without the CD. But it showed that installation wasn't complete even though it was and asked for security password once again after restarting the laptop.,Its worth for money,Okay, working.,Good,Valuable produc,Good USB Wi-Fi dongle for home and office works", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/317-HiMYIgS._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/ZEBRONICS-ZEB-USB150WF1-Supports-encryption-Standards/dp/B093QCY6YJ/ref=sr_1_104?qid=1672909129&s=electronics&sr=1-104"}
{"product_id": "B093ZNQZ2Y", "product_name": "LOHAYA Remote Compatible for Mi Smart LED TV 4A Remote Control (32\"/43\") [ Compatible for Mi Tv Remote Control ] [ Compatible for Mi Smart LED Tv Remote Control ]", "category": "Electronics|HomeTheater,TV&Video|Accessories|RemoteControls", "discounted_price": "₹249", "actual_price": "₹799", "discount_percentage": "69%", "rating": "3.8", "rating_count": "1,079", "about_product": "Compatible with MI Smart TV 4A 32 inch LED TV /Mi 4A 43 inch LED TV | Mi LED Smart TV 4A (32 inch/43 inch) Mi Smart Android LED TV|100% Best Quality Plastic Body and Soft Silicone Rubber Keypad|Remotes are checked by Testing Machine Before Shipment|Imported Generic Product Not by MI|Please Match the Image with Your Existing Remote Before Placing the Order", "user_id": "AGDR4WFX53YFXTBXAHC65MMBDERA,AFOEBFZC6LMNNTBEC22LCUGEO5QA,AGDWLF5AV4ORJG6IXPD65BSQ4WHQ,AERP2HDU5NDVDVWH2VDXZY3ITHRQ,AFLUBMW56L2YZFC7R3RZVLC7YGAA,AEVQ23BWUEEHRN4SPRKHA57N6SOQ,AGYFSXQSHFHYAB4GM2SRCFCQBFQA,AFYFP2TSUS4LLHR6CY5NJQZZIG7Q", "user_name": "mohamednathar,Amazon Customer,Ashwini Kansal,Gopala Krishna Reddy,Doctor eye,Anierrudh S,gaurav chikhale,Sandeep Kaushik", "review_id": "R1MTTFP4GWHWC8,R2A03DS956BN4T,R21TRTA1VGGCD3,R1UJJ36GMAT8P8,RLLTRV5LUMPGQ,R1A3XYRF4ESBLP,RIOC9B1740DPI,R12CWR7TITHMF8", "review_title": "Very hard to use,Good,Required Replacement but replaced one is Good,Good product & connectivity,Used remote delivered,VFM, Perfectly Compatible.,Working fine with mi tv4,I've bought it 4 times in a year", "review_content": "Not value for money.. not satisfied,Good,Required Replacement but replaced one is Good,Good pairing and connectivity,Got a used remote. As you can see in the pic, the back button is discolored. Since it is working and we are in an urgent need of a remote, not returning. Sharing so that other people stay aware of this.Edit - Requested a replacement and the replaced one looks good.,Almost look like original. Just the brand markings are missing.Works fine with my TV. Good compatibility.All features works fine and as expected.Bcuz of all this, it's a VFM product to me.,Working fine can buy,It is working but expensive. Remote control should be waterproof . Please make it waterproof. I'll pay even 1500.", "img_link": "https://m.media-amazon.com/images/I/21PB1kWQWdL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/LOHAYA-Remote-Compatible-Control-Please/dp/B093ZNQZ2Y/ref=sr_1_108?qid=1672909129&s=electronics&sr=1-108"}
{"product_id": "B08LKS3LSP", "product_name": "Gilary Multi Charging Cable, 3 in 1 Nylon Braided Fast Charging Cable for iPhone Micro USB Type C Mobile Phone | Colour May Vary |", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹345", "actual_price": "₹999", "discount_percentage": "65%", "rating": "3.7", "rating_count": "1,097", "about_product": "The cable comes with 3 Different pins allowing you to charge your Android, iOS and Type-C devices at the same time|High-quality copper wires promote maximum signal quality and strength|Ensure a maximum charging speed up to 2A, charge faster than most standard cables.|This multi charger cable widely compatible with all Smartphones.|What You Get: 1 x 3 in 1 Multi Charging Cable (with Mini USB, Micro USB, Type C)", "user_id": "AH5JH2QLZDYXTHIDXBBLTDHQUALA,AGY6OOO6NIXEY5CJIHB4LUUUQJLQ,AHCJ2GWM5V4XDOBLR4UU2RV4ERKA,AFBURR5C3CR7XL4WPXXV5ZEDDZPA,AFWFYPM37ORBVNKGLW4EETQML7TQ,AHFT6MCOAFZXAUNCYQYPBI7YYF4A,AHA2QGFQYDUQ57OW7ATIM3QVTIIA,AFI5YRB4PKR26ECAXNTMOWMXMEQA", "user_name": "kishore movva,Nithya,Balaji BG,M Shafi Bhat,pooja,Showkat,Anuj,Royal", "review_id": "R168J8VQSY0OH5,R18LTVF8A76SR3,RVRLO0A6SRBIU,R3VH49P53CT04T,RSEQE3YO0NKC0,R3A8QATMFQYP3W,R374YBV58QVZRY,R233DLMRTKEDS4", "review_title": "Product is nice,Decent cable,It charges all the three types,Value of money,Product is good and worth of money,Good material.... working good,Very good,ठीक ठीक है", "review_content": "Product  is nice,Decent charging cable for the price. This does not carry data. Also the retractor is not that great. Within a few uses it stops retracting unless you hold both ends and try to pull. No issues in charging,just received the product, seems good, got a black coloured product, checked all the three types cable head. Durability will be known after the regular use. Seems worth the value.,Good product,This is a useful product ever✅,Every thing ok,Good,क्वालिटी में अच्छा नहीं है पर सही चल रहा है।", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41nGfip4QuS._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Gilary-Charging-Braided-Magnetic-Charger/dp/B08LKS3LSP/ref=sr_1_109?qid=1672909129&s=electronics&sr=1-109"}
{"product_id": "B00V4BGDKU", "product_name": "TP-Link UE300 USB 3.0 to RJ45 Gigabit Ethernet Network Adapter - Plug and Play", "category": "Computers&Accessories|NetworkingDevices|NetworkAdapters|WirelessUSBAdapters", "discounted_price": "₹1,099", "actual_price": "₹1,899", "discount_percentage": "42%", "rating": "4.5", "rating_count": "22,420", "about_product": "Fastest USB 3.0 and Gigabit solution ensure high-speed transfer rate|Plug and Play for Windows (11/10), Mac OS (10.9 & later versions), Chrome OS, and Linux OS.|Foldable and Portable design ideally suits your Ultrabook|In an unlikely case of product quality related issue, we may ask you to reach out to brand’s customer service support and seek resolution. We will require brand proof of issue to process replacement request.", "user_id": "AHQC27SWWMUOTO3W7NGIG7KPX2AQ,AH3ZNJWSAOEWIBD3NFLGHZZOOMIQ,AFAFMRV4L35642NQMP3WELYPQ6ZQ,AG6GKJFYOVO2OJCRV73FBUIBAJLQ,AEWU6OTDLIVY6F2UAY2UYYQSGOPQ,AFOPBEQ5YUOBWJ7TBDFITQFZSN3Q,AETRLRK4QNNUXN3RRQ7BWMBAFXCA,AFXO2ER7GFIH4WDPPZX6LRZX3X7Q", "user_name": "MOINUL H.,Jayendra Pai,Avinash kumar,Sreekanth,Piojeet,simam.mular,Sagar,Saumik Shashwat", "review_id": "R30SWI8U6K7PDR,R2K3WL7JFGLDI,R2WXWZRPAKQ1GP,R29PWDI4WOF8FK,R26V2X161L8NR5,R3B4VBD2NKURWM,R3A6QVJ73S0FLJ,RSP7D739UWRFL", "review_title": "Easy to use,Working fine - but errors while using USB and Ethernet adapter together.,Speed is just awesome go for it,Best price to buy,Awesome product,Overall good,Drains battery if you use on smartphones,Excellent product but it has 1 major and 1 minor inconvenience", "review_content": "Good looking amd working fine.,I brought this primarily because my Lenovo Laptop (Windows 11) has only one USB 3 port, no ethernet slot and one c-connector port.While in office immediately after purchase of this TP-Link UE330 3-Port USB Hub and Gigabit Ethernet Adapter, I used this for the ethernet connectivity to my office network.  Simultaneously I was using the USB ports in the Hub for connectivity of my wireless mouse and one port for external hard-disk.  This continuously gave me problems with connectivity of the mouse or the HDD.  I got errors like USB device not detected etc.  Till a point, where it refused to detect my mouse.At home, I used the hub for connecting only to my external HDDs (two numbers) and it is working fine.  For a moment, I was trying to return the product, but since I got this delivered in Mumbai at my Office and then I had returned home to Karnataka, it refused to process return in a different city.Right now, it is working fine, since I do not need ethernet at home.,Speed is more than wireless,I am not used since it restricted in my system.,I have used it with HP and Dell Laptop. It’s compatible with all. It’s plug and play and easy to use.,Good product,It works perfectly,A trusted and a reliable brand with a convenient design having a slot for folding the cable. It works and works well every time.However, they made 2 strange design decisions that take some points off the satisfaction of using of the product:1) There is a bright white light on the product which keeps flashing when the connection is active. It is a huge annoyance when I’m working at night.2) The cable is flat, which is like a double-edged sword. On one hand, it comes in handy when folding it on itself and redacting into the body. But when it’s not hidden and used with a laptop, with the adapter being visible, the flat cable folded sideways looks ugly.The product would’ve been a perfect 5/5 if TP Link didn’t make these strange design decisions. Hope this helps. Thanks.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/219039qa+PL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/TP-Link-TL-UE300-Gigabit-Ethernet-Network/dp/B00V4BGDKU/ref=sr_1_110?qid=1672909129&s=electronics&sr=1-110"}
{"product_id": "B08CHKQ8D4", "product_name": "Wayona Type C to Lightning MFI Certified 20W Fast charging Nylon Braided USB C Cable for iPhone 14, 14 Pro, 14 Pro Max, 14 Plus, 13, 13 Pro, 13 Pro Max, 13 Mini, 12, 12 Pro, 11, 11 Pro Max iPhone 12 Mini, X, 8 (2M, Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹719", "actual_price": "₹1,499", "discount_percentage": "52%", "rating": "4.1", "rating_count": "1,045", "about_product": "【Power Delivery Fast Charging】: Charge your iPhone 12 from 0% to 50% in just 30 mins. Wayona USB C to Lightning Cable supports fast charging for iPhone 14, 14 Plus, 14 Pro, 14 Pro Max,13, 13 Pro, 13 Pro Max, 13 Mini, 12, 12 Mini, 12 Pro, 12 Pro Max, 11, 11 Pro, 11 Pro Max, SE, X, XS, XR, XS Max, 8, 8 Plus, and other later models when using your Type C Power Delivery Charger (including 18W, 20W, 29W, 30W, 61W, or 87W USB C Power Adapter).|【New C94 Connector】: This cable uses the Newest MFI Certified C94 Chip which is specially designed for fast charging, whose color is different from the previous C48 connector end. Charging Speeds 2.5× Faster.|【Compatibility List】: Wayona USB C to Lightning cable supports PD Fast Charge 3A (max) for iPad 8th iPad 2020, iPhone 13 Pro/Pro Max/ Mini, 12/12 Mini/12 Pro/12 Pro Max/11/11 Pro/11 Pro Max/XS Max/XS/XR/X/8 Plus/8 and iPad Pro 12.9\" gen1/iPad Pro 12.9\" gen2/iPad Pro 10.5\"/iPad Air3 10.5\"/iPad mini5 7.9\"; This cable also supports the standard charge (5V/2.4A max) for iPhone 7 Plus/7/6 Plus/6/6S Plus/6S etc. Note: You need a Type C port wall charger to achieve fast charging.|[High-Speed Data Transfer] : At 480Mbps data speed ,Transfer music, movies, and more between iPhone, iPad and Mac in seconds.|【Ultra High Quality Assurance】: Special Strain Relief design, can bear 15000+ bends in strict laboratory tests. Premium Aluminum housing makes the cable more durable. Premium nylon braided type c cable adds additional durability and tangle free. We provide this 6ft Nylon Braided USB C to iOS Cable with worry-free 12-month warranty reach us on +9-8080097788 by Call or Whatsapp.", "user_id": "AFKENW6K3CFMTD3EGXQCUGK5XWWA,AHW52L6QGPO7TTN7LC3B5JVJNRDQ,AGDOSBSPQWBNRA3G4IV3YWOVIOXQ,AFOTDDBZZITX2HTAZ7HBQ3I4BZYA,AEEXKG5AG3K2ZV5EDWTS44RP245Q,AGHPERSZ5ZUKU6VDRTYPQ3IOGQUQ,AHY6R6FREC2FHKQYBVIBR3XJKPVA,AFCKW7CNBDUGWITOVBVJGAQYTW6A", "user_name": "Kiran Kolla,Vishal gupta,Pranav,JS,Palak dadhich,8360101472,Pravin,Rahul M.", "review_id": "R3ROJ6AWGN2UFN,R3160KII7MBSDT,R8ZDM5P3NBJ6V,R2XYESNNUWI2DP,R1UHCZ5GEKZFZL,R2LUS6OIA1FUIY,R3TNBYI02BNXDP,R341FNER86M2NB", "review_title": "Good,I don’t like this product,Awesome product,Best cable for iphone xs .. works well with fast charging brick,Low quality pin but wire is fine,Excellent quality,Awesome quality and fast charging,Works fine", "review_content": "Good,,Quality of cable is good and fast charging and customer care support very helpful,Simply the best cable.. works really well with fast charging brick,Don’t buy if you have problem with loose pin…its pin is same as oroginal iPhone pin…but the wire quality is good…if you want to take for that…it just took 2 months for thier pin to break,Awesome charging wire,Awesome quality and fast charging,The product works fine. It is able to deliver fast charging when connected to a 20W charger. The cable is durable unlike the Apple OE cable.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41fRMsvSy8L._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Wayona-charging-Nylon-Braided-iPhone/dp/B08CHKQ8D4/ref=sr_1_111?qid=1672909129&s=electronics&sr=1-111"}