{"product_id": "B08BJN4MP3", "product_name": "HUL Pureit Eco Water Saver Mineral RO+UV+MF AS wall mounted/Counter top Black 10L Water Purifier", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterFilters&Purifiers", "discounted_price": "₹13,999", "actual_price": "₹24,850", "discount_percentage": "44%", "rating": "4.4", "rating_count": "8,948", "about_product": "Color: Black, Capacity: 10 litres, Power: 36 watts, Input Water Temperature: 10˚ to 40˚C, Operative Input voltage: 110 -240V;50Hz, Material tank type: Food grade engineered plastic;This water purifier provides advanced 7 stage purification to ensure 100% RO water. It enriches water with essential minerals to provide safe and sweet drinking water|Can be used for TDS up to 2000 ppm. Designed to treat multiple sources of water: Borewell, Tanker, or Tap water.;Included in the box: Water Purifier, Installation Kit, External Sediment Filter|Installation: Free installation is provided by the brand. Please wait for 24 hrs for the brand to contact you post-delivery for metro cities. For others, please wait for 48 hrs for the brand to contact you post-delivery.;Product Dimensions: Length 45.5 cm X Width 31.0 cm X Height 67.0 cm Warranty: 1 year on the product (Consumables & additional accessories are not covered in warranty)|HUL Pureit Eco Water Saver is the highest water-saving RO with a recovery rate of upto 60%. It helps you save upto 80 glasses of water daily compared to using other ordinary Ros; Included Components: Water Purifier, Installation Kit, Warranty Card; Purification Method: Ultravioletreverse Osmosis; Warranty Description: 1 Year Warranty Provided By The Manufacturer From Date Of Purchase|Purification Method: Ultravioletreverse Osmosis; Warranty Description: 1 Year Warranty Provided By The Manufacturer From Date Of Purchase; Included Components: Water Purifier, Installation Kit, Warranty Card", "user_id": "AGIHTJB62LSES5P47SG25CPSV4IQ,AFLAZ32RGD2TCCZ6RXZSJTOPYUZQ,AGUO5HJBINPLO6XJKQ2PEMYWNJPA,AGNQNBLTVVNAB6NKW25OR3CFEBZQ,AGBLMAZ6GSLLNNDLH7WQPPGKG6YA,AFEC2BL5KGRD3QNBBU7AKNFT3DEA,AHQ3YSPSNJ6PTH7GQ5BAIYDVIQOQ,AEOV5M2XBOTAJ5HEJVKZHDOM2PYQ", "user_name": "vaibhav anand,Debendra Nath Ghosh,gtnishanth,Sk rahil,Sunder s.,Rajesh Aswasthan,Sudeshna Aguan,Bhanu yadav", "review_id": "RTYS2009LXZ0F,R3DHH1B1DC2OGH,R26KSH3RBQKGT2,R214TVL0DAXY0G,R22XPNBA0P52JE,R2JCG39HM3XZKI,R30UMY6PRVGYKT,R398R1U5AOLEWZ", "review_title": "Sound is pretty annoying,Best Normal Water Purifier,Good product,Good,Good,Perfect product for a small family..,It’s a nice mid budget by product.,Great product truely satisfied", "review_content": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/71udR616RpL._SY88.jpg,Our mission is to purify drinking water and make it safe to drink.  In that case this Eco water saver 10L is very useful.  TDS of my bore well water is 472 ppm and TDS of purified water is 64 ppm and test very good. Rejected water is 40% out of 100%  Company is very careful in terms of service but local service is lax.  It is our misfortune that there is no service agent in our district (742101,2,3) headquarters.  I am very happy and will tell everyone to buy. Thank you Amazon.,Yes,The product is good and installation was very good. The service provider’s behaviour was vry good overall very good experience,Good,Good product by timely delivery of  Amazon. Instalation took 5 day's time but pureit sent a very humble and knowledgeble person for installation.Thanks team Amazon and Pureit for delivery and installation of good quality product at affordable price,The tap for water dispenser is at the mid of the purifier. By that I mean, when the product is wall mounted, the tap of the purifier is also at a height causing a bit of inconvenience.Rest, it’s a nice mid budget product.,Good product great company service support HUL keep it up👍🏻", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41ut+j+REdL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/HUL-Pureit-Mineral-mounted-Purifier/dp/B08BJN4MP3/ref=sr_1_317?qid=1672923609&s=kitchen&sr=1-317"}
{"product_id": "B0BCYQY9X5", "product_name": "Livpure Glo Star RO+UV+UF+Mineraliser - 7 L Storage Tank, 15 LPH Water Purifier for Home, Black", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterFilters&Purifiers", "discounted_price": "₹8,499", "actual_price": "₹16,490", "discount_percentage": "48%", "rating": "4.3", "rating_count": "97", "about_product": "7 Stage Purification: Livpure GLO Star provides 7 stage advanced purification: 1) Super-Sediment Filter 2) Pre-activated Carbon Absorber 3) RO Membrane 4) Mineraliser 5) Ultra Filtration 6) Silver Impregnated Post Carbon Filter 7)In-Tank UV Sterilization|Mineraliser: Mineraliser in the purification system ensures right level of essential minerals in water like magnesium, potassium etc. Magnesium boosts exercise performance, maintains healthy blood sugar levels, promotes bone health, and supports better sleep.|In-tank UV sterilization and insect proof-high quality storage tank helps in keeping the purified water pure for longer duration avoiding any sort of contamination post filtration. Purification Technology Used: RO + UV + UF + Mineralizer. 15 ltrs per hour filtration capacity and TDS in input raw water upto 2000ppm.|Its color & design complements the aesthetics of kitchen. LED indicators display power supply and purification status. 7 liters storage capacity is suitable for different family sizes.|Indication LED Display: The water purifier comes with interactive LED Indications -Power On, Purification Process and Tank Full Indication.", "user_id": "AHF45IU3KZ4H47ZP3F7CZE7MHYNQ,AFK3LUAAIPVB22RJDB74TVOSPC2Q,AGCCV4MEGM6TGD4ZCPMBQICK3SNA,AGDM3424VYOWVYWB3TYVDVD2ZZLA,AFXHSMAQBFXU4A34SCILCOV37VIQ,AGO4VY6QUDHZV2JIJXHT5V22GUUQ,AFGIOF47QJUHXAPHAUEQXT6LQJVA,AG5Y7UAFKC352NVZPMRVQRENEAMA", "user_name": "Amazon Customer,Ushanandhini M,DGS Engineering solutions,Indrajeet Ghosh,AA,himanshu madhani,Ankit Gupta,Avinash singh", "review_id": "R2ZPWCXL5SRL4K,RZQBPVMZ63GKC,R3PZ9M9NRLFCBK,R2VMQ0VVXS5IEG,R2C46FNV1C79UY,R3BAG45K66JWS0,R2L5BXFZ44VH08,R1DNIFUE8H5EEW", "review_title": "Livpure water filter reviews,Good product,overall good product, works great,Livepure Water purifier,Excellent.,Amazing product,Superb performance,Very good", "review_content": ",Good product.Initially a duplicate product was sent by the seller.We found out this using the barcode printed to check the genuineness.After a replacement request we got a original product but the plug was not working.After a service request technician came very next day and fixed the plug and leakage problem.You can go for it. But don’t forget to check the genuineness.,at first defective product Recived, got fixed by instalation person, overall good product, works great,Going going till now,Amazed and Happy with this purchase. I replaced my old purit top model with this:-1. Excellent price 8.5k2. Has all latest features of current high end over expensive ROs in market like in-tank UV, mineralizer, no prefilter required, tds adjuster, taste enhancer.3. Beautiful design.4. Water dispensing speed is fast so less waiting for filling glass.5. Press and hold lever tap is great.Overall excellent and best model that carries all latest features of other brand expensive model.Latest features in low cost.Simply amazing.,The product was good in this range,Fantastic water purifier and pocket friendly too.,Very good but water test not good", "img_link": "https://m.media-amazon.com/images/I/319t03ZuOML._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Livpure-Glo-Star-RO-Mineraliser/dp/B0BCYQY9X5/ref=sr_1_318?qid=1672923609&s=kitchen&sr=1-318"}
{"product_id": "B009UORDX4", "product_name": "Philips Hi113 1000-Watt Plastic Body Ptfe Coating Dry Iron, Pack of 1", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹949", "actual_price": "₹975", "discount_percentage": "3%", "rating": "4.3", "rating_count": "7,223", "about_product": "Black american heritage coating for easy gliding|Button groove speeds up ironing along buttons and seams|Iron temperature-ready light; Warranty: 2 years on product|Power: 1000 watts; operating voltage: 240 volts|Color Name: White; Size Name: Multi; Material Type: Other", "user_id": "AFWRX7NJDJNWOBKAJFVHN5WRNBZQ,AGMQBENGBYFDIFBCX7TTRXZJ42UQ,AFYY6ZT5ZOTXLDKDBSPRHTJLLZIQ,AGZ55KFBZ6HLW5UIQBEPIBBND6GQ,AH6ADLMJRC3DYSRBDFVJZEHXARGA,AFARITTBYR4HMMHALZPS4DZGMVTQ,AEOEFJ7ZBQWRXYKAX5BMGZQNMLFA,AEE2UIYAS7GME4GOS6EZWUK52KCA", "user_name": "Bharath,Yuvraj Mane,Aruna kumari,Kalpesh Rampariya,rohini,Vinod,Dinesh C Dwivedi,Prabhat Sharma", "review_id": "RUQ8WLFE1FRJ2,R3INJM16FB1HRU,R2SK87JCLEZXU5,R2ETO1K77ZMSKV,R2H68423RYLXB,R1WFAYRPS9QE0I,R3G4YE2Z67KWF,R10VUNRCJ444H", "review_title": "Good,Good product,Heating is less,Good and quality product.,Excellent product,Very good,Easy to use, better in performance,Superb Project 🥰", "review_content": "It's okay,Product good,All ok but heat is less on full speed. Today is 6 October if u replace it with better quality .I will be thankful.today is last day.,Overall good quality product. Like it and recommend it.,I trust the Philips iron and this has delivered as expected.,Very nice 👌👌,पसंद है,Good", "img_link": "https://images-na.ssl-images-amazon.com/images/W/WEBP_402378-T1/images/I/41EK0QNFSUL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Philips-HI113-1000-Watt-Plastic-Coating/dp/B009UORDX4/ref=sr_1_319?qid=1672923609&s=kitchen&sr=1-319"}
{"product_id": "B08VGDBF3B", "product_name": "Kuber Industries Round Non Woven Fabric Foldable Laundry Basket|Toy Storage Basket|Cloth Storage Basket With Handles| Capicity 45 Ltr (Grey & Black)-KUBMART11446", "category": "Home&Kitchen|HomeStorage&Organization|LaundryOrganization|LaundryBaskets", "discounted_price": "₹395", "actual_price": "₹499", "discount_percentage": "21%", "rating": "4", "rating_count": "330", "about_product": "PACKAGE CONTAIN: 1 Piece Laundry Basket|MATERIAL: Non Woven, COLOR: Grey & black|PRODUCT DIMENSION: 37 x 37 x 49 CM|EASILY FOLDABLE: Built-in handles for easy transport from the hamper to your washing machine. Easily folds open to put into use and quickly folds flat for home storage when not in use.|Easy To Use: This is a multi-purpose organizer that can be used for keeping various things. You can set a few bags for various items, such as office clothes, home clothes, daily essentials, and many more. This will help you get the things and will also save time in re-organization.", "user_id": "AGSOQRGXBG47F35QN7GIZU6WKZ6A,AH6K7IVGP33VRVDUW7OMJK4T4XRQ,AHL6LLEVH42TSWIRQ5SEXFRUMG2A,AF2G7CBWXGVMQKYJDB63DFT5YU3Q,AF7P56JP3WZNRN4CCTRWVH3L7C3A,AFUGNPSXEVDZS2VGJUYR6CAQQO3Q,AHAJML6W5NJNUP4ZO3N2X3FFOMEA,AGSD4DN7SI3JW6IO3LB7IR5CL4NA", "user_name": "9640185788,Piyush Mishra,Vickie,Sakshi gupta,Srinivas,Lovraj V.,Rakshitha,Sandeep Kumar Yadav", "review_id": "R1STWXMMXCIH5R,R2NMOFESF8XUH0,R1ZCZPBQQ9KJK5,R1ENHRHV4PYK80,R3JYYAE7E8XMB7,R23AXNSZOR242M,RS4EISO2SVH41,R19H4V5VDOUHHC", "review_title": "Kids toys,Value for money, good product in this range,Can go for this one,Good,Nice,Ok,Ok,Durable and bigger than my expectations", "review_content": "https://m.media-amazon.com/images/I/61-rEB6Cb2L._SY88.jpg,What do you expect from laundry bag?To store clothes or something like thatSo yeah it's doing the job 😂,It's big nd good,Good, little small can take 5-6 shirts.,Nice,It is of small size.,Same as shown,I got this product three days back and it comes with small packaging but when I opened this .... Actually it was bigger than my expectation. It comes with standard material and with nice quote written over it. This product is durable, sturdiness and value for money.", "img_link": "https://m.media-amazon.com/images/I/41FQI5F2OiL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Kuber-Industries-Foldable-Laundry-KUBMART11446/dp/B08VGDBF3B/ref=sr_1_320?qid=1672923609&s=kitchen&sr=1-320"}
{"product_id": "B012ELCYUG", "product_name": "Preethi MGA-502 0.4-Litre Grind and Store Jar (White), stainless steel, Set of 1", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|SmallApplianceParts&Accessories|StandMixerAccessories", "discounted_price": "₹635", "actual_price": "₹635", "discount_percentage": "0%", "rating": "4.3", "rating_count": "4,570", "about_product": "Country of Origin: India|Capacity: 0.4 liters, Material: Poly Steel|Machine ground and polished blades for quick grinding|Includes: Jar (0.4 liters) and Transparent lid|High grade nylon couplers for smooth trouble free usage+^+Warranty: 1 year on product+^+High grade stainless steel jars and blade", "user_id": "AGC3Z3473ZVXYFMWYSAUE2T7V3MA,AEDXKCO2L3ULRQJ5IH4QNI33A44A,AGRIBJTFIAXNL5IDSUIDXLUE6I5Q,AHZBPWQ7QCCQOXQMVWFSK5PGFP4Q,AFR3HDYVY3OY2KQFIEQO2SRPTW5A,AELVBHWVUCBMI7DE345Q3MCDAJQQ,AGNJ2LVUBOBR37BVTTXCTGYBP4RQ,AH6U7NIRXZ7NQQ67NYFWEATGKDPQ", "user_name": "Sunil Khandagale,Shamim,HARI.M,Malini,Kusal Srinivas,mkrishnanpillai,Suresh Babu,poongodi", "review_id": "RN9VBZPCHG67H,RSK3T9GASN96L,RPWBSG3KWA82A,RWGY8K9HNDNRU,R3L1XUQPJ929C7,R2XKLKC7UXH808,RM4IBEHSZRD8V,RAZEY6CB0C851", "review_title": "Good,Goos product which you can trust,Good,Cost effective,Good,Ok,Very good product,Quality", "review_content": "You can buy a good product.,Purchased this spare jar after 6 yrs of use.,Good product,It's nice,not cheaper same cost of shop.good result when using this jar,Best but not the same as the original one which we get in the box when we buy a mixxer,Like,Quality is good,Same as original", "img_link": "https://m.media-amazon.com/images/I/414iVhwacbL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Preethi-MGA-502-0-4-Litre-Grind-Store/dp/B012ELCYUG/ref=sr_1_321?qid=1672923609&s=kitchen&sr=1-321"}
{"product_id": "B07S9M8YTY", "product_name": "Usha Aurora 1000 W Dry Iron with Innovative Tail Light Indicator, Weilburger Soleplate (White & Grey)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹717", "actual_price": "₹1,390", "discount_percentage": "48%", "rating": "4", "rating_count": "4,867", "about_product": "1000W for powerful performance;Weil berger non stick soleplate|Multi colored LED tail light to indicate readiness;Easy ironing under buttons|Ergonomic design for a strong grip;Overheat safety shutoff; 360 degree swivel cord;Power: 1000 watts; Operating Voltage: 220 - 240 volts|Includes: 1 unit of product, User manual; Innovative tail light indicator: Red light while heating - Green light when ready to iron; Weilburger Non-stick coated soleplate glides effortlessly over the fabric; Plastic body to protect from electric shocks; Thermal fuse for overheat cut-off protection; 360⁰ swivel cord for easy operation; 1.8 m long chord; Indicator lamp for thermostat function indication; Includes: 1 unit of product, User manual; Includes: 1 unit of product, User manual; Includes: 1 unit of product, User manual; ISI mark for best product quality and safety of use; Warranty: 2 year product warranty|Color Name: Black", "user_id": "AEK23DLXXPG7UORUYI2DDS7RFVYA,AFRBQ32JL7MJAZ42PGXUPAXZSDUA,AGY755OL4WDTREH2UHZOLN2MTP3Q,AH3R5XO5VICXIDZB6BHBA5TY6O5Q,AHN6X3QCTG7BILQUFADRQKQ4I2SQ,AFK2NWB52ANDVAGQ53VJ222Y5GSA,AEZQECWFG4XZQBBXN7EBJVDWLMWQ,AESXSM7GDPH2GLFNMTOCZATE4MHA", "user_name": "Sachin Sahu,Arpita Panja,Rajesh verma,Mr. Girish Merwade,ravindra kr nayak,Venky,Aashish,Gyar Singh", "review_id": "R2T2IQ3NPMSEPC,R1RYD1G1L822TU,R3JBMU1NFJ68VJ,R2WSQQANOVVMW7,R3OIOOP7OOI9B,RXH86NNRUTTSM,R263I1US66YJWE,R1278X0YFW7IYM", "review_title": "Not so good,Good,Best best from market.,Very good iron,V Good,Light weight value for money,Really good iron at this price,Overall good.", "review_content": "The iron plate coating isn't good. Sticks on clothes, especially on printed shirts.,Good to use,Value for money.,Value for money,V Good,Nice product fast heating very good product,Gets through everyday work easily. Temp.  control is good. The indicator is brilliant. The cord is easy with the movement at the joint.,Everything is good", "img_link": "https://m.media-amazon.com/images/I/31W1xfnsOPL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Usha-Aurora-Iron-1000-Light/dp/B07S9M8YTY/ref=sr_1_322?qid=1672923609&s=kitchen&sr=1-322"}
{"product_id": "B0B19VJXQZ", "product_name": "ECOVACS DEEBOT N8 2-in-1 Robotic Vacuum Cleaner, 2022 New Launch, Most Powerful Suction, Covers 2000+ Sq. Ft in One Charge, Advanced dToF Technology with OZMO Mopping (DEEBOT N8) - White", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Vacuums&FloorCare|Vacuums|RoboticVacuums", "discounted_price": "₹27,900", "actual_price": "₹59,900", "discount_percentage": "53%", "rating": "4.4", "rating_count": "5,298", "about_product": "FREE HOME INSTALLATION & FREE HOME SERVICE: We, at ECOVACS INDIA, are committed to \"Keep Customers Interest Ahead of All.\" Feel free to contact Customer Care for Demonstration, Installation and Service Requirement.|PATENTED OZMO MOPPING TECHNOLOGY: With Unique OZMO Mopping that gives hand-like mopping efficiency, even stubborn stains can be easily cleaned.|MOST POWERFUL SUCTION: Ensures deep and thorough cleaning thereby eliminating all kinds of stubborn dust from your floor and carpet.|NEW LAUNCH, 2022: Ecovacs Launches DEEBOT N8 with upgraded suction power and advanced dToF Technology ensuring better cleaning efficiency.|SMART APP ENABLED & ALEXA / GOOGLE COMPATIBLE: ECOVACS Smart App connectivity lets you control scheduling and monitoring cleaning status from the palm of your hand. Works with Alexa & Google Assistant voice commands.|BEST SUITED FOR INDIAN HOMES: (A) Vacuum and Mop Simultaneously in-one-go. No need to buy separate Robot for mopping, (B) Covers Full House in one charge, (C) Suitable for All Floor types especially Tiles, Marbles, Granite, Wood, etc|ECOVACS BRAND: Undoubtedly, ECOVACS is a leading Brand in \"Robotic Vacuum Cleaner\" category with excellence in R&D & Innovation.", "user_id": "AFDTW4TES6JHT7YJUXKDFQJPRZXQ,AFEBFFAOMPMC6L3DMOXJYP355UNA", "user_name": "Jaydeep,Jayakrishnan R", "review_id": "R1BD0HURZRIGKV,RKQY8Y6U3Y4BT", "review_title": "A perfect balance of price and performance,Great Suction and above average mopping | Good Buy", "review_content": "Very happy with the product performance.Installation: Very easy to start using. Had to wait for 2 days for the technician but with the instructions from box, you can start yourself without waiting.In the box: 10 disposable mops, 1 washable mops, 2 side brushes, 1 main brush, Mopping plate, Deebot, Dust chamber with HEPA filter, Charging Dock, Cable, User Manual, Cleaning BrushCleaning performance: Superb cleaning with 4 power options - Quiet, Normal, Max and Max+. Lower suction means lower battery consumption. With higher suction power even the minutest dust particles will be cleaned up (Good if you have children in the house). Higher suction also means you need to clean the dust chamber more frequently. In all the 4 power options, the house will look clean and will collect most visible dust. The higher options are for deep cleaning. Also if you have groves or areas that accumulate dust over time in the flooring, the higher power will pull out dust from these tiny places.Cleaning Pattern: 1st edges of the room are cleaned and then it will run a north-south or east-west cleaning pattern inside the edges. No specific patterns like Y or Spiral)Mopping Performance: The mopping also has electronically controlled water usage - Low, Medium, High, Ultra High. The app shows warnings when using High and Ultra High (The robot may slip due to water on the floor) but I have been using High water flow on ceramic tiles and have not faced such a problem. The wheels of the robot have good grip which help with the higher water settings. The mopping will become more and more effective over time with usage of the reusable mopping pad (As it gets older, more area will touch the floor than a new mopping pad. For the 1st week, the mopping is not as good as the mopping pad does not entirely touch the floor but with usage the shape of pad will adapt and you will get better results.)Corner Cleaning: 1-2 cms of wall corners may not be cleaned, esp. if you don't have straight walls (E.g. if you have a bathroom door, which has a 1 cm cutout in the wall, then the corner area around the door might not be cleaned). 90 degree wall corners may have a 1-2 cm area which is not cleaned, however the side brushes are large enough for most of these corners. All other areas with obstacles, such as chair or table legs will be properly cleaned (Deebot may run around them 2 or 3 times).Corner Mopping: As the Deebot's mop is round, it will not reach the corners, expect a 5-6 cm area in the 90 degree wall corners not being mopped. However on straight walls, the cleaning is very effective as it may only miss 1-2 cms, which however will be cleaned by side brushes.IMPORTANT: If you have black furniture, Black stone / wall tiles, mirrors or any reflective furniture at the height where Deebot's Top mounted laser is located, the corner area near that black furniture will not be cleaned by Deebot. The laser is not able to properly recognize that it is a wall and will run a few centimeters away from that wall. This is important to consider if you have substantial amount of blacks in your house as the cleaning will be less effective.Mapping: The 1st run will map the entire house and you need to follow Deebot as it maps so that no areas are obstructed. Subsequent runs will update the map with any obstacles e.g chairs and tables if they were not initially mapped. The N8 version does not have additional sensors as the pro version. So it may crash into smaller items that the top mounted laser cannot directly see. Also, you can save at maximum of 2 maps at a time (2 floors). The 1st run will be a very random cleaning pattern. After the 1st run, you can edit the rooms (Divide or merge areas) and rename the rooms based on some preset options like Living room, bed room, kitchen, etc.). Once the rooms are mapped, Deebot will clean each room in the subsequent run and then you will be able to see proper cleaning pattern)The created maps are not editable (you cannot move or adjust boundaries). You have option to add virtual boundaries (as a line or as a rectangle box) where the robot should not go. This is extremely useful if you have mirrors or reflecting furniture at the height of Deebot. Deebot's laser reflects off the mirrors and assumes there is area of the house where it may be able to go (behind the mirror). So you need to manually block this mapped area behind the mirror with a virtual boundary or box. Deebot will automatically detect carpets and not mop over them (if you have installed mopping plate, then Deebot will ignore carpet area). Also there is an option to mark areas as no mop areas (Similar to Virtual boundary).Application Use: I used the android application for setup and regular cleaning functions. The app has an advanced mode, which works as per the stored map. If you turn it off, Deebot will start cleaning wherever you place it. E.g. I have a balcony which can't be accessed by the Deebot directly. I can pickup and place it in the balcony, turn advanced mode off and start cleaning. Once it is done, it will return to the place where you put it and notify that docking station is not accessible.The app also has 3 cleaning modes with advanced mode turned on. Area cleaning (Select a room or multiple rooms to clean), Auto clean (Clean the entire house), Custom Cleaning (Select an area on the map to clean).You can preset the sequence in which you want to clean the rooms. You can also set different vacuum and water levels for each room (or can use a common setting for the entire house). You can also preset how many times (Options are once or twice) you want to clean a specific room. You can also set multiple cleaning schedules based on which room you want to clean at what time of the day. Deebot will start working automatically. However, this is not advisable if you are mopping. As per the technician you must remove mopping plate after use. If any water leaks onto the parts, it may void warranty.There is an option to auto boost suction on carpets (to Max+). You can set the option for continuous cleaning, i.e. whether you want Deebot to auto restart cleaning if it runs out of charge midway. (Deebot will only recharge partially based on the remaining cleaning area, resume the cleaning, and then return to recharge - this saves time)The app also shows usage period of accessories in hours and the total expected usage time. It is an Ecovacs recommendation to replace the accessories - Side Brush, Main Brush, HEPA Filter. This area of the app also shows how to clean or maintain with images, which is really helpful.The app shows a history of cleaning cycles with maps. This helps to check if any areas were not cleaned.Cleaning and Maintenance: Expect that instead of cleaning the house daily, you will be washing the mopping pad every day and Cleaning Deebot once every week (depending on the size of your house). Cleaning will take around 30 to 40 minutes - remove all hairs from side brush, main brush and wheels, remove the dust chamber, remove the HEPA filter and wash the dust chamber, Wash the main and side brushes (if needed), Clean all the sensors of Deebot with a dry cloth, Let the washed accessories dry and then reinstall them. Also, remember that the investment in a robot is not a onetime cost. You will need to replace the accessories every 6-12 months based on the usage and maintenance. Consider the replacement cost also while evaluating a price point for investment in a robot vacuum.Overall Rating: 9/10 The cleaning and mopping performance is very good, and better than a house maid in most circumstances. (E.g. Deebot goes under the sofas). Expect manual work such as clearing the rooms before running the cleaning cycle, and cleaning areas out of reach of Deebot. In this price range, I am very satisfied with the performance.,", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31Ly7OehCGL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/ECOVACS-Robotic-Powerful-Advanced-Technology/dp/B0B19VJXQZ/ref=sr_1_323?qid=1672923609&s=kitchen&sr=1-323"}
{"product_id": "B00SMFPJG0", "product_name": "Kent Gold, Optima, Gold+ Spare Kit", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterCartridges", "discounted_price": "₹649", "actual_price": "₹670", "discount_percentage": "3%", "rating": "4.1", "rating_count": "7,786", "about_product": "Color: White|For gold, gold+, kool, star and optima models|1 UF membrane + 1 activated carbon pack + 1 sediment filters|Membrane life: 4000L", "user_id": "AH6L4HL7SHZ5FT3XJRTBG4VRQDDQ,AHM3BEM5TLDWOMRDAXTSJWFZ5TXA,AGCXOIOXQ6SMSCU5P73D2VTEEAQQ,AHJQP7JD3FSN7JT6D43MEG7F6BVQ,AET435JGPEIORB35LT7EZ4ASDRRQ,AENODVL6MR7QPBIXIIGAM54JZ6ZA,AGPIHCRS2LVMVTFCHLPYZMS6PL6Q,AGPAIQ4RMGU26NAKXGQCEB2OOS2Q", "user_name": "Shivraj,Subham,yedukondalu,MOHD MOHSIN,Jagdish Joshi,sam,M.Bharadwaj Phani Datta,BHARAMAPPA", "review_id": "R3K3LMO7VBZ15E,RIMQ7KGAFAY45,R1KDTPUO1RHWGT,RNJPU360H19UG,RRC1X279O3BYB,R3TS5E690D6AFF,R3S2E5C2I6JD1P,R1JSM9LLIPIPIE", "review_title": "Good quality, plz add 1 syringe with this kit,Original product,Genuine product,very good product,nice,good product,Good product no issues,ಉತ್ತಮ", "review_content": "Quality very good, but 1 injection syringe must be add in this kit,It is an original product. Got it at a discounted price.  Everybody should consider it.,Genuine product from kent,Kent Gold, Optima, Gold+ Spare Kit is a very good product  , I purchase this product 2nd time . It is very good for use,nice,good product,I bought it for second time good product with no complaints.,ಉತ್ತಮ", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41emm+fTJmL._SX300_SY300_.jpg", "product_link": "https://www.amazon.in/Kent-Gold-Optima-Spare-Kit/dp/B00SMFPJG0/ref=sr_1_324?qid=1672923609&s=kitchen&sr=1-324"}
{"product_id": "B0BHYLCL19", "product_name": "AVNISH Tap Water Purifier Filter Faucet 6 Layer Carbon Activated Dust Chlorine Remover Water Softener for Drinking Cartridge Alkaline Taps for Kitchen Sink Bathroom Wash Basin (6-Layer Filtration)", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterPurifierAccessories", "discounted_price": "₹193", "actual_price": "₹399", "discount_percentage": "52%", "rating": "3.6", "rating_count": "37", "about_product": "PVA non-woven + zeolite + maifan stone + calcium sulfite + natural coconut shell activated carbon + PVA non-woven, Six layers of water filtration, absolutely safe,no secondary pollution, non-toxic.|Compact handy, Suitable for all kinds of round taps,with a fixing ring, the water will not fall and will not leak.|Uniform size of the filter holes, you don't have to worry about splashing, it has the functions of filtering, splash-proof and water-saving.|Removes heavy metals from chlorine and other impurities in the water, improves the quality of the water, makes the water sweeter and safer.|Used in home kitchen, bathroom and any place you need.|Package Contain :- Pack of 1 Water Filter Faucet (Multi Colour).", "user_id": "AFNXAQBP6KZJYZD554ML2KJJTQVA,AEDNDMWWZ33RMM5UIXXGMEPSUYFA,AHH62JI45VG2IAZW6LEV5I2V5A3A,AFC6K2Z47KTGVTXKS3ZNPUEVLQDQ,AFB7NE24HEWG4SNDZWML7IYYMBLA,AEM3IXZKUN7EH2CFOJS6KL3YIFAA,AGC7SAVEMKWZRSJDQWYIBH2ZOMFQ,AHQS3NTHOXQUMLMUAE3FN4LSNCHA", "user_name": "Vasanta Koli,Vaibhav baid,Sanjana,Ajay Singh,RAMA KRISHNA T K,Dr.Vishwanath Akku,ujjwal kumar banerjee,basu gk", "review_id": "R2JQPA2EQ0WL1U,R3U349CN4O5SC6,R1J878MPQE23PD,R2R9RFXWTHCR3,R2X9MHLA6MM34,RHA2MO1Y7A64J,R19QO4H7S5AZSB,R2GYKQI0LU6PCG", "review_title": "Filter not effective,The best water purifier,Worth for money,Best water purifier,Sheer waste of money,Fits well for kitchen faucet,Lousy product,Waste of money", "review_content": "Filter not effective,The best water purifier I have ever seen. It purifies the water and their is no impurities present in it. I have used other products but this is the best. The quality is also very good and durable . Highly recommended,I'm literally value for money & very easy to install everything written on the description box also it's budget friendly .,Value for money and easy to install,This thing doesn’t hold on to the tap even if you use the attachments given. The screw cannot be tightened and as such it does not hold on to the tap.  Once the tap is opened it slips and falls away. A very cheap product and I am unable to return it now.,Filters well,Extremely poor quality with no manufacturer's identity. Useless product. I advise everyone to not buy this product.,Don't buy this product, don't serve the purpose", "img_link": "https://m.media-amazon.com/images/I/41jJsvzPK0L._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AVNISH-Water-Filter-Layer-Filtration/dp/B0BHYLCL19/ref=sr_1_325?qid=1672923609&s=kitchen&sr=1-325"}
{"product_id": "B0BPJBTB3F", "product_name": "Khaitan ORFin Fan heater for Home and kitchen-K0 2215", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|FanHeaters", "discounted_price": "₹1,299", "actual_price": "₹2,495", "discount_percentage": "48%", "rating": "2", "rating_count": "2", "about_product": "Khaitan Orfin Fan heater for Home and kitchen|POWERFUL 2000 WATT|HEATING POSITION 1000 W-2000W|ADJUSTABLE THERMOSTAT TEMP.CONTROL|AUTOMATIC THERMAL CUTOUT FOR SAFETY|FRONT GRILL FOR SAFETY|TURBO FAN", "user_id": "AGHT3K4KSG5MAQUSXRDT5VNB73GA,AE4Q5XQ7SZW35EEUJKQ3IV2IIBQQ", "user_name": "Manidipa Sengupta,Vidisha", "review_id": "R1OO2ED6615EX1,RR4S5JTJMCPA5", "review_title": "Bad quality,Amazing product..", "review_content": "The heating capacity is zero .Moreover i have initiated return request. Noone has come to collect it,Best heater at this price. Quality is very good . Suggest everyone to purchase this heater.......... amazing product to buy...", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31B8Pd1SmLL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Khaitan-ORFin-heater-Home-kitchen-K0/dp/B0BPJBTB3F/ref=sr_1_326?qid=1672923609&s=kitchen&sr=1-326"}
{"product_id": "B08MXJYB2V", "product_name": "USHA RapidMix 500-Watt Copper Motor Mixer Grinder with 3 Jars and 5 Years Warranty(Sea Green/White)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MixerGrinders", "discounted_price": "₹2,449", "actual_price": "₹3,390", "discount_percentage": "28%", "rating": "4", "rating_count": "5,206", "about_product": "500 W high Torque Copper motor|5 years warranty on motor and 2 years on Product|4 fin hardened stainless steel Techno Blade for fine grinding|Food grade Jars & Blades|20000 + high rpm for faster grinding|Easy to open PP flexi lids of jars|Jar Size: Wet Jar: 1.2 L, Dry Jar 800 mL, Chutney Jar: 400 mL", "user_id": "AGWRDM5YZKAAJ46Y2NUJSMCFD2RQ,AGAOIEU4KTRFNKU4K55O65W3MILA,AFJSEVZLNI3MKTWAMJJVH6N5BQOQ,AHQPMFJKEAFXVC3NVQLVVIPHDZJA,AFPERGOQHKWSN6M6CNDRGQJUPAMQ,AGL6KF3GSYVGK2WIV73Z5GTUN2MA,AFEE2S2P4LI6QSXWSLRVGRLHYIGQ,AGRZWZVM4SAPRBTOALQBUR6N6WQA", "user_name": "PK,Manigandan K,Monu khan,Manohar,Saroj Kumar Das,Dev tripathi,Anish Reddy,Ankit raj", "review_id": "R2MUOQFFMUBSEX,R2TTPMZXY7I60N,R3J2S0BEM61SOV,RNGB4OZTF3NE9,RPWGHZZ206ZUQ,R215KMCB5Y5BKK,R2XVLVMLVK698V,R3MMCNIWBVZHMH", "review_title": "Good,Superb,Nice mixer,Value for money 💰,Good product,His desine,Nice,Nice", "review_content": "Good product to buy,Value for Money,Easy to use,Good product,Mixer grinder is good, easy to use and sound bit high. But all the jar lid is not good so cheap quality lid, it's get removed top lid, plastic handle comes out from top, but overall is good and easy to use.,His cap system is not good,Good,Nice 👌👌👌👌", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41-76LhAc4S._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/USHA-RapidMix-500-Watt-Copper-Grinder/dp/B08MXJYB2V/ref=sr_1_331?qid=1672923609&s=kitchen&sr=1-331"}
{"product_id": "B081B1JL35", "product_name": "CSI INTERNATIONAL® Instant Water Geyser, Water Heater, Portable Water Heater, Geyser Made of First Class ABS Plastic 3KW (Red)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹1,049", "actual_price": "₹2,499", "discount_percentage": "58%", "rating": "3.7", "rating_count": "638", "about_product": "Instant water heater: Now comes with unbreakable First Class ABS (Acrylonitrile butadiene styrene) body and comes with water inlet and outlet Thread type. It is more convenient for usage and it will avoid water leakages. Our geyser is portable, instant, and compact, less power consumption Up to 20% saves electricity compare to other storage geyser|Auto cut off feature: It is available when the user forget to switch off it will going to automatically cut it off. (Manual reset models are only going to Standby Mode, Other Auto reset models are going to restart automatically after 10 minutes If this is not noticed, the same process keeps repeating it will increase your electricity and geyser life time also decrease.|Compact size: It provides Non-stop (247) hot water from 10 seconds onwards, just put it in the water tap and get hot water continuously it does not required additional plumbing. Ideal to use in Houses, Beauty salons, Hotels, Schools, bathroom, Kitchen, Wash area, Hospitals, Mansion and factories where there is an instant need of Warm/Hot water supply. (Strictly we are not recommended for drinking purpose)|Specifications: ABS (Acrylonitrile butadiene styrene) Shock proof and Heat resistant, Copper Heating Element Tubular type(3Kw.) , Indicators Neon Green and Red light, Thermostat Copper ISI marked, 1.5 square mm 3Core cable ISI marked 1.15Mtrs, 16Amp. Plug Pin-top ISI marked, coming with Guaranty card and user manual, with 2 No s Connecting nipple, 1 No Royal union, 1.5 m connecting hose and 2 No s Screw with wall sleeve and excellent packing|Easy to carry and safe to use: The instant water heater can be carried easily and the compact size to make things easier. It is safe to use.", "user_id": "AGPO6ZBQ2HPAKJULWTNQSP7FOBZQ,AGMACNXEDN7CAJXDCMPUZW3MO5GQ,AG7VZ4KBXNGIBZMW6Y7H5AU4T7LQ,AFP2TFQ26IBNKAWREZ34ERZBUTVQ,AEGLSZQOSLV77Z3RYDNKQ4DHO7OA,AHVKTMZNCOGSHMV4QI3OZCGK2J6Q,AE2IPM7LGWZM72PWXD7DG2OJAEJQ,AHMWLA3HDZGMRYZNHFWY7FWZ7BZA", "user_name": "Dhamotharan,SHEIK UMAR FAROOK.G,Amazon Customer,Chandhana,Vasanth,Siva,Md. Aftab alam,Subhani", "review_id": "RWIX4QGK0HB47,R2U607V82KC6LR,R34XJ1XQ2W72IB,R1IGS6R7QZHIL3,R24GH90H9QAC3X,R2CGSX3HLMIJZL,R1N6Y6SLVTC950,R2HZOPWZKCIJXD", "review_title": "Nice products,Compact,Items is not good because it's tap is not good for output,Good,Good Product,Not suitable,I liked good product,So nuc", "review_content": "https://m.media-amazon.com/images/I/61PfDZp8UzL._SY88.jpg,Easy to use,Items tap is not good for users,Very good 😊,Value for money, working fine,It is not suitable for my tap,I liked..so product good. So happy amazon.. Liked amazon products provided Sum like this,", "img_link": "https://m.media-amazon.com/images/I/41NJizePolL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/CSI-INTERNATIONAL%C2%AE-Instant-portable-Plastic/dp/B081B1JL35/ref=sr_1_332?qid=1672923609&s=kitchen&sr=1-332"}
{"product_id": "B09VL9KFDB", "product_name": "Havells Gatik Neo 400mm Pedestal Fan (Aqua Blue)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|Fans|TableFans", "discounted_price": "₹2,399", "actual_price": "₹4,200", "discount_percentage": "43%", "rating": "3.8", "rating_count": "397", "about_product": "Twin Colour design.Wattage: 60 watts.Voltage: 230 volts.Number of speeds: 3|Jerk free / Smooth Oscillation|Three speed control|Attractive colour combinations; 2 Years Warranty|Controller Type: Remote Control; Mounting Type: Floor Mount; Material Type: Plastic", "user_id": "AEHI7PMP7HHH3BIMEMM4D6XKJC2Q,AGZ325HAAV233447G6SUIVBMMMAA,AHA2VXNJ2E6VA2RFAAJS5ZFPF3EQ,AEJOJTOSSJNIBWO5CP655BMKQZ5A,AGLEYJPDKFHDQUKR44ANTMCVH7YQ,AFZUCCUR2EBAOJTXZAMP4GKYDGPQ,AEV6XXFLHIIAGFBXZQACBPNOKIMA,AE4GKTZA6NFJG2HC7TAMA4NIIDEQ", "user_name": "Surya,Amazon Customer,Amazgon Customer,Satyajit Mitra,Mohana Lonkar,tony,Amazon Customer,Kothapalli subramanyam", "review_id": "R1B00RU3SHI9Q9,RHQJ6BFGU8S7I,RG5NSLD24104J,R3JPZAMX1OKWEU,RR77HDAK29S5E,RI9OJ89Z7HZ5F,R3T0U6U3J4PDPY,R2FFZ4RWVYRVJO", "review_title": "plastic material not good just ok,Good for middle class range,Good,Havells fan,Oscillating knob cannot be fitted,OK toofan,In this price range very good fan,Good but you have to install the item.No one will come to install the product", "review_content": "plastic material not good just ok,,Nice pedestal fan for havells company..,supplied without remote.,I cannot fit The Oscillating knob of of the fan , so the fan cannot be made steady. I am afraid that the inside fitting for this knob is broken or misfitted hence the problem.Please rectify the problem immediately, if unable to rectify, please give me replacement.,Fan safety grill clamp very low quality plastic,I'm impressed with this fan...,Good quality", "img_link": "https://m.media-amazon.com/images/I/31jWfV8N6+L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Havells-Gatik-400mm-Pedestal-White/dp/B09VL9KFDB/ref=sr_1_333?qid=1672923609&s=kitchen&sr=1-333"}
{"product_id": "B0B1MDZV9C", "product_name": "INALSA Upright Vacuum Cleaner, 2-in-1,Handheld & Stick for Home & Office Use,800W- with 16KPA Strong Suction & HEPA Filtration|0.8L Dust Tank|Includes Multiple Accessories,(Grey/Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Vacuums&FloorCare|Vacuums|HandheldVacuums", "discounted_price": "₹2,286", "actual_price": "₹4,495", "discount_percentage": "49%", "rating": "3.9", "rating_count": "326", "about_product": "2-in-1 Handheld & Stick Vacuum Cleaner: With this upright vacuum cleaner by Inalsa, switch easily from an upright stick vacuum to a handheld vacuum at the touch of a button and tackle trodden-in dirt, dust and debris on furniture, soft furnishings, stairs and car interiors.|Powerful Cyclonic Suction: Dura Clean Plus utilizes an ultra-high 800watt powerful motor with a suction up to 16KPa, providing all-around protection in renewing all the corners of your home and car keeping neat. This vacuum cleaner can suck out as small as microns dust and particles hidden deeply in sofas and mattresses. Dirt just can't hide anymore !!|Improved HEPA Filter: INALSA hand vacuum cleaner features enhanced and improved HEPA filters which are capable of capturing 99.97% debris, dander and dust. It further extends the lifetime of the appliance and effectively avoids clog of filters while ensuring suction in perfect condition. Exquisite workmanship with notable durability provides you unparalleled user experience.|Low Noise & Multipurpose Attachments: Bringing you a quieter cleaning experience. Dura Clean Plus comes with 3 attachments to meet all satisfactions. Crevice nozzle for reaching debris in tight corners & spaces with ease; Dusting round brush easily picks up hair or dirt on delicate surfaces; the hose pipe adds felxibility to access for hard-to-reach areas. The floor brush provides multiple floors and carpet cleaning.|CONVENIENT & USER-FRIENDLY: This portable vacuum cleaner is light in weight and is ergonomically designed which will help you escape from fatigue clean. With the press of a button, empty your dirty container and the appliance is ready to go again in a jiffy !! You can use clean stairs, kitchen, office, car or corners without bulky and tangled cords. 1 Year Warranty by the manufacturer from the date of purchase.", "user_id": "AGGPBIDY2R3EUF2WDFJDCB27YWUA,AEPQHH4GUMMN2KTD7VAT5DZFHUTA,AFBU5FXWPA2YVMWWIMGYMA2AG34A,AGIFWMCJ3D3MLPZ4N6OIIXK4EP7A,AELT5NENL2ZMZ3JT3QH5U5WSB25Q,AFRLWVFJ43WNDMOQDE3QFXJX62OA,AE46HCBRT2IIILPNCL32DZ5JHYMQ,AGIN3WL3VR42ECXY6SFGEVYAX5BQ", "user_name": "Vishnu S. Mishra,Amazon Customer,rhymerium,Raman deep,Vishal,Utsav Ghosh.,Ashutosh,Amazon Customer", "review_id": "RN9FDFWKUWE27,R9ERTYK7DPN51,R17LPFA7PQVV2Q,R1VIJFIRWTTF1F,R30ZXKRSMH8MBC,R3V395NK0BE964,R30BJ29AF18U6C,R2HZN4EOJBDZU2", "review_title": "Good Product,Includes relevant attachments in this price point,2 in 1 is exactly what i needed! (Read the rest for pros and cons),Value for money,Apt vacuum cleaner for my requirements, does the job,Not so satisfying, if you have other options to not choose it, then go for that other option.,Okay okay product,Product is very nice and handy but heated after used of 10 minutes. Overall performance is good.", "review_content": "Nice product, low noise and good suction power in price range, received damaged packet and without hose pipe, but over all product is good worth of money,Received the product on time. Have used it once to clean and its easy to use , works well. The heating concern mentioned by prior reviewers is apt however don't a damper for a purchase at this price. It's a decent product in the affordable category. The floor attachment Particularly works very well. It is light weight and so cleaning lower end of ceiling fans was easy. The suction power when using sofa attachment is quite good in cleaning dust stuck in stitching corners. Overall, if you want to spend minimally and get all relevant attachments and your usage is for a 1 bed or a smaller sized apartment,  this product is a good start.,,Carpet bohot ache se clean nhi kar paata, baaki normal cleaning ache se kar deta he.,Got this vacuum cleaner after a lot of research and it has been a good choice till now. I wanted a handheld vacuum cleaner for both car and home cleaning purposes. My primary requirements were cleaning my car and gaming chairs/sofas. A car vacuum cleaner only wouldn't have suited the purpose. Also, I wanted a power-plugged vacuum cleaner as the one with a battery can be used only for a certain amount of time, and there is a long charging period of wait.This product ticks all the requirements. It has a 5m power cable that is long enough to use comfortably. The suction power is good at 16kpa, unlike the 6kpa of most battery-powered cleaners. Noise is okay, I mean it isn't so much to disturb someone until and unless someone is really allergic to noise.It has several components that helped clean my car and even my fabric gaming chair. And I was also able to see a visible difference in the window meshes.Yes, it gets heated after several minutes of usage, but I could use it with a wait of 2-3 minutes each time. Its weight is ample for horizontal and downwards usage. I haven't used the stick provided, and I think it might be a little bit difficult to use it upwards on walls if I need to use it continuously for 10 minutes or more.I had to be sure that the accessories were available after purchase, such as the filter, which I was able to confirm with customer care. It's a good buy. Let's see in the long run.It's made in China. The company provides 6 months of an extended warranty if a review is given and shared with them. This is a bit weird requirement to go ahead with. However, this isn't a sponsored review and is based on hardly a month's usage.Some photos are attached for help.,Nice product, but the filter strain was teared in one place, it needed to repair. But otherwise satisfactory. Build quality is very deplorable, they are just forcing the buyers to give 5 star by any means to give better service and warrenty assistance by a card inside the box, this seems really threatening. But overall working of this machine is somehow ok.I would rather suggest if you have options to not choose it, then go for that option.,Good for surface cleaning, build quality is not adequate but good to have at this price,https://m.media-amazon.com/images/I/81ix5q8WyWL._SY88.jpg", "img_link": "https://m.media-amazon.com/images/I/31RLcOp57gL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Dura-Clean-Plus-Filtration-Accessories/dp/B0B1MDZV9C/ref=sr_1_334?qid=1672923609&s=kitchen&sr=1-334"}
{"product_id": "B08TT63N58", "product_name": "ROYAL STEP - AMAZON'S BRAND - Portable Electric USB Juice Maker Juicer Bottle Blender Grinder Mixer,4 Blades Rechargeable Bottle with (Multi color) (MULTI)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Juicers", "discounted_price": "₹499", "actual_price": "₹2,199", "discount_percentage": "77%", "rating": "3.1", "rating_count": "3,527", "about_product": "Portable & Convenient to Charge: This little body light weight design is easy for you carry it to school,office,parks,camping, anywhere you want to. and it also convenient for charge by power bank, laptop, computer, car or other usb devices.|Rechargeable&Portable - The USB juicer cup comes equipped with a built-in 2000mAh rechargeable battery that can be easily charged by power bank, laptop, computer, mobile phones or other USB devices .|Easy and Safe Cleaning - It has have smart safety protection device, magnetic sensing switch ultra safe to use and clean, the juicer cup's body and bottom can be separated, you can easy to clean it|Multi-function - With our juice blender mixing kinds of fruit and vegetables,you can make natural tasty juice,milkshake,smoothie and other baby food.It's very portable and great for traveling, outdoor.|Multi Functional : drink a protein shake, smoothie or healthy drink everyday, not only for making a protein shake, smoothie, juice, and it works well for vegetable and other baby food.", "user_id": "AH6P2FS36YMFXR6BCZY4QI3A5EGQ,AHLSHAJTU5B4XBPJGON3Q4MKMY2A,AESBXYARD65VZMCEZT6TMIF2I6AA,AFJUCN3LJPEEGA2MCUJMISQ3Q6SA,AGRGJTMI3RMO44FRRNDFQCML32BQ,AGX6OXEPVDQPCMFUTJWCGPAWKMFQ,AGQZQ2BXDDXY6D5K7HZF4CFSSZ6A,AGJD4634EZVTJUCYQETIMPBL5LVQ", "user_name": "Amazon Customer,Amazon Customer,Farhana sherin k,Srinivaas,Avik Bandyopadhyay,ASEESJOT kaur bhullar,Sameer,Ammu", "review_id": "RUIKGKRD5Y2WM,RS2SWNB31NQTZ,R1F2SW4YE5GUXJ,R1FYDS9NWE2BJN,R6QHEB7AVI99H,RPO0OE319VG3R,R3O98DZ74AMK81,R1UHYB97GFXYMT", "review_title": "Running Time is less,Not much useful.,Good one,Not so good,Useful product but improper blades,Overall good ...but can blend only very very softer fruits,Worth your Money,Worest item", "review_content": "Average products,This isn’t useful for smoothies. Good for lassi or cold coffee that too was leaking.,Nice for light fruits,Not continue works,,Overall good but can blend only softer food or fruits,I am using this Blender for 1 weeks and Now I must say it's worth you money go for it I am college student and I usually make Oat+Banana MilkShake for breakfast which to my surprise it did really good job in blending themBattery: 1 full charge will give you 2 blendsBuild Quality: 4/5 really goodSo just don't think it's perfect for College students go for it,Product is not good it's very very worest item banana also not griding atleast nd charging issues battery is completed 2min and it will stops automatically", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51ngprQwafL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/ROYAL-STEP-Portable-Electric-Rechargeable/dp/B08TT63N58/ref=sr_1_337?qid=1672923609&s=kitchen&sr=1-337"}
{"product_id": "B08YK7BBD2", "product_name": "Nirdambhay Mini Bag Sealer, 2 in 1 Heat Sealer and Cutter Handheld Sealing Machine Portable Bag Resealer Sealer for Plastic Bags Food Storage Snack Fresh Bag Sealer (Including 2 AA Battery)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|VacuumSealers", "discounted_price": "₹429", "actual_price": "₹999", "discount_percentage": "57%", "rating": "3", "rating_count": "617", "about_product": "【Easy to Use】After installing the battery, you need to press and hold the switch button for 3-5 seconds to heat up. Put the bag that needs to be sealed in the middle, the thinner bag can be torn quickly, the thicker should be drawn slowly and evenly.|【Portable】After use, it is not necessary to disassemble the battery, and the hook can be stuck at the sealing place, and can be hung with other appliances. The perfect portable bag sealing machine, suitable for kitchen, camping, travel, etc.|【Dual use】This product is not only a sealing machine but also an opening machine, the opening is very easy and convenient.Mini and portable bag cutter and sealer,Quickly seals and cuts.|【Material】Using high-quality ABS material, fine workmanship without burrs, high temperature and low temperature resistance, durable.|【Note】Do not press violently when sealing, otherwise it will cause the metal contact piece to deform without heating. The bag to be sealed must be kept clean and free from water., oil and other stains", "user_id": "AELHZH2PRVKJIVTQMABOTT6LUMBQ,AGNBNAIVJCEB3TBMEUWKDG6F3OAA,AEEJ6B3XBCPD2CHBKEWXRNHXM5EA,AFVUY5ZKTN2NRRFDXM6M6IOW6YXQ,AFX3VLIHVKXRNRC2HBLSBNEIV2LQ,AEQABAS4A3RXJ6CM4EX2645IUCEA,AH3SJ6WSYDG6DYJVQ7UYWAACHFMA,AFDFDVVB5IXZZBCIHG3VJVK3E3CQ", "user_name": "Ritika,ABHISHEK U.,Bhavika,Rekha rana,Balamurugan A,Dhiren Shah,Mrs. Imran khan,Anusree", "review_id": "R24VRMVVKTZXZU,R2SZR29UV8HPIJ,R34NPCR94RTTCU,REPOE3PIM6ZRN,R2RF6XPVSOG2R2,RHE4AF3VC0YG,RQ8DJGRM0OVUA,R2AX7J603OWTJ3", "review_title": "Not worth the hype,Gud,Really useful 😃,Product is good but when we press to seal lower part of sealer is get out automatically...,Ok product. Not generating enough heat to pack,Not up to the mark,Pocket friendly, effective and easy to use,Average", "review_content": "Hi viewers so I bought this product after watching the endless hauls of #amazonfinds. As much as I was excited for the use of the product, it did not prove to be as useful. The sealing side does not heat enough for a packet to be sealed well. The cutter side works fine. But mostly, the heating side has to be pressed upon so hard that the cell case opens up as it slides with the pressure of the thumb so I feel we can totally work without this product in our house. Its definitely stylish, comes with a Manual, Cells and a Hook to hang it but the slipping cell cover fails my convinience with it.,Gud,Easy to use, worth the money,When we press to seal lower part get open automatically,Not heating enamous power to heat and pack the plastic cover,Quality of the product is not good. The hold and press part for heating and sealing is not consistent. Sometimes it seals, sometimes it burns the plastic. Also, the seal comes off of right pressure is applied, so it is not reliable too.,The sealer quality is too good and it’s sealing well. The only thing is you hv to press it hard while sealing.takes only few seconds to seal an entire packet.  Good when you are travelling with a toddler and carrying lots of snack packets. Pocket friendly and cute,Average working", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/21rLuqop7cL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Nirdambhay-Handheld-Portable-Resealer-Including/dp/B08YK7BBD2/ref=sr_1_338?qid=1672923609&s=kitchen&sr=1-338"}
{"product_id": "B07YQ5SN4H", "product_name": "Cello Non-Stick Aluminium Sandwich Gas Toaster(Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|SandwichMakers", "discounted_price": "₹299", "actual_price": "₹595", "discount_percentage": "50%", "rating": "4", "rating_count": "314", "about_product": "Material - Pure Grade Aluminum, Colour - Black|This cookware is made of High guage & pure grade Aluminum used for higher efficiency during cooking|Even distribution of heat helps in making your sandwiches crispier|This versatile cookware is compatible with Gas Stove.|100% Flame Proof with Elegant black finish body|The handle is made from heat resistant material that enables ease and convenience while cooking and carrying the cookware|Hard anodised construction provides a stable heat distribution during cooking and is fast in heating up.", "user_id": "AEYYS445R5U3OMTCXTPFPPYIOC3A,AGRJV53VRADLDOF7VTZ75QXG7Q6Q,AFRZUJVTEHFZOVRCJJMAZTI5343A,AHPGEGRJETCIIA5N5UHXPPK7ZW3A,AGUWLDNMRBUVBQTRLDFJOU7B67WQ,AGZE52HWESBYEHQE7ZWVG6MIUTBA,AHC4U7CH7PGMKPLM3K6T36QSLJBA,AFNISIS3SIIIMSYAPMEAXNWBM4SA", "user_name": "deepika chaturvedi,Rishu,SKG,sachin agarwal,ashutosh malik,Amazon Customer,Shallu malik,Amann", "review_id": "R2P5LLM3NUTV98,R2T24WJDYF97OT,R1H22LPZ4C01LF,R2Q0K2ZG4X5GOR,RMKFA51N2GL3C,R25ABQM4CM6CPA,R1JXDDZO9EMZD4,R1IBNDHUOM6FD6", "review_title": "Very good product,Good,Good,Good product,Not a quality product.,good,Not value for money,Great purchase.", "review_content": "Very good product..only thing I found lacking was quality of non stick should be little more better..good to use..,Nice but lock has little rust as shown in picture,Performs as expected.,Good product,It's a light weight product.,good product.... toasts well... size also a little bigger comparatively to other products... happy with the purchase...,Product is non sticky but not upto the mark..,@Rs 99 this is great purchase from Amazon. After four unsuessful or failed purchase finally this item get delivered to me. Before this I ordered four different items not this one which were of very low price for one minute but after my order and payment the order get cancelled automatically on the very next day. But this time it get delivered. I am very satisfied.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/318oSoMwjsL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Cello-Non-Stick-Aluminium-Sandwich-Toaster/dp/B07YQ5SN4H/ref=sr_1_339?qid=1672923609&s=kitchen&sr=1-339"}
{"product_id": "B0B7FJNSZR", "product_name": "Proven® Copper + Mineral RO+UV+UF 10 to 12 Liter RO + UV + TDS ADJUSTER Water Purifier with Copper Charge Technology black & copper Best For Home and Office (Made In India)", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterFilters&Purifiers", "discounted_price": "₹5,395", "actual_price": "₹19,990", "discount_percentage": "73%", "rating": "4.4", "rating_count": "535", "about_product": "Color: Black and Copper, Capacity: 10-12 liters, Power: 60 watts, Input Water Temperature: 10˚ to 40˚C, Operative Input voltage: 100 -300V ac; 50Hz, Material tank type: Food grade engineered plastic; Can be used for TDS upto 1500 ppm. Please use a TDS meter to find out the correct TDS of your water source before buying a water purifier|Proven Copper+ Eco Mineral RO+UV+UF+TDS charges water with 99.8% pure copper, in real time. While as per traditional practice, water needs to be stored overnight.|Ultra Filtration imparts crystal clear clarity to your drinking water in addition to making is safe from viral & bacterial contaminations* UV+UF removes viruses; Patented Mineral Guard Technology to retain essential minerals in your water|1 year warranty*;10-12 Liter capacity; Booster Pump is required for the functioning of water purifier in case of inlet water pressure being less than 0.3kg/cm sq. Available through our service technician at an additional cost.|RO technology reduces TDS, hardness, and removes pesticides & heavy metals. Eliminates harmful bacteria, viruses, protozoa & cysts|1 year warranty for electrical parts, except UV Lamp. Warranty starts from date of dispatch. Filters are consumables, get blocked or choked because of water only. If water quality is good filters life will be more, If water quality is bad (More turbidity or more TDS) Filters life will be less. so, not covered in Warranty. Electrical part will be send through; Installation will be completed within 48 to 72 hrs.|Taste Adjuster (MTDS) controller enables adjustment of taste depending upon the source of water|12 stage filtrations,12 liter storage, High quality grey & Black color filters. With Active Copper Filter Series;ncludes â€“ RO Purifier, Pre Filter, Installation accessories, user manual. Installation â€“ You need to pay Up-to Rs. 500/- to the technician for installation.", "user_id": "AG6ST6L57J4B7UHNXKEV55ZP3NPQ,AHJYH6BZ2SXIWIEUPNPC75P6ZWEA,AEOIPHSMBDVHZPYBH76LQEFONJQA,AFZ56RXI37SOY5JWTOPITA6FUFQA,AHTQNDXEZ2JFDY6U3YVUQXL454LA,AFFVGMQSTPJEJCPOO4ICULDQQIVQ,AGBLLO3IZWOWUZPRCZHTVSM3ZUKA,AHAC7B6KYGC4V2SR7JY3O347OBJA", "user_name": "Bobby,Arunkumar,aditya,sanket,srinivasa m,Sandy,Pradeep maroo,Pravin P", "review_id": "R1BRNGXN1P2SNY,R1MLFHXV5FZHKJ,R3JDJSYI7QMMXW,R1SO4U2YQ4QVI7,RNKC5XGEH5NV2,R2FZGTY0F38C1H,R240P2TKGWDYW0,R2I902T88OZJ4E", "review_title": "Gud product and gud service,Good product in this range.,Useful,Good,Water taste is good and installation also done on prioritu basis worth for your money,Very good purifier in this range,Satisfactory performance,Installation charges extra", "review_content": "Like the product with decent look,Newely installed , now there is no issue,Batter than buying 15k 20k branded ro. Just use 3-4 yrs and buy a new one. Best 👍💯hai,https://m.media-amazon.com/images/I/61HN2ZnNzFL._SY88.jpg,Indication switch should be there after water is filtered,,Satisfactory performance,I have purchased this item 2 weeks ago. U have to call authorised technician to install the system as it is complex and cannot be fixed by local person. Also to check the TDS. the system work well although lots of waste water is been flushed out during the water purification", "img_link": "https://m.media-amazon.com/images/I/41EzVyKoA0L._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Proven%C2%AE-Copper-ADJUSTER-Purifier-Technology/dp/B0B7FJNSZR/ref=sr_1_340?qid=1672923609&s=kitchen&sr=1-340"}
{"product_id": "B01N6IJG0F", "product_name": "Morphy Richards Daisy 1000W Dry Iron with American Heritage Non-Stick Coated Soleplate, White", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹559", "actual_price": "₹1,010", "discount_percentage": "45%", "rating": "4.1", "rating_count": "17,325", "about_product": "Aesthetically crafted plastic body|Temperature control for more convenience|Comes with a swivel cord that makes movement easy|American heritage non stick coated sole plate|Comes with a neon indicator|Unique floral design with Wooden Pattern Handle|Warranty: 2 years on product", "user_id": "AFRHROLDDYV3Z75BI2LCW6O6OPTQ,AHTYYRQCRKLTWIECJ3QMHUNOYVRQ,AEEDAYAZG3NHVRQC4VQJO7UOGA6Q,AFR4WQF4SHGWAFPVW7SUGKDR7P5A,AH5Y6ZM2DJB7ZNP5ARJTNRW4TNHA,AGHRWZJQVN3R7S4TP5J2USU5E4VA,AE7VMF3T7AZVT6UB7TAZ2CVBTECQ,AE55VMGAF6S4FH763DDIXLTZIVBA", "user_name": "Gopal   Bhakat,AJIT PAL SINGH,Ishfaq Sheikh,Rakesh Kumar Pujari,G10,Aleeza,Farheen,Balkrishnan", "review_id": "RNEAQQCZW4BQR,R3QX33JL1X0RQ2,R190BAYCEPAT8R,R1CCAJOU1DMY14,R2KPPV8ZRKYJYF,R2N5CX7I9OROMB,RN0DQOQT1HQTW,R6EYGLUKXGGAH", "review_title": "Good health product.,The best dry iron I have owned in last decade!,Value for money,Good,Bang on budget,Bad,light weight,Good for home use", "review_content": "I take it my food habits in three weeks. Better result.,LightGreat designeasy manouverabilityfast heatingwhat else can one want... absolute go for product!,Go for it,Good,Simple, light and easy to use ...best at its price,Temperature control pr5,its too light to handle and works good with this sole plate as dry iron,This iron box does the job. Its light weight and irons well.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31+mSNSzKXL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Morphy-Richards-Daisy-1000-Watt-White/dp/B01N6IJG0F/ref=sr_1_341?qid=1672923609&s=kitchen&sr=1-341"}
{"product_id": "B0B84QN4CN", "product_name": "Wipro Vesta 1200 Watt GD201 Lightweight Automatic Dry Iron| Quick Heat Up| Stylish & Sleek |Anti bacterial German Weilburger Double Coated Soleplate |2 Years Warranty", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹660", "actual_price": "₹1,100", "discount_percentage": "40%", "rating": "3.6", "rating_count": "91", "about_product": "Wipro Vesta 1200 Watt Light Weight Automatic Dry Iron With German Anti Bacterial Soleplate Coating", "user_id": "AEPMS5PFD6A3CBZ7A5GCVJURRQPA,AFSKCZCQS5Q2D5IFYXRTCAEG5BZA,AFLYLUQJLNGO32IJITTXKWO2YOCA,AH43ILYGJQUD5563RLERPIE2UMCQ,AEW6MNLEJPNDYI52OFUVMB3EDYMA,AHFF6M6NA23SOFKPPX22FLLPRELA,AF4LT2MRA6U4IPL63X5ANNO5BLOA,AGLMUN4K5NVDCVNPMNI5OF2IH5LA", "user_name": "Aniket Chudnaik,Wasimraja,Rahul Mallah,inderjit singh,Shivhari,Vishbhav Poojary,Pawar,Balasubramaniam R", "review_id": "R2F0IBB2PGO45G,RJFI2R3H927Q,RC7IDRI4JEBY7,R32SRTV86GX7PE,R280BK653XF5IU,R1TL5WY2M25VGJ,R2BSYUX6ABDXCI,R3IWMYQP9WYGE1", "review_title": "The wire is short,God,Rahul Mallah,Very nice 👍,Good ✌️🤝❤️👏👍❤️❤️,Stopped working after a few days.,Excellent product pls buy,Very useful", "review_content": "Very short wire to connect to my switch,Nice,,Very good product,Good,Turns on heat initially and then doesn’t heat up. Eventually needs to cool down completely to again start heating again. Wouldn’t recommend buying.,Excellent product pls buy.,Nice", "img_link": "https://m.media-amazon.com/images/I/314V87LweLL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Lightweight-Automatic-bacterial-Weilburger-Soleplate/dp/B0B84QN4CN/ref=sr_1_342?qid=1672923609&s=kitchen&sr=1-342"}
{"product_id": "B0B8ZM9RVV", "product_name": "Zuvexa Egg Boiler Poacher Automatic Off Steaming, Cooking, Boiling Double Layer 14 Egg Boiler (Multicolor)…", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|EggBoilers", "discounted_price": "₹419", "actual_price": "₹999", "discount_percentage": "58%", "rating": "4.4", "rating_count": "227", "about_product": "egg boiler have Compatible design with new appearance makes for a great gift for your family and friends|Special Feature: Anti Dry Safety Protection || Less Noise || Stainless Steel And Anti Scald Design || 14 Eggs Capacity Removable Tray White", "user_id": "AGATYIKGAWO26SQJ7K7TDN2LFUSQ,AFRJHB6VXULSM53VYU5TBJL3F62Q,AEUJCWHLY4ZE4YHU5HVUSHLTKNTA,AGLD2LXDWUQZSZDFC3U7H6N3VFAQ,AHS4FBZAI7M2PJ5BAYWJDCIB3I6Q,AF5XD4J2O3Y5AVWNBSHPYLPQXQNA,AFR5OERHAWKGE5BFDJ5FVFKGGXQQ,AGANY4HWSF32KZFVMOTNULK2RQBQ", "user_name": "Nishant sharma,E VEERESH,Nimish Sharma,Chandrasekhar K.,Nilofer A.,Ilavarasi,Vijay Naiknaware,Harshavardhan", "review_id": "R3LK3T3R4O8FU7,RGKDXCG824W5,R32ISLP60XI7WG,R3HCQZ8VAQXLAM,R21NKRX5SKSE3,R1JCAOH6CT4ZDX,RBPCGQGUPOSY,R23PLPS8OE8OR6", "review_title": "It is very good product value for your money go for it and save some money,Nice,Easy ro use for children as well,Less time more work,Must buy 😊 I would recommend just go for it,Super fast,No need to wait for a long time,It's a good product", "review_content": "Very good product go for it and save for your money.,Nice product,Good and easy to use,Good work done with a whole family,Must buy ...genuinely I would recommend this for boiling eggs...it boils egg so fast and I wonder how does it peel so perfectly 🥰  just on love with this 😍,It really makes my work easy..also I don't need vessels or cooker for boiling eggs...it also boils the egg so fast...love to recommend,It just boils in less then 10 minutes , every easy to use no need of much water and has an auto off option so don't have to keep and an eye on itReally love this product,It's a good product", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31RZz5dsEVL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zuvexa-Poacher-Automatic-Steaming-Multicolor/dp/B0B8ZM9RVV/ref=sr_1_340?qid=1672923610&s=kitchen&sr=1-340"}
{"product_id": "B01892MIPA", "product_name": "AO Smith HSE-VAS-X-015 Storage 15 Litre Vertical Water Heater (Geyser) White 4 Star", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|StorageWaterHeaters", "discounted_price": "₹7,349", "actual_price": "₹10,900", "discount_percentage": "33%", "rating": "4.2", "rating_count": "11,957", "about_product": "Type: Storage ; Capacity: 15 Litres; Wattage: 2000 Watts; Pressure: 8 Bars ; BEE Rating: 4 Star;|Inner Tank Material: Blue Diamond Glass Lined Tank- 2X Corrosion Resistance; Outer Body Material: Metal|Product Dimensions: 44.1 cms X 33.8 cms X 33.8 cms|Warranty: 7 years on inner tank, 2+1* years extended warranty on glass coated heating element and 2 years comprehensive|Included in the box: 1 Vertical Storage Water Heater, User Manual , Mounting Screws|Blue Diamond Glass-Lined Tank for 2X corrosion resistance|Glass-Coated Heating Element to prevent scale formation and extend the life of heating element", "user_id": "AG3PLRKXVXLYQ7YHOIU4QVWWFBAQ,AHRU7JSVBHVEBWI2H2N6CVM3IIPQ,AH4ZQO5NIBMSXG7LLOGJ67WQ54IA,AFY4C2ZKXRWWGZRC2WIRBN4HTT7A,AEBBDZUR4T6MWDXS4COIUJLYXHHA,AFYENENKOXRC77BZ5JFXNG6GBNAA,AESSNDMFJZFM6Q5URYBYPEIUSYNQ,AERCNZE7BL2UQB45USYQ3NS3KDHA", "user_name": "VINAY,uday patil,Amazon Customer,giri raj singh,PATEL P.,Amazon Customer,mukhtyar singh,Jayendra Chauhan", "review_id": "R1YVS42PE19S0D,R3DONAXVXXHGDY,R6PIB7C4JS214,R1IUZ4ZBSB7KQ2,R2LJBGGLXY8MMO,R2LXCMNDSZ18EC,RTNR1AFNBXK4C,R14X6K190U5P2", "review_title": "Nice Gyser,Good child I am say,Great product in this budget,Good product,Good,Amazing Machine highly recommend,Good product,Working Great", "review_content": "It gives hot water but only after 25 min of running which I feel a bit slow.  Let's wait for years now to come up with it's performance.,Good very good,I am already using 25 liter of the same geyser but no issues till date .,Good product, one con: very noisy like boiling water,Good product,This is my second purchase AO Smith geyser are amazing but sad to share that their Techician are very rude and never came for installation so I had to get it installed from my own electrical person..Please work on the technician part otherwise AO Smith geyser is quick .,Installments very easy,I have been using this Geyser for more than 2 months. It has been working great without any hiccups so far. It heats the water pretty fast. It stay in high rise and no issues due to high water pressure. I have never tried its temperature control feature, so no clue how it performs. I have set it at max temperature and it meets my requirements. Buyers may go ahead buying this without a seconds thought.", "img_link": "https://m.media-amazon.com/images/I/316y4IIKD6L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AO-Smith-HSE-VAS-15-Litre-Storage/dp/B01892MIPA/ref=sr_1_341?qid=1672923610&s=kitchen&sr=1-341"}
{"product_id": "B08ZHYNTM1", "product_name": "Havells Festiva 1200mm Dust Resistant Ceiling Fan (Gold Mist)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|Fans|CeilingFans", "discounted_price": "₹2,899", "actual_price": "₹4,005", "discount_percentage": "28%", "rating": "4.3", "rating_count": "7,140", "about_product": "Design and finish exotic rich looks with modern styling|Aerodynamically Blade Shape|Speed: 400 RPM; Air Delivery: 230 CMM|Wider tip blade; 2 years comprehensive warranty|Material Type: Aluminium; Mounting Type: Downrod Mount", "user_id": "AG2REE6BFNII6CHJQ2HQCG4Q5BWQ,AGPSJBF6CTEE4MJG3X5Z3DMJEJZA,AGY545OCMI3P63JWXM4QMK7QXCIA,AFQBNWTWNCOQH65QJK2TGLWRYCJA,AHVFTQFFKLLV5IFJDEQBTF4ZFI5Q,AH7XAZIRDIDE2HVRZAZ4J4BSG3NA,AFJI2CTQBDXHG74Q3R6S5RPYTOWQ,AHAXO75FQ7QCFXWMJF4JNHNS3A7Q", "user_name": "Sheetal Satish,Vipul Vora,Naresh Kumar,Rahul jain,Amazon Customer,Qadri Yaseen,Amazon Customer,Rohit Prajapati", "review_id": "R3W8PELKPQYYI,R3AV7SRJJGTMF2,R4A9Q67LKCDN3,R3AV2JB3F2MMO3,RI4BBDQRBX3QS,R2N9AER7WVBMQU,RHZ7QGZ3QY95Q,R36IMPCVTWBT4A", "review_title": "Packaging and look wise it is awesome 👍,Perfect fan,Good product,Good looking bit heavy,Nice product,Good,Good fan,Looks classy", "review_content": "https://m.media-amazon.com/images/I/51gBvXGDt3L._SY88.jpg,Best fan with perfect performance,  great air with no voice .,As in picture looking same,2 months in using product. Good looking, dust resistant. Only issue I think of its heavy by normal fan standard. Fans are easy to install but no remote control. Price is little high i think for this it should be around 2300-2700 rupees.,Nice Product,Product is good but colour is dull if colour is light then look really nice,Overall good,Colour showing in app is not same in physical,Looks classy", "img_link": "https://m.media-amazon.com/images/I/21954ou6hSL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Havells-Festiva-1200mm-Resistant-Ceiling/dp/B08ZHYNTM1/ref=sr_1_342?qid=1672923610&s=kitchen&sr=1-342"}
{"product_id": "B09SDDQQKP", "product_name": "INALSA Vaccum Cleaner Handheld 800W High Powerful Motor- Dura Clean with HEPA Filtration & Strong Powerful 16KPA Suction| Lightweight, Compact & Durable Body|Includes Multiple Accessories,(Grey/Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Vacuums&FloorCare|Vacuums|HandheldVacuums", "discounted_price": "₹1,799", "actual_price": "₹3,295", "discount_percentage": "45%", "rating": "3.8", "rating_count": "687", "about_product": "POWERFUL CYCLONIC SUCTION: Dura Clean utilizes an ultra-high 800watt powerful motor with a suction up to 16KPa, providing all-around protection in renewing all the corners of your home and car keeping neat. Handheld vacuum can also suck out as small as microns dust and particles hidden deeply in sofas and mattresses. Dirt just can't hide anymore !!|IMPROVED HEPA FILTER: INALSA hand vacuum cleaner features enhanced and improved HEPA filters which are capable of capturing 99.97% debris, dander and dust. It further extends the lifetime of the appliance and effectively avoids clog of filters while ensuring suction in perfect condition. Exquisite workmanship with notable durability provides you unparalleled user experience.|LOW NOISE & MULTIPURPOSE ATTACHMENTS: Bringing you a quieter cleaning experience. Hand vacuum comes with 3 attachments to meets all satisfactions. Crevice nozzle for reaching debris in tight corners & spaces with ease; Dusting round brush easily picks up hair or dirt on delicate surfaces; the hose pipe adds felxibility to access for hard-to-reach areas.|CONVENIENT & USER-FRIENDLY: This portable hand-held vacuum cleaner is light in weight and is ergonomically designed which will help you escape from fatigue clean. On the press of a button, empty your dirty container and the appliance is ready to go again in a jiffy !! You can use cleaner stairs, kitchen, office, car or corners without bulky and tangled cords.|1 Year Warranty by the manufacturer from the date of purchase.", "user_id": "AE4L3MBEACOHT7Y7GGWQ72DUJ6SA,AELHNY42N2WPTZN5R42GOW2RO5SA,AG5ST5LJL5DUIYA5AH5V4EFXO4JQ,AG5V75LPUVIVS3DFZNN4UEK2FBJA,AEQSYGYF7LVSIVQEEXPC6VCMLBJQ,AH4OBRDNZVTVDLWTAV2V3B422AVQ,AHTBKWSU5IG46LZWJ3QQZKL6LTJA,AFKSCELXRYLARIVIXIWJQPHL5AHQ", "user_name": "prem chand,Avishek Saha Chowdhury,Tanvi Chadha,Sashi G.,Shailesh Patel,Cynthia Andrew,Shijo Mathew Abraham,anoop sharma", "review_id": "RHK81ZNE4PTND,R1APOT5W7NCQ0K,R2TC26RQAISV2N,R29YF4D5Q0NB7T,RUNNMDT7UQU00,RU90SRND4C6NC,R2RM3RN5D9HC4M,RC89DCR0F7SCA", "review_title": "Good for now,Worth Buying For Daily Cleaning,Very strong!,Convenient and powerful hand vacuum,Powerful suction of Product,Good budget buy,Powrrfully loaded for the purpose.,Handy Vacuum Cleaner", "review_content": "Device was sturdy and handy, suction power is quite strong all the attachments are good, except the extension pipe was so weak that it gets crumpled when it comes in contact with any object.,I bought this to get rid of dog hair on my bed and it does the job quite nicely. it gets rid of dust very easily. Very handy and durable product.,This is VERY strong, so while that is good for certain things, it can also be a little difficult to vacuum as the it sucks in the surface, making it difficult to glide along the surface.Also, it does heat quickly so you have to keep pausing.however, overall for this price, it's quite an amazing buy.,A good product that cleans dust from upholstery and floors. Variety of attachments help for different surface cleaning. Good suction capacity. Long cord makes it more useful since you can reach greater distances from the plug point. Only reason for 4 stars overall is that when using it, some dust comes out from the collection compartment. The closing seal could be made more firm so that there is no air leakage out.,Easy to suction the spider nest on the wall and other corner dust.,Great product. Works great for the price it is coming for. As usual it is not a heavy duty vaccum so that means it is will get heated up... Give 5 mins break and use.,Affordable and easy to use, fits the purpose.,Good nice cozy machine easy to use and good looking", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41MrcJcvi3L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Handheld-Powerful-Filtration-Lightweight-Accessories/dp/B09SDDQQKP/ref=sr_1_343?qid=1672923610&s=kitchen&sr=1-343"}
{"product_id": "B0B5RP43VN", "product_name": "iBELL SM1515NEW Sandwich Maker with Floating Hinges, 1000Watt, Panini / Grill / Toast (Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|SandwichMakers", "discounted_price": "₹1,474", "actual_price": "₹4,650", "discount_percentage": "68%", "rating": "4.1", "rating_count": "1,045", "about_product": "Sandwich / Panini Maker with Thermostatically Controlled Heating Element. Adjustable hinges which adjusts to any size of toast or snack.|Sandwich / Panini Maker with Thermostatically Controlled Heating Element. Adjustable hinges which adjusts to any size of toast or snack.|Red indicator – Power on and ready; Green Indicator turns off automatically once grilling plates are heated.|Grip handle, Elegant black finish body, Fixed Sandwich Plates.|Shock Proof Body | Wattage: 1000W | Power cord length: 80cm.|Warranty: 1 Year Standard Warranty + 1 Year Additional Warranty on FREE Registration", "user_id": "AEYHTCWWZYU3JQBU6SLNFFT3OMVQ,AEEYMW4YXUA5ZC4H34CHUW5EPFKA,AFJM5RTEFFX7H3WDQYDY6GX5HPNA,AG6JEDS3UJIQHXUGHEQHW7XHL2KQ,AE3BLMRIEOFTPVYRWPR7P5QUL5RA,AGOEGXCUQTAT4C57KQHXQJ4X25PQ,AEF4QBAINOQAYMSVNXHYZE7AYTSQ,AEFIOOBMEJPER2FTC4AVKEZ44NYA", "user_name": "Shiva,Saurabh vats,Gaurav thapa,Ash Sharma,Chandraprakash mohata,Saleha,SANYAM SINGHI,Bharti", "review_id": "R2KA10FTGOHQYB,REYTAGJ74749P,R2K1HT3L3AA6YD,R2QPRH31E0VIXG,RB7KRXWWEVCNK,R21JTGL4FLUYFT,RCYHGGNFDK4S3,R28YJ8VEV2B2GS", "review_title": "The Grill and Toaster is good,Ibell,Good product,Does what it claims.,Good product and valu for money spend,I thought Ibell sandwich maker is best brand and I can use use usually easy clean it now easy,Good Product,Good product", "review_content": "The product is working fine. But at this price range there should be a temperature regulator. We are always using silicon spatula but the Teflon coating is coming off on its own. Product is functioning with in the described specifications,Compact,Good and reasonable easy to use,The machine is super easy to operate and use. 1000watt is hood enough and works fast as expected. Happy with the product.,Very good product all and every think is good only cord wire is very short so company have look,I like to all features and service from I bell customer care service I can reffer to another person for buy this brand,The product is good.Following cons according to meCord length could be longer.The toaster doesn’t closed fully. Which is something that should be mentioned in the product description,NA", "img_link": "https://m.media-amazon.com/images/I/51SvK5l5JRL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SM1515NEW-Sandwich-Floating-Hinges-1000Watt/dp/B0B5RP43VN/ref=sr_1_345?qid=1672923610&s=kitchen&sr=1-345"}
{"product_id": "B096NTB9XT", "product_name": "Aquaguard Aura RO+UV+UF+Taste Adjuster(MTDS) with Active Copper & Zinc 7L water purifier,8 stages of purification,suitable for borewell,tanker,municipal water(Black) from Eureka Forbes", "category": "Home&Kitchen|Kitchen&HomeAppliances|WaterPurifiers&Accessories|WaterFilters&Purifiers", "discounted_price": "₹15,999", "actual_price": "₹24,500", "discount_percentage": "35%", "rating": "4", "rating_count": "11,206", "about_product": "Patented Active Copper Technology provides goodness of copper in water|Patented Mineral Guard Technology: Helps to retain all essential natural minerals such as Calcium & Magnesium which provides perfect blend of safe and healthy water.;UV-C technology ensures that every drop of water is as healthy & safe as water boiled for 20 minutes.; Ultra Filtration imparts crystal clear clarity to your drinking water in addition to making is safe from viral & bacterial contaminations* UV+UF removes viruses.;Taste Adjuster (MTDS) controller enables adjustment of taste depending upon the source of water.|Felxible installation: The purifier can be easily wall mounted or kept on the counter top.;Convenient Features: a) High Storage Capacity b) LED indication alerts when tank is full, when service is due & when cartridges need replacement c) Transparent tank allows you to check water levels easily d) Purified stored water can be dispensed even without electricity.|8 Stages of Purification Technology with 7 litres large tank capacity Stages: 1) I-Filter, 2) Chemi Block, 3) Patented Mineral Guard, 4) Taste Adjuster (MTDS), 5) RO Membrane, 6) UV-C Purification, 7) Ultra Filtration, 8) Active Copper Technology.;Patented Active Copper Technology: With the goodness of copper that instantly infuses copper ions along with other essential minerals into the water. Copper has antimicrobial, antioxidant, and anti-inflammatory properties that help to support healthy metabolism . It also helps to provide the body with energy and is much needed for growth and development.|1 Year Warranty RO Membrane*:Reduced opertional cost with long life RO Membrane. Get it cleaned/replaced free of charge.* 1 year or 6000L whichever is earlier as per standard test conditions mentioned in the user manual.;Water Saving: This Aquaguard water purifier saves Upto 60% water-Ordinary RO+UV water purifiers end up wasting 50-75% water.Aquaguard water purifiers with superior RO+UV+MTDS technology purify water and regulate its taste to save up to 60%* water.|Included Components: Plumbing Kit, Accessories, Product, Power Supply Adapter & Bracket For Adapter; Purification Method: Ultravioletreverse Osmosis; Warranty Description: 1 Year Manufacturer Warranty From The Date Of Purchase, 1 Year Warranty On Ro Membranethe Compan", "user_id": "AELCV26DAB56JEU7CL2LUTR2TYKA,AHQQWCVTBJQ767433OZGYVW7OJVA,AGPQAC65TOG2HWQ42LE4JB46OUJA,AENORZWFAJOJLG4FLUB2LHOB25MQ,AHAAEQSQJFRGPLP6U2LG2TWXFVOA,AFHPAS35RXP7JEKV5KVVGGYIOV6Q,AGIWQJDJXJNGJDO5DNIML4ATNVEQ,AHZG2MJP5M6GKLC6YVHOJTZ3ZAKA", "user_name": "Shivang,Renu S,Balaram Sharma,PBT,Srikanth Aakula,ANUPAM,Dipu Choudhury,Ashraf K", "review_id": "RU0EQUWAQWSU6,R2R99SCVYQYHPL,R7O3R0R2OR9EZ,R1EO91IQFDEPU8,RMYWUK6J83TM9,R3GV3HMKR68771,R3MB7ZUKQPAQ1C,R1QKEORLV97GNT", "review_title": "Usable,Good,Awesome,Satisfied,Purifier,Beware to buy it from online,Very Good Quaility,Easy to install", "review_content": "Good service,Good,I like this product,taste is also good 👍👍,Worth for money product.,Ok,I am updating my review, hope it will get published and the who's and who of the brand will pay attention to it. After every two to three months the unit is having problem with the inlet system. Many a times, the inlet stops taking water but the indicator shows tank filling! It was rectified by the service person. Again, now the indicator showing tank filling while the inlet valve is shut! It should show the purple light means low or no pressure. It's a faulty unit. The installation guy and the service persons were right who stated that the faulty and low quality units are sold online, whose statement I ignored thinking that every offline seller says so. Alas, I was wrong. I want this unit to be removed immediately and want my hard earned money back.,At this price this product is very suitable.,Esy to install", "img_link": "https://m.media-amazon.com/images/I/31TnmukIucL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Eureka-Forbes-Aquaguard-boiling-Technology/dp/B096NTB9XT/ref=sr_1_346?qid=1672923610&s=kitchen&sr=1-346"}
{"product_id": "B078JF6X9B", "product_name": "Havells Instanio 3-Litre 4.5KW Instant Water Heater (Geyser), White Blue", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹3,645", "actual_price": "₹6,070", "discount_percentage": "40%", "rating": "4.2", "rating_count": "561", "about_product": "LED Indicator: Colour-changing LEDs that change from blue to amber to indicate the hotness of the water|Outer Body: Rust and shock proof ABS outer body for long life|Inner Tank: Stainless steel inner tank of 304 grade|Power Cord: Fire retardant power cord for maximum safety|.65 MPa Bar Pressure: Suitable for high rise buildings and pressure pump applications|ISI Marked and ISI certification|Capacity: 3 liters", "user_id": "AENQUXAACC6E53BRVBZPXCC356OA,AEBGRX2UHNMQHYKUQFHGDUPE4UCA,AEEWHS6M7UDMDKWHZSVVHGW5JJUQ,AHJEMKM64LMY6YJR5AE3RMA2IW7Q,AHZHKXL5TIRPYY5YI5IUSYODJZSA,AHOTFNEAM62KASA6YHCDNPGNNZRQ,AGFQZRCAAKEW5ULV2UIU4RBI6IEQ,AE6ZHG2AXD6VPRRT3EUFSGVQJKOA", "user_name": "Kindle Customer,rajni,JYOTI SRIVASTAVA,Amazon Customer,Ankit Devidas Chavhan,Sayan Mandal,Amazon Customer,M Das", "review_id": "R3TCEP7588ZBZ,R2I5P8LAU0IX8X,R19Q8ONLFVVDNG,RTAB1NOENZ16O,R2088N9Y90R4IZ,R3R8TSL66Y6E6F,R29WIAZC4ETAX2,R2J8KC6I69DKED", "review_title": "Serves unlimited hot water instantly,Very good,Go for it,Instant heating,Just go for it.,Best for instant heat water,Amazing products,Instant got water, quite literally", "review_content": "I bought \"Havells 3lts Instant Geyser 4.5KW White/Blue\" and I'm really happy I made this decision.Let me start with why I went for \"Instant Geyser\" instead of \"Storage Geyser\".-Storage geyser's have a tank to store water and heat it.-For example a 10litre storage geyser fills up the 10 litre tank and then heats the water.-As it has to heat high volume (10 lts) of water it takes time of about 5 to 10 minutes-Instant geyser's on the other hand heat water instantly within 1 to 3 minutes-However the catch is they dont have a huge capacity tank which means at a given instant it has only small volume(depending on tank capacity) of hot waterNow who should opt for \"Instant Geyser\" and who should opt for \"Storage Geyser\" is the question ?- If you like to have a \"Shower Bath\" for which you require more than 10 litres of hot water continously then you should go for \"Storage Geyser\" since storage geyser of capacity more than 10lts will store 10lts of hot water and provide it to you as soon as you turn on the shower without any pauses-Instead if we consider \"Instant Geyser\" of 3lts capacity for shower bath, it cant provide you 10lts of hot water continously because for every 3lts it takes time to heat water again-Hence for a shower bath better to go for \"Storage Geysers\"-If you like to have a \"Bathtub Bath\" then instant geyser's are good to go because-Consider using a bathtub, a bathtub generally is of capacity 350lts-If you even use a \"Storage Geyser\" of high capacity as much as 25lts, still you will have 14 pauses of 5 to 10minutes each-Because at one shot this storage geyser can provide you only 25lts of hot water continously and then you will have to wait for 5-10mins for the next 25lts to heat-So to fill the entire bath tub, you need to have 14 times 25lts of hot water = 350lts-So the total wait time would be 14 times 7mins (on an average) = 98mins-In this scenario of \"Bathtub bath\" its better to go for instant geysers since they provide hot water almost instantly and eventhough there will be pauses for every 3lts of hot water still the pauses being very small you'll have a bathtub full of water with enough amount of heat/hotnessThen you might ask what should we consider for \"Bucket Bath\" ?-Both \"Storage geysers of 15lts or above\" and \"Instant geysers of 3lts or above\" are good to go-Just choose based on:  Price,  Time taken to heat ( instant takes less time ),  Energy consumption ( instant comsumes less )Now coming to \"Havells 3lts Instan Geyser of 4.5KW\", why I bought this ?-Havells is a great brand-I wanted to have it for \"Bathtub Bath\"-4.5KW heats 3lts of water in just 30 to 50secondsWhat I liked about this product:-I have been testing it from a week and it is really ossum as it is heating 3lts of water in just 45seconds ( I have used a timer to note that )-The installation was totally free, however remember you will be charged if there is any \"Plumbing Work\" do be done.-No need to buy any extra accesories like pipes, everything is provided in the box, you just need to buy a 16amp plug which would be less than 100rs-As soon as the product was delivered by amazon, I got a message from havells saying they have registered my installation request and the very next day the instalaltion was done, thanks a lot Havells ( This might differ for you based on your location, I live in hyderabad)-I really like havells customer service-The geyser comes with 2 years of warrenty for the whole and 5yrs of warrenty on the tank-It has \"Auto Cutoff\" feature to stop further heating or wastage of electricity if you forgot to switch off ( however please switch it off once done because eventhough it has auto cutoff, still once the water in the tank cools down it will again start heating and the cycle repeats )-It shows color indication: \"Blue when its heating\" and \"Orange when it has done heating\" ( Have a look at the pictures I have attached)Note:-Go for the 4.5kw model if you want hot water instantly in 30 to 50seconds, the 3kw model might take 2 to 5mins to heat 3lts of water-Make sure it is 4.5kw model because I see reviews from other customers who say the \"Mustard\" colored geyser is not 4.5kw but 3kw ( better go for white and blue color to be sure ),Very nice product,Good product,4.5KW rated heater is able to heat water in minutes and maintain that temperature for continuous flow of hot water. Good product,Great product at great price.,Value for money and instantly warm water comes in just 2min,Havella water heater,Water heats up in 45-60 secs depending on the weather.This review is after using this water heater continuously for 10-12 days in December, in Kolkata, with one of the days being extremely windy and lowest temperature at 14-15 degree Celsius (during afternoon/ early evening hours). On the coldest day so far, it took around 1min &10-15seconds to heat up completely.If you don't have chronic pain, or arthritis, or this is not going to be used for very old people, whereby really hot water is required for bathing, I think it can work perfectly for winters with lowest temperatures upto 9-10 degrees, because I have chronic pain and use this to get really hot water and for a shower, not using a bucket, and it's manageable.Obviously can't be compared to steaming hot showers using a storage geyser, but this heats quite quickly, so can be used in the shower even with the low capacity.For that same reason, it can be used for multiple people, because by the time one person leaves the bathroom and the next enters, you'll have fully hot water, only of lesser quantity, so if you don't live someplace cold, or don't need very hot water but mildly hot water, this can be used for multiple people as well.Installation support was also good.No cons, only that if Havells introduces a 5l instant heater in the 4.5kW range, then that would be a game changer and might give storage geysers a run for their money because this is perfect for anyone who doesn't have their own home and might need to move around, because it's compact, and provides instant hot water.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31991seDfcL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Havells-Instanio-3-Litre-Instant-Geyser/dp/B078JF6X9B/ref=sr_1_347?qid=1672923610&s=kitchen&sr=1-347"}
{"product_id": "B08CGW4GYR", "product_name": "Milk Frother, Immersion Blender Cordlesss Foam Maker USB Rechargeable Small Mixer Handheld with 2 Stainless Whisks，Wisker for Stirring 3-Speed Adjustable Mini Frother for Cappuccino Latte Coffee Egg", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|HandBlenders", "discounted_price": "₹375", "actual_price": "₹999", "discount_percentage": "62%", "rating": "3.6", "rating_count": "1,988", "about_product": "Fast To Get Creamy Froth With Great Power: The immersion blender Equipped with an innovative, super premium motor, the must-have handheld foam maker gives long-lasting and reliable performance. The high speed upgraded motor boasts enough power to create foamed milk within 20 seconds. It is a perfect foam maker for coffee, latte, cappuccino, matcha, hot chocolate and any other frothed milk|Multiple Whisking Speeds: Blender Cordless owns 3 Speed allow you to choose the proper whisking speed to froth milk, coffee, latte, cappuccino, chocolate milk, tea, Low speed operates at 4,000 rpm. You can mix nutritional supplements, protein shakes and baby formula with no lumps. Medium speed operates at 8,000 rpm. You can mix egg, milk, coffee or tea. High speed operates at 13,000 rpm. You can create creamy froth for coffee, Latte, cappuccino, hot chocolate|USB Rechargeable: The ectric whisk coffee blender can hold a strong charge for several times a day. You can charge it anywhere and anytime with your power bank, phone charger, computer etc. Perfect for using in home, office, camping, or travel|This handheld small mixer has 2 Stainless steel whisks,can use as coffee frother, egg beater , handheld blender, mini mixer, egg maker,mixing protein shakes, milk, coffee, hot chocolate, and others.|Easy To Install & Use: There is a shaft inside the port and you need to target it well and keep the handheld blender straight when inserting it. Don't need to insert too much, The spring can easily bend or stretch. One hand hold the whisk head and one hand hold the main body, then use moderate force to pull it out horizontally. This battery powered whisk head is made of sturdy food-approved stainless steel for extended service life.", "user_id": "AGR7UFLFQ3KUH7644ARDPSSYAZ2Q,AGMHSLSOBPJRH6RCZBNKNZ2YQY6Q,AENX4IK4CRKRAOJQOLMRH6QNCTCA,AFAW47CO7UX37TKZSGRUHIKZMATA,AHUHAGOBF67BLOQGF3C5GBFOPPYQ,AF6UFCDLC6WSCFBZE56AMTOFKNVA,AG2FFL77UFH5Y44BU4FY2FKT6YAQ,AE7Q7KWRZ7MHMTD4I63KVNQQLOGQ", "user_name": "Nipurn Ruhela,Shalini KJ,Aloke Kanoria,ASHISH SHARMA,Pankaj Chaudhary,Manish,Muskan Thakur,Balvinder", "review_id": "R38F8NXSXYDTXY,RVHJAX9LZXL81,R2E2LEW31FG8SL,RR4N76OXC0SFK,R3RUZMOBCK3L6O,RLT5ZN2J9CR4R,RE3SOUOHD3XN5,R1A4SOUGDN8TRQ", "review_title": "Ok ok product,Great Tool for Kitchen,Easy and handy,Different frother machine,not as per images,Not good as I thought.,powerful,So glad that I bought this!,Good product, value for money", "review_content": "Good product received and i give you this full review after 7days,Value for Money,Easy and handy to operate,I received my frother machine it's good for price and the motor is also good works well have 3 different speed one can adjust as per requirement however I have received a different variant frother not as per images which is displayed but is working fine let's see now how many days it survives easy to clean and it makes quick froth can also be used for eggs. I must say area of improvement would be selling details need to be update. Build quality area off improvement and the battery charging indicator as well should also show how much battery is remaining that feature is also missing, in the variant I received.Can purchase this product and can give it try for me it's working doing the job.,I ordered black one but get a white. Build is not good as I think. Easy to clean.,It is indeed a good product the only thing that can be improved is speed adjustment buttons as it starts directly at the full speed you can reduce the speed but it should be in an increasing order (Speed Button),The power adjusting buttons are great.Froths in only two minutes. One charge can hold up to 12 times od frothing! Totally worth the price!!,I ordered this product for beating coffee, but this product is also best for mashing eggs, lassi making and other kitchen works also. Great battery life and rechargeable in short time period", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41875hbgKyL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Rechargeable-whisks%EF%BC%8C3-Speed-Adjustable-Cappuccino-Bulletproof/dp/B08CGW4GYR/ref=sr_1_348?qid=1672923610&s=kitchen&sr=1-348"}
{"product_id": "B00A328ENA", "product_name": "Panasonic SR-WA22H (E) Automatic Rice Cooker, Apple Green, 2.2 Liters", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Rice&PastaCookers", "discounted_price": "₹2,976", "actual_price": "₹3,945", "discount_percentage": "25%", "rating": "4.2", "rating_count": "3,740", "about_product": "Total Volume: 2.2 Ltr/Cooks Up To 1.25 Kg Raw Rice|Anodized aluminium pan, comes with cooking plate|5 hours keep warm function|Warranty: 2 years on product and 5 years on heater|Power: 750 watts; Operating voltage: 220-240 volts|BIS Govt Approved|Total Volume: 2.2 Ltr/Cooks Up To 1.25 Kg Raw Rice;Anodized aluminium pan, comes with cooking plate", "user_id": "AG636YCW33ZTJ3O67MQZNNNAIJVQ,AGJL5WHO3VVJALGYBKA7UUMANF4A,AG56GJXG2U4TIZ42J4H5SIAOZFSQ,AHRJPSHYWW7POL5N5G7HI6D2UXNA,AE4PB2D5M7A6CIPE4SHZMHIDDIBA,AFYZBDPD6PGSHBHPHQTOVJW4QFCQ,AHCF6MDMVOOGIZK7AQMS5E4ZOJKA,AG6S5T3PING6QXZAUDDTH6FO7ICA", "user_name": "Aniruddha biswas,Manoj S.,Gautham Panchavadi,Prashanth,Amazon Customer,Rejeesh n.c,kishore koilada,Ally", "review_id": "R1OMQV5UFU8OAK,R1ZKAUAWGCN68M,R372LY89QNU1WS,RSZSH0XP6FHXL,R1QBFW8U0VSW9,RCX3IHOVKD69A,R3PESF4URSOFRC,R15SV1BX6S6PS9", "review_title": "Good,Adequate and efficient are the most apt words.,Good product,Single rice bowl,Good,Gift of god,Nice,Looks elegant", "review_content": "Good,Adequate and efficient are the most apt words. Its really of excellent quality , usage and VFM. I recommend it to all small families from one to five.Extremely functional, excellent quality, easy to maintain, clean. Takes little space. It doubles up as a momo maker, idly maker, OdiyaPithaa maker, Steamer and of course a Rice Maker.I have gifted three, bought three for my larger family by now. One for self, one for my parents, one for my village house. The earliest one is now five years old and is still cooking.Great product...Go for it.,,Only single rice bowl comes with this product,Good,Nice to use,,, go and buy it,Nice,Handsome looking rice cooker, especially the green color looks great, could have been tagged at 2500rs", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/419H62Is66L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Panasonic-SR-WA22H-5-4-Litre-Automatic-Cooker/dp/B00A328ENA/ref=sr_1_349?qid=1672923610&s=kitchen&sr=1-349"}
{"product_id": "B0763K5HLQ", "product_name": "InstaCuppa Milk Frother for Coffee - Handheld Battery-Operated Electric Milk and Coffee Frother, Stainless Steel Whisk and Stand, Portable Foam Maker for Coffee, Cappuccino, Lattes, and Egg Beaters", "category": "Home&Kitchen|Kitchen&HomeAppliances|Coffee,Tea&Espresso|MilkFrothers", "discounted_price": "₹1,099", "actual_price": "₹1,499", "discount_percentage": "27%", "rating": "4.1", "rating_count": "4,401", "about_product": "BATTERY OPERATED FOR PERFECT FROTH IN NO TIMEÃ‚ - the mixer is battery powered so you don't have to worry about cords and finding sockets.|BECOME A BARISTA OVERNIGHT -Ã‚ with our froth wand you can make cafe style coffee at home instantly. Impress your friends and family with your new magic wand!|GET CREAMY FROTH QUICKLY -Ã‚ our milk frother will start creating creamy froth for your morning coffee within 15 - 20 seconds.|BEAUTIFULLY STYLED WITH VERSATILITYÃ‚ - our coffee beater comes with an elegant stainless steel stand to fit into any modern kitchen.", "user_id": "AGVONMMX6YJEEGSYPHCV2JQBJYSQ,AF5FBMSRN3DNZ5VA7QO34JVWM3FQ,AFDPYHNXY5R5DCB7GLDCSX24CQ7A,AF3FQ4SRTJYSEHJJW2UP5WM3LRSA,AEE5QN5TSLHUPXJL4WX76DZW3YEQ,AFGIFBW7GHAMXX5YNQFSE3HQYEWA,AF36AG5NBJM77D5PW7A3Q3SNKNOQ,AEQSEIQ55YRS5ITY6PMOHDFCJJWA", "user_name": "Anshika Verma,Dippy,Mitesh Mayavanshi,Pri,Arpit Agarwal,Chitra Jain,jeevan prakash,Shivangi Virdi", "review_id": "RKV8CMWS5JH6D,R1QIQ59JU5UE4V,R2L12WCBQ4OCVC,R1UF72K40NHBF1,R9J5VXGXQDEI5,RDU15S26VUSDV,R3JYUNYTYNOS5E,R281VFJGSFWPSV", "review_title": "It's okay,A must have for coffee lovers,Perfect product for making a perfect cup of coffee.,Stopped working after minimal usage,Great Product,Amazing!,Awsome,Good", "review_content": "It is a nice product it does what as it says but the only thing is it does not have a great speed if you put a dura cell battery then Only it will show the speed and second thing is the frother my friend recieved from insta cuppa is another and what i recieved is another she has a thing or a button where you don't have to keep pressing the button to froth but in my product i countinuesly have to press the button to froth,Indispensable tool for coffee lovers – specifically for making a professional tasting latte, cappuccino or espresso. It produces soft creamy foamy milk froth in a jiffy (Highly recommended to use full-cream milk for best results). It is handy, easy to use, lightweight, easy to clean with a convenient stand to park it when not in use. No hassle of wires or charging. Simply insert two AA batteries and you are good to go - best results with Duracell.Attractive and secure packaging. Express delivery. Very satisfied!,First hand experience with this product is quite good. It does the task with ease. Will use this product more than 1 month then will edit this review. But for now the product is simply amazing at this price range.,It was working well and suddenly after four months it stopped working. At first i thought I needed new batteries but even with new batteries it's not working just in 4 months i haven't even used it completely for 30 days in the 4 months I've had it.,Great product and easy to use, hoping I will not face any issues as mentioned in some comments.,Easy to use,The quality and speed of the product are just amazing...I thought it was costly but it's worth the money.....blindly go with this..thank u so much,Product is good till now I have used it 3-4 times but still to use more and if anything goes wrong have to check their customer service.. Detailed review will give after 3 months of use", "img_link": "https://m.media-amazon.com/images/I/41Lfns2oFNL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/InstaCuppa-Handheld-Operated-Electric-Stainless/dp/B0763K5HLQ/ref=sr_1_350?qid=1672923610&s=kitchen&sr=1-350"}
{"product_id": "B09PDZNSBG", "product_name": "Goodscity Garment Steamer for Clothes, Steam Iron Press - Vertical & Horizontal Steaming up to 22g/min, 1200 Watt, 230 ml Water tank & 30 sec Fast Heating (GC 111)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|SteamIrons", "discounted_price": "₹2,575", "actual_price": "₹6,700", "discount_percentage": "62%", "rating": "4.2", "rating_count": "611", "about_product": "Lightweight & Portable: Dimensions: 223 x 158 x 120 mm. You can steam your clothes and fabrics vertically or horizontally without the weight of the water tank holding you back. This steamer is travel friendly and can easily fit it into your suitcase.|Detachable Water Tank: The steamer comes with an easy-to-detach water tank with the capacity of 230 ml which allows it to run for at least 10 minutes!|One Button Function: You just need to hold on to one button while steaming and as soon as you let go, the vapour immediately stops which allows you to save on water. The blue light at the back indicates that the steamer is ready to use!|Measuring Cup: We provide you with a measuring up to immediately measure the water intake required for your steamer.|Box Contents: Handheld Garment Steamer | Measuring Cup | Detachable Water Tank | Instruction Manual | Warranty Card.|Assistance and Warranty: 1 year Goodscity India offsite service warranty on manufacturing defects ensures on time customer support. Reach out to us on our website for any queries: www.goodscity.in OR via email: help@goodscity.in OR call us on +91 890 890 1290", "user_id": "AFS2KZ7HYC7JUO5JOGPAQY2IKNGA,AEXELC7IXD4IBM7P4BQNFF5PENSA,AEHSEYWIGX2757A2UWJS7J2CG3CA,AH2UIFL2ZLH7AZP6L2I6JNJNDR7Q,AGESDEISSJA7HFM6224YLOY7AOSA,AEKM3HT4LYB2UVTFZQYLNGHALBFA,AHSAKHOAXLHAC5I6OCL22DC6WOLA,AGXJ5BSSV5THYPGNS7GJJVFNOKKA", "user_name": "NIKITA,Amazon Customer,Ankita D.,Purna,Sekhar,Santhi,S.K THAKUR,Piyush P Satpathy", "review_id": "R28OJFR9T45794,R1Q7JAGLTGSLIR,R17RCVE0E6A6XA,R280FE6OS8V8I4,RMC53XMIQL6LY,R1TL181OM5ZWSJ,RL6IWO0F5BP3F,R2VCXQVEFYZWR8", "review_title": "Useful Product,Good product,Good,Most cutest color travel iron,Good quality product.,Great quality garment steamer,Superb,Superb supportive good for garment!", "review_content": "The product does it’s job really well. Just feels a little heavy.,It is easy to use and wrinkle free and happy for using first time. Thank you Amazon.,Good product,First of all I really like the color of this iron. This is so cute to hold and use it. I was little worried about the performance but I tried this on daily basis for good 5 days so far and the cloths are really neat and wrinkle free. I feel this is little bulky as compared to the iron that I used from my friends in the past but otherwise this is a good travel iron. Now I don't have to worry about ironing lots of cloths before travelling to somewhere.,2 level steam adjustment allows better control to obtain optimal results and Easy refill large 1.8 ltr water tank suitable for long steaming sessions and Powerful 2000watt all aluminium heating element for fast even heating and Double anti-dry design for comprehensive heat & damage protection, I'm really satisfied the product.,This steamer works like magic. I just used hanger for cloths and used it.Very useful for fast instant ironing.Need to press button for steam.All you need is little patience. Do it slowly.Wall on background helps.Don't put hands on opposite sides of clothes, it's temperate is high.,The results are evident. All your bulky clothes can be ironed pretty easily with this. A small amount of water is enough to iron a blazer or even a lehenga. The efforts have become minimal. It s a modern day treat to have this at your home. The price when compared to others is kept minimum. The warranty is pretty much handy extra six months,I used it for the first time in my life. And, wow, it just worked like any normal iron! It is handy, portable and fast enough to do the wrinkle free garments.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/21df9THeM-L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Goodscity-Garment-Steamer-Clothes-Steam/dp/B09PDZNSBG/ref=sr_1_351?qid=1672923610&s=kitchen&sr=1-351"}
{"product_id": "B085LPT5F4", "product_name": "Solidaire 550-Watt Mixer Grinder with 3 Jars (Black) (SLD-550-B)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MixerGrinders", "discounted_price": "₹1,649", "actual_price": "₹2,800", "discount_percentage": "41%", "rating": "3.9", "rating_count": "2,162", "about_product": "DRY GRINDING BLADE - This stainless steel blade is specially designed for dry grinding like roasted coffee, red chilies (with flat lid on) pepper, raw rice, coriander, etc|PACKAGE CONTENTS - A Base Unit. Liquidiser Jar with polycarbonate dome. Grinder Jar with plastic cover. Chutney Attachment with a plastic cap. Set of 3 Blades. Spatula. Instruction Manual|WARRANTY - 12 months warranty from the date of purchase against any manufacturing effects. Warranty covers only motor", "user_id": "AHZFKWGDBRQKNMNQ4ZPL52OZBRKA,AGBEFVJFOQIRF7C7KY5VN6XO7JEA,AGN47LODJXDWX6WWSS5JJLKP2HWQ,AGJRVBQJIVB445HIWTFCZOI37IQA,AHCNUZM2XGWJXQHPWYVZMS5CAEMA,AFQICBBGIA6ED2FXXYEVEVKDFOWQ,AELILYZUYXGJOFN2P7KT7OEUBM2Q,AEJHZ5W2C7AYFISGPX7WSDVSIYEQ", "user_name": "Mukta Khan,mal kho,Apurba,Patel Kiran,Critical  Customer,Bhagyashree chopade,SANDIP SINGH,Ramesh kumar", "review_id": "R2F6HAXHI2E0QM,R3ARFHUPI2UTDN,R2NFBRLIKTBYX6,R1NQQIZHCDSRL8,RU6YHY3TNNV6U,R2F0F9H707NNWH,R32GR67TTDTEH,RMA358YLCTHG2", "review_title": "Ok product 900/ma bast product  A little family product Not resturant not hotel,Heard to relief but nice 👌,Value for money,Discount is good,Good product for non continuous work,Good product,भाई कभी मत लेना नहीं तो पछतायो गे 6 महीना ईयूज किया हू और ये लोग वारंटी भी नहीं देते हैं,Best product", "review_content": "Ok product 900/ma bast product A little family productNot resturant not hotel,No,Nice product,Good product,For Dry grinding of spices, motor heats up,👍,भाई कभी मत लेना नहीं तो पछतायो गे 6 महीना ईयूज किया हू और ये लोग वारंटी भी नहीं देते हैं कभी को कस्टमर नम्बर देगे कोई सुनता ही नहीं है बोलेंगे कंप्लेन दर्ज हो गया है और कोई सुनवाई नहीं हुई,https://m.media-amazon.com/images/I/71HMDwsW8bL._SY88.jpg", "img_link": "https://m.media-amazon.com/images/I/41SWYTwG5-L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Solidaire-550-Watt-Mixer-Grinder-SLD-550-B/dp/B085LPT5F4/ref=sr_1_356?qid=1672923610&s=kitchen&sr=1-356"}
{"product_id": "B0B9RZ4G4W", "product_name": "Amazon Basics 300 W Hand Blender with Stainless Steel Stem for Hot/Cold Blending and In-Built Cord Hook, ISI-Marked, Black", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|HandBlenders", "discounted_price": "₹799", "actual_price": "₹1,699", "discount_percentage": "53%", "rating": "4", "rating_count": "97", "about_product": "Strong, sturdy blender with a 300 W powerful and efficient motor that can be used across a range of cooking needs.|Has food-safe, rust-resistant stainless steel blending blades. The ergonomic slim design makes it very easy to hold and use.|With a silent motor, this blender is extremely comfortable to use. It makes almost no sound and works efficiently in silence.|Stainless steel stem allows you to use it even with hot food without damaging the stem.|Penta-flow breakers ensures even and consistent blends.|100% copper motor with double bush ensures durable functioning.|Easy click-fit locking system makes using the product very convenient. Also comes with an in-built hook in the cord for easy storage.", "user_id": "AGBNLIOKIT72A2TBLG6A35XUEIMQ,AFTFMOXP7SKX4NJJIYLRJ4TAKZZQ,AFQAXRM4XEA72PNIMWCW2F53ISWA,AEBDUINAFKTVCCEEHAXKR7AG5LXA,AGYKZQYHVADBHYAL7U5P7F4KSRBQ,AECVPCTS5NOO6MT4NUYJJBUT7COA,AHKUEAEHUGIV6L2V7PGR7PCJ5JIA,AFU6BDGJZI74Y35UXM2RWQLLTIHA", "user_name": "JASWANTSINGH,Vedant Joshi,Subanathan,NARENDRA  N,Aadesh,Amazon Customer,Monica,Aniketverma", "review_id": "R31WQ6LSRGW2ZR,R38HZUI1W51JF2,R3ORITJ44RSH6F,R19ZBL4YHKSF9E,R3H95PXGDM3OFT,R2OAZG856SPCH0,R23KHIP7PE2TA4,RXHZQKEGCUAY8", "review_title": "In this price worth to go for,First Impression: Looks elegant and sturdy with classy design.,Quality product,Good,Best purchase,Value for money. Easy to use.,It splashes everywhere and not much power,best of price in Amazon basic. hand blender in other company blenders", "review_content": "In this price worth to go for,Yet to use it but looks quite classy and sturdy. Design is nice and base is detachable for easy cleaning.,Nice product, strong and finish, easy to use and clean, Like it,Good,The quality of the product is good and it's very easy to use. Value for money.,Use it every day for mashing cooked vegetables to make soup. Easy to wash and store. Seems to be reliable.,Splashes and little power,This Amazon basic hand blender so easy to use and clean best of other compani blenders product so easy to clean easily use best of price in Amazon basic.🥰", "img_link": "https://m.media-amazon.com/images/I/31YvxM2eDDL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Amazon-Blender-Stainless-Blending-ISI-Marked/dp/B0B9RZ4G4W/ref=sr_1_357?qid=1672923610&s=kitchen&sr=1-357"}
{"product_id": "B0085W2MUQ", "product_name": "Orpat HHB-100E 250-Watt Hand Blender (White)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|HandBlenders", "discounted_price": "₹765", "actual_price": "₹970", "discount_percentage": "21%", "rating": "4.2", "rating_count": "6,055", "about_product": "Unique comfort grip|Sleek and strong and motor with 18000 RPM|Easy to store and wash with smooth and safe switch|Elegant design and wall mountable|Long power cord with unbreakable poly carbonate bowl|Multi-purpose fixed stainless steel blade|Warranty: 1 year on product", "user_id": "AEQX3KIYFY6RCTFIX2J76NVKPF3Q,AGHE2Y6SEZXUO5QR44FVYOZ52B5A,AFU46CW62ED472TF44RSU3HQ7HQA,AFOCLJYM3NII6TR3FOJVXFTY2SLA,AFJDCQHDXSOYUGXT2X3FCUO7K33Q,AFPHGWJFEN2UK47F2RDYBL6YUAZA,AG7O2DWNCAQIAMWYENDUQG3P5FPA,AFKB6MWYZHS44ZDTVNSMRGBR2CGA", "user_name": "Boo,Jeevan Kumar,Shivam Jangra,Manzoor,Manish,Yashwant Panchal,Santosh Kumar Saini,Chandra  S  Sharma", "review_id": "R3R9NQXE7ERW69,R31DY4L4738GNN,R3347MGIFGCWJS,R263YLUZGHS5XD,R1ETYQQ9DO5CT3,R2D2D3D80JZBY3,RB0Q5W9URO8ZE,R3SYQPLCIXHS1E", "review_title": "Better than I expected!,Good,Good product,Great durability and original products,Very Nice !,Good product,Good,Good product", "review_content": "Pros:1) Looking at the picture, I thought it would just be the blender with some cap to cover the blade. Turns out the \"cap\" was actually a pretty nice container to blend small amounts of anything. The container itself seems of great quality, has measurements on the side, and also comes with a lid so that nothing splatters outside when you're using the blender.2) There is also a holder with some nails if you wanna mount the blender on a wall.3) The blender itself is amazing to hold, looks great, and is pretty easy to use.4) The blender can even stand on its own if you have to leave it and attend to something else. If you place it vertically, you can leave it as it is.Cons:1) After over 15 seconds of continuous blending (that is, if I'm not just pulsing it but continuously blending), there is this smell of some sort that starts to come from the blender. I'm not sure if that's a sign of overheating, or if it's normal.2) There's this groove right above the blade, and every time I'm done washing, there's always a little residue that was hiding in that groove which always comes out a few seconds after I'm done washing, and I always have to go back to clean that. So that's a small inconvenience.But it's overall great, and I'd highly recommend getting this product!,Good,Making the life easy.,Great durability and original products,Very nice product for small or moderate usage.,Good product,Very good,Very useful product in day to day work", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31l0oxTSJuL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Orpat-HHB-100E-250-Watt-Blender-White/dp/B0085W2MUQ/ref=sr_1_358?qid=1672923610&s=kitchen&sr=1-358"}
{"product_id": "B09474JWN6", "product_name": "HealthSense Rechargeable Lint Remover for Clothes | Fuzz and Fur Remover | Electric Fabric Shaver, Trimmer for Clothes, Carpet, Sofa, Sweaters, Curtains | One-Year Warranty Included - New-Feel LR350", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|LintShavers", "discounted_price": "₹999", "actual_price": "₹1,500", "discount_percentage": "33%", "rating": "4.2", "rating_count": "386", "about_product": "RECHARGEABLE CORDLESS: Long lasting multiple USB rechargeable battery gives usage of 60 min with 6-hour charging. Being small handy makes it perfect handheld for at-home daily usage & while on travel|SWIFT & ERGONOMIC: Built with premium ABS material, SS mesh cover & razor-sharp blades. Advanced technology & powerful suction motor shaves off any cloth lint-free|SUPERIOR RELIABILITY: 3 stainless steel floating blades removes lint, pills, bubbles & fuzz of all sizes! Large storage bin eases usage|MADE FOR INDIA: HealthSense is a registered Indian Brand aiming to bring quality innovative products. This product is idealised & conceptualised for Indians & manufactured by exclusive overseas partners|SERVICE & WARRANTY: 1 year Healthsense offsite service warranty on manufacturing defects ensures on time customer support", "user_id": "AFXT4M4YZCGYWUG22BMXEOB7VUOA,AEZWBVOWAZGCLKUNZXNBRCMWR2TQ,AH2IMO7T23MIAIHRLZGUSPHEXSZQ,AFNIVT3EJUTT7FKZW6GZVEWWT7HQ,AEJ4WWMJAKONQU4XNWCKIGA5U4LQ,AGEMLCWZLIJVZMIMPK3J4NEX5SMA,AFP7CS7L7WZM3OXFXC77IPNINGUA,AGJCU3HCKI6FYPKYS6FBZGJOQJ6A", "user_name": "GB SLG,Jemin,Ashwini Vetekar,Kusum,sonu ali,Amazon Customer,Amazon Customer,rinku singh", "review_id": "RVV3VEBYM65XS,R25CPGMH2YOEGC,RL1N0IR94UURO,RJDDXBOXLND1S,R1RIAS936O3KJB,R2HJLACK6M123R,R37WC2OOJ7EH00,R552K8E1PGVSB", "review_title": "👍 nice,Lint removed instantly and effortlessly,Amazing product...worth the money,Best purchase till date,Good,Works as expected,Good quality,Must have product for Winter clothes", "review_content": "Like,Loved the product alot. After cleaning off the lint, clothes looked good as new.,This lint remover is just too good...very easy to use and easy to clean...it removes the lint completely and gives a fresh look to the clothes.,Absolutely love the product, very useful. No gimmicks, I like it when the product does what it says. The brush at the back is just cherry, highly recommended. Blessing for winter clothing, it does work on any kind of cloth which has lint/fuzz on it,Super,Works well as designed. Cord free allows flexibility.But, the lint collector is a bit small requiring frequent emptying.Also, the collector could have been transparent to allow easy view.Nonetheless, this is a fine aid for day-to-day use.,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/810x1MmF+9L._SY88.jpg,it is really very good product and easy to use and clean. I used it on my old winter clothes having lints and used them with confidence as it really improved the look Even my relatives used it when visited me and were happy to use it.. also . Bought it at 1199 in Dec'21.. Now at 899 is a very good price. It came with a charging cable and a cleaning brush.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41lGZWRZqOS._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/HealthSense-New-Feel-Rechargeable-Electric-Sweaters/dp/B09474JWN6/ref=sr_1_361?qid=1672923610&s=kitchen&sr=1-361"}
{"product_id": "B09G2VTHQM", "product_name": "AGARO Classic Portable Yogurt Maker, 1.2L Capacity, Electric, Automatic, Grey and White, Medium (33603)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|YogurtMakers", "discounted_price": "₹587", "actual_price": "₹1,295", "discount_percentage": "55%", "rating": "4.1", "rating_count": "557", "about_product": "1.2 Litres Capacity|Double Deck Seal|Stainless Steel Bowl|Fully Automatic|1 Year Warranty|Product Dimensions: 16.5 x 16.5 x 11 Centimeters, Item Weight: 800 Grams", "user_id": "AGYTFOW77SU6CYA7L2ID3IYBWMLA,AHAHGFYVEV3DXUG3GQFCUPBSHTZQ,AEOVVK7XRSH3T5SSQLE42FWIY3RQ,AE2XSRIZGIHUEHFRYKTLVQIKYFKA,AGHEDHPCRHKYDPXWSKRKEP7HLNDA,AGEM42HY6YHDGMWMGZYPLVHA27XA,AEHXNDAJNJXBV4NGZ2ZWKIPPJREQ,AGQ2KOOSNRJVNY3PYFXFZPRKDIDA", "user_name": "Hem,Anya,Deepak Roy,ASHUTOSH PANDEY,Srinivas,PJ,9703041496,O N Misra", "review_id": "R243ZL6I5OCPFC,RMRDDMYPHJVVP,R3T10OKWTH8OE8,RMG3T7RJ48ZLD,R3UFE6QT0QHH7G,R3X13NSZ9R7V8,RDV1T7ZH0FK06,RUQIUJ24RX540", "review_title": "Very easy to use curd maker,Excited to try it,Good product to settle hassle free yogurt,Checking now,Good Product at this Price,Good product,Good,Best yogurt maker at this price range", "review_content": "It's very useful in winter when it gets cold and curd does not form properly. It maintains fixed temperature enabling fermentation process. I gave one star less because it does not have any handles so holding the apparatus can be tricky as it has this smooth surface so it might slip off from hands. You have to be very careful while holding and handling this curd maker, if they give side handles and auto-cut off feature then it would be best.,Package arrived in good condition. Now need to contact company for warranty,Good product to settle hassle free yogurt. Only thing is it should automatically cut of power once yogurt is ready. Else yogurt tastes amazing.,Got the product,looks good... checking now,I am writing this review after using the product for three weeks. I have chosen this as 'Agaro' Brand seems to be more trustworthy and has 1.5 years warranty (1 year +6 months extra after registering)Good Things - It works as expected. For my taste and local weather conditions, it takes nearly 6 hours. This will vary based on individual taste and local weather conditions. Very light weight. Cleaning is easy and there is no problem even if there is a bit of spill.Not So Good Things - Quantity is not 1.2 liters, it is few ml more than 1 liter.Plastic covers are delicate and there is chance of them getting damaged while cleaning. In my opinion manufacturer should have a provided a optional spare set of covers.Considering the cost, build quality is sufficient (as it is Made in China)Length of the wire is 94cms and usually requires an extension,Good product,Good product,It's just amazing. This sentence is enough to comment for this unique thing.I never ever had ever imagined to make yogurt in quick time and even in winter without any compromise in taste.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/310umqMFDRL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AGARO-Portable-Capacity-Automatic-33603/dp/B09G2VTHQM/ref=sr_1_362?qid=1672923610&s=kitchen&sr=1-362"}
{"product_id": "B07R679HTT", "product_name": "AGARO Imperial 240-Watt Slow Juicer with Cold Press Technology", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Juicers|ColdPressJuicers", "discounted_price": "₹12,609", "actual_price": "₹23,999", "discount_percentage": "47%", "rating": "4.4", "rating_count": "2,288", "about_product": "Cold press process for maximum juice extraction and nutrients retention;Easy to assemble, operate, and clean|Large 74mm Feeding Tube I Can process whole fruits like orange & apple;Screw Shaped Pulverizing auger to squeeze last drop of juice|100% BPA free Plastic;Dense juice with practically no air bubbles|Can be used to extract juices, prepare smoothies and sorbet;1 year warranty on Electrical parts and 5 years on motor; Blade Material Type: Stainless Steel|Suitable for gifting on Diwali and other special occasions.", "user_id": "AHJT2MQLGOFNAFFNLLJGIYO5LT5Q,AHVXXQOUU54RYRBWFDE7VI3S5PLA,AF4TTIEDYAPHWU7WG5UTJM345ZHQ,AH4CZ72FCY3JIQJAEGG3IL5MOC3Q,AHYALQ3NLFMTU52IWFICXNJIC7VA,AEIJBUDBWBW6XM22W5US5BWDBFYA,AH722R3XI2Z5PC7QQ6YUEXE6V2DA,AHWW4TSZL3AGYOBMIKJHP56I4O6Q", "user_name": "Karan Singh,Sajan Gupta,sandeep saini,Tarun Kumar,Yanala Raghuvamshi Reddy,Sravani,Amazon Customer,gaurav rastogi", "review_id": "R3URL5J0TF2CFR,R37JPC46NZUYM4,R1OQKLY9Q4GY95,R32GL6C68NHZHW,RROVBM9HC5VHW,RYKSWQWZ75CWA,R1DIINFPSDUN2C,R2YE4LXQQUWF7F", "review_title": "Overall Nice Product,Must buy product,Product is good to use.,Tasty and Healthy juice,Good,Good product,material,Just got it", "review_content": "It's a nice product, does the needful. Was easy to assemble and it's technology is really getting the juice from the fruits or vegetables properly and there is very less waste.,Easy to make any kind of juice, just love it.,Product is good,The juice from this Juicer is so tasty and natural,Good product,Good product,Nice product,Juicing very easy ,Good quality,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61mgjONWNTL._SY88.jpg", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41e5RU3gPHL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AGARO-Imperial-Slow-Juicer-Watts/dp/B07R679HTT/ref=sr_1_363?qid=1672923610&s=kitchen&sr=1-363"}
{"product_id": "B00B7GKXMG", "product_name": "Wipro Smartlife Super Deluxe Dry Iron- 1000W", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|DryIrons", "discounted_price": "₹699", "actual_price": "₹850", "discount_percentage": "18%", "rating": "4.1", "rating_count": "1,106", "about_product": "Scratch resistant sole plate;Adjustable thermostat controls|teflon non-stick coating;Easy Glide: Reaches into hard to reach areas|Smoothest coating duPont;Smoothest coating dunpont teflon non-stick coating; Auto off pilot light;Warranty: 2 years on product|Power: 1000 watts;Includes: Electric iron, Instruction manual and Warranty card|Material Type: Aluminium", "user_id": "AHC7U7MTAN2Y2T6X2G43SWSQHETQ,AFN6JOIM4WB7CBNNAM7JQJAJVZNQ,AER7ER4GHJ65LKQFSIRZG6DSEC5Q,AF6PJDQ5GNVGTIYXA5ZCTCKBLHEA,AHU5Q5IFZNU5KKPBZBP2Q63V5NFQ,AEBY74RXWDNJOHARPUMVQT5MY5XA,AFLIUDPXTMHWUWXDEPUT72WCMQAQ,AFIOG6MKUPF37DAJ5VTKKPFG62AQ", "user_name": "manjula,Rishi Kumar Mishra,Tankala sushma,Sunil Kumar Rajak,AKSHAY,UMME KULSUM,Lx,Sangeeta wandakar", "review_id": "R1ZMYNJKIPID9R,R21HYR2IZWHCTU,RF3YHF01ASGWA,R10AUP1PXSZ48T,R2BF4IQECR3SFS,R1QSF7UGCDTRKX,R3DE0HC1JNBC6C,RLPLHEPRNO61J", "review_title": "it s very nice and easy to use,Good quality...go and purchase,Good,Good quality,Good product 👍,Good,Value for money @600₹,Good", "review_content": "its light weight easy to use but is not worth for the value,Very good product,Good,Very good quality,Easy to to use,,Good and very happy with this product,Value for money @600₹,Easy to use", "img_link": "https://m.media-amazon.com/images/I/319pDZDL+sL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Wipro-Smartlife-Super-Deluxe-Iron/dp/B00B7GKXMG/ref=sr_1_364?qid=1672923610&s=kitchen&sr=1-364"}
{"product_id": "B07H3N8RJH", "product_name": "AmazonBasics Cylinder Bagless Vacuum Cleaner with Power Suction, Low Sound, High Energy Efficiency and 2 Years Warranty (1.5L, Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Vacuums&FloorCare|Vacuums|CanisterVacuums", "discounted_price": "₹3,799", "actual_price": "₹6,000", "discount_percentage": "37%", "rating": "4.2", "rating_count": "11,935", "about_product": "Bagless 700 Watt Cyclonic Cylinder Vacuum Cleaner; AAA performance in terms of energy efficiency and cleaning performance; 25 kWh consumption per year|Triple action nozzle for thorough absorption of coarse and fine dirt; (easy-to-use sliding button to regulate the suction power)|Reusable dust cup means no need to purchase disposable paper dust bags.|Cyclonic technology provides intense suction power that effectively draws in air, dirt, dust, pet hair, and other debris|The washable HEPA-12 filter captures more than 99.5 percent of all particles for a cleaner air release|1.5 l capacity, small, compact and lightweight, easy to carry thanks to integrated handle, 5 m cable length, 1.5 m adjustable hose|Exceptionally quiet (78 decibels), cord storage, Accessories include crevice nozzle, upholstery nozzle, dust brush, parquet brush and accessory holder|2 Years Limited Warranty in case of manufacturing defects, Actual product may differ slightly in appearance to illustrations/picture provided", "user_id": "AGRAAUFFZVW3L5L4MV65HRI63NPA,AGSMGWHNRQAZOOIPF7UOSNBQDNIQ,AFJZWYEHRGAPQPS5N64LTC3JOCXA,AHERFNSW6YQVDARIDK6WI3GFTCLA,AH2R6HPCGKBGV62HAZ3BH3HFMIPQ,AFAR6KANGGM4XIVC6ZDTSEONGR6A,AE2WVSMP7ZOFNGQWHUPQNRZHLOVQ,AEJNLPO52JIB3UFIIIGFMQBJCJLQ", "user_name": "Liliput99,umamaheswaran,Alina,Prasanthi,Amazon Customer,Nissam kollam,Kaviya,Unknown", "review_id": "R3RFDGR8TPI8RK,RAKVMHE1HIAWS,R993RWWGJ9AOK,RG1S054Z1LNM,RXNSR6DWHY21T,R2UAN2MTFP5KVM,RVXBEXV3GDXD8,R3NEQG8JV6357R", "review_title": "Good suction power, enough for most cleaning,Worth for the price given,Okayish,Budget vacuum cleaner.,Very nice product worth it 😄,Best vacuum cleaner,It's a really good worthy product,Simply superb", "review_content": "Suction power mentioned no where on product spec or packaging. But surprisingly it's having good suction do most of the cleaning effortlessly.I purchase 3ltr version which having button to control suction.It's some what true that suction reduced when dust cylinder is somewhat full. But I resolved issue by emptying dust cylinder and cleaning filters.It's somewhat tricky to remove cylinder itself for cleaning do it carefully ow u will break plastic locks.It's very similar to midea vaccum cleaner available in uk with 16kpa.All extension pipes are of steel make is it difficult to work with due to weight.Btw it don't have blower function.The price of product and performance make it best buy vacuum.,It's worth for the price given,and does it's job perfectly,only concern(on my personal experience) I had was the extension cord provided is made of steel and it's bit heavy and we can't hold it for long while  cleaning the spider webs in roofs, rest all good,Suction power is okayish. Its a good product, value for money but can do much better with a good suction power. It doesn’t remove most of the dust takes too much effort,It is a good choice if you are looking for a vacuum cleaner under 5k. It is worth for the price.,nice product worth the money,Suction power is good, cord length sufficient for home purpose, noise level is also low right now,Please go for it. It has excellent suction power easy to carry around and has different options for cleaning things. Good product for this price,Very usefull and comparatively very good when compared with costly vaccum cleaners in 8k. Dust cup is just awesome..Only drawback is no blowing out......", "img_link": "https://m.media-amazon.com/images/I/41bdE73aspL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/AmazonBasics-VCS35B15K-C-1-5-Litre-Bagless-Cylinder/dp/B07H3N8RJH/ref=sr_1_365?qid=1672923610&s=kitchen&sr=1-365"}
{"product_id": "B07K2HVKLL", "product_name": "Crompton IHL 251 1500-Watt Immersion Water Heater with Copper Heating Element and IP 68 Protection", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|ImmersionRods", "discounted_price": "₹640", "actual_price": "₹1,020", "discount_percentage": "37%", "rating": "4.1", "rating_count": "5,059", "about_product": "PACKAGE CONTENTS: 1 unit of Crompton Immersion Water Heater, Instructions Manual and Warranty Card", "user_id": "AGD2UEWN67Y75EOCKEJE7TSOKPDA,AGD4TUF2TI74HZLJF4SEZHSJL5LQ,AEVI6BPCNUCWF43ZU36XOMZAZUSQ,AGCRBPV45GJOL34GSLRX4FPLED7A,AE4IXYSBU6N2L4ABI3FPVKYOL4XQ,AGKCZKL5F5SWMXTE7EOOX2TVAP6A,AHAWYKI6SKVO2NGCZ4BDJ4WWSZCQ,AE6MBEP4HN5HDV6LIEEN54UBRPWQ", "user_name": "Nikhil Kumar Singh,bhanu,Mallikarjun g.,RM,Deepak,sayan pal,Deepak,CHANDAN JHA", "review_id": "R88E54B144DD0,R3FL7Q9VYK7FX,R179TG3O7PDRPF,R3Q8O6PFUVQU7A,R8AM97GFJ0FQP,R1XSLD1GQ10QW7,R1AN77ZWAV7W2O,R1JOWRTOHMS9W3", "review_title": "Nice product,Product not Quality donot buy,Wonderful product,Power Indicator is Missing,Excellent product,Value for money product,rod water heater,पानी गर्म होने में 15 मिनट से ज्यादा टाइम लेता हैं", "review_content": "Awesome,I am purchase July month 2022. Product was repaired. I informed to customer service. He assigned Technic. Said this product was replaced with 10days. But still issue was resolved. Again call with customer care.  He said not in our control. We asain one more time,Good,The rod is good overall, the only drawback it has is missing power Indicator,rest it looks fine,Use this it's worth,The heating rod heats 5litre water with in 5 to 10 minutes The product totally worth its value,excellent and perfect,रड की लंबाई के अनुसार पानी ज्यादा डालना पड़ता है इस कारण गर्म पानी होने में टाइम लगता हैं", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31pzC6I+bEL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Crompton-IHL251-1500-Watt-Immersion-Heater/dp/B07K2HVKLL/ref=sr_1_366?qid=1672923610&s=kitchen&sr=1-366"}
{"product_id": "B09MQ9PDHR", "product_name": "SaiEllin Room Heater For Home 2000 Watts Room Heater For Bedroom | ISI Approved With 1 Year Warranty | For 250 Sq. Feet Blower Heater & Room Heaters Home For Winters", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|FanHeaters", "discounted_price": "₹979", "actual_price": "₹1,999", "discount_percentage": "51%", "rating": "3.9", "rating_count": "157", "about_product": "Room Heater For Home is Meant for Spot Heating, Room Size: Upto 250 sq ft. 100% Pure Copper Wire Motor for long life|Heater for Home Ideal to be used a s Room Heater for Bedroom small / medium room only, i.e., up to 250 sq. ft. when operated at 2000 watt heat setting. Makes some noise due to fan. Body Material: Plastic, Metal|Our Blower Hitter comes with a powerful 2400 RPM copper winded motor for quick heating and can be used vertically or horizontally (kindly refer to images);Do not worry if you experience some burning smell when you run your room heater for the 1st time. This is due to the motor varnish getting heated for the 1st time. The problem should not recur in subsequent usage. If it does, please contact our Customer support|Room Heaters Home for Winters gives Cool, Warm or Hot wind selection knob for heat setting; Please note that regulator changes heating power & not actual fan speed;Lightweight (1.15 kg) for easy portability between rooms; Plastic body with rust-free metal grill front", "user_id": "AGUJD7ONEYENBWZTZDMV2R5WUS5Q,AFX56WJDKZA5QDCLNHWGZE4WBM2A,AHQH32FK57N5R4DXCYRDFJERD3MA,AF3O2DRWWLEEYZOWDPONHNCYOYCA,AHBY5WOGTC3LCNKSXEH6XYLX4C7A,AEB2QT7KVD2RVAWLPXGQFJ3ERYWQ,AFT3QGE4IU2G7IBMCWEWET7DAAAQ,AEQR7OAEEWSVH3FXEK6VO2ELW2LQ", "user_name": "Manish kumar,Randh,Vijay Singh Negi,Lallan T.,Shubhangi Mehrotra,Rompy,Vipin,kapish", "review_id": "R3EH3U82O1X3NA,RFZS8GTC3FBL5,RPXUHUM30UTOQ,R1AI9WFQ3G1DHX,RW7GLU8WKBE0M,R8JGWFB8APIP2,R2WSL4EHLPOXQ6,R1B73QMNM4YS1Q", "review_title": "Size of heater is small,good product,Power Cord is too short. How and where to use it? Do I spend further on Extension Board???,Not relatable product. No after sell service,Portable and efficient room heater,Useful product,Best Blower for the office use,Good product for room", "review_content": "Overall heater is good but it's size is small but it can make small area heat within few seconds,,Power Cord length ..very very short, and Function Knobs have no Written Marking of the Functions.,Material used is not of a good quality. No after sell service available at my location.,This room heater is portable and quiet efficient. It warms my room perfectly. It was really a good deal.,It is very useful and easy to handle,Sufficient heat is blowing with air, very nice product in this price, best to use for single person in office and home also not making noise like other products.,I like it", "img_link": "https://m.media-amazon.com/images/I/41VYlxCZqLL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SaiEllin-Heater-Portable-Bedroom-Compact/dp/B09MQ9PDHR/ref=sr_1_364?qid=1672923611&s=kitchen&sr=1-364"}
{"product_id": "B014HDJ7ZE", "product_name": "Bajaj Majesty Duetto Gas 6 Ltr Vertical Water Heater ( LPG), White", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|InstantWaterHeaters", "discounted_price": "₹5,365", "actual_price": "₹7,445", "discount_percentage": "28%", "rating": "3.9", "rating_count": "3,584", "about_product": "Dimensions: 35.56 Cms X 19 Cms X 55 Cms", "user_id": "AH2PWK54MG3S6EOHGLGP3LTQJOAQ,AHKY24SIF5BG5XOFBACXN33XUO3Q,AGLCQ6Z2KEIXM7DC7JFZEN623CHQ,AGVRXUM3GMUGSUDI2BCELQ5G3MRQ,AFFJF7JN2X3UKBT33BHFMU2FCDIQ,AH3LPGUYC6VZUHBLHZKGMMBT5HGQ,AHHQ5CWRAMNLLPSINLJSICBU7CRQ,AGSHCIHX3V7HS6F6W2XTBOYFX5WQ", "user_name": "jaydeep barad,Amazon Customer,Mukesh,Mitesh Thakur,Tejas D.,Jeet singh,Himanso,mohit goyal", "review_id": "R3573XWMBZ88LW,RYNFBD6U8G0VG,R2NLFJL73LNWXM,R1DOYFCE2U82WE,ROTYDHVA4QC9L,R314WOWD2JI7BC,RFMW7AV5SCYI4,R17OEBPM77XXFS", "review_title": "Yet to know the performance,Good,Hamara bajaj...,Battery isue,Good but PNG model is Made In China,Value for money,Expansive,Service and Installation", "review_content": "It's been just a week ... So yet to know the performance overall but till date it's working fine,Good,Good quality,Battery capacity is very poor of power,Product is fine but I was disappointed by seeing Made in china lable on Png version. Also seller sent LPG model first instead of PNG so check your model once received. Product is working fine.,https://m.media-amazon.com/images/I/61SxpCSn4PL._SY88.jpg,,Product seems to be working fine till now but Very Very poor service by Bajaj Serviceman.He came and just hanged the geyser on wall and said his work was limited to that only.We had to call another technician on our own to complete the installation, and do the plumbing work.Even pipes, cells did not come with the geyser and were sold by Bajaj serviceman separately.0 marks to Bajaj for service.", "img_link": "https://m.media-amazon.com/images/I/31MEXd6TAoL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Bajaj-Majesty-Duetto-LPG-6-Litre/dp/B014HDJ7ZE/ref=sr_1_365?qid=1672923611&s=kitchen&sr=1-365"}
{"product_id": "B07D2NMTTV", "product_name": "Black + Decker BD BXIR2201IN 2200-Watt Cord & Cordless Steam Iron (Green)", "category": "Home&Kitchen|Kitchen&HomeAppliances|Vacuum,Cleaning&Ironing|Irons,Steamers&Accessories|Irons|SteamIrons", "discounted_price": "₹3,199", "actual_price": "₹3,500", "discount_percentage": "9%", "rating": "4.2", "rating_count": "1,899", "about_product": "Cord and cordless convenience for easy and hassle free movement;Ceramic coated sole plate - even heat distribution and best for all types of clothes|30 g/min continuous steam output and 100g/min steam boost;Visible water droplets in the water tank means the iron was tested in factory and passed the quality test|Anti-drip feature to avoid any water dripping from the soleplate in case the steam level is not reached;350 ml water storage tank , Cord length :1 m|Vertical steam : Ideal for all fabrics and saves time;Steam burst function and spray function; Self clean feature to clean the scales built up;Warranty: 2 Years Warranty|Care Instructions: Handle With Care", "user_id": "AEUTMRODCZ5QP6FRYACICHQHJGJA,AGBAIGEU4LX4TAQQOENWMZBZCV3A,AHDSUGLHNAFKFMGKJPLS5HLJFL7Q,AHBRTDUHKMIYUZLP6W7RM4IMFV4A,AHK6Y7FOVUIRNCIYQUA4BBIKXOGA,AFH3LWABFWVDV36O4EA7EDMVB7OQ,AGK46AGUBC3MLDF3UJFYKYVXX7JA,AGZ2OFZQWKMUV5RUP367QIUEDFWQ", "user_name": "Sivaraman S,V Rajendra Kumar,Mrigank,Valmiki Sravani,Rahul Raj,Dr.Aasif,Kshitij Gupta,Melvyn lobo", "review_id": "RDXQHIOFK1PKR,R3SVTCGHMIRBEU,R1IZIEXJ4GIYSS,RDUMYFY75NN95,R2GX29CH20R2HN,R246JQ5OCCXV4C,R3OUB0HZCUEZBL,R2ZYHN8QERPN3K", "review_title": "No entanglement,Iron with freedom,Good Iron,Steam iron!,It’s wireless,Good,Wonderful,Light weight and very adjustable to ur family needs", "review_content": "Good iron, loved the cordless way of using it. Instant heating, with steam flow for crisp ironing.,Good iron box. Steam is as advertised. Irons well. A notch above swivel chord when it comes to cordless convenience. 100ml measuring cup was cracked as it is delivered. Hence a star less,It is good and easy to use, go for it,For First time users, steam ironing can be useful and may love this variant. I have used Siemens iron already and it's not working so on emergency ordered this model from this brand. Both brands are varying in specific parameters. Bodywise BD iron box is small in size. So it took little extra time in closing a single apparel iron. Weight also lighter. Steam consumes water very quickly like I used 100ml twice for 3 apparels.. Color variation observed from image on box and original product inside. Finally work wise okay and job done. This experience is from single use of BD box and first impression. Have to see and watch rest of the story if any,Absolutely portable and easy to reach corners. Steam ironing make easy to iron cotton cloths,But not so heavy,Good product enjoying using it,This iron is good for daily use and easy storage", "img_link": "https://m.media-amazon.com/images/I/41ady4ISpWL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Black-Decker-BXIR2201IN-2200-Watt-Cordless/dp/B07D2NMTTV/ref=sr_1_366?qid=1672923611&s=kitchen&sr=1-366"}
{"product_id": "B075K76YW1", "product_name": "Inalsa Hand Blender| Hand Mixer|Beater - Easy Mix, Powerful 250 Watt Motor | Variable 7 Speed Control | 1 Year Warranty | (White/Red)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|HandMixers", "discounted_price": "₹979", "actual_price": "₹1,395", "discount_percentage": "30%", "rating": "4.2", "rating_count": "15,252", "about_product": "Half the mixing effort: Easy Mix has a powerful motor that provides powerful processing & at the same time is energy saving. Save time & money with this appliance. It performs all your blending, whisking & kneading tasks fast & efficiently. Body Material : ABS|Cord Plug / Length : 2 Pins, 1.0 m , Control the power you need: With 7-Speed control settings you get, control your food preparation. Mix ingredients for a variety of recipes, from slowly stirring in chunky ingredients like nuts or chocolate chips, at speed one to whipping egg whites or heavy cream, at speed seven|Attachments for all your cooking tasks:Beat, Mix, Whisk, Blend, Mash with Quality stainless-steel attachments.2 Detachable Beaters & Whisker/Dough Hooks that will take care of your meal preparation. Now making doughs& batters is quite an easy task|Handy & Conveneint: In-Built Eject Knob Feature helps you to remove attachments without a hitchIts compact design & slim-grip makes our hand mixer machine easy to hold and manoeuvre in mixing bowl or large cup. Input Supply 220 - 230V, AC|1 Year warranty: We sincerely provide with product warranty and genuine customer service. If you have any needs or questions, we will be more than happy to assist you", "user_id": "AFA27PWZ7R6SHPUK6YI3LUPVQAXA,AH3YMZDQPMC4SNFHGLOEIFEO5P4A,AGC7U4WCJ72KSPKZJE6SA6ULCNAA,AF2I6FEF7CCDHSXJQCMHRDLEV4UA,AGZYDFV5X762ARBCKH3CXTG4QUTA,AGBBKPN6FHVMRRHWZVRJ7O45VG7Q,AHON53VQVWWCC3G7B6BF4BE7ZESQ,AG57G63ZBJYDUGVZ2VRDSZD6L4ZA", "user_name": "Placeholder,V P.,sanjay,Amazon Customer,Sweta,J k bricks,Swapnil Patil,Kritika S.", "review_id": "RKYJMDLBEO56M,R376767ZF0GAG9,R34R6IMCCGAV5E,R2JQ1CZWIUOSXX,R30SGGX9LU3IEW,RPP3YL70C1J1I,R2Y8Z95B7LQZHR,RERXVOZZDMCMH", "review_title": "Good,Decent,Ok,Good product,Nice,Good product,Not good as per price,small & elegant hand mixer", "review_content": "Beat with hand blander,Its decent performance,Thik h,Good product,Speed 1 and speed 2 was not working, it starts from speed 3. So returned.,Good and value for money,Not good as per price,Fast delivery. Received on 30.11.22. small & elegant hand mixer with friendly power to beat the coffee, dough, etc. use twice only, too early to respond but still feel, inalsa brand will maintain its repo, overall like this value for money.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/413XAuyrxWL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Inalsa-Easy-Mix-200-Watt-Mixer/dp/B075K76YW1/ref=sr_1_367?qid=1672923611&s=kitchen&sr=1-367"}
{"product_id": "B0BNLFQDG2", "product_name": "Longway Blaze 2 Rod Quartz Room Heater (White, Gray, 800 watts)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|ElectricHeaters", "discounted_price": "₹929", "actual_price": "₹2,199", "discount_percentage": "58%", "rating": "3.7", "rating_count": "4", "about_product": "Power Consumed: 800 W", "user_id": "AFVRAZD6HB5ALMMLJRZYAA45RKFQ,AGUO5ELH4U5ORQ4F4NYJQNZNTX3A,AEKTWPXEMR5QE53HL2AV2SVFK2SQ", "user_name": "Amit,Chahat Goyal,Gurpiyar Singh", "review_id": "R34GHCVBN6M7BX,R3OA62LXAITW86,R3YGN1PYLTA95", "review_title": "Ok product,Worth buying product,Must buyyyyy", "review_content": "2 rods can not be switched seperately, selecting 1 rod always switches on the top rod.,,", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/51y3Y6qZScL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Longway-Blaze-Quartz-Heater-White/dp/B0BNLFQDG2/ref=sr_1_368?qid=1672923611&s=kitchen&sr=1-368"}
{"product_id": "B082ZQ4479", "product_name": "Prestige PWG 07 Wet Grinder, 2L (Multicolor) with Coconut Scraper and Atta Kneader Attachments, 200 Watt", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Mills&Grinders|WetGrinders", "discounted_price": "₹3,710", "actual_price": "₹4,330", "discount_percentage": "14%", "rating": "3.7", "rating_count": "1,662", "about_product": "2 Litres Capacity, 5 Years Warranty on Motor|High Quality Grinding Stones, Heavy Duty Motor|Compact Table Top Design, Coconut Scraper Attachment|Atta Kneader Attachment.", "user_id": "AHWEG7FHG5CEE2TMD524HYGNU32Q,AGYUMZDNBIOODZYCN4GHMJ3F44VA,AEJM34LROKAFVQ432EM4D4JLSOQA,AF5W2TAYXQ3FWMTFIEHR6R2NOCKA,AFH5ZUO3KMVT2SYS6CNMMXZA4SZQ,AH2KFGXW374DTI6UT4U7V3NFJRQA,AFMR44UPPEJS3KH7CZZTLBGUY7RQ,AFUSIVMKLXOVGMV7AEF5FRQGLJHA", "user_name": "Vinod,Gopinath,ravi,Pooja,Kamlesh B.,Anand RB,mahendra pandey,sakthimurugan.M", "review_id": "R138ITHIJ8RJ6M,R1KZ4GHZKT2TPA,R1SUUZASWMKX38,R1UZWXA61RMVAG,R1ITYM212PMU7Y,R3GAC6LEDQRXWV,RCD1ZRKX9XILR,R1JOZFF0PN5PHU", "review_title": "Good,Ease of use,Ok,Very good,Grinding is fine but during grinding little barter leaked from the drum. Kindly suggest.,Good one, but loud.,The quality is good but damaged,Ok 👍👍👍👍", "review_content": "Can buy it,its really a good product for the price,Ok,Very good,Product is nice. I used it for idli dosa barter.Kindly suggest what to do?,The device is good but very loud!,The jar is damaged.,Ok good..", "img_link": "https://m.media-amazon.com/images/I/41-iQHWCwHL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Prestige-Wet-Grinder-PWG-07/dp/B082ZQ4479/ref=sr_1_369?qid=1672923611&s=kitchen&sr=1-369"}
{"product_id": "B09Y358DZQ", "product_name": "Pigeon Zest Mixer Grinder 3 Speed Control 750 Watt Powerful Copper Motor with 3 Stainless Steel Jars for Dry Grinding, Wet Grinding and Making Chutney and 3 Polycarbonate lids - Blue", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|MixerGrinders", "discounted_price": "₹2,033", "actual_price": "₹4,295", "discount_percentage": "53%", "rating": "3.4", "rating_count": "422", "about_product": "[ Powerful & Efficient Motor ] : This Pigeon Mixer Grinder has powerful 750 Watt Copper Motor with 3 speed controls gives an exceptional performance and provides fine mixing and grinding of the ingredients at 3 different speed levels. The motor comes with an overload protector which protects it from sudden power surges.|[ Anti slip handles ] & [ Anti-skid feet ] : The Mixer Grinder jars handles are ergonomically designed for easy grip to ensure easy handling and to prevent slippage while handling the jar in mounting and dismounting the items from jars. Anti slip grips ensures that the machine remains stable where-ever it is placed while using.|[ SS Jars & lids with Food Grade Safety ] : Stainless Steel Jars of mixer grinder will keep the mixture inside the jar from spreading outside and also protects it from the external pollutants. It ensures the quality of your food is well maintained with food grade Stainless Steel Jars and Polycarbonate lids|[ Easy To Clean ] & [Reliability ] : Compact body Mixer Grinder with an ergonomic design allows for perfect usage as well as for easy cleaning. Anti-slip feet ensure not to slide the mixture on the base from the jars.|2 year Manufacurer Warranty", "user_id": "AEP43IVDSJR5UREBLL53W5AJKZTQ,AEJS5VAOH7KD6X2F3TAMXOCXSOPA,AHQ2K3MM7CU5KAOLTRHNV4HHMKVA,AFR7AVNAODFBSW5HPTITQMLUOFKQ,AGFKW6ILYGZKEDCK55ADC6QLYEJA,AE24UFIVBSESSEV7UALTKP7K5Z4A,AHIFIRZZSK7NK4HWJ7FCYSHQ7KKQ,AFHYPBJQA4XGEWJLPUSFVQU2EKXA", "user_name": "Srishti Agraharrie,Priya,Amazon Customer,Honest reviewer,Pooja parihar,vikas,Amazon Customer,YOGESH R JAIN", "review_id": "R1HFQQWKU1B7T9,R3HPSXLWX2RSHO,R2ZFEFLH2H6BOJ,RGRLYUCCNW475,R3V539LPWIH3CD,R2XI5MDOB81641,R22CGQQGZP9IJE,R1UL38ZEBW713N", "review_title": "Not as expected,DON'T BUY pegion products, NO CUSTOMER SERVICE,Not that happy,Undoughtable,Nice product,Value for money mixer,Sound and blade,product have too much scratches on top", "review_content": "Has only one blade in jar and the jar quality is very bad.,After using for one month, it stopped working and amazon customer care is asking to reach out pegion customer care but, i have been calling several numbers from past week no one's responding, no customer service don't buy,I got two medium jars instead of the large jar.,After the 1 month of use.I gifted this to my mother from my first income, till now she dosen't complain anything about this mixer.Don't know about other costumers, but mine product working fine, yeah its true that it makes noise loud but the performance under this price range will cover up the noise.,Good product go for it,Nice,Overall meets d purpose In budgetSound of motor is regularGrinder missing 4 blade inside d jar (all jars wer given wit 2blades only)Feedbak aftr using for 4months,product have too much scratches on top", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31oK2IDhhLL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Pigeon-Powerful-Stainless-Grinding-Polycarbonate/dp/B09Y358DZQ/ref=sr_1_370?qid=1672923611&s=kitchen&sr=1-370"}
{"product_id": "B09M3F4HGB", "product_name": "Borosil Volcano 13 Fin Oil Filled Radiator Room Heater, 2900 W, Black", "category": "Home&Kitchen|Heating,Cooling&AirQuality|RoomHeaters|ElectricHeaters", "discounted_price": "₹9,495", "actual_price": "₹18,990", "discount_percentage": "50%", "rating": "4.2", "rating_count": "79", "about_product": "QUICK HEATING OIL FILLED ROOM HEATER WITH WIDE COVERAGE - Equipped with 13 fins and 2900 W of power this oil filled room heater is just what you need for the winter season. The room heater efficiently heats up and the in-built fan helps to disseminate the heat to the room.|ADJUSTABLE TEMPERATURE CONTROL - The room heater is equipped with 3 heat settings and adjustable thermostat, you can customize the temperature according your heating needs.|NOISELESS OPERATION - Enjoy the cosy warmth of your space in a serene environment. Silent operation makes it ideal for any room. Whether it is work, entertainment or sleep, it won't hinder the ambience in any way.|EASY STORAGE & ADVANCED SAFETY FEATURES - Carving out a comfortable room, desk, or other cosy spot for work, focus, and learning is more important than ever. Add this heater to your designated space for warmth; it optimises productivity.|SAVES ENERGY. Carving out a comfortable room, desk, or other cosy spot for work, focus, and learning is more important than ever. Add this heater to your designated space for warmth; it optimises productivity while also saving energy.", "user_id": "AFIW2LGGEMKYVUE6UG2YLJ73QOLA,AEQFXB3NZOMW4N72EAGVDHFV7M4A,AGRAJW47BFWMQE426JX6TR2BCELQ,AGSJ64KS4SFGZOJTR4TWAMQHNTIQ,AETH7LKNVDPFD2WPRVL7WXXCQXQA,AFDQX4OPUFUN56VXCWO54Z7O2AEA,AGILEHPBZZUJACQFI527X6HPPS2Q,AEAKW6XSSNBTTT2SHXRSIYJ3P2KA", "user_name": "Vivi nyuthe,Amazon Customer,Bala Mahesh Yadav Thotakura,Sunil Singh,Thoughtful_user,Anuj,Mamta,Vikas", "review_id": "R3E3VUOM7IQWIG,RZ2N6DQS7N3YW,R1M6LN7UHLOFD5,RSFAK41WPQNGS,RFTJVE897RMI1,R5BPUDDXQP2LX,R1RNRZ1O5EQLX2,R2RPW3A6WAAR13", "review_title": "A1,AWESOME PRODUCT,Room heater2900watt need separate power connection,Not upto the mark.,Probably the best build in this category.,A good heater with some additional amazing features which make it a best buy,Not as expected,Nice product", "review_content": "Perfect for winter,MEETS ALL MY REQUIREMENT,Good but expensive product with working process,Since I have tried Bajaj 13 fins oil heater, this 11 fin heater is not worth it. The quality is good just for the looks however the fins are very thin and unable to produce the same heat with same power as Bajaj.Although I am comparing it with Bajaj 13 fins still the room size was 12x10ft and borosil heater really struggled to even put the room to a comfortable temperature. With Bajaj it was done within half hour however borosil took even 2 hrs and still we were feeling uncomfortable.The fan placement is low and it doesn't converts that much heat for faster heater even with max settings.Please check both physically if possible, Bajaj is on a heavier side and fins are of good quality.Though I received 2 defective Bajaj heater ( physical dent on body) from cloudtail , I have again ordered the same. Hope this time it turns out to be good.No company is providing the details of the oil quality used in their product. Good luck.,I have used bajaj oil filled heater before. This feels more sturdy. I think havells and borosil make the best quality oil filled heater in terms of sturdiness and finish. Although it’s a simple assembly but still I wanted to buy a good brand as it draws a lot of power and I was concerned about safety.It makes the room warm quickly. Based on the power mode you choose. It will make the room dry. I have seen people using  water vaporiser alongside but on low power I haven’t felt too try in 1-2 hours of use.Overall, since it was borosil, I expected an even more beautiful look but since it works well I am happy. Easily 1.5-2 k costlier than its peers.,Using 3rd Party off-brand blowers for years, I finally took the leap and bought the 13 fin Volcano from Borosil. It has transformed the way with its reliability and efficiency.Packaging:The item was secured and packed very well with amazon packaging along with the original Borosil Packaging.Assembly:Using the provided guidebook was easy to understand. The unit comes as assembled but you have to attach the castor wheels which was pretty easy. Then all was left was to plug it in.Usage:The heater warmed up the 20ftx20ft room with relative ease. It has 3 power levels for the fan attached and a temperature regulator. The heater takes 5-6 minutes to heat up and bring the room up to temperature.Looks:The product looks very well and the black fin structure helps meld well with any decor you have in your room.Additionally, the two-year warranty and the safety features make it a must-buy product for winters.9/10 would buy again,Did not give the expected result,Ordered this OFR a month ago and have had used it since then. It is a powerful product to warm up the room pretty quickly. Although the first few minutes are slow but then it picks up the pace and evenly heats up the entire room. It is quite and doesn't even vibrate. I already own an OTG and an egg boiler and now the OFR. Borosil has stood up to the mark providing good quality appliances at a decent price tag.", "img_link": "https://m.media-amazon.com/images/I/41qqrzjPySL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Borosil-Volcano-Filled-Radiator-Heater/dp/B09M3F4HGB/ref=sr_1_371?qid=1672923611&s=kitchen&sr=1-371"}
{"product_id": "B07VZH6ZBB", "product_name": "Crompton Solarium Qube 15-L 5 Star Rated Storage Water Heater (Geyser) with Free Installation and Connection Pipes (White and Black)", "category": "Home&Kitchen|Heating,Cooling&AirQuality|WaterHeaters&Geysers|StorageWaterHeaters", "discounted_price": "₹7,799", "actual_price": "₹12,500", "discount_percentage": "38%", "rating": "4", "rating_count": "5,160", "about_product": "PRODUCT: Crompton's energy efficient storage water heater with corrosion resistant body|TECHNICAL SPECIFICATIONS: Wattage: 2000 W; Capacity: 15L; Star Rating 5; Pressure 8 bar|3 LEVEL SAFETY: Capillary Thermostat, automatic thermal cut-out & multi-functional valve to provide higher safety|ANTI-RUST: Fitted with specially designed magnesium anode which prevents corrosion due to hard water quality, Body- Plastic|QUALITY COMPONENTS: ISI marked nickel coated special element to provide resistance against scale formation", "user_id": "AHRTYUKNV36J2ZEK4CKJMQOK4S6Q,AGQAYI2H5TL53UE55XVUIDAMSGLA,AEYH6IVYMLPHU62VNOKKM2KTOIIA,AEEWPCT3NI67LDWFLJ7HICLMMZPQ,AEOXDLAGO5YUKIJDGVRZ26GTZNRA,AG6KERF2BWYB52CC56DEC3KZQYNA,AFQNKFOMPJ7YGCSP672YCJQQEVNQ,AGCMYXUQA4TOC4JPIJ2NHHMDMNNQ", "user_name": "Anuj Dhingra (Gadget Gig),AKSHAY KHOWAL,Kiran K.,Sai Deepak Velivela,Rajiv Das,Ashok kumar,Vishal kandare,Gaurav Pachauri", "review_id": "R18A1K5678ELRR,R3VBWUYTKOOUQ7,R320E1OP4NVG4E,R10EY3S2UI2CVF,R3TWPYZY4WV9SK,R2GYN2RG5YXY61,R2Y6MTG252PZ9P,R1IM78YLKWJZ1B", "review_title": "Best for small Family,The Gyser warms up water very quickly but does not hold hot water for long,It's good,Not up to the mark,One day delivery and installation... excellent service,Waranty card not found,बेहतरीन,Good", "review_content": "I have been using this Geyser for almost two months. it heats up the water in just 15 minutes and quite power efficient. Uses almost half a unit for two person. And if you leave it on for the whole day its around 1 unit. Very power efficient. And looks stylish in the bathroom and due to the form factor doest take much space. Go for it . You get all the pipes and Installation material in the box so no need to buy them separately which is the case in some other models.,I had 2 option while purchasing this geyser, Havells vs this one. I opted this one as this was cheaper then its Havell's counterpart but this geyser does not satisfies me at all. The only PROS is its heats up water very quickly but rest is all CONS.I keep the know to maximum temperature but still the light does not move from orange to red even if I put on the geyser for 3 hrs. It does not holds hot water for long. I have used Recold, AO Smith even Amica earlier they were not as quick as Crompton but they used to hold hot water for long. I have another Havells at home whose light goes from green to orange to red to display water temperature.,Paisa wasul hai,The product is not that good , just given 5 star energy efficient, but it takes more time to heat the water, also don’t holds hot water for atleast 6 hrs. Temperature control also not so good , after getting 2-3 liters itself , water becomes cold, even if it is on from 20 min,I’m using ao smith geyser in our one room from five years, no issue, again purchased 2 geysers for other two rooms , one is ao smith and other is this crompton, even though i spend more for this geyser I’m not satisfied. Better go for ao smith or racold..,,Waranty card are missing.,एक होम गीजर में जो होना चाहिए वो सब कुछ है सबसे अच्छी बात है पावर आफ होने के बाद भी गीजर के टेंक में बचा पानी 8 घंटे तक भी गर्म रहता है।,Good product using since 2 months working properly", "img_link": "https://m.media-amazon.com/images/I/31kbrfC16XL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Crompton-Solarium-Qube-Star-Rated-Storage/dp/B07VZH6ZBB/ref=sr_1_372?qid=1672923611&s=kitchen&sr=1-372"}
{"product_id": "B07F366Z51", "product_name": "Singer Aroma 1.8 Liter Electric Kettle High Grade Stainless Steel with Cool and Touch Body and Cordless Base, 1500 watts, Auto Shut Off with Dry Boiling (Silver/Black)", "category": "Home&Kitchen|Kitchen&HomeAppliances|SmallKitchenAppliances|Kettles&HotWaterDispensers|ElectricKettles", "discounted_price": "₹949", "actual_price": "₹2,385", "discount_percentage": "60%", "rating": "4.1", "rating_count": "2,311", "about_product": "Specifications: Power: 1500 watts, Capacity: 1.8 liter, Auto Shut Off with Dry Boiling, Cordless Base: Yes, Overheat Protection for Safety.|Durable and Hygienic: Made of food-grade stainless steel, this is a durable and hygienic kettle to boil water in.|360° Cordless Base: The base of this electric kettle keeps it stable and secure in one place. Also, it allows 360° movement, so you can swivel the kettle around completely.|Dry Boiling Protection: This kettle features an essential safety measure that turns it off if there is no water inside it.|Warranty: 1 Year Manufacturing warranty from the date of purchase.", "user_id": "AH2JOLKV3633COTRT3L6472Q7MIA,AH66PPDVLVKP2O6AYTIGA4LDLOAA,AGQECQXYEAY4SYHRW5NDNF36VDSA,AGE4ASVQOHHGYYYKQOMF2TLIXBRA,AHV4I63UFGYQ7AFWXLTQXSHSXCZQ,AGE23INNJKHQYZTU3WBTNSCAVGOA,AGMBBBIHMGMWKJI5OSFGKWAKJVVA,AHV6JQ726F6FJ2DHW4ZHKMXNUEYA", "user_name": "s_ray77,SUJAN MISTRY,Pankaj,Durga,FAROOQ,jyoti gole,Rohit,Amazon Customer", "review_id": "R2HOIOV2PZY6Y0,R16YJN41HAWT0T,R3V1KGX1M84MDL,R1MJS2XFJ5XTYU,R1QPQWXB4IZHD9,ROZB42OM5ZUZC,R17BVAUSS4GAE9,R2O4T61G3PT1SL", "review_title": "Useful item,OVERALL NOT VERY BAD,Good quality,For the price ok.,GOOD PRODUCT,Review,Good quality,Short cord and narrow mouth.", "review_content": "My only concern is longevity, so let's see how long this one lasts. Otherwise, it's quite quite useful, especially during winters.,Good looking but light weight. Not easy to clean.,Nice product,I bought this as it is made in india. It is light weight which is good and does its job well. The lid must be manually opened and must be pushed all the way up to hold. Initially it fell back but it needs to be push back to hold upright position.Am happy with itafter using it for two days.,Except for the cord length of the kettle which should be a bit more.Otherwise, THANK YOU FOR A GOOD PRODUCT.,Very nice,Good working,Heats well, less noisy and looks elegant. Cord is short and partially opening lid makes it difficult to clean. Has worked well so far.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41RI-hzCnvL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Singer-Aroma-1-8-Litre-Electric-Kettle/dp/B07F366Z51/ref=sr_1_373?qid=1672923611&s=kitchen&sr=1-373"}