{"product_id": "B09V12K8NT", "product_name": "boAt Wave Lite Smartwatch with 1.69\" HD Display, Sleek Metal Body, HR & SpO2 Level Monitor, 140+ Watch Faces, Activity Tracker, Multiple Sports Modes, IP68 & 7 Days Battery Life(Active Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,499", "actual_price": "₹6,990", "discount_percentage": "79%", "rating": "3.9", "rating_count": "21,797", "about_product": "Screen Size: The 1.69 inch HD full touch display with 500 nits of brightness will bring every detail to life!|Resolution: Get sharper color resolution that brightens your virtual world exponentially.|Slim Design: The ultra slim and lightweight design of the watch is ideal to keep you surfing your wave all day!|Sports Modes: Track your daily activity: calories burnt & steps taken. Choose from multiple sports modes which include Walking, Running, Cycling, Climbing, Yoga, Basketball, Football & many more|Google Fit & Apple Health: The watch supports Google and Apple Fit to seamlessly monitor your health.|IP Rating: Sweat freely while you work out with IP68 dust, sweat and splash resistance.|Watch Faces- Customize your style with 140+ based watch faces.", "user_id": "AFHFQB5UN57HBBYIGBV4YYZDXSZQ,AGPBZBEFPFL64PWRZX32JSZUHDMA,AH32ZSUDD2AINXSY42RIVL5RBCIQ,AEGEQUSFQ3L5GTTYJEM34ZLSZN5Q,AEXNZJKAL3YMVOOAUSE3BZFP4JPQ,AELMNMBT5LVUJB7C3PHTT4NTETXA,AENLU2UJ3XK6A2ORODWSHIRNY7SQ,AFZ5LXQHEOBA4QWHTTF3TQNP7XIQ", "user_name": "Aby Jimson,Prasad Pavithran,Mahesh Chandra K M,Pannalal singroli,vinod thonti,Mayank Dunkwal,swarn,Rekha H gohil", "review_id": "R19QUEKHANF087,R2CU03OULJTK2A,R1SHVTKMHHOREL,R16MDWVEULVTGY,R24VBI0XML9AS5,RO1WU1XMSF20C,R17U7AO7GNBOX8,R2HES1EME0OXU4", "review_title": "Overall good except connectivity,Ideal Product,Ok,उपयोगी एवं संतोषजनक,Ok in this price range,Battery,It is a good watch,Nice watch", "review_content": "The watch works fine. Good touch screen and overall features. But the connectivity with smartphone is pathetic. If you prefer a smartwatch which is not intended to pair with you phone then go for it. It works well in all other aspects.,This was indeed an ideal purchase. Good performance, good built, up to the mark functionality at this price. Stable and Sturdy. Recommend. 👍🏻👍🏻👍🏻,Looks ok,हार्ट रेट एवं ऑक्सीजन,Good for normal users.....Not for heavy users like daily activities.....Good looking on hand...App is not working properly some times,The battery power is amazing 👍🏻,It's a good watch but the strap always comes out,Nice watch", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41rxRY5TDSL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/boAt-Wave-Lite-Smartwatch-Activity/dp/B09V12K8NT/ref=sr_1_17?qid=1672902995&s=computers&sr=1-17"}
{"product_id": "B07JQKQ91F", "product_name": "JBL C50HI, Wired in Ear Headphones with Mic, One Button Multi-Function Remote, Lightweight & Comfortable fit (Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹499", "actual_price": "₹999", "discount_percentage": "50%", "rating": "3.9", "rating_count": "92,995", "about_product": "JBL Signature Sound|Lightweight and comfortable: The 3 sizes of ear tips (S,M,L) that are included allow you to choose a size that gives you the most comfortable listening experience even for longer listening periods.|High Clean Bass. Troubleshooting steps : Kindly ensure 3.5mm port on Host device is clean and dust free and 3.5mm jack of the earphone is adequately inserted inside the input device port|Noise Isolation Microphone, Dynamic frequency response range (Hz) 20 Hz – 20 kHz. One-Button Universal Remote with Mic|Quick Launch Access to Google Assistant / Siri|Ultra Lightweight and Comfortable with 3 sizes of ear tips|High Fidelity Twin Cable|What's in the box : 1 pair JBL C50HI headphone, 3 sets of ear tips (S, M, L), 1 Warranty and safety card", "user_id": "AGBB4DAVTI36DUQN2NLQNXJLG37Q,AG5H3U5TC6HICM23GAH5FKKIZAYQ,AF53WDXQTVOHTCIUK5YSGJXGVLSQ,AGVGHUTVQQMXT76XTN2CYSHDUJNA,AHXN6UXEHQZVJHLCNWCYHA2IAZQQ,AGTC2E3OIYPYGNKPF2XISDGZWZEA,AEQJY72BUJBIQCYK6V7CIZFEGFKA,AGS74K5IWCYY7PLGQZR7KGVOPCYA", "user_name": "Pooja,Prashant,Kartikey Singh,Sailendra yadav,SHRINIVAS JAWALKAR,shyam,girishkumarlanka,Nidhi", "review_id": "RW3YCZCKGOBH,R3099XAIXYVYOG,R355B0JH9K3ZSR,RJS13UCRXJ0V3,RVHF9P5OW46KR,R19S4YL4JL81R9,R1OUTZ9YCQLAMM,RGN1P0TZA7RF0", "review_title": "Good,Overall Good,Decent earphones for the price,Worth it,It's just not like that,Good one,Really Good one under Rs 500,On the budget best branded Earphones", "review_content": "It has been only 1 month since I have bought this item so I can't comment on its durability but currently it is working perfectly. Sound quality is good. Fitting in ear is perfect which has been constantly an issue with other earphones I have used till now.I have doubt on its durability because its wires are kind of handle-with-care. If it is durable then it will be among one of the best earphones, I have used till now.,Unable to hear after, 8 months,Good budget earphones for taking call and listening to music/ watching videos once in a while. Be careful with the wire though as it can get tangled easily and is not that strong.,Best buying in these range,The C50 HI is a budget friendly in ear earphone and it really comes at a great price.But the next version of these i.e. C100SI has more value for money factors.Like C50 HI has angled 3.5mm jack whereas C100SI has the normal one and i am not supposed to say this but trust me C100SI has the best best best and superior sound quality if I compared to C50HI.Though it doesn't have a great durability.But if your previous earphones were c100si and you are switching on these then one can definitely notice the difference between the c100si and c50hi although you can adapt the sound of c50hi in nearly about 1 week if you are switching from c100si.To be honest the c100si is literally best in all circumstances such like gaming,Listening to music and professional editing the vocals,mids highs lows are perfectly balanced in c100si but not c50hi.in c50hi mostly when listening to sing the bass was not up to mark and the vocals were so loud that the bass was literally fading main point is that whenever we hit the full volume both of them never distorted any single beat.Hat's off to harman.,Good earphones short time usage.,Its good with very clear voice and average Bass clarity. I am not giving 5 stars because certain Bass can be improved a bit more. Overall its a good one.,Was looking for budget earphones with voice clarity, JBLC50 HI does the work. Except for bass quality there nothing else to complain about.", "img_link": "https://m.media-amazon.com/images/I/31rmf+p45oL._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/JBL-C50HI-Ear-Headphones-Black/dp/B07JQKQ91F/ref=sr_1_18?qid=1672902995&s=computers&sr=1-18"}
{"product_id": "B08W56G1K9", "product_name": "LAPSTER Spiral Charger Spiral Charger Cable Protectors for Wires Data Cable Saver Charging Cord Protective Cable Cover Set of 3 (12 Pieces)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|CableConnectionProtectors", "discounted_price": "₹99", "actual_price": "₹999", "discount_percentage": "90%", "rating": "4.1", "rating_count": "8,751", "about_product": "SPIRAL TUBE CHARGING CABLE PROTECTOR are designed with highly flexible silicone and can be used as phone charger cord protector and phone charger saver to completely protect cables for all devices including, cell phones, computers, laptops, apple / android watches, lightning cables, pc’s, the list goes on and on.|Besides protecting all Your USB cables / cords, SPIRAL TUBE CHARGING CABLE PROTECTOR feels surprisingly nice and is fun to install on any wires end. Use it as your headphone cord protector or charger cable cover. Simply touching it can relieve your stress too! Yet, even better, the Lightning Cable Protector looks super cool. It doesn’t get any better than this!|works with virtually all computer and cellphone cables. You can even use it in almost anything like as pet cable protector, chewsafe cord protector, cord protectors from pets, wire protector from pets and as a wire protector tubing for phone and computer cables.|Spiral Tube charging Cable protector is your permanent fix to all those damaged lightning cables. It perfectly works as a cable strain relief or a critter cord so you won't have to deal with cable repair or iphone cable repair and frayed wire repair.|Wrap the cable protector onto Your preferred cable as an iphone charger end piece. SPIRAL TUBE CHARGING CABLE PROTECTOR will wrap around any wire just like a protective sleeve would but with more mobility.", "user_id": "AFNGZSZUISNZ2SMAN3L3OALQXS2Q,AEL2T4V2QAHYRIJ6BPMOETWMGLIQ,AHEU57WSVYX3MYVUTKXND7722D6Q,AH7GSAGP2FWNNWZHN7Q56Z2AWLVQ,AGIHBFWNPMXWTJOAUVEHA23XKOBQ,AE54CJHDDTC3JOR6UCSVK4UCZTTA,AHXT34K7Q5XLB7MNGS4NFI2VBMVA,AHTP47A2GMNACDBEPESZBPCQI2UQ", "user_name": "Happy customer,Screcko,Alka Agrawal,madhu,Udit Jain,vasuki,Shivansh Rajput,Karthik", "review_id": "R8UDGYG74HT52,R1ZKTL2UFMHHOQ,R2XQ7ANJA4VF12,RNHDS9HCAZYPP,R2GML0ZIF4G3XG,R25B9RAM7E6ERE,R1A8S1062HZ64L,R3K1WGUC05G378", "review_title": "Value for money but,functional,Good,Very easy to use,Good,Good product,Good,Cable protector", "review_content": "Ordered this product for charging cables. The package involved 3 packs containing 4 spirals. However, they sent all the packs containing same 4 colours. The spirals are tight for thick cables but loose for apple's charging cables as they very thin.,very useful product but the grip and the size of it was a bit small for my cable as it couldn't fully cover the entire part of it but nonetheless it's gonna work and im glad i have it as a safety for my data cable. good product.,Good product,If u have a single charger and it’s expensive too then u should try this…. It really protect ur wires,Good,Good product, value for money,It's nice but thoda length or ho sakti h size thoda chota h,Best product for usb and other cables", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41oSVnJMFKL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/LAPSTER-Charger-Protectors-Charging-Protective/dp/B08W56G1K9/ref=sr_1_19?qid=1672902995&s=computers&sr=1-19"}
{"product_id": "B07WG8PDCW", "product_name": "pTron Bullet Pro 36W PD Quick Charger, 3 Port Fast Car Charger Adapter - Compatible with All Smartphones & Tablets (Black)", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Chargers|AutomobileChargers", "discounted_price": "₹349", "actual_price": "₹1,299", "discount_percentage": "73%", "rating": "4.0", "rating_count": "14,283", "about_product": "PTron bullet pro is a 36w charging power car charger passed the rigorous test by USB compliance standard and it's fast and safe to provides you the best possible quick charging performance|Qualcomm quick charge 3.0 technology charges QC3.0 enabled smartphones up to 80 percent faster, up to 4X faster than standard chargers via USB C or micro USB cable (cables are not included)|You can charge 3 devices simultaneously, it features 2 USB ports, 1 type C port, and 36w device output which is more than enough to charge smartphones or tablets at the same time|With a built-in USB Type-C port with Power Delivery (PD), charge all USB-C compatible devices at full speed from this travel-ready car outlet adapter.|It's built-in smart IC chip, ensures complete protection for you and your devices, including over-heating, over-current, high-temperature protection and short-circuit protection|It is compact, lightweight, well build quality and can be easily carried in a pocket, purse or suitcase|Extensive compatibility with USB-C and USB-powered devices including phones, tablets, dash cams, etc", "user_id": "AEIYWH2ASVIR6LTJ2JBXPQLOUYNA,AEYBIV3UZ3VQECGKV6QRO7PLR2EA,AHEAYHNW5FVLH6XD7RRKIG32OUCA,AGKIV4JCOJQGPNWBBKPXVME7T7NA,AH32CT6EKUDWLGELKZDK4TEUWZRQ,AHPRFGJEPXRPFJBR6CEZR45ICAKA,AG4ELQEFRPWHH2ADRUMUJW6XP7JQ,AEVHROK7EARG7XEZSSNEJNP6DPEQ", "user_name": "Rakesh Roshan,Kani,Amazon Customer,Amazon Customer,Cheekoti Rameshwara murthy,MBS GOLD JEWELLERS,Durvesh Sawant,Wilson Rodrigues", "review_id": "R3HLDGIDF7PO8C,R2FBEQYGE0TH2P,R81L413HRWD8B,R3V903TPDK44R2,R38GLLZ84DSEWS,R1GXNHN7WJM2G7,R3RK45ISPYVM54,R125MD72MJH9VN", "review_title": "Good,Good product,Charging well but build quality could be better,Quite nice,Good quality product,Ok,Good Purchase,Built quality could have been better", "review_content": "Had used Ptron earphones earlier. So wanted to tried this one. And it's good,Newly purchased. Not yet used. But looks good and worth for money,Charging well but build quality could be better,Quite nice,this product working fine....,Ok ok,Good Purchase for 300 Rs , its has 1 type C and 2 Regular Ports for Charging with Good Speed and Also Looks Good,While it's priced very economical the built quality could have been better given the brand", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41LZP1CmYRL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/PTron-Bullet-Pro-Lightweight-Smartphones/dp/B07WG8PDCW/ref=sr_1_20?qid=1672902995&s=computers&sr=1-20"}
{"product_id": "B01L8ZNWN2", "product_name": "HP v236w USB 2.0 64GB Pen Drive, Metal", "category": "Computers&Accessories|ExternalDevices&DataStorage|PenDrives", "discounted_price": "₹475", "actual_price": "₹1,500", "discount_percentage": "68%", "rating": "4.2", "rating_count": "64,273", "about_product": "Durable metal Charming appearance which brings a great sense of style|Electronic plating after printing technic (Anti-fake). Other Features : Plug & Play|Lidless, compact design with integrated strap-hole, Temperature Proof, Shock-Proof, and vibration-proof|This pendrive is compatible with operating systems such as Windows 2000/XP and Vista, Windows 7, 8, 10 and MAC operating systems 10.3 and above. The HP V236W 64GB Pendrive has a minimum write rate of 4MB/sec and a read rate of 14MB/sec|Durable metal Charming appearance which brings a great sense of style|Electronic plating after printing technic (Anti-fake). Other Features : Plug & Play|Lidless, compact design with integrated strap-hole, Temperature Proof, Shock-Proof, and vibration-proof|This pendrive is compatible with operating systems such as Windows 2000/XP and Vista, Windows 7, 8, 10 and MAC operating systems 10.3 and above. The HP V236W 64GB Pendrive has a minimum write rate of 4MB/sec and a read rate of 14MB/sec", "user_id": "AH3VUICGCKITW2W3TEED2EIY3ZTQ,AGTVGGF42U3KPHT3BTNHNX73XSVQ,AHMMC3QMOKVDBOOVOHAFZSCLWDAA,AGRHECE4JDSOZKHEAH5YNWV6YNKQ,AGIL2JPFUVXPBA4PNMMVAIPXAKWQ,AFPOLXH4MXKCJI33QBTKLOA25A3A,AF5M3QNBEEXBHH6BOPCHIU7V2WVQ,AGWVF275SEYSCYQXQFO7KEL5AAQA", "user_name": "Varun,Ankit maurya,GANESH T V,Ravi,Amazon customer,Vijayaraj N.,Amit Chavan,Hkpatel", "review_id": "R3SSOBQITYNPKB,R3A4C1P3IDXTAD,R3W0T7AI69710R,R33EXPRT4EBMKP,R36CM7BFMNFGKB,RV1VPXNF6R439,RK6F5JOI2TI2P,R1URGIVAZHUKNJ", "review_title": "Solid and stylish, but too tight in usb port, average performance.,Good product,Slow,It works everywhere except for car stereo,ONLY 57 GB,Good,Good,Nice pen drive", "review_content": "Got 2 of this 32GB HP v236w pendrives this morning. Review is based on testing done the same day:Summary:The product is genuine and sturdy, but the performance is just about average, based on a random file copy performance to fill the entire space.Pros & Cons (comparing with SanDisk Cruiser Blade 32 GB) :Pros-1. Solid body, looks and feels great.2. Read speed is fine (22 MB/s).3. Product is genuine, covered under 2 Year manufacturer warranty.Cons -1. Fits too tight in usb port, thus causing more wear to the port and may even damage it if not used carefully.2. Capacity is 31 GB (precisely 31042043904 bytes), not 32 as advertised. In windows it'll show up as a 28.9 GB drive compared to 29.8 in Sandisk. No big deal, just a technical observation.3. Write speed (3.3 MB/s) is not bad, but slightly inferior to its close competitor Sandisk cruiser blade which easily gives 4 to 4.4 MB/s for the same test.4. Warranty is only 2 years, compared to 5 years on Sandisk. But since almost nobody claims warranty after 2 years, and besides- the plastic body of Sandisk gets physically damaged in 2 years anyway, so it's okay for me.Bottomline:It's good enough for casual users, maybe chosen over Sandisk for its look, feel and sturdiness. Frequent users may want to look for better options- with easier port fitting and better write speed.Details:The product name is HP v236w as shown on its packing (the images in listing are correct) while its part number is FD236W-32, so slightly confusing but both are the same thing.Testing whether it is genuine or fake:The bottom of the hologram sticker on the packing has a silver layer with \"scratch and check\" written on it. Scratching it reveals a 20-digit code beneath it, and the right edge of the sticker has the url \"www.pny.com.tw\" to verify this code. Go to support > product authentication page on that url. That page contains instructions and explanation of the results that you may get. Mine were originals, with the codes tested for the first time (repeat test result will be a warning that the code was tested before).So that means it is covered under 2 year manufacturer warranty, as declared by hp for Aisa Pacific region.Design and build quality : Sturdy, stylish but with a design flaw-It is exactly as shown in the picture. The body is a solid steel case with open front and the back sealed with a black plastic cap. The plastic back fits perfectly and gives it a stylish look, though it may come off later. The HP logo, product code etc are embossed on the steel body so likely won't be erased with time. Overall, it looks and feels great. The flaw I noticed was that it takes significantly more strength to push it into the usb port, compared to other usb devices like generic usb cables or usual plastic pendrives like Sandisk. You almost have to fight with it to push it in or pull it out. This means its frequent use can wear out the usb port too soon, or may even break it if not used carefully.Capacity : 31 GB, not 32, will appear as 28.9 GB in windows-It is advertised as a 32 GB drive but the actual capacity is 31GB, and yes, I'm fully aware of the decimal vs binary calculation difference, I'm a hardcore linux user. To be precise, its exact capacity is 31042043904 bytes (on both pendrives I tested). So in windows it will show up as a 28.9 GB drive. In linux it will show up as either 31 GB, or 28.9 GiB (binary calculation like windows). For comparison, my 32GB Sandisk shows up as 32010928128 bytes, or 32 GB, or 29.8 GiB. This loss of 1 GB in a 32GB pendrive is no big deal for me, just a technical observation.Performance:Read speed: about 20-22 MB/sWrite speed: about 3.3 MB/sTested with : a collection of ISO files ranging from about 350MB to 4GB, along with a few smaller files like pdf or txt. Total size of the collection was about 30.2 GB (28.2 GiB).I did this testing on linux, so to be fair, the write performance may be slightly better on windows as it works better with fat32 that the pendrive comes formatted as.(Edit: No performance difference on Windows either. Formatted as exFAT on windows 10 to make it multiboot with YUMI. Read-write speeds were same while copying ISO files to it, or reading them to load in memdisk while booting.)I could do more accurate testing with tools like dd command but didn't bother as the difference usually isn't very significant.,Ups.....The product is very good, i mistakenly washed it 8n washing machine with my pants but it is still running like new. No data loss problem or data corrupt problems i have faced yet.Downs......The only downside is this pendrive is little slow because of technology 2.0(3.2 is newer one)And second one is not affact your data at all.. the silver paint on pendrive is vanishing time by time and it is now turning black,Product is good but slow,Storage is good but doesn’t work for car stereo,57 GB OUT OF 64,So far so good,Good product,Ok", "img_link": "https://m.media-amazon.com/images/I/31febYa30qL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/HP-v236w-64GB-USB-Drive/dp/B01L8ZNWN2/ref=sr_1_21?qid=1672902995&s=computers&sr=1-21"}
{"product_id": "B009VCGPSY", "product_name": "HP X1000 Wired USB Mouse with 3 Handy Buttons, Fast-Moving Scroll Wheel and Optical Sensor works on most Surfaces (H2C21AA, Black/Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹269", "actual_price": "₹649", "discount_percentage": "59%", "rating": "4.3", "rating_count": "54,315", "about_product": "3 buttons improve productivity;Optical sensor works on most surfaces|The sleek and modern HP Mouse X1000 adds an instant touch of trend-setting style to any work space .|Glossy black and metallic gray shine with sophistication|3 years manufacturer warranty on the device from the date of purchase|Operating System: Windows Xp;Style Name: 1600 Dpi", "user_id": "AEKLQGYWRYPMVY7BPBGHFZHW2KHQ,AFY6F4SOQGV36CVSEIW32NCNCSUA,AFZJRXAD3NPFKJU56SZBKYK3X4DQ,AHPF7KBSD6D2KESY7LO7JWUYU6IA,AGCILAMQ3VYCN54F3LUXGIFBXTSA,AGE7AOWKJLOVFXMMTBYYLT35OEXA,AGWQVVOQMKQDKPGOT66L7MEXJXIQ,AFLSABEQELMYX7MQMC76CE3YZA4Q", "user_name": "Shridhan Varadkar,Mahalingam,Rajender Eslavath,PRADEEP YADAV,Saravanan,Divyansh,Maninder S.,Rahman", "review_id": "RZK0M87UXFG2,R3AZ8CAEQNP5IQ,R129CVNZPQBGK3,R1ENQGYVMS224D,RFZOVKT1IXFRY,R1SI1FFO31ZKVB,R2AMJ2PSF5B54Y,R5IR2JMR7OMZK", "review_title": "Decent mouse from trusted brand,Value for money,Good,Average mouse.,Good,Cute,Its a good mouse for normal usage... loved it.💕,HP X1000 Wired USB Mouse", "review_content": "The mouse is decent for its price of 269I don't usually use Windows I'm using this on my Linux OS and its works fine on Arch Linux so I'm sure it will work fine on any Debian-based distro as well.First impression - The size is a bit smaller so it will take time to get used to it The scroll wheel is little wobbly Buttons travel of the button is bit too much considering its small form factor*I will update my review after using it*,I have been searching for this kind of small mouse which is very handy to use. Value for money.,Just good as in this price range,This is nice product in low cost.,Given price, Better one definitely.,Little one,Overall good product,Its easy to use.", "img_link": "https://m.media-amazon.com/images/I/31plkeAvAQL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/HP-X1000-Wired-Mouse-Black/dp/B009VCGPSY/ref=sr_1_22?qid=1672902995&s=computers&sr=1-22"}
{"product_id": "B0B296NTFV", "product_name": "Portronics Toad 23 Wireless Optical Mouse with 2.4GHz, USB Nano Dongle, Optical Orientation, Click Wheel, Adjustable DPI(Black)", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹299", "actual_price": "₹599", "discount_percentage": "50%", "rating": "4.1", "rating_count": "1,597", "about_product": "[WIRELESS FREEDOM] - Enjoy up to a 10-meter wireless connection with the Toad 23 wireless mouse’s tiny plug-and-forget wireless receiver. No software or driver installation needed. The mouse automatically connects to your computer system. It is ready to go when you are.|[CARRY IT ANYWHERE, EVERYWHERE] - Portronics Toad 23 Wireless Optical Mouse is the perfect accessory for those who travel for work, executives who give presentations, or anyone who wants greater control and freedom. With its compact design, it easily fits in pockets.|[ERGONOMIC DESIGN] - Designed to keep either hand comfortable. With the click wheel, Toad 23 becomes easier to use with a third click button at your disposal.|[HIGH-SPEED OPTICAL MOUSE] - The 2.4 GHz operating speed of this wireless mouse sends quick signals to the device. With the button to adjust DPI resolution, now adjust your mouse sensitivity as per your requirement.|[30 LAKHS+ CLICKS] - Once you buy Toad 23 Wireless Optical Mouse, you don’t need to worry about its durability. With a life of over 30 lakhs clicks, this wireless mouse is highly durable and delivers optimal work quality to the users.", "user_id": "AGORBC2ADNWTLGRWKCZRO7GOG7RQ,AHW6N3FDZXLXEEXO53Q3SMVFLCDA,AFLGGMV4SBRWIXXHBCHESRA5WMVQ,AHXAAOXPYBOJOTHOOTDEEPQJ7FVQ,AFNROTTTTJQQPZPRJWWPSPBEPVQQ,AHKEHV7YSGK2ZCMEUQYS6LJNURKA,AEFXAZ2UATTLLEZX44V5WMEGNS4A,AHERJ7CWJFLTCL3H64F27OBZBHBA", "user_name": "Sandip Roy,Neelakantam varsha,Rohit S. Rathore,Salman Siddiqi,Anil Kintali,Vivek,Vishal S.,Supriya Patra", "review_id": "R1Y9N553TGL8LN,R28ZACVW980ACH,R2SPQPMXFCB67B,R2L2KO1KH9FLRI,R37SFSAVVH051A,R15PGRIFZVLZLP,R3O0LVO6BNKANJ,R11LCNI4PZLK5B", "review_title": "Noisy clicks - otherwise fine,nice one,Portronics \"An New Player in the Field\".,Good Built Quality & Smooth Experience,Good Pricing, Light Weight and Excellent Functionality,Effective Sleep Mode,good,Nice and comfortable", "review_content": "Light weight. Easy to hold. Clicks are a little hard. Sleep mode fine - there's a switch on the back. Just remember this is not a silent mouse, and will make loud click sounds.,worthy easy to handle,Product is completely satisfied from Portronics. I never thought that this company would be near to hp or Dell if we talk about computer peripherals, but portronics changed my thinking. I appreciate this.Mouse is good and working smoothly.,Value for Money,Good Pricing, Light Weight and Excellent Functionality. Sleep mode is Good. Should be used with Duracell...,Pros:1. Design is good, small and comfortable to use.2. Sleep mode is very effective. Can save battery.Cons:1. If your mouse in bag and you turn on your PC it will get connected and stay on if clicks are happening due to movement inside bag.2. Not that much silent clicks. HP mouse was better.3. Even with this effective sleep mode. Its battery gets drained too fast.Conclusion: Its good for use and for money. But if you're working professional i would suggest buy an rechargable Mouse. Can save your spends on AA battery and your ways to shop.,nice product,Its have on off switch for saving battery life. and product is fine according to price", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/218fOqSir3L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Portronics-Wireless-Optical-Orientation-Adjustable/dp/B0B296NTFV/ref=sr_1_23?qid=1672902995&s=computers&sr=1-23"}
{"product_id": "B09NVPSCQT", "product_name": "Noise ColorFit Pulse Grand Smart Watch with 1.69\"(4.29cm) HD Display, 60 Sports Modes, 150 Watch Faces, Fast Charge, Spo2, Stress, Sleep, Heart Rate Monitoring & IP68 Waterproof (Jet Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,599", "actual_price": "₹3,999", "discount_percentage": "60%", "rating": "4.0", "rating_count": "30,254", "about_product": "1.69\" grand display: Get the rich immersive viewing experience on the 1.69\" LCD display.;60 sports modes: Take your pick from a wide range of 60 sports modes. Charging Time 2.5 hours|Instant charge: Now enjoy more than a day’s worth/25 hours of battery in just 15 minutes of charge. Battery Capacity: 260 mAh;150+ cloud-based & customisable watch faces: Choose from 150+ cloud-based and customisable watch faces and change your look to suit your outfit.|Noise Health suite: Get valuable insights about your health from Noise Health Suite featuring 24*7 heart rate, stress, blood oxygen, sleep monitor and menstrual cycle tracking.;Quick-replies to texts and calls: Stay in touch with the world with quick replies available for Android.|IP68 waterproof: Live your life the way you want to, thanks to the IP68 waterproof rating.; 7-day battery: Charge your watch once and go about your week without a hitch.|Connectivity Technology: Usb; Compatible Devices: Smartphone; Included Components: ‎Smartwatch, Magnetic Charger, User Manual, Warranty Card; Item Type Name: Smartwatch", "user_id": "AF3JE3MHGVCOATHASUTMN3VGF3UQ,AEDSNOOD2D6SJAET2BTNBHLV2SSA,AGGTMAPT4WBWP2C62I6CGW22QNCA,AGC6NVLEXXVXAOMXP46RL2622EBA,AFMZPE7XRDTD4DOUAAMZOME6HG7A,AFOTHR4JPCQC4JXBR3WV4C6T5XHQ,AEJMCBDH3VXRL4SPYOC23J4OG6OA,AFE2254KL46HW7HEMQMQAGTC2LUA", "user_name": "Ranjitha Parida,Shubham Pawar,Arul,Lokesh K V,Nandita Talukdar,Sushma Pradhan,Amazon Customer,Datta Dhanwate", "review_id": "R3B5HP4PJ8JIOG,R2NS7Z2XUJL73H,R3DLYP0JW3PWDP,R3HWHOM95KCAZV,R2EVYBZOHRZ8NQ,R2U4UV55GHL0AB,R2E6IQWP86JIVZ,R225NQB3ASPXBV", "review_title": "Ranjitha,Good one,Best One!!!,Good and average usage,IT'S BEEN GOOD,Good,Overall good product,Nice", "review_content": "Battery life is low,Worth purchase,Good performance at this price range,A economical product to buy for average usage of checking time, heart monitoring, steps track, etc.Battery backup great single charge stands for min 3 days.Recommended only for simple use and show off.,First of all, this watch is budget friendly.watch faces - the app has a large number of watch faces step track - not that accurate but that fine• weather forecast:- 100% accuratesleep - pretty accurate information Overall, the experience is pretty good.But but but, The battery life is not that good only 4 days of battery backup.,Nice product,Overall good product to buy,Good product", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41qqmdUWnhL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Noise-ColorFit-Display-Monitoring-Smartwatches/dp/B09NVPSCQT/ref=sr_1_25?qid=1672902996&s=computers&sr=1-25"}
{"product_id": "B09YV4RG4D", "product_name": "Fire-Boltt Ninja 3 Smartwatch Full Touch 1.69 & 60 Sports Modes with IP68, Sp02 Tracking, Over 100 Cloud based watch faces - Black", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹1,499", "actual_price": "₹7,999", "discount_percentage": "81%", "rating": "4.2", "rating_count": "22,638", "about_product": "Fire-Boltt is India' No 1 Wearable Watch Brand Q122 by IDC Worldwide quarterly wearable device tracker Q122.【1.69” HD Large Touch Screen】- Fire-Boltt Ninja 3 comes with a 1.69” HD Full Touch Display for smooth swipes and clear vision;【SPO2/ Oxygen, Heart Rate】 - Fire-Boltt Ninja 3 Smartwatch comes with real time 24*7 SPO2 / Blood Oxygen tracking, Dynamic Heart Rate Monitoring (If a patient is suffering from Covid 19 please use a medical device prescribed by the Doctor)|【60 workout modes】- This smartwatch consists of 60 sports mode to track. Keep a track of all your activities and compare history to analyse your performance. Count steps, distance, and calories burned.;【IP68 Water Resistant】- This smartwatch can withstand dust, spills, raindrops and is sweatproof too|【POWERFUL BATTERY】 - About 7 days battery life and a Standby Time of 25 Days 【Multiple Watch Faces】- Unlimited Customized Built in Watch Faces and also multiple watch faces through the app;【Stay Social Stay Updated】 – Inbuilt Social Media Notifications.|【All In One Smart Coach】 - Track your Daily Steps, Sleep, Fitness, Sports, Heart Rate and SPO2 【Enjoy Music And Camera Control】 【IP68 Water Resistant】- This smartwatch can withstand dust, spills, raindrops and is sweatproof too;Clasp type: Tang Buckle; water_resistance_level: water_resistant. System requirements: Compatible with android 4.4 or above, iOS 8.0 or above, Bluetooth version 5.1 or above.|Case Material Type: Plastic; Connectivity Technology: Bluetooth; Compatible Devices: Smartphonetablet; Band Material Type: Silicone; Color Name: Black; Human Interface Input: Touch Screenbuttons; Item Type Name: Smart Watch; Included Components: 1 Smartwatch, 1 Manual, 1 Magnetic Charger, 1 Warranty Card; Band Color: Black", "user_id": "AH2OARRWRYKQNYKCWGQKO3NOINQQ,AFIIBGWYNYPKBPVV3YRZPI3PYGBA,AF6HCCU2LSBC7VI7PXDP7BV234VA,AFOFD4PXG6Q4MMOSO5DL3Z6SPH3A,AFJLVCFIQOLK52GX6GEPNDVDXMLQ,AEQQH4MFXL57BHAPR5HEDWJ7IYSA,AHKFAQZRUQBRNNHBMARKC5YBCLBQ,AFU4L7YEY73K63B4VWGPBWQVAYWQ", "user_name": "Rahul Singh Rauthan,Sanjoy C,Prashanthi,Aditya Singh,Satyajit Patale,Owais,Amazon Customer,Himon Roy", "review_id": "R2VEHBS4GTI9SH,R560D18O1BJM7,RYPXAOQI77XRF,R2T1AP2XBIAQBK,RU2RYKNTJU52I,R3D6UA9AB1KZ5D,R1YFZYNSZI9FAG,RQU8SHDXBG8NZ", "review_title": "Premium looking watch,Excellent Product,The Tracking and touch would be better,Bluetooth connectivity,Very good,The watch is good,Felt Good,Not bad", "review_content": "Its only 4 days since we are using the product and based on so far usage, review is as below :PROS :1) Looks, it looks premium.2) Features at this price range3) Battery : It seems as if the battery will easily last for a week or more with normal usage ( Have closed all notifications which saves battery )4) Steps Accuracy : Will give 8 out of 105) Magnetic charger ( easy to charge )CONS :1) Have not noticed anything till now.,I ordered 2 watches for my wife and sister. Got it at the price of 1500. I am always a fan of Firebolt. And ninja 3 is very good. Touch responce is good. Good battery life. Sleep track is very occuracy. It has all necessary features and those are quite accurate. It's light weight and looks good. Over all it's an excellent product at this price.,Touch screen is not so good it takes time may be i need to use it for a while for better experience,I like the sleep tacking , heartbeat measuring , Spo2 and exercise tracking .I dislike the bluetooth of the smart watch only .  I use this watch for exercises,Battery is goodTouch screen is niceAll fixtures are very good,I like the watch style and charging is so fast,Firebolt Ninja 3Felt Good  for the watch , simple and easy,Its good, value for money, overall performance is good.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41ApzUQQFVL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Fire-Boltt-Ninja-Smartwatch-Sports-Tracking/dp/B09YV4RG4D/ref=sr_1_27?qid=1672902996&s=computers&sr=1-27"}
{"product_id": "B07TCN5VR9", "product_name": "Boult Audio BassBuds X1 in-Ear Wired Earphones with 10mm Extra Bass Driver and HD Sound with mic(Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹329", "actual_price": "₹999", "discount_percentage": "67%", "rating": "3.9", "rating_count": "77,027", "about_product": "In-line Controls: Answer/reject/ calls, play/pause, voice command.|Ergonomically designed drivers: Aerospace grade AL alloy drivers give the best acoustics, 3D HD sound and a punchy bass. IPX5 Water-Resistant|Ear fins for Sport Fit: Ear loop hold your buds in ear stably (colour of the ear loops may vary), perfectly fit for running, climbing, hiking, cycling etc|Extra Bass: Boult’s Neodymium technology enables drivers to deliver extra punchy and deep bass with accentuates the warm mids and crystal clear sparky highs|Built-in Mic: Condenser microphone for HD calls and Siri/ Google assistant voice command|Lightweight , comfortable & premium metallic finish, Tangle Free", "user_id": "AECPFYFQVRUWC3KGNLJIOREFP5LQ,AHHURVABUYFBH5VMO37ELU6VL4BA,AGINNSDVZYV5ZKNNIJO7GL2ODKJA,AHGTFXNFYDEBYKFIM5AGTVJHLQWQ,AETX622QBRE6A5D6JOV5JW3NDXUQ,AGJDDBKFP2QLF76TQ4G2LWTVVXLQ,AFYQCTYLY5N5ZAB2DBAKWUZNBF7Q,AFZQHGNNUAQ2MMHXAE3IUISW6OFQ", "user_name": "ArdKn,An Interested Customer,Kiran Kumar,Jaya,Aditya Tapase,Aniket,noor,Rohit Shariya", "review_id": "R2GVOJLXANNFG2,R3CY1HGOV9WMQT,R7U8B1E7W8E54,RYB8ZW396HQB,R3790HUAN7KW93,R1IN06KIK8ENHU,R1UXT7KA6M4R0Z,RNTYVAAWTJ5CE", "review_title": "A Good wired headset in budget.,They Work Well and Are Reliable,Volume is not as expected,Good sound but too much of bass annoys,Boult Audio Bassbuds X1,Pretty good earphones, but....,Nice Earphone , boult audio X1,Ok", "review_content": "This is my first product from Boult. I wanted a wired earphone and when I searched on Amazon I found Boult in such a low price and I ordered it. Recieved it today.Checked it by connecting to my phone and I was surprised by the audio quality. This is a nice product in this price range and the mic is also good. The build quality is average and you can't complain considering the price. It also has a clip to attach the earphone to your shirt like the good old Nokia days. It has total 3 pair or ear tips (2 in a zipper packet and 1 already attached to the earphone).  The manufacturing date is March 2022. So, it's quite new actually, not an old stock. It also has that anti-slip ear hook, which is an added advantage. In general, it is a good product for this price.,I was looking for reliable Bluetooth earbuds on a budget, and settled on these. Personally, I am pleased with them. I have been using them for almost four months now, including one month when they saw around 12 hours of use per day.PROS:▪ Comfortable.▪ Elegant and sober appearance.▪ Reasonable battery life. I would let the earbuds recharge at, for example, mealtimes.▪ Decent range. Going a few meters into the next room, with a concrete wall in between, was no issue.▪ The battery status of the dock is shown by a series of LED blinks. Simple and practical.CONS:▪ Mediocre phone calling quality. In particular, the microphone. The few conversations I had using these went successfully, so this was not a deal breaker, but the clarity was not the best for sure.The touch controls were initially a drawback for me, but I got used to them. Also, this product does not come with a charger. Either charge off of your computer, or buy a charger with the recommended electrical output. As for the sound quality, it is acceptable, not superlative. I have listened to music, and I have watched films and YouTube videos, with no problem.As a final note, I prefer this type of earbud over the in-ear type, because I find it more hygienic. Wiping with a clean cloth after each use, and leaving the lid of the dock open for some time, should help to slow fungal growth.,Very Good Product, nicely fits in the ear and comfortable .The Volume seems to be a little low at the highest.But, A good Buy,Sound quality is good everything is balanced but bass dominance is too high and couldn't hear the treble and other notes,very good bass quality And Worth for money earphones I ever Buy.. also Product Quality is awesome 🔥❤️,it doesn't fit as snugly in my ears, maybe it is cause of greasy ears, but the product is good, highly recommended,,Bolte audio bass is very good", "img_link": "https://m.media-amazon.com/images/I/31DbAD6EoCL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Boult-Audio-X1-Earphones-Cancellation/dp/B07TCN5VR9/ref=sr_1_28?qid=1672902996&s=computers&sr=1-28"}
{"product_id": "B00ZYLMQH0", "product_name": "Dell KB216 Wired Multimedia USB Keyboard with Super Quite Plunger Keys with Spill-Resistant – Black", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Keyboards", "discounted_price": "₹549", "actual_price": "₹1,799", "discount_percentage": "69%", "rating": "4.3", "rating_count": "28,829", "about_product": "DEVICE TYPE: Keyboard|CONNECTIVITY TECHNOLOGY: Wired|INTERFACE: USB|HOT KEYS FUNCTION: Volume, Mute, Play/Pause, Backward, Forward|KEYS STYLE: Chiclet", "user_id": "AF2PEMNSWZSUIHRAPJGOPJ7GAF6A,AHJATMZUL2L2MVZDRBBE2YCLSDUQ,AHMCOOZB4T62PFVOC5KYTRN7AKCA,AHO6HF6W242DPCOUL337SAZ4RFWA,AEPIMKMLGRFWLU7CETWUPBCLFR7Q,AGT4OV5ZEJELU6LGJ3SVHQBHUBYQ,AGBJZG3XMZ3WPI7FY2DLYYXSBUNQ,AHG4NWCAUQ7X2Q2OYOIB5WRNPHWQ", "user_name": "Minhaj Mohd,Amazon Customer,Placeholder,Ismat parveen,Animesh,Subham,hanmandla raju,vishal charikar", "review_id": "R1REJSSQVMNGVO,R33WYRQ1J4RZHO,R3ECO7HPNMHBTT,R1GORSR46QQ6SN,R1O350T6VW5RR3,R2BXJ480ZVSUMH,R28KMQ1TUV7E2Z,R3KCC7HPRPOF0C", "review_title": "Sturdy key-board for office use,Smooth keyboard,Good one,Low budget but good product,Good,Good product,Good,good", "review_content": "Ordered it for my home office and have been using this for almost 10 months, it looks good and there is no lag in typing and the keys are comfortable while typing.,Nic product and smooth keyboard! Effortless typing and keys are aligned exactly as per my expectations. Not happy with the packaging and I hope realises from next order.,Felt happy to see Dell on its body; I think it is genuine. it worked from day one; future will tell how long it satisfies me. 'am using it with an old laptop.,Good for typing, and working very smoothly...,Good p,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71clegoImjL._SY88.jpg,Good product,good", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/4178Hx01kZL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Dell-KB216-Wired-Multimedia-Keyboard/dp/B00ZYLMQH0/ref=sr_1_29?qid=1672902996&s=computers&sr=1-29"}
{"product_id": "B09YV4MW2T", "product_name": "Fire-Boltt India's No 1 Smartwatch Brand Talk 2 Bluetooth Calling Smartwatch with Dual Button, Hands On Voice Assistance, 60 Sports Modes, in Built Mic & Speaker with IP68 Rating", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹2,199", "actual_price": "₹9,999", "discount_percentage": "78%", "rating": "4.2", "rating_count": "29,478", "about_product": "【Bluetooth Calling Watch】- Fire-Boltt Talk 2 enables you to make and receive calls directly from your watch via the built-in speaker and microphone. This smartwatch features a dial pad, option to access recent calls & sync your phone’s contacts.;【Dual Button Technology】- This smartwatch has dual buttons to carry out the tasks more efficiently and easily. Use the first button to change the menu style and to return to the first page, use the second button to quickly land to the exercise page|【Voice Assistant】- Command your mobile phone with your smartwatch, the watch has a voice assistant built in to make work easy and fast. Tap on the AI feature to activate the mobile phone voice assistant and make calls smoothly, or hear the weather update;【60 Sports Modes】- Track 60 different sports mode like running, walking, climbing, kabbadi, cricket and many more, get the benefit of every sweat and calorie lost【IP68 Water Resistant】- This smartwatch can withstand dust, spills, raindrops and is sweatproof too.|【Built In Mic & Speaker】- Enjoy listening to your favour ite tunes on the watch and experience HD Calling through the built in Mic;【1.28 inch HD Display】- This smartwatch has a 1.28” TFT LCD Full Touch Display with a 2D High Hardness Glass for super protection and a high resolution of 240*240 pixels 【Full Metal Body】- This watch is long lasting and durable with its metal body feature|【SPo2 Monitoring】- Monitor your blood oxygen levels any time anywhere. 【360 Health Ecosystem】- With this watch track your heart rate, calorie, step count and multiple sports modes with easy touch;【Play Games On Your Wrist】- Play 2 mini games in your pastime or leisure time.; 【Smart Notification】- Get all your mobile phone notifications on the watch and stay updates about trends, meeting emails and much more. 【Remotely access smartphone features】- Click pictures, change music tracks on the watch with a single touch.;Clasp type: Tang Buckle; nanwater_resistant. System requirements: Compatible with android 4.4 or above, iOS 8.0 or above, Bluetooth version 5.0 and above.|Compatible Devices: Smartphonetablet; Band Material Type: Silicone; Human Interface Input: Buttonstouch Screenmicrophone; Band Color: Black; Color Name: Black; Included Components: 1u Smartwatch, 1u Charging Cable, 1u Manual; Item Type Name: Smart Watch", "user_id": "AEJQT5NMTAM2ZRPQDNGLOL6NTKRQ,AHIKFQ5VP6QGYQK3GJICMV4U7ULA,AHWEF3345QLMPIGGOW6VUYJZEFDQ,AFLEQIFCKD7EUBQTHJ7T7XF4MWMQ,AGOYRCQ3PNL2AIXWYLPSXVQYGJEA,AHLORXFV6I3JRBNER3O6DIOVWM5A,AH445QA3XXIV6FPASBU6OBICSLYQ,AHT6SE3YNTHR76UT4QDQKBHEH5EQ", "user_name": "Deepankar G.,Babu Singh Rathore,Liton Das,Biswajit Udayabhanu,sameer shaikh,Anil p.,Anoop Sharma,Rameshwar Singh Rathore", "review_id": "R26YAKWWPQSNL,R30L263BU0PTZP,R1A8G9G8J5Z3V5,RBTZE0Y27F7IZ,R2HS8RN6NBKP6Z,R39640821J2S6S,R75IA3ZAEBTFU,RCVN98N40B1C5", "review_title": "Worth the price, expecting good performance on extended use,According to this price is value for money Good product,Good budget calling smart watch.,Just Go For It,It's a mind blowing watch,It's good product in this range,Very Good watch in this price Range,Good Product as per the price charged", "review_content": "Received the product today. The packing was intact though I found watch not at its proper place. It fell down inside the box and found the inner holding box damaged also. Not expecting any kind of tampering but thought to share the product packaging. Overall nice product, will share detailed review once use it for atleast a week.,Good watch through fire 🔥 boultI am impressed for this watch is so computableand all features are properly working like mean feature voice calling are properly working andThis price range are no any brand are give this feature I am Happy for this watchThank you Fire 🔥 boult,Pros: The phone supports both phone and apps calling. Has long charge. Phone finder,  phone camera shutter are good features. Beautiful looking watch.Cons: Not a full screen display, display is smaller than the watch. My watch is not center alligned. Limited number of watch face. Sometimes tends to call on recent number with false touch. Phone book should be a little larger than 8 numbers.,Just bought it ,so my review is basically the first impression.I will write a detailed review after few days of use. I like the style and it looks good. So far touch operation is also good,It was a awesome watch... I liked it sleep monitoring it's accurate. According to me this worth buying and I would suggest anyone who is reading this review to go ahead and buy this watch,It's good product in this range because I have one more of pebble smart watch in same price range but after using fire boltt it's better. Only one issue that not stop call ring during office or meeting time.,I liked Everything except Hearbeat and O2 Level accuracy but it's close to real levels so average in this respect. Otherwise it's a kill for the money !!! Very good overall.,The product is good as per the price charged. One feedback to supplier to improve the glass of watch, there are lots of scratches within one month of usage.", "img_link": "https://m.media-amazon.com/images/I/41Mce3f9faL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Fire-Boltt-Smartwatch-Bluetooth-Calling-Assistance/dp/B09YV4MW2T/ref=sr_1_30?qid=1672902996&s=computers&sr=1-30"}
{"product_id": "B01HJI0FS2", "product_name": "Dell MS116 1000Dpi USB Wired Optical Mouse, Led Tracking, Scrolling Wheel, Plug and Play.", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹299", "actual_price": "₹650", "discount_percentage": "54%", "rating": "4.5", "rating_count": "33,176", "about_product": "Movement Detection: Optical, Resolution : 1000dpi;Cable Length : 1.8 meter, Interface Type : USB|Colour : Black, Weight : 413 Grams|Great Aesthetics, Usage ideal for office, education sectors, designing, basic gaming etc|Comfortable for use in longer periods with performance; Warranty : 3 Year|Hardware Platform: Pc", "user_id": "AH5ZFNLZLJW24YKDQMDHCWGT3MLA,AETSU7SDMZB4653PYWJ54WIPTYJA,AE3XDACOGNEPOGDQHEDJWR4R3JBA,AGLYWTUJ7XAWSKGMRXZEMUHNN3QA,AGAPGK7QBUJDHYEHVEZIJSSU6RXQ,AGJ2FLVYPLUMJGSB434XS3BTEU7A,AFPDB7JSVPNWJT6KF53C3O5ORJQA,AH3M2HOCS7VMTXCOYYI2AKZTFQDA", "user_name": "Mohammad Noushad,Ramkumar.R,Sreeram,Gs7,Dongay Rajasekhar Panda,Ritesh,Rahul Bangera,Vismay", "review_id": "R2K3IBMM9I3HQH,RL1H11C1J4W4U,R26GYIVCHR44IY,R2X4UKYY57A9JX,R3J71TYH2ISEUY,R3EX53W4D2TLR9,REY9RHIDKB28T,R2IYAMOBWJY5JC", "review_title": "Big in size as comparison to other normal sized mouse but works very well,Good for office uses,worth the buy,Best mouse at this price,Item is good.  No issues,It's really worthwhile,Good for home or office use,Rough and affordable", "review_content": "I'm using this mouse from more than 6 months now and It's working great.but the only problem I faced is the big size of it.It looks like the old ball mouse which is quite big in size.Good for gaming by the way.,Working good,by far the best mouse I've used (writing this after 3 days). suits well for daily use; could be a tad bit bigger ...,Been using this mouse for the last 4 years both in office and at home. Suits my hand the best, tried some gaming mouse at 500-800 range but the feel is not good and my wrist starts to hurt on those cheap mice. This one is the father of all mice in that sense as it ticks all the boxes for me. Obviously you cant expect some god like gaming performance but its decent and for everything else it's the best.,Item is good.  No issues,It's Really worthwhile,A bit short in height, clicks and scroll good for home and office use,Easy to use. Rough. Lasts for 4 years+. Affordable.", "img_link": "https://m.media-amazon.com/images/I/31z5b7RYc2L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Dell-MS116-1000DPI-Wired-Optical/dp/B01HJI0FS2/ref=sr_1_31?qid=1672902996&s=computers&sr=1-31"}
{"product_id": "B076B8G5D8", "product_name": "Boya ByM1 Auxiliary Omnidirectional Lavalier Condenser Microphone with 20ft Audio Cable (Black)", "category": "MusicalInstruments|Microphones|Condenser", "discounted_price": "₹798", "actual_price": "₹1,995", "discount_percentage": "60%", "rating": "4.0", "rating_count": "68,664", "about_product": "BOYA BY-M1 is an omni directional microphone, perfect for video|Designed for Smartphones, DSLR, Camcorders ,Audio recorders, PC etc.|The microphone features an Omni pickup pattern, for full, 360-degree|Using the microphone: For Smartphone Switch off the microphone Slide the ON/OFF up to OFF/Smartphone The power is shut down. For DSLR, Camcorders, Audio recorders, PC ect Switch on the microphone. Slide the ON/OFF up to ON|For use with the Lavalier Microphone on Action Cameras customers are requested to purchase \"TRRS to TRS Adapter\" then only it would work|power_source_type: battery powered", "user_id": "AHB43CZ4RHLJ5S6CBOWX6MEI7J4Q,AF3XMPDSQQDSRN2PG5NGPECLPRDQ,AHQF77NZIRBV6LQMO6VEC6O5FL4Q,AFIKD3VY6WOYWPMJUTELWZAXHIXQ,AH6NJEFXD5ISMZJQICGKAZPQQGWQ,AGQS2PKNNCEBXCPSYKOO4I2DGZNQ,AEMACSBSMT4WLJPLOKIWGFJLJJEQ,AH2MIHS2WTWM7R5DFWRUZVTYK7TQ", "user_name": "Sameer Patil,Ashish s.,Harshal Kothari,Govinda,Arjun Ram,Amazon Customer,swapnil,Sk Sahanur Ali", "review_id": "R1ZSCBBOGJ8VB,R2JXWEENFMSBAQ,R1TOMRGD2ASPF,R1PFE2ODTMG96C,R1C5A0KYEKBKJJ,R1IYLE1NMK9R12,R3IS14LK5OVU68,R2727E10ZHH72K", "review_title": "DETAILED REVIEW with Best settings for better Sound output !!!,Worth if you know how to use and what to use it for.,Good for non-professional recordings,Buy this and start creating content for your youtube.,Long cable should be optional.... it's too long else good mic for beginners on YT,Working as expected,Nice product,Good 👍", "review_content": "NOTE :@ Its ready to go Mic, which doesn't need any sound card and can be plugged and used directly even with smartphones.* Has 3.5mm jack connector built in, you can use 1/4' connector if needed.@ It has very Long cable which measures upto 20 feet, so note that.@ It has absolutely NO noise isolation and normal smartphone earphones does better job of noise reduction compared to them in STOCK condition, but with SIMPLE EDITING this mic works just fine ( Check the review below for detailed settings )There are literally thousands of review on this product, but NONE explained the best possible settings for it when used with smartphone with Audacity software, or even in general. So I took the risk of ordering it and it turned out to be nightmare right out of the box, as the sound output was worse than my smartphone earphones. So I went to search for best settings on amazon & other sources but in vain. Fortunately I myself in experiments found the solution and now its working just fine.First I am mentioning all the pros and cons considering the settings that I found and then listing those settings,PROS :-------1. Built quality of the complete mic and cable is good for the price given.2. Length of cable is insane (20 feet).* I personally didn't find it useful, as I use it with my smartphone which is just couple of feet below in my pockets, but for some users it can be very useful if using in rig setup with Camera.3. Has universal 3.5mm jack, which is handy.4. Its easy to use, just plug and play device, which doesn't need any sound card or external device to work.5. Has support for multiple device right from smartphones to DSLRs and computers.6. It comes with carry pouch which is very handy, since its a mess with such long cables.CONS :--------1. Biggest con is the sound quality right out of the box. Its just garbage quality and even normal ears can't bear the background noise collection, so forget about audiophiles. My normal smartphone's earphones record much better sound quality compared to this.2. Length of cable is way too much for me and I guess for many users. I think there should have being multiple option on length to choose from, as keeping 20 feet cable wrapped and hanging or in pocket while recording is not comfortable.3. It comes with a button cell for recording sound for devices other than smartphone and there's NO way to know whether the battery is dead or what's its charging level. Only way to check is by plugging it to a digital recorder or computer and test. So if you are carrying it with recorder which doesn't has playback feature or if you are in hurry and in case of dead battery to record all the sound, then only way to find that your efforts are in vain will be when you comfortably sit to edit it and trust me, its very frustrating ! I am mentioning, it as this scenario have happened with me once, hence I am very cautious about batteries now & use it with smartphones or digital recorders.4. I think price should have being couple of hundred bucks less, considering the sound quality.BEST SETTING USING AUDACITY SOFTWARE :===================================These are the settings when you record with smartphone or any other device and there are lots of background noises and you use Audacity software, which is Free !1. Open the software and open the audio file you recorded with this mic.2. Select entire audio clip and open \"Effects\" and then \" DISTORTION \"3. Start the playback of audio clip in the software, so you can listen to change in effects that you are about to make.4.Now select \" Distortion Type \" option on the top of box and select \" Soft Clipping \".* or select \" Hard Limiter \" and do the settings as it sounds suitable to you.5. Take the \"Clipping Level cursor to extreme Right end or so until you hear soft pleasant output.6. Adjust the \"Make-up Gain\" cursor little bit if needed, I keep it on 49.* Here you can select which ever type, which you feel is suitable for you.7. Now just click \" APPLY \".8. Now is Noise reduction. For that Select short section of audio which DOES NOT have your voice, but ONLY has background noises that you don't want.9. Open \"Effects\" and then \" Noise Reduction \"10. Click on \" Get Noise Profile\".11. Now select entire audio clip and again Open \"Effects\" and then \" Noise Reduction \".12. Finally, click on \" OK \" and that's it !Now you are good to go with soft, slightly lesser Noises and more pleasant sound output. After these steps, you can amplify the sound from same software or any other end user software.VERDICT :-----------I personally am very disappointed with the sound quality, though the audacity tweaking gets it to bearable level, but its satisfactory enough. Plus price seems slightly more on this. I wouldn't recommend these are someone looking good sound quality specially if you live in noisy environment. Buy this only if you live in very silent conditions.,It's not great or best out there for beginners but good-I use a budget mid-range phone and the boya mic is better than in built mic of phone. record it in WAV format, it's good.-You gotta use software/apps to pull the best of this, like audacity or some other editing app.-It's pretty long and that's good as you can extend the cable to a good distance say if u r connecting it to the camera on a tripod.-Overall it's decent for beginners. I see high-end phones have good recording capabilities, but if you have a budget phone, then this one is deal.,Microphone looks very well built, it supports both phones and cameras. There are some phones that does not support external mic, please check before buying as one of my phone did not support it.They claim noise cancellation, however, I did not notice major difference it also captures great amount of noise, only cancellation is because of foam padding around the microphone. I could not observe noise cancellation, at least, while recording on phone.Overall package is well bundled, wire quality is decent, however the dongle quality is excellent, even the small clip to hold the microphone feels solid.,Wire is to long but good if quality of wire is improve in future then 5 stars from me but now 4 star good sound low price 1 star - for wire quality but over all a nice product.☆☆☆☆,I think It's good for online teaching like I do...But yeah some problems like very long cable length I mean someone might need but it should be optional.... or detachable price of the Mic itself is not much anywaysI am okay with this mic for sometime... until I am sure I need quality Rode mic to upgrade...,Don't expect noice cancellation under this budget but audio recording quality is very good.,Nice product,Decent", "img_link": "https://m.media-amazon.com/images/I/41UYenF+lnL._SX300_SY300_.jpg", "product_link": "https://www.amazon.in/Boya-Omnidirectional-Lavalier-Condenser-Microphone/dp/B076B8G5D8/ref=sr_1_32?qid=1672902996&s=computers&sr=1-32"}
{"product_id": "B07JW9H4J1", "product_name": "Wayona Nylon Braided USB to Lightning Fast Charging and Data Sync Cable Compatible for iPhone 13, 12,11, X, 8, 7, 6, 5, iPad Air, Pro, Mini (3 FT Pack of 1, Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹399", "actual_price": "₹1,099", "discount_percentage": "64%", "rating": "4.2", "rating_count": "24,269", "about_product": "High Compatibility : Compatible With iPhone 12, 11, X/XsMax/Xr ,iPhone 8/8 Plus,iPhone 7/7 Plus,iPhone 6s/6s Plus,iPhone 6/6 Plus,iPhone 5/5s/5c/se,iPad Pro,iPad Air 1/2,iPad mini 1/2/3,iPod nano7,iPod touch and more apple devices.|Fast Charge&Data Sync : It can charge and sync simultaneously at a rapid speed, Compatible with any charging adaptor, multi-port charging station or power bank.|Durability : Durable nylon braided design with premium aluminum housing and toughened nylon fiber wound tightly around the cord lending it superior durability and adding a bit to its flexibility.|High Security Level : It is designed to fully protect your device from damaging excessive current.Copper core thick+Multilayer shielding, Anti-interference, Protective circuit equipment.|WARRANTY: 12 months warranty and friendly customer services, ensures the long-time enjoyment of your purchase. If you meet any question or problem, please don't hesitate to contact us.", "user_id": "AG3D6O4STAQKAY2UVGEUV46KN35Q,AHMY5CWJMMK5BJRBBSNLYT3ONILA,AHCTC6ULH4XB6YHDY6PCH2R772LQ,AGYHHIERNXKA6P5T7CZLXKVPT7IQ,AG4OGOFWXJZTQ2HKYIOCOY3KXF2Q,AENGU523SXMOS7JPDTW52PNNVWGQ,AEQJHCVTNINBS4FKTBGQRQTGTE5Q,AFC3FFC5PKFF5PMA52S3VCHOZ5FQ", "user_name": "Manav,Adarsh gupta,Sundeep,S.Sayeed Ahmed,jaspreet singh,Khaja moin,Anand,S.ARUMUGAM", "review_id": "R3HXWT0LRP0NMF,R2AJM3LFTLZHFO,R6AQJGUP6P86,R1KD19VHEDV0OR,R3C02RMYQMK6FC,R39GQRVBUZBWGY,R2K9EDOE15QIRJ,R3OI7YT648TL8I", "review_title": "Satisfied,Charging is really fast,Value for money,Product review,Good quality,Good product,Good Product,As of now seems good", "review_content": "Looks durable Charging is fine tooNo complains,Charging is really fast, good product.,Till now satisfied with the quality.,This is a good product . The charging speed is slower than the original iPhone cable,Good quality, would recommend,https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/81---F1ZgHL._SY88.jpg,Product had worked well till date and was having no issue.Cable is also sturdy enough...Have asked for replacement and company is doing the same...,Value for money", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/51UsScvHQNL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Wayona-Braided-WN3LG1-Syncing-Charging/dp/B07JW9H4J1/ref=sr_1_33?qid=1672902996&s=computers&sr=1-33"}
{"product_id": "B014SZO90Y", "product_name": "Duracell Ultra Alkaline AA Battery, 8 Pcs", "category": "Electronics|GeneralPurposeBatteries&BatteryChargers|DisposableBatteries", "discounted_price": "₹266", "actual_price": "₹315", "discount_percentage": "16%", "rating": "4.5", "rating_count": "28,030", "about_product": "Lasts up to 100% longer* (*Longevity performance compared to the Minimum Average Duration of the 2015 IEC AA Digital Camera test. Results may vary by device or usage pattern.)|Our best battery, suited for everyday devices with extra performance for high drain devices|Available in AAA, AA, C, D and 9V sizes|Superior Nylon top closure helps preventing our batteries from leakage|Duralock technology keeps unused Duracell batteries fresh and powered for up to 10 years in ambient storage", "user_id": "AF37SWB5BJAXD6F2Q74M6HJIHADA,AFP7XI3X4GGJVQCYYPJZ3Y3KZJFA,AFC5CQXBCJCOU4VWPCMLLQV5NJRA,AF5L22PGGUCE6JRZN7Q6CZJMMH5A,AEZQUPHUINOCTERMXT3HOTVPLYGQ,AGLYWTUJ7XAWSKGMRXZEMUHNN3QA,AF2GJR4HSNPC5E7MMHUMDK5QR4PA,AHR6Y7I727FA6UYUHTZYNGOGDV2A", "user_name": "Gopinathan,Punaram Chutia,Amazon Customer,SREEJITH R B,S.S.Sohi,Gs7,Manish Liya,Anna", "review_id": "R31X4I2TGYDUN8,R27PTCIK04AE46,R23U630I51IZTI,R3TLR3XSHP0UH9,R2RP5UV7LX3QTF,R3W3H7WY3GXGHM,R158W5SZQQ5YSS,R1OT133BOUEYND", "review_title": "That's a nice one,Best services.,V good less price than that of market,As described,Value for money,Best battery cells out there,Quality yu,Good", "review_content": "Nice one, tried on remote mouse and found working fine.,Good product, good services.,V good,As described Duracell battery good one,For AC Remotes,The life on these is excellent, been using these for my controllers for gaming and these are the best. Lasts long and does its job. What else do you need.,Good Quality,Loved the product", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/415nVOD7bWL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Duracell-Alkaline-Battery-Duralock-Technology/dp/B014SZO90Y/ref=sr_1_34?qid=1672902996&s=computers&sr=1-34"}
{"product_id": "B07KCMR8D6", "product_name": "Classmate Octane Neon- Blue Gel Pens(Pack of 5)|Smooth Writing Pen|Attractive body colour for Boys & Girls|Waterproof ink for smudge free writing|Preferred by Students for Exam|Study at home essential", "category": "OfficeProducts|OfficePaperProducts|Paper|Stationery|Pens,Pencils&WritingSupplies|Pens&Refills|GelInkRollerballPens", "discounted_price": "₹50", "actual_price": "₹50", "discount_percentage": "0%", "rating": "4.3", "rating_count": "5,792", "about_product": "5 vibrant Neon body color|Smooth and fast writing|Japanese waterproof ink|Country of Origin: India", "user_id": "AEVPRYZLGHNMEZA5BYGIX36LYZXA,AEZPOZQEEBFFXZ2EQUYJI4VIQILA,AE4FRP3D6KIQG7H3GP436GUD52VQ,AGIUJI423LLZ56YOUAQ5NEYLFVEA,AGGT6VCILAXDI3NPIFAKXBGDYVQA,AHYLFL4VWQ2J4OOZXMEPISX5G64A,AHONFHGWU5UFOW2K622LL7B26M3Q,AETTZUILIPB5I7FQ272YUGEJ4SNQ", "user_name": "Gatij saini,Biswajit Kundu,Altaf Khan,Agam Saran,Dinesh Jain,Isha Singhal,Nilofar Adeni,Ramkumar Dharra", "review_id": "RZAAQFY7BDSWC,R3604ZO2AA4PK5,R3C8K6Z6W9MDTQ,R38163YROZHHFG,RDXE4NC3K02IY,R2BG3LFIR1DRUP,R1AA1L9EH743MV,R1Q23Z4DE0QT8Q", "review_title": "Nice ball pen,Good product,Average,Nice Pen,It's a good product,Smooth,It's writing like flowing silk.,good produced", "review_content": "Very nice ball pen,Thank you Amazon,Easy to hold but not water resistant. Can say value for money,Kids like the colours and are very fond of writing with it,The product is good, and my son likes it.....,Loved the product, very smooth and apt colour of inkMust go product,It's writing like flowing silk.,buy......", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/414BHyTttvL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Classmate-Octane-Neon-Pack-5/dp/B07KCMR8D6/ref=sr_1_35?qid=1672902996&s=computers&sr=1-35"}
{"product_id": "B00N1U9AJS", "product_name": "3M Scotch Double Sided Heavy Duty Tape(1m holds 4.5Kgs) for indoor hanging applications (Photo frames, Mirrors, Key Holders, Car Interiors, Extension Boards, Wall decoration, etc)(L: 3m, W: 24mm)", "category": "Home&Kitchen|CraftMaterials|Scrapbooking|Tape", "discounted_price": "₹130", "actual_price": "₹165", "discount_percentage": "21%", "rating": "3.9", "rating_count": "14,778", "about_product": "Sticks to most surfaces includingwalls, ceramic tiles and wood-surfacesthat are clean, dry and smooth#.|A no-mess alternative to glue forlight-duty attaching andmounting tasks.|Ideal for permanent mounting tasks.", "user_id": "AGXGYUPGIFDGD6LPTVB2XVE7JWNA,AH2ZUPRKPAFHMLFBVWD26PDVJK4Q,AGAXCWBSPZUPB6GKZKHS3WDT52YA,AHJBGHHXDRA7M5MKCLYLYDNWSURA,AGS35GMYV4YBWSINMHG7KX6VCX5A,AFX2CQSR3SBHOJQWQHBLDIHQG3RA,AEEE77EDIHNXZHXAC77EGZGKGSLQ,AH64TGKPMKB5SNT76NT4ZDNF5YEA", "user_name": "Amit Shrivastava,Sikandar kunar,INSTALL INTO PC,Sourabh,prakash,Arjun AK,Surendra Sawant,Subrahmanya Udupa", "review_id": "R2U4L5Y1EI2L9P,R17YBU9W32A30N,R29OI40B53G6UK,R3LHAFK1QLQHX,RQXZDM0PKSCMS,RKN5ISCXXFA4B,R2V6JCQJ8NFGYI,RAH387U1B1AFN", "review_title": "Good Quality adhesive, easy to use,Good,good product,Good product,Ok on walls,Very good,Good to use,Very nice.", "review_content": "Quality of adhesive is very good. I used it to stick photo canvas on wall and it worked well.,Good kwality,i dont tell this product totally good.but i believe this item 75 % good.,Good product,Holds good on walls but not in wood works .,Sticks well.. Holds fair amount of weight..,Good and usefull,Very nice.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/41BeawIQB5L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Scotch-Double-Foam-Tape-24/dp/B00N1U9AJS/ref=sr_1_36?qid=1672902996&s=computers&sr=1-36"}
{"product_id": "B07KY3FNQP", "product_name": "boAt Bassheads 152 in Ear Wired Earphones with Mic(Active Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹449", "actual_price": "₹1,290", "discount_percentage": "65%", "rating": "4.1", "rating_count": "91,770", "about_product": "Break away from old habits through HD sound via 10mm drivers, crystal clear sound to your ears helps you execute what you have visualized perfectly, enhance your senses with the BassHeads 152.|Vibe your rhythm all day with fantastic bass heavy tunes that drown out your stress and brings back your search for the ultimate quest, it’s time to get kicking.|Communicate seamlessly with the inbuilt mic that has high sensitivity and a versatile frequency range to provide the ultimate experience; Foldable/Collapsible: Yes, Deep Bass: Yes With Microphone: Yes.|Durable and highly resistant, the braided cable adds to the nirvana with its soft feel and tangle resilient features, because wasting time is simply not an option when you’re a boAthead|Plug into convenience with the 3.5mm angled jack to begin your journey|1 year warranty from the date of purchase", "user_id": "AFYMFZN2MFKODDI25OZKLO36LCHA,AE46PAL3I6SQVZG4CQR754OYQ7RA,AFILVEY4BG7TP2XCLB7N6AGAZMFA,AHKAHUT2A5EOQTRLYEOO6W6BQSTQ,AELYRRH5SBV6UFG3GU6BFG5BR2QQ,AES5I6RABQPPMKSG73P546HHSHFQ,AHTP6VRCDVSOFKPWMXJLFWKU2VJQ,AF27PDSYD6M3T6GI6X3VMQXOGUUA", "user_name": "Sameer,Dwarakesh Arshu,Arjun Kumar Ravi,Mathew K,Amazon Customer,User,venkat,Priyanka Deshmukh", "review_id": "RZ7BLWVBP91F3,R3VUE0FS0NDIRK,RWESRERAFOYEW,R1YONSMZERBPET,R3JFQJ4ZJ5RY0T,R1KBRXW0AL249U,R22L0SQFC67YKF,RWK29DZUWGFWM", "review_title": "Mediocre,Best in Budget and Beast in Quality,Best quality this product,Ear phone With Jack,Nice,good,Good sound quality,Value for money!", "review_content": "Recieved damaged product the first time, the seller is very good and quickly replaced it for a new one. Go for bassheads 242 if you are spending this much. They are charging more for the metal enclosure and the braided cable. The angled jack is a plus but the sound quality is so-so. Infinity zip 100 and their own bassheads 242 are way better for sound.,I would like to start by saying I'm not an audiophile, therefore my review will be less about the audio quality of the product and more about the over all experience regarding the product. First off, this is my second time buying the product and you guessed it, it's good enough that I will buy it a third time if need be!Upon unboxing we are greeted by the presence of 3 pair of extra ear buds . There is also a pair of ear fins in the packet containing the extra ear buds, these ear fins are used to keep the ear buds snugly in your ears during strenuous periods of use where there is a chance of lots of movement. More on this later.Coming to the ear phones itself, it's among the very few ear phones that genuinely feels premium in hand. It is very durable, specially the plug part that connects to your phone, many a time my ear phones stop working because the plug part malfunctions and causes problems in the functioning of the ear phones. This is not the case with these.The wire itself is made of rubber/silicon. It feels good in hand and the only thing I can think of that could be improved here is to braid the wire but so far the wire hasn't showed any form of wear and tear common with most other ear phone wires. Another thing to emphasize is that the entire cable is flat through out, this genuinely decreases the number of instances where I find myself trying to untangle the wire. This is truly one of the best features of this pair of earphones.Remember I said something about the ear phones being made completely of metal? Well it continues to the mic and the left and right splitter. Both these pieces feel very premium because of the signature cold feeling of metal against skin. I don't know about you but attention to small details like this always brings smiles to my face. It is to be noted that the mic piece is a universal single button type and hence cannot control volume, personally this problem didn't affect me much but the might be potential buyers who might find this to be a deal breaker.Mic quality is subject to individual bias therefore I can tell you my personal experience. In my opinion I feel that the quality is average, it won't blow anyone's mind but it will deliver most of the time. A common complaint I heard from most of my callers that they find it difficult to hear me when there is a significant amount of back ground noise or wind rustling in to the mic, these are common issues even with ear phones price significantly higher than the boAt BassHeads 152Finally the most important part of the review, the sound quality of the ear phones. As I said earlier I won't be going into the technical details . I am a bass lover and that is what led me to buy this pair in the first place. In my opinion I found that the Bass is indeed good but not over powering for the average consumer like how the Extra bass versions of the Sony line up of earphones trend to be. The volume gets sufficiently high and more often than not I use it at less than half it's total volume when listening to music. The clarity of the boAt BassHeads 152 are above par and easily betters even ear phones in the 2000 INR price category this is one other reason why I love this pair so much. A point to remember, as the entire covering of the ear phones is made of metal it is significantly heavier than other ear phones. This becomes a double edged sword, on the one hand the metal makes the ear phones feel very premium but it also makes it significantly heavier than other earphones made of plastic. This causes it to easily fall out of your ears if the supplied fins are not used. The find unlike the ones find in let's say the newer Bose ear phones aren't as comfortable and can hurt your ears if used over a prolonged time.Last but not the least, there are multiple color variants of the boAt BassHeads 152 including red, black and blue. I found myself opting for the black variant both the times this may be a personal opinion but I find it to be the best of the three. That said I do see most corporate consumers opting for the black as it is a neutral color. This leaves out the red, for reasons unknown the red variant is sold at a lower rate on most sites perhaps due to shortage in sales, therefore if you are short on cash and just want a great pair of ear phones then grab these while they last.Pros:1) No metal build2) Excellent wire quality and trendy3) Durable4) Above average sound qualityCons:1) Metal build in the earphones trend to make them heavy and thus falls out of your ear easily2) Supplied Fins are uncomfortable to wear over a prolonged time3) Supplied Clip piece is removable and tends to get lost easilyI hope everyone who read this found it useful and can make an educated decision to buy or not to buy the BassHeads 220. All suggestions are welcome.Thanking you, Dwarakesh,Best quality  I like boat earphone saund quality,Only disadvantage  I noticed was this can't be use in USB phones,  3.5 mm jack is provided so it can be  usedin Jack phones only .,Nice,good,I used this headphone for travel. Very lite and easy to carry in pocket. colourful. Sound quality is good. The wire is thin so i feel cautious  While taking it from bag or pocket.,Gd one! Only thing is covers/sleeves comes out easily if not gd fit. However, additional covers/sleeves are provided.", "img_link": "https://m.media-amazon.com/images/I/31RiDkNjpjS._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/BassHeads-152-ToneSecure-Braided-Earphones/dp/B07KY3FNQP/ref=sr_1_37?qid=1672902996&s=computers&sr=1-37"}
{"product_id": "B0B3N7LR6K", "product_name": "Fire-Boltt Visionary 1.78\" AMOLED Bluetooth Calling Smartwatch with 368*448 Pixel Resolution 100+ Sports Mode, TWS Connection, Voice Assistance, SPO2 & Heart Rate Monitoring", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹3,999", "actual_price": "₹16,999", "discount_percentage": "76%", "rating": "4.3", "rating_count": "17,162", "about_product": "Fire-Boltt is India' No 1 Wearable Watch Brand Q122 by IDC Worldwide quarterly wearable device tracker Q122.【Bluetooth Calling Watch】- Fire-Boltt Visionary enables you to make and receive calls directly from your watch via the built-in speaker and microphone. This smartwatch features a dial pad option to access recent calls & sync your phone’s contacts.;【1.78\" AMOLED Display】 - Fire-Boltt Visionary has a premium 368*448 Pixel Resolution and 1.78\" AMOLED Display which comes with the Always On feature.|【Over 100 Sports Modes】 - Walking, Running to Tedious Workout modes we have covered it all. Fire-Boltt Visionary smartwatch does a wonderful tracking job to each sports mode the user carries out in the day or at the gym.;【Connect TWS On The Go】- This smartwatch has an internal storage memory of about 128MB to store your songs and listen to local music on your bluetooth headset|【AI Voice Assistance】- Command your watch and let the magic happen. This special technology is in the Fire-Boltt Visionary Smartwatch;【Smart 360 Health Tracking】 - The Fire-Boltt Visionary Smartwatch comes with a complete package of health tracking features. From SpO2 tracking to real time heart rate tracking stay fit always. With the breathing exercise and women health the smartwatch is fit for each use and purpose|【IP68 Water Resistant】 - The smartwatch is fit to withstand sweat, dust, dirt and sand and is resistant to submersion upto a maximum depth of 1m of freshwater for up to twenty minutes.;【Smart Notifications】 - Keeping you notified on every second of all activities through your social media connects. Do not miss out on any notification that you receive on smartphone.; 【Remote Controls】 - Click numerous pictures and listen to your favourite songs by just one touch. 【Basic Reminders】 - Don't drink water or walk in normal breaks we have got you covered in that too with the sedentary reminders you will alwasy stay hydrated and will walk good, a step to a healthy life|Band Material Type: Silicone; Band Color: Black; Human Interface Input: Buttonstouch Screen; Included Components: 1 Smartwatch, 1 Manual, 1 Magnetic Charger, 1 Warranty Card; Case Material Type: Metal; Clasp Type: Tang Buckle; Color Name: Black; Compatible Devices: Smartphonetablet|The AMOLED provides over the line performance. It is thinner, lighter, flexible and one of the safest display technologies ever developed..Band Width:20 millimeters.Water resistance depth:1 meters", "user_id": "AHQIYGWISGS2IQAQ3OM4IZHKIV4Q,AGXCRSJZ5RYOGMFVSLNRCILGSATQ,AE4MORXG46LGABI76KRVGV5BCLMQ,AHPN4Q3AZDX3HSUYDT7MHYDIL6QQ,AGBOBQFRZDOF5XPJRLHJYOGRFKNA", "user_name": "Vineet,shreyas,Amazon Customer,shaurya,Kartik Yadav", "review_id": "R2FY1Z66KZXJWD,R2HMU574902EOQ,R33J3X2N75IXU3,R3GGQG1U2KLAE3,R31AMOLX49DVF8", "review_title": "Nice watch but some cons,Great device for the budget !! And amazing amazon service!!,Good watch in this price,Watch faces could have been better,Amoled Screen & Touch, Average Wrist Band.", "review_content": "Today only i recieved this watch at first instance it win my heart ....I was using it a whole day and i found some pros and cons of this watchPros# Amoled Display is very bright and nice# Look and design is premium# Bluetooth calling is awesome, speaker is loud and clear . Even my voice is reaching to opposite party very clearly while calling with watch.# calculator features is useful# Multi Functional crown button is easy and useful .. Easily to change theme with just scroll the crown button# play music directly from the watch with the internal storage although its only 128 mb but sufficient to store around 10 songs approx.. song sound quality is also fine# strap quality is good and soft# TWS connecting features is also niceCons# sometimes i found watch is disconnected with my phone  ..not sure why its happened as i have checked only for one day# fingerprints are clearly visible on  Screen Glass .. i have attached the pic for it#Health Tracker are near to accurate but never rely on smartwatch at this price range.i have measure the bp with this watch and with bp machine both results are different... 70-80% accurate only..# AI Voice assistant is not very useful as it only work for mobile when i press the voice assistant button on watch .. like if i give command to set alarm on watch it set alarm on mobile so basically it just a button to wake up google assistant for mobile phone.#Sometimes when you pick call from your mobile phone call automatically transfer to watch and voice started coming from the watch speaker.. which is quite irritating..this must be correct by firmware updates i have purchased it for Rs.3420/- including bank offer . For this price range overall its a good & premium watch ..Its my experience with this watch for just a one dayRest how it work for long run that depends..,Recieved a damaged device at first... Slight gap between display and body from the left side.. but quickly recieved the replacement next day....The replacement was good...Amazon provided great service and delivered replacement in just 16 hours ...so great job amazon..also i live in bangalore.. so the experience might vary from place to place..ProsSmooth enough UIFairly accurate readings on all the sensorsHeartrate BP and spo2Call quality is great for the price.. good speakers and good mic..You can control spotify and soundcloud music too from the watch .and use tws to listen to spotify while controling with the watch... And it is seamless...Display is great ..colors are punchy and bezels are good enough... Not as narrow as crossbeats ignite s4 max but still good enough...Build quality is good but does not feel very premium.. it does feel like a below 5k watch...So you cannot trick anyone that this is a apple watch 😂Strap is not too long as every review mentions.. strap is good enough... Not too comfy..I ordered a metal strap from amazon for my watch and it is amazing...Ui looks much better in person than reviews.. UI is smooth and looks good... Not as good as realme watch 3 pro..But still good for the price..Overall its a good watch for the price of around 3.5k -3.9kAnymore and it is not worth the priceRealme watch 3pro is the best at around this price.. so if you get that in stock and for below 4k then get realme watch 3 pro..Or else for this price segment firebolt visionary is the overall best watch compared to all other watches under 4kConsCall when recieved on watch doesnt stay on tws it switches to watch for some reason..which is oneSteps are a little inaccurate and reads steps even if not walking..so dont rely on step counterBattery life is not great if youre using always on display and calling... Maybe around 3 daysBut otherwise battery stays for over 5 days.Blutooth range is not too good.. and varies from watch to watch.. and also phone to phone.. i get a decent bluetooth range of around 20 ft .. but this is more of a fact than a con..,I write this review after 1 week of using this watch, BP, BPM, SPO2 running and sleep tracking functions are working well, watch speaker is also loud and clear to you and the other callers. The only con is when you want to listen to songs through a watch from a mobile its Bluetooth disconnects automatically again and again, as this fund is not useful for me so ignore it, overall it's a good watch.,Everything is absolutely Greta in this smartwatch.But these things could have been better:. Watch faces- you should have the option to add upto 3-4 watch faces at once from the app rather than one at a time and 10 pre-installed ones. App ui could have been better. DND mode absent. No option to toggle Bluetooth (always on),Before review i would like to appreciate this great strategy to pour out honest reviews from users by giving them bookmyshow voucher.I loved the Touch Screen experience & Amoled screen of the watch, it gives a feel of premium watch. The band of the watch is average & doesn't look premium & i separately ordered a metal band. I am expecting Mobile App improvement from FireBoltt as I don't find it good enough if I compare it with Boat's App for its watches (As I own a Boat smartwatch). Rest Visionary is a good buy & worth the money the only thing which physically is not appealing is the average quality of the band.", "img_link": "https://m.media-amazon.com/images/I/41r1d8a2WGL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Fire-Boltt-Smartwatch-Resolution-Connection-Assistance/dp/B0B3N7LR6K/ref=sr_1_38?qid=1672902996&s=computers&sr=1-38"}
{"product_id": "B07QZ3CZ48", "product_name": "boAt BassHeads 122 Wired Earphones with Heavy Bass, Integrated Controls and Mic (Gun Metal)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹399", "actual_price": "₹1,290", "discount_percentage": "69%", "rating": "4.2", "rating_count": "206", "about_product": "Tune into Premium Audio with 10mm Drivers and enhance the vibes with BassHeads 122|Vibe in your rhythm all day with its Super Extra Bass and immerse into an enthralling time.|Communicate hands-free in a seamless way with the built-in mic that has high sensitivity and a versatile frequency range to provide the optimum calling experience|Plug Into Nirvana with the 3.5mm gold plated jack to begin your journey towards auditory bliss.", "user_id": "AEY3XQ3NAOS4ZK53VDEVWJ72UYMA,AFENYA36PCVR7U6VQVSGHGIUH7KQ,AEEYC3VV6XNJOUKLAKNJCTNZ37DQ,AE35LUYKKECJUBLJE373GGQIZNOQ,AF75CFR7RD3EVKMOZ6TU5J7GOOVA,AEIHLPUUYWECA55HPXXHUPKVA6JA,AFAEMQGQFXD6JFPE2PTK6THIH53A,AGUZOTZKNVCVN57MFLCTCNCTDLCA", "user_name": "Clifford Francis,Paras s.,Aditya Pandey,Abhinav Mukherjee,Abhilash S.,MKS,Pradheenadoll@ G.,parth vishnubhai parmar", "review_id": "RUVNSVGR3C0ZK,R3IZIBJ48U0KDN,REZOPKFLKI7YE,R3G7FE8ICIL8K5,R1G7WNTY9MC6H4,RV51Y63DBOCWS,RSYBU38UVWSP6,RADZV5UTZTYWO", "review_title": "Boats are the best.,Just awesome,it is good in this range .....,Great product in the price range,Awesome product,Nice,Perfect,Quality", "review_content": "The sound quality is amazing but you have to be very careful while using it as the wire from the earplugs to the controller seems very delicate. One negative point is that the noise cancellation sucks.,Great bass and noice overall awesome and build quality is very slick,👍,It's obviously not the best earphone out there but certainly does it's job for the price, you won't miss out on much just a bit of bassGreat buy though,Value for money. Decent build quality and looks. Best product at this price range.,Nice... Value of the product,I like this,It's best quality and good 👍  for thi renge", "img_link": "https://m.media-amazon.com/images/I/41dNRo8Hu8L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/BassHeads-122-Earphones-Tangle-Straight/dp/B07QZ3CZ48/ref=sr_1_39?qid=1672902996&s=computers&sr=1-39"}
{"product_id": "B09T3H12GV", "product_name": "Dell USB Wireless Keyboard and Mouse Set- KM3322W, Anti-Fade & Spill-Resistant Keys, up to 36 Month Battery Life, 3Y Advance Exchange Warranty, Black", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Keyboard&MouseSets", "discounted_price": "₹1,399", "actual_price": "₹2,498", "discount_percentage": "44%", "rating": "4.2", "rating_count": "33,717", "about_product": "Movement Detection Technology (Mouse): Optical Buttons Qty: 03 Movement Resolution: 1000 dpi|Hot Keys Function: Volume, Mute Keyboard Technology: Plunger|Device Type: Keyboard and mouse set|Wireless Receiver: USB Wireless Receiver Adjustable Height: Yes|Interface: 2.4 GHz Type Keyboard/Mouse : Wireless", "user_id": "AGUV3QWPJUZF72A7TRV5XZLSRP2Q,AHQMSLQQ4T7RDZBR7K6FFS2WTG3Q,AFZVV44R3C5A6YYCZDNUTMEKD7OQ,AEZKAOXLKYZBBTZ6MEL33LAY2O5Q,AF5AATC7IJVSDOVSKOGL4KE5M52A,AF4KWHA553OSYR5DLLBBDEHHBRJA,AFEVXMESJYDWLJBXPN7HVX62TPOQ,AFI2SQEGAA3335ZEAMB52XPPHS2Q", "user_name": "Harsh Kumar,Arv,Debayan,Sidharrtha Jain,Chirag,Satish,Amazon Customer,Amazon Customer", "review_id": "R1SNDKJ3F47REI,R2TKI3QCYTIHEU,R3LOHD95Y9I8Q3,R3L674Y2TEWO4K,RCNO312K340D9,R21QJQYXKVPKBW,R11VGKTVQCTPW1,RIME7JQPW8QM8", "review_title": "Best for general use,Works well for basic usage,Good product in the budget,Ok product. Not so great.,Good,Good one to have,Great Product,Good.", "review_content": "Writing this after using it for two months --Pros -1. Noiseless button2. Soft press3. Lightweight4. Good build quality5. Non-eraseable button sign6. Easy battery installation7. Good support range8. All button work properly9. All 104 buttons are available10. Low battery indicator (The indicator does not glow when you install the new battery. It glows only when the battery is low.)Cons -1. No num-lock light2. No caps-lock light3. No scroll-lock light,Works well for my basic usage.The keys travel is smooth and fine, and mose click and wheel is  not that smooth, but that is fine as this is the starting range. Perhap the next one is slightly more expensive, I guess that might be what I could have tried.,The keyboard is superb. The mouse too is nice. However the led light of the mouse isn’t working for the piece we have received. We Mable to give a 5 star rating because of this flaw.,Comes with Duracell Batteries so you can straight away plug it and play it.You have to keep the reciever really close to the keyboard and mouse, yet mouse constantly shows lag and skips during movement.,Good,Wireless keyboard and mouse combination made my desk clean,Great product from DELL, using for a long time and it is very comfortable for long hour working.,Good product but key spaces are larger than normal pc keyboard.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/415yl0HeDQL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Dell-Wireless-Keyboard-Mouse-Spill-Resistant/dp/B09T3H12GV/ref=sr_1_40?qid=1672902996&s=computers&sr=1-40"}
{"product_id": "B098NS6PVG", "product_name": "Ambrane Unbreakable 60W / 3A Fast Charging 1.5m Braided Type C Cable for Smartphones, Tablets, Laptops & other Type C devices, PD Technology, 480Mbps Data Sync, Quick Charge 3.0 (RCT15A, Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹199", "actual_price": "₹349", "discount_percentage": "43%", "rating": "4.0", "rating_count": "43,994", "about_product": "Compatible with all Type C enabled devices, be it an android smartphone (Mi, Samsung, Oppo, Vivo, Realme, OnePlus, etc), tablet, laptop (Macbook, Chromebook, etc)|Supports Quick Charging (2.0/3.0)|Unbreakable – Made of special braided outer with rugged interior bindings, it is ultra-durable cable that won’t be affected by daily rough usage|Ideal Length – It has ideal length of 1.5 meters which is neither too short like your typical 1meter cable or too long like a 2meters cable|Supports maximum 3A fast charging and 480 Mbps data transfer speed|6 months manufacturer warranty from the date of purchase", "user_id": "AECPFYFQVRUWC3KGNLJIOREFP5LQ,AGYYVPDD7YG7FYNBXNGXZJT525AQ,AHONIZU3ICIEHQIGQ6R2VFRSBXOQ,AFPHD2CRPDZMWMBL7WXRSVYWS5JA,AEZ346GX3HJ4O4XNRPHCNHXQURMQ,AEPSWFPNECKO34PUC7I56ITGXR6Q,AHWVEHR5DYLVFTO2KF3IZATFQSWQ,AH4QT33M55677I7ISQOAKEQWACYQ", "user_name": "ArdKn,Nirbhay kumar,Sagar Viswanathan,Asp,Placeholder,BharanI,sonia,Niam", "review_id": "RGIQEG07R9HS2,R1SMWZQ86XIN8U,R2J3Y1WL29GWDE,RYGGS0M09S3KY,R17KQRUTAN5DKS,R3AAQGS6HP2QUK,R1HDNOG6TO2CCA,R3PHKXYA5AFEOU", "review_title": "A Good Braided Cable for Your Type C Device,Good quality product from ambrane,Super cable,As,Good quality,Good product,its good,Good quality for the price but one issue with my unit", "review_content": "I ordered this cable to connect my phone to Android Auto of car. The cable is really strong and the connection ports are really well made. I already has a Micro USB cable from Ambrane and it's still in good shape. I connected my phone to the car using the cable and it got connected well and no issues. I also connected it to the charging port and yes it has Fast Charging support.,It quality is good at this price and the main thing is that i didn't ever thought that this cable will be so long it's good one and charging power is too good and also supports fast charging,Value for money, with extra length👍,Good, working fine,Product quality is good,Good,very good,Bought for my daughter's old phone.Brand new cable it was not charging, I already repacked and requested for replacement.I checked again, and there was some green colour paste/fungus inside the micro USB connector. I cleaned with an alcoholic and starts working again.Checked the ampere of charging speed got around 1400ma-1500ma - not bad, came with braided 1.5m long cable, pretty impressive for the price.Can't blame the manufacturer.But quality issues by the distributor, they might have stored in very humid place.", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T2/images/I/31zOsqQOAOL._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Ambrane-Unbreakable-Charging-Braided-Cable/dp/B098NS6PVG/ref=sr_1_41?qid=1672902996&s=computers&sr=1-41"}
{"product_id": "B096MSW6CT", "product_name": "Sounce Fast Phone Charging Cable & Data Sync USB Cable Compatible for iPhone 13, 12,11, X, 8, 7, 6, 5, iPad Air, Pro, Mini & iOS Devices", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹199", "actual_price": "₹999", "discount_percentage": "80%", "rating": "3.9", "rating_count": "7,928", "about_product": "【 Fast Charger& Data Sync】-With built-in safety proctections and four-core copper wires promote maximum signal quality and strength and enhance charging & data transfer speed with up to 480 mb/s transferring speed.|【 Compatibility】-Compatible with iPhone 13, 12,11, X, 8, 7, 6, 5, iPad Air, Pro, Mini & iOS devices.|【 Sturdy & Durable】-The jacket and enforced connector made of TPE and premium copper, are resistant to repeatedly bending and coiling.|【 Ultra High Quality】: According to the experimental results, the fishbone design can accept at least 20,000 bending and insertion tests for extra protection and durability. Upgraded 3D aluminum connector and exclusive laser welding technology, which to ensure the metal part won't break and also have a tighter connection which fits well even with a protective case on and will never loose connection.|【 Good After Sales Service】-Our friendly and reliable customer service will respond to you within 24 hours ! you can purchase with confidence,and every sale includes a 365-day worry-free Service to prove the importance we set on quality.", "user_id": "AGU3BBQ2V2DDAMOAKGFAWDDQ6QHA,AESFLDV2PT363T2AQLWQOWZ4N3OA,AHTPQRIMGUD4BYR5YIHBH3CCGEFQ,AEUVWXYP5LT7PZLLZENEO2NODPBQ,AHC7MPW55DOO6WNCOQVA2VHOD26A,AFDI6FRPFBTNBG7BAEB7JDJSMKDQ,AFQKCEEEKXCOHTDG4WUN3XPPHJQQ,AHKUUFNMBZIDLSSPA4FEHIO2EC7Q", "user_name": "Kunal,Himanshu,viswanath,sai niharka,saqib malik,Aashiq,Ramu Challa,Sanjay gupta", "review_id": "R3J3EQQ9TZI5ZJ,R3E7WBGK7ID0KV,RWU79XKQ6I1QF,R25X4TBMPY91LX,R27OK7G99VK0TR,R207CYDCHJJTCJ,R3PCU8XMU173BT,R1IMONDOWRNU5V", "review_title": "Good speed for earlier versions,Good Product,Working good,Good for the price,Good,Worth for money,Working nice,it's a really nice product", "review_content": "Not quite durable and sturdy,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/71rIggrbUCL._SY88.jpg,Working good,https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/61bKp9YO6wL._SY88.jpg,Product,Very nice product,Working well,It's a really nice product", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31IvNJZnmdL._SY445_SX342_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Sounce-iPhone-Charging-Compatible-Devices/dp/B096MSW6CT/ref=sr_1_42?qid=1672902996&s=computers&sr=1-42"}
{"product_id": "B09ZQK9X8G", "product_name": "Noise ColorFit Pro 4 Advanced Bluetooth Calling Smart Watch with 1.72\" TruView Display, Fully-Functional Digital Crown, 311 PPI, 60Hz Refresh Rate, 500 NITS Brightness (Charcoal Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹2,998", "actual_price": "₹5,999", "discount_percentage": "50%", "rating": "4.1", "rating_count": "5,179", "about_product": "Advanced Bluetooth calling: Upgrade to an effortless calling experience - attend/reject calls and dial numbers, from your wrist.;Digital crown: Navigate through the watch, adjust volume and change the watch face via the fully-functional crown.|1.72’’display: ColorFit Pro 4 features 1.72’’ TFT LCD with 25% more screen area than ColorFit Pro 3.;Vivid clarity: View information under the brightest sun, thanks to 311 PPI and 500 nits of brightness.|60Hz refresh rate: Get smoother scrolling & navigation experience.;100 sports modes: Take your pick from 100 sports modes and ace your game.|Noise Health Suite: Know how your body is doing with the battery of fitness features.;Productivity suite: Get more work done with quick reply options, stock market updates, alarm and disconnect with smart DND when you want to.; Water Resistance Level: Water Resistant|Item Type Name: Smartwatch; Connectivity Technology: Usb; Included Components: ‎Smartwatch, Magnetic Charger, User Manual, Warranty Card", "user_id": "AEL5HU25IP7YT5WK3LXNC5M36NBA,AG6OO5TADBKM6RSXLN54U2LYYPXA,AFBICZEMDBBG2PL7T424USBD3PNQ,AH6KGRI6O5D37TRWQAKYLMWIZMKQ,AFQY3C6LSFBOO4FUHKKVD7Q6LFIQ,AEP3MKB5RNDLJPK4JW22FX74WKFQ,AFDTYPH2YS7I3XDWEY5I6RXU53MA,AEUXJSPLBCM6V4UCEVFPF53YC4GA", "user_name": "Sanjay G.,Vinay Bucha,Amazon Customer,arun,Rohit,Saly b,Aasim Ansari,Aniruddha Joshi", "review_id": "R14ALM4LONM07K,RBQ5KLENMT5W,RC8LE1R8ZUXK6,R2DOHSMCOKMG28,R23BQ1TQ435IEO,RX6XRNRWHWUBM,RQTVJP9U5HCTZ,R19QIA3XET90J7", "review_title": "Some improvement required,Not best for tracking sleep, calories burnt of heart rate.,Noise,Noise watch is good,NOISE,DOes everything well so far,Noises,Bluetooth calling", "review_content": "1. Please add app gallery when we do right to left swap on home screen. Because right to left swap or left to right swap have same pages.2. It should ring instead of vibrate in alarm or you can give it optional depends  on user.3. The temperature doesn't sync fast I have to go in the noisefit app  again and again and do it on and off in weather settings to sync feels like jugad. All these things can be fix from updates so pls try to do it,The watch looks cool and works very well but the sensors are not the most accurate. It shows that I am up 1 to 1½ hour every night when I am not also the heart rate is generally higher than what it actually is and the calories burnt are lower, the pedometer is more or less accurate,Nice one. Only Bp monitor is missing.,I like this product,I liked the watch very much,DOes everything well so far,I m happy,Good features", "img_link": "https://m.media-amazon.com/images/I/413x7j3Z30L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Noise-ColorFit-Bluetooth-Fully-Functional-Brightness/dp/B09ZQK9X8G/ref=sr_1_43?qid=1672902996&s=computers&sr=1-43"}
{"product_id": "B08ZJDWTJ1", "product_name": "Seagate Expansion 1TB External HDD - USB 3.0 for Windows and Mac with 3 yr Data Recovery Services, Portable Hard Drive (STKM1000400)", "category": "Computers&Accessories|ExternalDevices&DataStorage|ExternalHardDisks", "discounted_price": "₹4,098", "actual_price": "₹4,999", "discount_percentage": "18%", "rating": "4.5", "rating_count": "50,810", "about_product": "Digital Storage Capacity - 1TB; Get an extra layer of protection for your data with the included 3 year Rescue Data Recovery Services|Form Factor - 2.5 Inches, Hardware Interface - USB 3.0, Drive RPM - 5400|Password protected - No; Sleek and simple portable drive design for taking photos, movies, music, and more on-the-go|Automatic recognition of Windows and Mac computers for simple setup (Reformatting required for use with Time Machine)|Drag-and-drop file saving|USB 3.0 powered", "user_id": "AFWREBMJRX47V7TJD5E7VUBKZY3Q,AFKUWB5DABB7DVVRNJADCSDKFJ5Q,AGCKABAFBXEB4DLQSVS2YPRFULZA,AEWO5MXEBFN3PMJAXYAUXB4OMBOA,AGBNLIOKIT72A2TBLG6A35XUEIMQ,AGDC3KZSQJMQL3GNEEMOIZRKXUAQ,AENODPH3RWTEZMADDI7ZXXD5UBLQ,AGGJWLZDECN7FGJ45NLF4JOUE27A", "user_name": "Pallavi Varur,Amitasap,PRADEEP,Karma,JASWANTSINGH,Suhasini Muppidi,Atesham,Arun Kumar", "review_id": "R2BYIBOB1SJCU5,R27XI4KBBS4CO0,RNDLXV8UJZSO,R1HOQAPL2PXKNX,R3DZGHPLQSWOLO,R37YZ6CK8TNTM4,R3KPNR16XZW0ZH,R28BCVQ1MKZP7S", "review_title": "Good,gud,Hard disk,Good product,Serve the purpose,Seagate portable 1TB External Hard disc,Good,Good use", "review_content": "Good one.,gud,Hard disk is good but data cable quality poor,Finalised this product after a lot of research. It works well. Go for it.,Serve the purpose,Good one,Nice product,Still at work.", "img_link": "https://m.media-amazon.com/images/I/41igriVLabS._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Seagate-Expansion-1TB-External-HDD/dp/B08ZJDWTJ1/ref=sr_1_44?qid=1672902996&s=computers&sr=1-44"}
{"product_id": "B08FTFXNNB", "product_name": "HP w100 480P 30 FPS Digital Webcam with Built-in Mic, Plug and Play Setup, Wide-Angle View for Video Calling on Skype, Zoom, Microsoft Teams and Other Apps (Black)", "category": "Electronics|Cameras&Photography|VideoCameras", "discounted_price": "₹499", "actual_price": "₹1,999", "discount_percentage": "75%", "rating": "3.7", "rating_count": "3,369", "about_product": "HP w100 480P HD Web Camera enables the user to experience good quality video calls and supports video quality up to 640x480 pixels with the latest version of skype, zoom, facebook, etc. It comes with 60° wide angle view for stunning visual experience.|Designed to record videos with quality up to 640x480 pixels for your YouTube uploads or any other social media uploads. The webcam supports the tripod stand, just plug the webcam via the USB port into the computer.|Comes with built-in noise isolating Mic which helps to avoid noise during video chats or while recording videos and also included AWB(Automatic White Balance) so that you get clear and natural images.|Equipped with Tripod ready universals clip which fits perfectly to the laptop and LCD monitors. It has a ability to swivel 270°, up-down adjustable web camera.|Universal compatibility with Plug N Play feature which uses USB 2.0 for connectivity, makes it an essential gadget which can be used in your daily life irrespective of you being at office or home. 1 year manufacturer warranty on the device from the date of purchase.", "user_id": "AHLLRY3ISUM56WO2EJYCDE4J6E3Q,AGL2WQUXIVJ7MJZO2FQA5YEEKYGA,AGPMMNZ6KT752BNQNASY52CKSHHA,AFTPAQY425APNC5O64CFVBNYGUMA,AFFGWYKF2QF2IRGERWSNOLQ2QW7A,AFFQMKXLAXT54MS2POKG6RZSRQXA,AE3ZQLAKLHGLFWBN2LOJTSYYN7HA,AHI4OYSIYXJIJIXAO73LAUJTEICQ", "user_name": "IC,neetu singh,Prasenjit Jana,DANGAR RAMABEN KARSHANBHAI,Kushal,M.Pradhan,Naresh,ANURAG GUPTA", "review_id": "RXPIU94G6Y8XR,RG8WXHVO3Q5BN,R2VKT81SI4UN3S,R1TH2LQCYPBXMS,R1XO0RGL2VW166,R2WSQJGLL679MI,R1CEANV7C25XJ6,R2SFO5ZGKFMA3A", "review_title": "Value for money, good wuality,Reliable and easy to use 👌,Good,AVARAGE PRODUCT,VGA quality!!,No mic is available in the product,Basic functions ok,Good when used in day light", "review_content": "The video is slight zoomed in, which is great for office work since you want it to focus on face rather than the rest of the background. However there is a slight tinge of sepia (warm temperature) in the picture quality/ hence reduced 1 star. Really cost effective!,Product helped me in my live classes,Yes,THIS PRODUCT IS AN AVERAGE PRODUCT. PICTURE QUALITY IS OK OK AND ALSO MIKE IS WORKING OK OK CALLER LISTENS TO YOUR VOICE NORMALLY. BUT ITS GOOD TO USE FOR THE OFFICE OR HOME FOR SKYPE CALLING OR ZOOM MEETINGS.,the picture quality is crap!! tbh,No mic,Quick setup, no downloads needed, built quality no complaints, picture quality just near average, mic quality ok, could be cheaper,It is good in daylight if you have window to for sunlight when you use it work better. In the night it start lagging (you need too much lighting in the night that may harm your eyes and start headache)I gave 4 bc of pricing but 3 star for camera quality. (Bcz not good in night)", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/31XFxTn1DCL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/HP-Webcam-Wide-Angle-Calling-Microsoft/dp/B08FTFXNNB/ref=sr_1_45?qid=1672902996&s=computers&sr=1-45"}
{"product_id": "B08YDFX7Y1", "product_name": "ZEBRONICS Zeb-Dash Plus 2.4GHz High Precision Wireless Mouse with up to 1600 DPI, Power Saving Mode, Nano Receiver and Plug & Play Usage - USB", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹299", "actual_price": "₹449", "discount_percentage": "33%", "rating": "3.5", "rating_count": "11,827", "about_product": "DESIGN: Wireless Mouse with Ergonomic form factor|BUTTONS: 4 Buttons: Left/Right/Scroll Click/DPI Switch|RECEIVER: USB Nano Receiver|FEATURES: 2.4GHz High Precision mouse with Power saving mode|TRACKING: 800/1200/1600 DPI Optical Sensor|USAGE: Best for Laptop/PC/Mac", "user_id": "AFJ7UDS63R5ITGAMOSRK7KNWHSSA,AH7ZV5NZPWUYLZQLPVYXXYV4VOVA,AHIHRVMHYHOH5D52QNATDQ6G3VRQ,AFDTXWDJNXAYUGM542YUPNIBHBOQ,AFICHFCZ5WJJOZ6HM67EQ2L3YYTA,AEP7EC356VG6MRFKXMOMUB7P54XA,AG2SFK64KDQ5YXJ2DRZSQHA7IAIQ,AGKFITVCPLXDAGC5SLHFRLXPQYYA", "user_name": "Wilson Patel,Sneha m,Karthikeyan G,Karnal kumar,Deepak Rathod,Kumar Satyam,Arun Sharma,Placeholder", "review_id": "RLR4ETD7RIB3P,R2TLZ8IYTYAIJR,R3C4LR2YHIRZ95,R3M7POECW3UFL3,R31RTO2FZW8SEN,RV2OCYSB602OB,R31GOALBI9UPLK,R1CTAKZMHTLVVO", "review_title": "Useful for simple use,Great product,Good,Good but not satisfying 🙂,Good product,Good product at this price.,Not for gaming,Good product.", "review_content": "I have used it for week now on daily basis. It's a good product.1.For normal use It's great. You can use it with ease.2. For game 🎮  also it is usable but it's littel bit on heavy side Its unnoticeable if you are not that habitable to play games.3 sleep mode is a good feature which helps to save battery 🔋. And you don't have to worry about killing the switch whenever you leave the pc.,Nice product,Value for money,This mouse is very noisy and small too.I have returned this mouse because I got a better product of Quantum with keyboard which satisfies me.Also this mouse package doesn't contain any battery.So, you should care and think twice before purchasing this product.,Nice product so far it working smooth,Good product at this price. But after falling down it gets broken.,Good for basic use not for gaming.,I like this product.", "img_link": "https://m.media-amazon.com/images/I/31HWJqJdtjL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/ZEBRONICS-Zeb-Dash-Wireless-Receiver-Buttons/dp/B08YDFX7Y1/ref=sr_1_46?qid=1672902996&s=computers&sr=1-46"}
{"product_id": "B08HDJ86NZ", "product_name": "boAt Deuce USB 300 2 in 1 Type-C & Micro USB Stress Resistant, Tangle-Free, Sturdy Cable with 3A Fast Charging & 480mbps Data Transmission, 10000+ Bends Lifespan and Extended 1.5m Length(Martian Red)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹329", "actual_price": "₹699", "discount_percentage": "53%", "rating": "4.2", "rating_count": "94,364", "about_product": "The boAt Deuce USB 300 2 in 1 cable is compatible with smartphones, tablets, PC peripherals, Bluetooth speakers, power banks and all other devices with Type-C as well as Micro USB port|It ensures 3A fast charging and data transmissions with rapid sync at 480 mbps|The premium Nylon braided skin makes it sturdy and invincible against external damage|Its Aluminium alloy shell housing makes it last longer with 10000+ Bends Lifespan with extended frame protection for strain relief|The resilient and flexible design offers a tangle free experience seamlessly|Deuce USB 300 cable offers a perfect 1.5 meters in length for smooth & hassle-free user experience|2 years warranty from the date of purchase", "user_id": "AEWAZDZZJLQUYVOVGBEUKSLXHQ5A,AG5HTSFRRE6NL3M5SGCUQBP7YSCA,AH725ST5NW2Y4JZPKUNTIJCUK2BA,AHV3TXIFCJPMS4D5JATCEUR266MQ,AGWIGDEMFIIUAOXYY2QATNBSUGHA,AFSTSLQUV4EVEXWKBOLEFHL2H5YQ,AGAKDNBHY2FKX7I4ACRGILU7QL7A,AFNWJUWJRHCC6HN52KMG5AKZY37Q", "user_name": "Omkar dhale,JD,HEMALATHA,Ajwadh a.,amar singh chouhan,Ravi Siddan,Himanshu Goel,Udaykumar", "review_id": "R3EEUZKKK9J36I,R3HJVYCLYOY554,REDECAZ7AMPQC,R1CLH2ULIVG5U3,R2DMKIBGFKBD6R,RC89B5IAJUTR5,R3B3DDON5FH8DS,R13WAEJDI5RS36", "review_title": "Good product,Good one,Nice,Really nice product,Very first time change,Good,Fine product but could be better,Very nice it's charging like jet", "review_content": "Good product,long wire,Charges good,Nice,I bought this cable for Rs.339 worthy product for this price, i tested it in various charger adapters 33w and 18w it supports fast charging as well.,Good,Ok,I had got this at good price on sale on Amazon and product is useful with warranty but for warranty you need to go very far not practical for such a cost and mine micro to type c connector stopped working after few days only.,I like this product", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41V5FtEWPkL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Deuce-300-Resistant-Tangle-Free-Transmission/dp/B08HDJ86NZ/ref=sr_1_47?qid=1672902996&s=computers&sr=1-47"}
{"product_id": "B087FXHB6J", "product_name": "Zebronics Zeb-Companion 107 USB Wireless Keyboard and Mouse Set with Nano Receiver (Black)", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Keyboard&MouseSets", "discounted_price": "₹699", "actual_price": "₹999", "discount_percentage": "30%", "rating": "3.5", "rating_count": "15,295", "about_product": "Keyboard Interface USB (Nano receiver) Total No.of Keys 104|Companion 107 is a wireless keyboard and mouse combo that comes with a nano receiver built for home/office use. Plug and Play|Mouse Interface USB (Nano Receiver) Resolution 1200 DPI No. of Buttons 3|Mouse High Precision Compact & Ergonomic Design Advanced optical sensor technology Nano Receiver Plug and Play|The mouse that tags in this combo is ergonomically designed and super compact. It is a high precision mouse with 1200 DPI, and three buttons.|1 Year warranty-from the date of purchase|The keyboard features 104 keys inclusive of a rupee key. It has a low battery LED indication,and a power-saving mode.", "user_id": "AEU3E6TTMRR3RHIFOK3IF6XYSDLQ,AEZYNEENP5XHNOPLJJETULXZCA3A,AEGIDWKG4HE7J5FFY65JSBQTELFA,AG5DWPD54QGSLWJ6QUFERLPNAX4Q,AGHNMCD4YF3P2TJZ4OARR35PZT5Q,AEXUB3TKS66IKTFNZZYLP4CJ2IZQ,AFGWFXKWBDBAQ6Q2FCANAK7ZJGUA,AFZDR5KNLP6HTBN33LC3AZ472J5A", "user_name": "HARDIK A.,JAYANTH,Huq Enterprises,E.C.GEORGE,Prince of world,vishwanath pratap yadav,Gurumoorthi,HIMANSHU JOSHIYARA", "review_id": "R1ZFP957X6NEUB,R1V5NJVJMX27HK,R37W2Z08BFVMN2,R23NRC2SDTFP1R,R2IDKTNLPSRRXA,R3TRXLCPJ7CXLS,R2RQD6H9YMSUK6,RS9ZB4H3Y5CQZ", "review_title": "Worth Buying !,Good one for the offered price,Good one in that budget,Good one.,best at that price.,good,Ok,Very good product", "review_content": "I am using this Product from last 12 days, and its working great.Keyboard:- Keys are really soft touch and almost soundless. It automatically goes in power saving mode with in 1m20sec when not in use.Mouse:- works smooth works almost on every surface .Fast-typers  can also use this product. - YES.Just that the material/plastic of the keyboard is expected within this price.,This model companion 102 Keyboard buttons are not as comparable /comfortable as other standard basic model availableHowever we need to  practice to get used to it .Overall it is ok for rough use , where we can avoid using laptop keyboard ..Keyboard requires AAA battery and mouse require AA battery.. it could have maintained same.. need to check battery life of keyboard.Mouse doesn't come with on off button to save battery life.,Good,For the space I'm using, it's good. One of the key came out then I've to replace. Now working well. But not dependable bcos if u r not careful...... when the next one comes out can't say then it's useless.,keyboard is excelent, but mouse quality is below average...but at that price a perfect choice.,good,Ok,Very good product", "img_link": "https://m.media-amazon.com/images/I/41UUBwBt05S._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Zebronics-Zeb-Companion-107-Wireless-Keyboard/dp/B087FXHB6J/ref=sr_1_48?qid=1672902996&s=computers&sr=1-48"}
{"product_id": "B07N42JB4S", "product_name": "SYVO WT 3130 Aluminum Tripod (133CM), Universal Lightweight Tripod with Mobile Phone Holder Mount & Carry Bag for All Smart Phones, Gopro, Cameras - Brown", "category": "Electronics|Cameras&Photography|Accessories|Tripods&Monopods|Tabletop&TravelTripods", "discounted_price": "₹799", "actual_price": "₹3,990", "discount_percentage": "80%", "rating": "4.3", "rating_count": "27,139", "about_product": "LIGHTWEIGHT AND COMPACT: Weighs just over a pound. Extends to 22\", 30\", 40\" and 50\". Minimum Height: 16\". Carrying case included.. Centre Shaft Jacking System:Turn this button lightly to control jacking system. When the button is loose, the center shaft can up and down easily. When the button turn to tight, the height can be fixed. Camera can up and down smoothly and moving stably. The fully extended length can up to 105cm.|UNIVERSAL CELLPHONE HOLDER: Easy attachment & padded grip to avoid cellphone damage / Adjustable phone adapter fits all phone with a maximum stretch width of 3.4\".|LEVEL INDICATOR: Built-in bubble view levels and 3-way head to allow for tilt and swivel motion; portrait or landscape options.|WIDELY COMPATIBLE: Compatible with all video cameras, digital cameras, still cameras, projector, GoPro devices, smart phone adapters, and scopes.|3-Section, Lever-Lock Legs: Uneven terrain? Need to frame the shot just so? The tripod effortlessly accommodates custom set-ups thanks to its lever-lock legs, each with three extendable sections.|LIGHTWEIGHT AND COMPACT: Weighs just over a pound. Extends to 22\", 30\", 40\" and 50\". Minimum Height: 16\". Carrying case included.. Centre Shaft Jacking System:Turn this button lightly to control jacking system. When the button is loose, the center shaft can up and down easily. When the button turn to tight, the height can be fixed. Camera can up and down smoothly and moving stably. The fully extended length can up to 105cm.|UNIVERSAL CELLPHONE HOLDER: Easy attachment & padded grip to avoid cellphone damage / Adjustable phone adapter fits all phone with a maximum stretch width of 3.4\".", "user_id": "AEDCAWW6MGT4UO4RRH7NOK3EH5SA,AFMZX4QR2GN2JMC5GZS66RJM4YTQ,AFLG2PW5COQFF4ALCTWAHMWQ5XBQ,AGT75OEHIEIVEH3WH3ARDJGVUM2Q,AEZW37RE5IIP2MCYW7NCWO3CTJCA,AFGLU4AR4M7DZADQJX5SUGNZW7UQ,AG6YU7BHITXUFJ22336KYWROTZKA,AFWHBJHINMLO6RESQFNCY27BFGHQ", "user_name": "Mananveer singh,Lavanya.G,Ananta Bhaskar Somawanshi,JYOTHI. N,Jaikrit,Govind Prajapati,Amazon Customer,Ramanjaneyulu", "review_id": "R2BUP3AXKYUHYP,R3B772KI95MWNX,R7R351CJN43NM,R84AXG1XCM1R3,RYCTR2UZGN6GU,R1VNKAJ163SXLP,R310TJNPM9I9ZO,R231H2ZVU5558I", "review_title": "Very Good for Beginners,Light weight & sturdy,Product is good and light weight.,Excellent,Easy to use and light weight to carry,Superb tripod, I'm happy🙂,good product,Ok Good", "review_content": "I recently purchased a tripod online from Amazon and I am very pleased with the purchase. The product arrived quickly and was well packaged, making it easy to set up. The construction is solid and sturdy, allowing me to confidently use my camera without fear of any wobbling or shaking. In addition, the price was extremely affordable compared to similar products on other sites. Overall, I would highly recommend this product for anyone looking for an inexpensive yet reliable tripod!,Product is good as expected, sturdy, light weight and good for beginnersThank you,Product is good and light weight.,I like it very much the product was amazing at affordable price it very useful and helpful for beginners,It is very easy to use and light weight to carry around. Great tool for clicking pictures on a scenic holiday.,It's stability is perfect. Beginners can start with it👍,like the stability and mobile holder,Simply Superb this one for phones & cameras", "img_link": "https://m.media-amazon.com/images/I/41Fm0YcrDqL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Syvo-3130-Aluminum-Universal-Lightweight/dp/B07N42JB4S/ref=sr_1_49?qid=1672902997&s=computers&sr=1-49"}
{"product_id": "B0B31BYXQQ", "product_name": "Boult Audio Airbass Z20 True Wireless, 40H Battery Life, Zen ENC Mic, Type-C Lightning Boult Fast Charging (10Mins=100Mins), BoomX Tech Bass, ENC, IPX5 in Ear Earbuds with mic (Green)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹1,399", "actual_price": "₹5,499", "discount_percentage": "75%", "rating": "3.9", "rating_count": "9,504", "about_product": "Offers playback time of up to 10 hours for every charge. Carrying case can give 4 additional charges to the earbuds making total play-time of up to 40 Hours.Note : If the size of the earbud tips does not match the size of your ear canals or the headset is not worn properly in your ears, you may not obtain the correct sound qualities or call performance. Change the earbud tips to ones that fit more snugly in your ears|Touch Controls & Voice Assistant: With one multifunction button, you can play/pause, previous/next track and answer/hang-up calls. Voice assistant function lets you access Siri/Google Assistant.|[Auto pairing ] Automatically pair with your device as soon as you take them out of the case. No need to manually pair to your device each time|IPX5 Water Resistant - Can comfortably be used in the outdoors or in the gym.", "user_id": "AGGSPBWHNKPM222VK2PCN4PHRMWQ,AHKPIQ3BNCTJ2EVZ3SWK45X6S2MQ,AEZ4XP6EQ5UIJF5YHBGJ3EPP4MOA,AFIND4QQKETURXU76GI6655ZFS4Q,AF6SCWIB7NVHZI4WWZHXAY2JJUGA,AEE2XYKFE3DMNYQTOCBK3PEVORQA,AH7X6273K5JCM64M6H4NHACJNOPQ,AHJE2BSA3PARAUPU7WEXWJ6WS3KQ", "user_name": "Ruman,deep,Jatin Sawhney,Nehru,P R Vedprakash,LEO SELVARATHINAM,Adil,Ashish Srinivas", "review_id": "R3Q0EFB6CKAL4W,R3SBR1YRGFORQV,RHK2VI4OFC8UW,R1QPBRC7ZDKAB6,R2QKG9AO1MMHNQ,RLC1RHGMCZS55,R4RMB9P1YZJV3,R3L44D00WINPGV", "review_title": "Best to use wid like any phone.....it has great range,Good in this budget,Good,Very good for music lovers,Nice product,Boult audio airbass z20 review,Good product impressive,Worth of buying", "review_content": "Everything is good as I've used like a lot of earbudss nd this one i found is quite ammusing.....like i didn't get the nice range quality as in my device never cncts wid every wireless device..... but it connected wid my device nd it works swesome,After using the Bluetooth around one week i experience that call quality is average but you can use this to listen music if you are not base lover.,Bass quality is good can be better.,Overall it's good but there is small disubence during driving  with in the range,Nice and good product. Liked it,SOUND IS GOOD BUT QUALITY NORMAL,Good product impressive,Sound nd bass is good nd value for money", "img_link": "https://m.media-amazon.com/images/I/31Hjf7KD75L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Boult-Audio-Lightning-Environmental-Cancellation/dp/B0B31BYXQQ/ref=sr_1_50?qid=1672902997&s=computers&sr=1-50"}
{"product_id": "B08CF3B7N1", "product_name": "Portronics Konnect L 1.2M Fast Charging 3A 8 Pin USB Cable with Charge & Sync Function for iPhone, iPad (Grey)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹154", "actual_price": "₹399", "discount_percentage": "61%", "rating": "4.2", "rating_count": "16,905", "about_product": "[CHARGE & SYNC FUNCTION]- This cable comes with charging & Data sync function|[HIGH QUALITY MATERIAL]- TPE + Nylon Material to make sure that the life of the cable is enhanced significantly|[LONG CORD]- The Cable is extra thick 1.2 meter long, optimized for an easy use for your comfort at home or office|[MORE DURABLE]-This cable is unique interms of design and multi-use and is positioned to provide the best comfort and performance while using|[UNIVERSAL COMPATIBILITY]- Compatible with all devices like iPhone XS, X, XR, 8, 7, 6S, 6, 5S, iPad Pro, iPad mini and iPad Air", "user_id": "AE3Q6KSUK5P75D5HFYHCRAOLODSA,AFUGIFH5ZAFXRDSZHM4QB2KPKFUQ,AFK4NJOLFSJGWLOJIUIAROJF6YVA,AFUOTYRFUXVPEBGIXVZZ7DR3CZUA,AFDLRSXKDZ6U3U3KD46SQLFGZQRA,AH5VLM66SIK7J3IRG4NY7XVOQ55A,AE3MQNNHHLUHXURL5S7IAR7JTGNQ,AFSEOFZY67MYC7UAJU264Z5NFTLA", "user_name": "rahuls6099,Swasat Borah,Ajay Wadke,Pranali,RVK,Bhargav,Durai Vignesh,Amazon Customer", "review_id": "R1BP4L2HH9TFUP,R16PVJEXKV6QZS,R2UPDB81N66T4P,R3KK4GT934ST3I,RCFHMWUSBIJO,RDO7DACXMAJ84,R3A6MEZL3LY66Z,R1ESIEKPGAYA29", "review_title": "As good as original,Decent,Good one for secondary use,Best quality,GOOD,Amazing product at a mind blowing price!,Nice Quality,Good product", "review_content": "Bought this instead of original apple, does the work for 150rs, not as fast as apple charger but its a good option if you want cheap and good product, bought it for iPad pro 10.5 and it's working flawlessly, build quality is ok, its not like i am gonna hang my clothes on it and i want a very strong cable, even a braided cable stop working after a year, i have used both Anker and Apple store strong braided cable they all stop working after a year so please don't buy high end cables just for that instead choose a this one and even if it's stops working withing a year you only loose 150rs compares to 2000rs.UPDATE------------------------------------pin has stopped charging from one side, now i have to slip the pin to charge from other side, but i will update and let know for how long does it work,,It’s good. Not sure about durability as the pin area feels a bit fragile,Does not support apple carplaySo was little disappointed about thatOther than that cable is made up of very good quality,Best to buy,100% NOT FATHFUL,Writing this review post 10 months and 3 orders of the same product.Honestly Portronics Konnect L lightning cable works like magic with the original Apple charging brick.Seeing the price of the cable I initially hesitated buying as it was as low as ₹99/- with the offers and so I wasn’t sure if it would work well with my iPhone 12 or whether it would impact my iPhone’s battery health because all the other lightning cable brands were costing over ₹350/- like Wayona, Amazon Basics, etc.Earlier I was using Wayona Brand lightning cable with eventually frayed and stopped working.Charging Speed:Charges my iPhone fast enough almost similar compared to the original cable level when used with 12W Original Apple power adapter.Quality and Durability:Great quality braided cable and doesn’t tangle easily and can withstand day-to-day usage.L-Shaped pin:This is very innovative by Portronics and it makes sure the cable doesn’t get damaged even if used while charging.CarPlay and Data Sync:Works smoothly with CarPlay and syncs data effortlessly.PS: I have used this cable only with the Original Apple Charging Brick and extremely satisfied with its performance.,Better than I expect the product I like that Quality and I plan to buy same type cable come with usb C to Lighting cable for emergency purpose that much I love this cable. Buy for this cable only emergency uses only since Good one,Good product and value for money", "img_link": "https://m.media-amazon.com/images/I/31VzNhhqifL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Portronics-Konnect-POR-1080-Charging-Function/dp/B08CF3B7N1/ref=sr_1_51?qid=1672902997&s=computers&sr=1-51"}
{"product_id": "B07SLMR1K6", "product_name": "SanDisk Ultra Flair 64GB USB 3.0 Pen Drive, Multicolor", "category": "Computers&Accessories|ExternalDevices&DataStorage|PenDrives", "discounted_price": "₹519", "actual_price": "₹1,350", "discount_percentage": "62%", "rating": "4.3", "rating_count": "30,058", "about_product": "High-speed USB 3.0 performance of up to 150MB/s read speeds|Transfer a full-length movie in less than 30 seconds!|The drive’s durable and stylish metal casing keeps your important files safe, while the included SanDisk SecureAccess software lets you password-protect and encrypt your sensitive files|Compatible with both USB 2.0 and 3.0 ports, Operating temperature32° – 95°F (0° – 35°C)|Country of Origin: Malaysia|9th Generation Intel Core i9 ProcessorsProducts formerly Coffee LakeDesktopLithography14 nmProcessor Base Frequency3.60 GHzTDP95 WIntel UHD Graphics 630350 MHz|BX80684I99900K", "user_id": "AHTYSJ2UVZO5LT77K37P423ZMQXQ,AHYQION7F7POWPGNNAFXPK64RSNQ,AHKUNPS4ZAWFCFMIOFSKV5LF7IOA,AH4O4H2WHIKNWUYTERTGOH4FFY7A,AFIS2LYGKHAXZN6NFF2JJI2M4TBA,AFQLKJFTCAK4X2YI2B72OID4IVLA,AHQIKKPBVNWP27JVQYZSYMEG6XAA,AGKYYB6ZSV2OI4BSXLKISFSFLGUA", "user_name": "Akash Kumar,Anil Kumar,saijayanth,Rajib A.,Vinit Sarin,Ravinder Gautom,Yogesh Karel,MANISH KUMAR", "review_id": "R1HP1ZGFB28GM7,R3JCTIK67UAT4K,R2S9JBF2ECD6C6,R2M4VC26VFSJ5K,R2I3JCCVO4U03G,R3NOWQBXUGHRI9,R3ULD6B7PBI3FQ,R2UQOW05XNOHS5", "review_title": "Great pendrive,Value for money,Good,Kaafi slow hai, heating issue bhi hai,Good and fast drive,It is best pendrive at this prize.,Satisfactory with a bit heating issue.,Average", "review_content": "Initially the pendrive i got was getting very hot when inserted and without doing anything but then i applied for exchange and the second time i got a pendrive it just gets little bit warm and is much better than first time. I had called SanDisk for first pendrive and they asked me ask for replacement so i did and second time I've got good pendrive. Go for it.,Best quality and value for money,Working good,60 percent Good40 percent badHeating very fast because of the metal body I guess,kind of slowBuilt quality is good,Since it's metal, the build quality is great but causes heating issue when transferring files for longer periods of time, otherwise performs as expected,It is best pendrive at this prize and speed is good. I suggest u can buy without any worry,The quality of pen drive is absolutely good as expected but yes as other customers mentioned in comments about the heating issue.. Yes it heats up but only when its actually in use.. means while transfers or hardcore use of pendrive but when left idle its completely normal. I forgot the pendrive attached until afternoon but it was completely normal.. No heating issue once the transfer was done.,Average", "img_link": "https://m.media-amazon.com/images/I/317KlchuxeL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SanDisk-Ultra-Flair-USB-64GB/dp/B07SLMR1K6/ref=sr_1_52?qid=1672902997&s=computers&sr=1-52"}
{"product_id": "B09MQSCJQ1", "product_name": "boAt Xtend Smartwatch with Alexa Built-in, 1.69” HD Display, Multiple Watch Faces, Stress Monitor, Heart & SpO2 Monitoring, 14 Sports Modes, Sleep Monitor, 5 ATM & 7 Days Battery(Charcoal Black)", "category": "Electronics|WearableTechnology|SmartWatches", "discounted_price": "₹2,299", "actual_price": "₹7,990", "discount_percentage": "71%", "rating": "4.2", "rating_count": "69,619", "about_product": "Alexa- Alexa built-in Voice Assistant that sets reminders, alarms and answers questions from weather forecasts to live cricket scores at your command!|Screen Size- ;1.69\" big square colour LCD display with a round dial features complete capacitive touch experience to let you take control, effortlessly.|Watch Faces- Multiple watch faces with customizable options to match your OOTD, every day!|Brightness- The ambient light display allows automatic adjustment of brightness on the watch, suited to your environment|HR & SpO2- The watch comes with a stress monitor that reads your HR to indicate stress levels.It also monitors your heart rate and SpO2 (blood oxygen levels) to keep a tab on your overall health.|Sleep Monitor- Track all stages of sleep every night and keep a tab on your sleep health with the sleep monitoring feature on the watch.|Sports Friendly- Its 14 sports mode and 5 ATM dust, splash and sweat resistance makes it the perfect fitness companion to have.", "user_id": "AFBVVELP4GVFVUNT2JCI5JHVGRWQ,AGN6VHI3RRN2EETVG2K6AU54UJ2Q,AEGXNXBUADLS35GCQLX7K5EIFU2A,AGRLRL4UJ4K36QPX6NY4X5ZETZEA,AFB7KATBZJ56CDSFNRN5GVI5WLWA,AEQLEDKX266NBPOVEJSVR35XNFYA,AH4EQ3AD64V4T45VEG3L4LK7IGQA,AH4EGLGTSXX4GYBAOERNBPVIKD6A", "user_name": "Andy,Deepak Karki,B J SHIVA SHANKAR,Shakil A.,Vikas Jeughale,Priti raut,Vikas,Amit T.", "review_id": "R2LYKHFGZWSYDL,R2LAYGYWWKW3YG,RAG4DPQGRW30H,RY14T5VSHXOVL,R32YZCYBC5ZRV5,R1DMAEV6DQYUOD,RNR9AZJON6EHU,R2NUKH8120XBX1", "review_title": "Best Budget watch,MERA WAQT BADAL KE RAKH DIYA!!,Nice product and user friendly compare to other smart watch,Nice watch...,Vikas,Nice,Not worth it,Grt", "review_content": ",Wow!!! Just wow!!! How can a beautiful product like this exist at such an affordable price?! I mean I am simply amazed by this watch. Kya dikhti hai yaar aur kya waqt dikhati hai yaar. Yeh ghadi tik-tik toh nahin chalti but it has made my life tracking theek-theek for sure since the day it is with me. I love this watch. The accuracy, colour (black), weight, apperance, etc. are so so so amazing.Giving 4 stars because its mobile app sucks for real. Mobile connectivity has a lot to be improvised. It could have been upto the mark agar ghadi banane pe itna kharcha kar hi diya hai toh :(,Nice product and user friendly compare to other smart watch.,Nice watch,Noise is best...it's very useful product,I like,After 6 months the charging is not working,Good productI hv used this product since 1 year", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41lQan54SPL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/boAt-Display-Multiple-Monitoring-Charcoal/dp/B09MQSCJQ1/ref=sr_1_53?qid=1672902997&s=computers&sr=1-53"}
{"product_id": "B094YFFSMY", "product_name": "Tygot Bluetooth Extendable Selfie Sticks with Wireless Remote and Tripod Stand, 3-in-1 Multifunctional Selfie Stick with Tripod Stand Compatible with iPhone/OnePlus/Samsung/Oppo/Vivo and All Phones", "category": "Electronics|Mobiles&Accessories|MobileAccessories|Photo&VideoAccessories|SelfieSticks", "discounted_price": "₹399", "actual_price": "₹1,999", "discount_percentage": "80%", "rating": "4.0", "rating_count": "3,382", "about_product": "This is a Bluetooth Enabled selfie Stick for Mobile Phone. Just click the wireless remote to capture the photo|Bluetooth Selfie Stick is provided with a tiny wireless remote that can be connected to your phone and can be used up to about 15 Ft|Ultra Light Selfie Stick can be used to Take selfies or capture your favourate videos. This multifunction tripod with selfie stick weighs only 113 Grams.. Rubber Grip : No|Tygot Mobile Selfie Stick is compact and foldable. It can be Extended up to 60 Cms long|Selfie Stand for Mobile Phone can be Rotated to 360 degree + 220 Degree Angular Adjustment", "user_id": "AHTVBHRLCBX5E5GBPONFYZLCNBGQ,AEXRBZRUCAA7B3P4I2W344GKKEKQ,AGCRWVPOVID3SCYSXUIFZNEVZ5KQ,AFLG2PW5COQFF4ALCTWAHMWQ5XBQ,AGTYNRS4BMV64TFKAWN5BGOC3RLQ,AH4SGJXQP3YL7ZSOBVDVA6EF6NNQ,AEE6GBKI25S2XX77PN4SZTH7KWTQ,AFQREO7QQWGS5QZYY2VUNQKV5VPA", "user_name": "Shekhar Badola,Pravin,Kishor,Ananta Bhaskar Somawanshi,Anonymous,Jyothi,Rishi,Amazon Customer", "review_id": "R3BGA0IR8XWNFF,R1Z9SVTENNC9JG,RE5OA1UZUJM9W,R285X2YEP7XRRW,R1ENCB49VUPLIC,R23RJUU2U87L75,RM2L3W83I8OIA,R6BV56BS9PVP9", "review_title": "Value for Money,After 1 month usage review,Good product,Product is good and light weight.,Good product,Nice product.Bluetooth option Is good,Can go for it, not much stable but a decent product,Seems to be a good product by first use", "review_content": "The selfie stick is made up of cheap quality plastic.However the built structure of the selfie stick is stable and even the tripod stand will provide you ample support to make a video  time lapse or a portrait selfie.Recommended to all video bloggers who have just started their channels on YouTube or any other sites.Its worth a product with the money we are paying to purchase it.,Did take this product on a trip. It's good but I was always afraid whether it's going to fell from the stand. The holder is clumpsy, cannot hold it tighter. Need another person help to insert the phone in the stand or need to sit down and stretch the phone holder to insert the phone. Maybe not worth 399₹. Let me know if you have any other doubts,It is user friendly,Product is good and light weight.,Works well and Bluetooth connectivity is also good.,Nice product.Bluetooth option Is good,Stability is ok only, otherwise a decent product,Good product", "img_link": "https://m.media-amazon.com/images/I/41MmsYTi06L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Tygot-Bluetooth-Extendable-Multifunctional-Compatible/dp/B094YFFSMY/ref=sr_1_54?qid=1672902997&s=computers&sr=1-54"}
{"product_id": "B092X94QNQ", "product_name": "boAt Rockerz 330 in-Ear Bluetooth Neckband with Upto 30 Hours Playtime, ASAP  Charge, Signature Sound, Dual Pairing & IPX5 with Mic (Active Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹1,499", "actual_price": "₹3,990", "discount_percentage": "62%", "rating": "4.1", "rating_count": "1,09,864", "about_product": "Playback- Keep dancing to the tunes of your moods all day long as Rockerz 330 is backed with a playtime of upto 30 hours.|ASAP Charge- Charge for only 10 mins and get a playtime of 10 hours, so get yourself ready to flip through your favourite play list. Charge for 40 minutes to get full charge. Driver Size: 10mm x 2 Drivers|Drivers- The unbeatable boAt signature sound shines through no matter what you're playing via its powerful 10mm drivers, Charging Time 30-40 mins|IP Rating- Rockerz 330 is marked with IPX5 water and sweat resistance for a carefree listening time.|Dual Pairing- Take the advantage of dual pairing and connect 2 devices at once and enjoy real-time audio with Bluetooth v5.0|Design- The ergonomically designed neckband dons magnetic earbuds, has a premium alloy metal control board with high-grade silicone finish. Note- They do not support play/pause function|Controls and VA- Command your playback, hands-free and activate smart voice assistant easily via its smooth integrated controls|1 year warranty from the date of purchase", "user_id": "AFLLCZFPCLWLDKVX63KDI75LX7EA,AG6UWS47VN74SMHL4KL57DEJMBIA,AHVRHERJSRHVM63FSTZZI5SRWFKQ,AEXK4GFZSUC45HV5ZMD6ZSF2CK2Q,AGEE5MMSCUBGNWYJ3WY622OZ7Y6Q", "user_name": "Srikar Kandikonda,Alden Andrews,Bharat Gidh,Praveen S,Varun Jadhav", "review_id": "R1E0E2U9FSYVCE,R1XW3BIC0SBBJY,R1WOPI53IJ9804,R29PDCDRZOK9OT,RP5AN5NRHB0TT", "review_title": "First day impressions: A BEAST!,A decent all rounder.,All good but multiple pairing is awful,Good Product by BoAt,Good Product (but Not well-finished) at a Fair Price of 1599", "review_content": "As I browsed various multiple earphones in this range on a not-so-busy workday break, I came across this very feature-packed product. It seemed interesting - and had something called DIRAC Opteo in it + ANC. So I thought I'd give it a shot.First-day impressions - it's blown me away!Exhaustive list of impressions:1. DIRAC OPTEO: Balanced sound with punchy bass! Yeah, and not booming bass. It's so great and I'm quite surprised it sounds like something you'd expect at a higher price point.  1.1 Soundstage: As soon as the headphone is switched on, it starts in 'battery saving mode'. Once you turn on DIRAC Opteo mode, you can literally feel the space opening up. All the instruments feel individual and sound separated. Fireflies (by Owl City) sounds lovely and all the strings sway in the centre while the various zaps and buzzes surround you. It's really great for the price!  1.2 Treble and Mids: Clean and clear. The bass doesn't overpower them and feels just right. The vocals come out clearly and all the instruments don't interfere with it (Drive home by Steven Wilson sounds great!).  1.3 Bass: Punchy and tight. I love how it fizzles in 'Bonfire' (by Knife Party) and how it reverberates in 'Turn Down for what' (by DJ Snake). 'Breakin' a Sweat'(by Skrillex, Zedd) sounded tight and I discovered how well produced it is! Lovers of tight bass, this is your product!2. Volume: It gets really loud. So loud that I can't listen to it at the highest setting. But if that's your thing, then you should know that the highs get pretty shrill at the setting, but the bass is still pretty clean and loud!3. ANC: ANC is present, but won't drown everything out. It's a great add on but if you're looking for a headphone to make all sounds around you zero, then this won't do that. If you need to drown out some noise while you listen to your tunes, this will do the trick!  3.1 Ambient Sound mode: The opposite of ANC, it pulls in the outside noise to let you have a conversation. Again, you can't blast tunes at high volume and still have a convo, but you can listen with lower volume (near 25% volume) and hear things around you. If the ambient sound also increased as I increased volume, it would have been amazing.4. Calling: Did a couple of calls. With no-noise, the other person said I sounded great! I took a couple of calls in a local grocery store (was pretty loud) and the other end had no issue hearing me.5. Buttons: The button placement is easy and I didn't feel any issue getting used to the controls. The simple manual explains everything in 2 mins, so read once and you're good to go.  5.1 To note: The sound is best in DIRAC Opteo mode. Every time you turn it on, you have to double press the multi function button to turn it on. I'd have loved having it on by default. Also every time I turn it on, it plays a 3-4 second tune, which could have been shorter. (Imagine hearing it every time you turn the thing on. Ugh.)6. Connectivity: Once I connected it to my phone the first time, it connects to my phone within 1-2 seconds of turning the earphones on.7. Battery: It seems to last long! I've been using them for about 4.5 hrs and it's gone down about 20%. Cannot say anything more yet though.  7.1 When you take both the earphones out of your ears, it doesn't auto pause like some of the competitors. Annoyed that this was missed, would have saved so much more battery if they did this.8. Build quality: I have a black version. It's made with good quality plastic and didn't feel heavy around my neck. It doesn't have metal anywhere, and it's quite simple. I think it looks decent.9. Exercise: Need to test! Will update later.In summary, an easy recommendation. If you can overlook the small issues, there's a great sounding, feature-packed and long lasting device here at a great price! 10/10 would definetely recommend!,First I was bit sceptical about the build quality but have to say it's got a pretty sturdy material and decent quality buttons, bass is good, vocals are much clearer in Crystal bionic mode, ANC is working to a degree will definitely cancel out the noise of your celing fan but don't except any more than that, no issues with call enx is working upto it's name, battery is sufficient around 12-14 hours if you mix up the modes.. Overall a decent all rounded neckband, jack of all and king of none.,All other things such as sound quality, battery backup are very good but multiple device pairing is implemented very poorly. If I connect with laptop and try to connect with phone at same time. It does not work many times. If headphones are connected to laptop and you close the laptop without shutting it down then you won't be able to connect with phone again unless and until you disconnect with laptop. This is a big bug. Please fix this.,This BoAt 330 ANC Neckband is very Good but needs improvement and fixes.Pros:-• Nice Sound Quality while using Crystal Bionic Sound, but it's average on normal mode which feels a little more bassy and losses clarity at certain points.• Great Build Quality• It's ANC & Ambience mode is good in this price range.• It's quite Comfortable to wear for long sessions as per my ear fitting.• It has Dual Pairing which is very good but it's not very seamless and there is a small issue with dual pairing, e.g., while receiving a call on one device, the audio/video being played at another device won't Pause (you have to manually pause) instead there won't be any sound output through that device. Its a little issue but it would have been great if the video gets paused while receiving a call on another device, as this is available on BoAt Rockerz 335 and a few different BoAt Neckbands.Cons:-• It's range is very low considering Bluetooth v5.2, I even have BoAt neckband with v5.0 which has better range. Even a single wall coming in between 3-4ms can block the sound output.• Its battery life is average which needs charge every day if you use it for roughly 8-10 hours everyday with Bionic Crystal Mode/ANC enabled.• While using Dual Pairing sometimes there are sound drops and lags in between. And the sound gets high pitched and starts lagging sometimes if you switch quickly between devices. (This happened on the Replacement unit I received, maybe it's not the case with your unit).• Sometimes no sound is received while playing Audio from both devices. (I don't know if it's wrong with my unit or every unit.)Overall this is a good and considerable Neckband under 2k if you want Good Bass-Rich Sound Quality, ANC/Ambience mode and Descent battery life.But if your requirements mostly is Dual Pairing, then this is not for you. As I bought this considering Dual Pairing feature most importantly. But it's not really seamless in between Devices, but still it's the best possible available feature in this price range or even under 5k but it needs improvements and fixes to make it more seamless and efficient.Another problem with Dual Pairing is that the media doesn't gets paused on first device if there's a call on the second one, which is already there on BoAt's few other Neckbands, but then there is no Media-Pause feature on them. (e.g., If audio is being played on 2 devices first device Audio will get paused if Audio is played on second device and vice-versa).So do try it out by yourself. Because it's my personal experience with the Neckband, maybe you get a better experience.Thanks for Reading. Happy Shopping!,Bought this one after using Rockerz 255 pro for over 2 years now. Comparing this with that, that one was ergonomically better, felt snug in ears.Standalone review of this.1. Noise Cancellation is just alright, not too great, not too bad.2. Sound Quality is definitely great and excellent with the Bionic Sound feature. Kudos on that part.3. Bass Quality is fairly good at this price point.4. Holds charge for as long as advertised.5. Overall bulky nature of the neckband puts you off and then the finish is poor too around the control buttons making it look very tacky & cheap (atleast on the funky grey one which I bought because it was priced lowest).Conclusion:Good Product at a Fair Price i.e. Nothing too great but nothing bad either.", "img_link": "https://m.media-amazon.com/images/I/31gzRr9mIaS._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/boAt-Rockerz-330-Bluetooth-Assistant/dp/B092X94QNQ/ref=sr_1_55?qid=1672902997&s=computers&sr=1-55"}
{"product_id": "B0846D5CBP", "product_name": "Casio FX-991ES Plus-2nd Edition Scientific Calculator, Black", "category": "OfficeProducts|OfficeElectronics|Calculators|Scientific", "discounted_price": "₹1,295", "actual_price": "₹1,295", "discount_percentage": "0%", "rating": "4.5", "rating_count": "5,760", "about_product": "Redesigned ES PLUS series calculators featuring easy-to-understand Natural Textbook Display, Non-Programmable Scientific Calculator with 417 Functions|Stylish design but same function as Casio FX-991ESPLUS 1st edition, 10-digit mantissa + 2-digit exponential display|Basic Trigonometrical & Statistics Functions, and many more functions|Colour coded keypad for easy key differentiation, Simple and easy to use, Comes with new slide on hard case|3-years warranty by manufacturer", "user_id": "AFES6HMBN5CAV5HWKASX5HS743BA,AE2SYKBDNNE4PVOOYME4HQILKXTA,AFDMSPZU56HC6LYNPSPFLBTALJMA,AGVSDTELCGKF3H54PJHYWO22MGFA,AEEOHRSGRB777SO6I4OOPWZ4DQ4A,AF3CZ6OL3AA35DQULP6J2TCEOJOQ,AHTXWZCWVFIFVLHBN27YWHVPXTUQ,AGVJ4GQPFR3DJ4ZV4ZT6EXE3ZNUA", "user_name": "Vajrala s.,Goutham.G.A.,Abhishek Kumar Sharma,Goutam,bheemanna,Jose v j,Pratik Kumar (Sinu),cherukusureshreddy", "review_id": "R2MYHLYRBQ49CU,R1ZYG8KT7IKN0F,R1CPM2M1SFJD0Q,R1MT0UWLT7MBYN,RH2E56CG2VRB0,R3O8V8MGL6A3AQ,R2IY9SO9GDZ9ZU,RC16I7A47XY5Z", "review_title": "Nice,Good and light calculator,Cheap buttons,Good calculator,Good product thanks Amazon,Super dealing,Function,Ok", "review_content": "It is very easy to use.,Good and easy to use.,Overall built is good but button quality is very poor. If you have ₹200 more then i suggest you to go with \"FX-991 ES Classic\", it's much better choice than this.,Nice productRecommended from entering college,Like,Amazon very good experience, excellent 👌,All function under one segment.so i like it.I sey for all engineering student u purchase only this because this is the best for your problem.this is a solution understand.,Very good", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41PDEAuwT3L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Casio-FX-991ES-Plus-2nd-Scientific-Calculator/dp/B0846D5CBP/ref=sr_1_56?qid=1672902997&s=computers&sr=1-56"}
{"product_id": "B00KXULGJQ", "product_name": "TP-Link AC750 Wifi Range Extender | Up to 750Mbps | Dual Band WiFi Extender, Repeater, Wifi Signal Booster, Access Point| Easy Set-Up | Extends Wifi to Smart Home & Alexa Devices (RE200)", "category": "Computers&Accessories|NetworkingDevices|Repeaters&Extenders", "discounted_price": "₹1,889", "actual_price": "₹5,499", "discount_percentage": "66%", "rating": "4.2", "rating_count": "49,551", "about_product": "Boosts wireless signal to previously unreachable or hard-to-wire areas flawlessly|Compatible with 802.11 b/g/n and 802.11ac Wi-Fi devices|Dual band speeds up to 750Mbps|Miniature size and wall-mounted design make it easy to deploy and move flexibly|Ethernet port allows the Extender to function as a wireless adapter to connect wired devices|Worry-free customer support —— For other installation related query, compatibility issue or any other queries call on toll free no 1800 2094 168 or write us at support.in@tp-link.com", "user_id": "AETEHTDQT4GMZAJW5NTRO77AQBZA,AHMFYDHJQSNEIQVXXGRBHFN4HIXA,AGDVBHF2VZWQBVPW2LSCWM523PCA,AFHCO46ICGCCZ7HI7WZSESKXHVSA,AFOVQIU4VXRHWZ2ON5VX6DOVPRVQ,AGYOOAFQSB2ESYS42MNEKUCHNQGA,AEMEVA4RPDV7TUZZGW42VEOVSMXQ,AETIV4U656LPL5QIPSWXR2INPE4Q", "user_name": "Amazon Customer,Sanu Menon,Shyam,Anas P V,Amis,Joga sampath Kumar,Mayur Tangsale,Gandharva Purohit", "review_id": "R3QXJLS2BDGPZU,R2ZQ7IF3YXTAYB,RB59C2UES2IGE,RCRYJ6I1OC3S4,R3CJKWJKEQBO76,R2EYE183J6PMG0,R22S9G5EXHE6L5,RXTN6L62R1AU0", "review_title": "Works as advertised,Good product,good,The Product works as described and is super useful,Not good range,Goog item,Does increases range and speed of Internet,ONE TIME INVESTMENT", "review_content": "Liked easy set-up. Disliked having to download and app and create a account,An awesome product. This covers 2 floor plus terrace in a 1800 sqft house. You can buy this product without any concern. I would suggest you to have tp link router too to be bought along this for a seemless experience,Product is good,I have received the product from amazon in pristine condition and it works very well as described. I am using it in my first floor room where I have low signal for my wifi and gets disconnected when i close the doors. The extender helps to resolve the issue and configuration was also really easy. One of the only minor issue is at very random times ( rarely) this gets automatically disconnected, but can be reconnected easily by going to wifi settings of device.,Everything is nice except range!,Good item,Using in my 2BHK home as getting weak wifi network from router and slow Internet speed. It is easy to setup and does increases range as well as speed tremendously than original router. Option of 5G & 5GExt works great. Horizontal range is quite good as for vertical range at height of 1st floor is perfect and on 2nd floor its manageable. Doesn't heat not heat that much. Surely go for it little costly but worth it.,Use the Tether app, do the installation by yourself & enjoy the WiFi. Helped improve network connectivity in my house. VALUE FOR MONEY. Do look out for this product during SEASONAL SALE for a better deal.", "img_link": "https://m.media-amazon.com/images/I/312J9hg8ypL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Tp-Link-300Mbps-AC750-Range-Extender/dp/B00KXULGJQ/ref=sr_1_57?qid=1672902997&s=computers&sr=1-57"}
{"product_id": "B08H9Z3XQW", "product_name": "boAt Bassheads 242 in Ear Wired Earphones with Mic(Blue)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹455", "actual_price": "₹1,490", "discount_percentage": "69%", "rating": "4.1", "rating_count": "1,61,677", "about_product": "Fly into your workouts with precise tones that inspire and energize your system with its HD sound, all the time.|Find a balanced audio sound set pumped through 10 mm dynamic drivers that can get real loud! Propped up by a banging bass, push your flow to higher limits|Get the sound in and sweat out with IPX 4 Water and Sweat Resistance here to elevate your game as crush those repetitions or a rigorous run|Coolly crafted midway down the cable to endorse practicality mixed with an aesthetic design that allows for communication and music playlist control|Move with unrestrained dynamic freedom via shape adaptive secure fit ear hooks made for you to lose yourself in your workouts and your music|Fashionable with a loose freestyle, yet made to sustain through twisting, contorting and tangling so that you can carry your style and music with you everywhere|Bassheads 242 are compatible with almost every device that carries a 3.5mm slot|1 year warranty from the date of purchase", "user_id": "AFG3EU556AXTCQXSTGYD2ACM5H6Q,AF65DDTW2IWXZ4TJJ7ZMVMH7J35A,AF2YGWDQLV72RCMMOSU2FVQCMVTQ,AGGMCQ2FU6ORE3JKL6VUTHPQKZZA,AGJK54UTZLRAIC27TJYRC2FITPNQ,AECA5GYEXI5PM7SREQZXQQBLP5PA,AGVJCBYEOVBLWDFZ42IPRVYU25RQ,AEVPRYZLGHNMEZA5BYGIX36LYZXA", "user_name": "Tanu,THENNARASU,uday,Rohit,Akshat Sharma,pramod b.,deepank Sonwal,Gatij saini", "review_id": "R2WQHYFXQ5BCCA,R3BU0MFK2ORFS6,R28DOVGVW1QZXZ,R26XU8W37JQI55,R2S12HQMGEON44,R2NVYGBTVG3FJR,R3VG49O0264FQ9,R2A3HU0CB8SUQ4", "review_title": "Good Sound,Not bad,Some what satisfied with the boat 242--- 4.5/5,Outstanding fantastic,Good purchase,Nice product,Good quality,Best gaming earphone", "review_content": "sound of song are good its really good or i am still using almost maybe 2 or 3 month maybe more but they still good,Product is in good quality and comfortably fixed in our ears but the major issue is when we were buds for few minutes, it will start hurting our ears,Iam satisfied with the sound quality, 4.7/5Ok with the noise cancellation performance.But when it comes to bass quality it is some what less than the boat 225. Not too much low, clarity in the bass is some what Missing, light weight when compared to boat 225. Finally boat 242 is good at. Its price range.,Mic, sound quality crystal clear , bass is also good and the wiring quality is very good overall earphone is very good in this range. Worth hai product me,Bought them 2 months ago... No other complains so far.... Everything going great...But are little overpriced for 550,Nice,Bast,Gaming -niceSound-osm😎Disyan-nice and value for moneyThank you amezon ♥️", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41nGG6kJr9L._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/boAt-Bassheads-242-Wired-Earphones/dp/B08H9Z3XQW/ref=sr_1_58?qid=1672902997&s=computers&sr=1-58"}
{"product_id": "B08LPJZSSW", "product_name": "DIGITEK® (DTR 260 GT) Gorilla Tripod/Mini 33 cm (13 Inch) Tripod for Mobile Phone with Phone Mount & Remote, Flexible Gorilla Stand for DSLR & Action Cameras", "category": "Electronics|Cameras&Photography|Accessories|Tripods&Monopods|TripodLegs", "discounted_price": "₹399", "actual_price": "₹995", "discount_percentage": "60%", "rating": "3.9", "rating_count": "21,372", "about_product": "Heavy Duty: The Gorillapod mobile tripod is made of high quality ABS. Making it a very heavy duty product and giving it an exponentially longer life, as compared to other plastic based camera tripod. Ensuring that even with a very rough usage your mobile phone, camera, phone, DSLR and tripod stand are safe. If Shooting in rough conditions and environments you have a peace of mind that everything will be safe. Maximum load: 1kg|Rotating Sphere: An Anodised finishing rotating sphere in tripods for mobile or gorilla tripod ensures that you get a great load bearing capacity for your dslr camera, mobile tripod, DSLR tripod, gopro tripod. Along with an accurate angle lock. Which ensures that your phone stands can take photos at angles that you desire and will stay in that angle as long as needed. Which also ensures that no matter how heavy your device, the tripods is comfortable and can be used for a long duration.|Portable & Lightweight: A portable design ensures that you can carry and use your mini tripods for mobile effortlessly throughout the day. ABS makes the mini tripod exceptionally lightweight and durable. It is perfect for a long day of gorillapod tripod shooting. Being a camera stand tripod you can also view your mobile phone or DSLR camera recorded videos in rough and unstable environments. With a peace of mind that your tripods for mobile, dslr camera and mobile phone will be safe.|Clasp Lock: A clasp based lock brings in the tripod an easy to lock and accurate angle mechanism, to help you lock in the exact angle you desire for your tripod for dslr camera. It ensures that the angle for your gorillapod tripod for mobile remains exactly how you like, even after hours of usage. The clasp is made of a fail proof mechanism which will ensure your phone tripods never looses the angle while shooting a time-lapse type view.|Mobile Attachment and Bluetooth Remote for DSLR, Action Cameras & Smartphones", "user_id": "AFIVMGZO74QYOK7KXVJMFH36PTPA,AEILB3YJC5WD4FNH2SCVAGPRDRBA,AEOCPQRJLJDQSJTXD4NVM6LYDWLA,AFHPT2SC2FCLRFYAXBVAYHGPFA6Q,AHDEBPMFVRVWVX6O4KIOLHJ743AA,AEHTBYQI7XPSICO42RVPPDG6GYAA,AGZFM5HJWJ6EYQ5AKAXM22NAPRLQ,AHFUCGQIN5PXICCP3SSBXKBIMIIQ", "user_name": "A. Dubey,anandmohan,PREM,Daanish Daaivik,A,Amazon Customer,Jitendra padhi,Kritkalp", "review_id": "R1I66H8DGGS985,R1ZQIZ7XIUXVKP,R97VJ0SV72PH6,R387X09HTG3RFI,R129BK806X9B1Q,R3A3JLSFF2WST,R2DLBUT9R8P3K4,R2YZHYSB1WOZ5T", "review_title": "Fantastic Cute Tripod, **Detailed Review**,Worth it purchase...,Good,Good But Could Be More Better.,Camera / phone holder is not stable  🛑 NOT VALUE FOR 💸💰,Good tripod for mobiles, cheap and beginner friendly.,Very good,Satisfactory", "review_content": "Review written on 09-12-2022It is a nice little tripod for your Phone / mini camera or Gopro. It has Rubber grips, which makes it anti Slip on flat surfaces and feels sturdy in your hand.Here are few Pros and Cons u should know before buying.● PROS▪︎Light weight and easy to assemble.▪︎Very Good for small devices.▪︎Stability is superb.▪︎Comes with Bluetooth remote.▪︎Quality of Rubber and Plastic is great● CONS▪︎Size is quite small, it looks little bigger in the images shown.▪︎ Not at all Suitable for Big DSLR cameras or video cameras.▪︎ I think that the rotaion of the balls can become loose after several months of use. I'LL Update here.●Final Verdict : For the price of ₹400, It is a good product as it is quite useful when you vlog or want to take group photos. It will easily carry your Mobile phones and small cameras but DONT EVEN think of mounting your professional camera on it, it is very small compared to big cameras.Go for it!! It's a great product.,I basicly purchased it to record timeplace video but when I recieved it I was surprised because it was soo good at a less and affordable price but I gave it 4 stars because of the Bluetooth remote as it was unable to click photos and i even changed the battery but it didnot worked,Product is very good as compare to the price.Personal Opinion : A little bit quality of the material with a bit more size could have been improved.,Good But Could Be More Better.Can't Take Mobile WeightNeed To Adjust Stand Every Time For Single Click.,,This tripod is a good purchase. Pretty standard quality, i must say. Bluetooth remote also works perfectly. Not very suitable for hefty dslr cameras. Good for mobile phones and vlogging.,I m use this product from 1.5 year no complain,Learning needed", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41jOKzw6-EL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/DIGITEK%C2%AE-DTR-260-GT-Flexible/dp/B08LPJZSSW/ref=sr_1_59?qid=1672902997&s=computers&sr=1-59"}
{"product_id": "B09MT84WV5", "product_name": "Samsung EVO Plus 128GB microSDXC UHS-I U3 130MB/s Full HD & 4K UHD Memory Card with Adapter (MB-MC128KA), Blue", "category": "Electronics|Accessories|MemoryCards|MicroSD", "discounted_price": "₹1,059", "actual_price": "₹3,999", "discount_percentage": "74%", "rating": "4.3", "rating_count": "1,40,035", "about_product": "Up to 130MB/s read speed with UHS-I interface. Performance varies by capacity.|Works with cell phones, smartphones, Android tablets, tablet PCs, and more.|6-Proof protection: Waterproof, Temperature proof, X-ray proof, Magnet proof, Drop proof, Wearout proof|10-year limited warranty; For further queries, please contact us at 1800 30 7267864|Includes full size adapter for use in cameras, laptops, and desktop computers", "user_id": "AGQT36ICAXRXAG4IXZUULJZIH4XQ,AGKL2QQZYTI6LCC4CDJEGIV3EDUQ,AGFI73CMZKYLOYXJFEQBOGGVTTMA,AELXR5NQFM7D6VMAQLQ75LZKBRQA,AEOFVQUVTVP7AU7TM7IZBXJC3NOA,AHG33QRWJPAIDBY3URAHOVO67T5A,AEWCPYNJLQRK7UW54HDWPA45R6SA,AHLDP6L4GQIF7MJWWMNALXNQXYEQ", "user_name": "Rashmi Joshi,Soumendra Pattanayak,Kumar.katukuri,RAJULAPATI MARUTHI VARA PRASAD RAO,Souvik,Mahendran G,It's Me Swaraj ...,Vijay prajapati", "review_id": "R2ZYS8OJWNY7VY,R33U0ERE0GVMNJ,R1CQTXZAM4625F,R1YR920UPA7YH0,ROOP0SB30EBY3,R32BCBNUXTRTEL,R11PB4N9WB3VCS,RQ5FP6ADSIS6O", "review_title": "Got less storage.,Good deal,Looking is fake product... Storage capacity 58gb.. Menstion64gb.,A nice gadget.,Nice and good,Trusted brand,with adapter!,I liked it's performance and quality.,Good quality", "review_content": "I ordered 128GB but got 119GB.,It's a good deal to get the SD card in this price, but it was even less in Reliance digital. But as I needed in 1 day it's fine to order.,Looking or fake product...,Storage is perfect,Package quality not good,Installation was easy.i got it for my tablet.i had a confusion bw this and SanDisk and finalised this one coz mine is s6lite.free spce shown as 119 gb..it's been only two days.no problem faced.will update if any issues arise.,I have purchased this card 3 times. In first two times, they delivered fake sd card with the same samsung branding but thanks to Amazon for accepting return request. In third time I got this genuine Samsung Evo Plus SD Card 64gb. I purchased this card in Rs. 599. You can also get this at less price during offer season. The least price I have seen is Rs. 539.Performance is almost good as I expected.Write Speed is about 17 to 25 mbps and Reading speed is around 35 to 45 mbps. But I did not tested reading speed too much. May be you will get better reading speed. Adapter is also good quality and performing good.Thank You...🙂,Go for it ensure size", "img_link": "https://m.media-amazon.com/images/I/31R6RP26dzL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Samsung-microSDXC-Memory-Adapter-MB-MC128KA/dp/B09MT84WV5/ref=sr_1_60?qid=1672902997&s=computers&sr=1-60"}
{"product_id": "B08Y1TFSP6", "product_name": "pTron Solero TB301 3A Type-C Data and Fast Charging Cable, Made in India, 480Mbps Data Sync, Strong and Durable 1.5-Meter Nylon Braided USB Cable for Type-C Devices for Charging Adapter (Black)", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|Cables|USBCables", "discounted_price": "₹149", "actual_price": "₹1,000", "discount_percentage": "85%", "rating": "3.9", "rating_count": "24,870", "about_product": "Fast Charging & Data Sync: Solero TB301 Type-C cable supports fast charge up to 5V/3A for devices and data syncing speed up to 480Mbps.|Universal Compatibility: This USB charging cable connects USB Type-C devices with standard USB devices like laptops, hard drives, power banks, wall and car chargers, etc..Connector One: Reversible Type C|Connector Two: USB A Type|Rough & Tough Type-C Cable: Charging cable with a double-braided exterior, premium aramid fiber core and metal plugs. It has passed 10,000 bending tests and can easily withstand daily use.|Extended Length: 1.5-meter long c-type cable uses nylon material to protect the wire and avoid knots.|Perfect Fit Connectors: pTron Soler USB-C has passed the 5KG load test, swing test, 5000+ times connect & disconnect to ensure that there are no loose connections.", "user_id": "AEQ2YMXSZWEOHK2EHTNLOS56YTZQ,AGRVINWECNY7323CWFXZYYIZOFTQ,AHBAT6VLOXWGYDL57KHCNCLPXAKA,AF7NDY2H6JVYTSQOZP76GCATQ34Q,AFV7ZA733ZLME4KNLZPMPCBUNPPA,AHFAAPSY2MJ5HYOU2VQDJ7AQY4NQ,AH2WGV2PEBUTICRPBEEVKF24G5LA,AEP4MK3EKOBDKTGPJTRN5RBDIODA", "user_name": "Jayesh,Rajesh k.,Soopy,amazon customer,Aman,Shankar,dinesh,Chitra,Ajaybabu.O.M", "review_id": "R7S8ANNSDPR40,R3CLZFLHVJU26P,RFF7U7MPQFUGR,R1MV1NKC23DWPI,R11D3U0V2XKDKF,R18MP1KLUE18PC,RWGJNVEH5ZQME,R1XN72FU6Q37IH", "review_title": "It's pretty good,Average quality,very good and useful usb cable,Good USB cable. My experience was very good it is long lasting,Good,Nice product and useful,-,Sturdy but does not support 33w charging", "review_content": "It's a good product.,Like,Very good item strong and useful USB cableValue for moneyThanks to amazon and producer,https://m.media-amazon.com/images/I/51112ZRE-1L._SY88.jpg,Good,Nice product and useful product,-,Sturdy but does not support 33w charging", "img_link": "https://m.media-amazon.com/images/I/31wOPjcSxlL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Solero-TB301-Charging-480Mbps-1-5-Meter/dp/B08Y1TFSP6/ref=sr_1_61?qid=1672902997&s=computers&sr=1-61"}
{"product_id": "B08CYPB15D", "product_name": "HP 805 Black Original Ink Cartridge", "category": "Computers&Accessories|Printers,Inks&Accessories|Inks,Toners&Cartridges|InkjetInkCartridges", "discounted_price": "₹717", "actual_price": "₹761", "discount_percentage": "6%", "rating": "4.0", "rating_count": "7,199", "about_product": "Cartridge color: Black|Yield: 120 pages|Ink type: Pigment-based ink cartridge|Compatible with printers: HP DeskJet Plus All-in-One (4121, 4122, 4123), HP DeskJet All-in-One (2720, 2721, 2722, 2723, 2729, 2332, 2330, 2331, 2333), HP DeskJet (1212, 1210, 1211, 1213)", "user_id": "AGQCLZES57R2QEDXM4F4NYKS4BRA,AES2RGBBQ4M5CIOUC5LSR4XORTPQ,AFKGUUI7MXXMU3IRK4KDHPAP5OCA,AEVJWZ7SNUGFWWIEFQ24USB2IELA,AEZEXVSVIXMOTKZXT4BD2BIIUI7Q,AGOUYRRLNFOWW2P323TXTZI42STQ,AEPC76LBJ62NNNFB3FLLEV6DMZXA,AFBVO5EYL6CDO3PXRSG4MK7X2JXQ", "user_name": "Devendra,TILAK C.,krishnakanth,Nisha,Amazon Customer,Sweet KP,Ahmed Ziyad,Aniruddha M.", "review_id": "R1LAI2YEEUW0E0,RR8Y3CSNEHCK6,R1MXV3ILO9VTIP,RJDGO8A1H214O,R39LPM6JEQVLZV,R34GXFIAQ89K4W,R168AR72LPYI6V,RM1F5QKM6SSLE", "review_title": "Best.,Price is high,Trusted and genuine HP ink cartridge.,SENT A PACKET WITH THE SEAL ALREADY OPENED.AND THE CARTRIDGE FOUND TO BE DUPLICATE/FAULTY/USED ONE.,Compatibility,Product is good  but price is to high,Good,Okay", "review_content": "Best Fingerprint Scanner Divice.,Easy to use,Ink cartridges are easy to install. Genuine product with very fine print quality.,SENT A PACKET WITH THE SEAL ALREADY OPENED.AND THE CARTRIDGE FOUND TO BE DUPLICATE/FAULTY/USED ONE.,Compatibility issue,Product is very good but price to high so company take step for cut the price after that sell more and comfortable customers,Not bad,Okay", "img_link": "https://m.media-amazon.com/images/W/WEBP_402378-T1/images/I/41ZraPJKHYL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/805-Black-Original-Ink-Cartridge/dp/B08CYPB15D/ref=sr_1_62?qid=1672902997&s=computers&sr=1-62"}
{"product_id": "B085HY1DGR", "product_name": "Sounce Spiral Charger Cable Protector Data Cable Saver Charging Cord Protective Cable Cover Headphone MacBook Laptop Earphone Cell Phone Set of 3 (Cable Protector (12 Units))", "category": "Computers&Accessories|Accessories&Peripherals|Cables&Accessories|CableConnectionProtectors", "discounted_price": "₹99", "actual_price": "₹999", "discount_percentage": "90%", "rating": "4.0", "rating_count": "1,396", "about_product": "Protect cables: The cable protector was designed with highly flexible silicone, which can be applied as phone charger saver and charger protector to completely protect cables for all devices|Protection Effect : These cable saver protectors can protect wires and power cords from dirt, frays, tangles and knots; Reduce the risk of fraying and breaking|Touch Comfortable: The wiring protector is made of good quality TPU material, soft and touch comfortable, which can be applied to protect your headphone cords, charger cables and so on|Prolong Life Of Cables:The charger cable saver will help to prolong the life of your cable even the cable has been damaged|Easy to Install: A detailed usage is provided; All you need to do is install according to the steps in the manual", "user_id": "AENDUJB5OZB6K4DYJJ6JCWFTSRCQ,AHRWY7ICLIT3SPBQFPD7V7C7NJDQ,AFSTHMXFUDYHM43NKFYVF5TM2DDA,AGVOU7UYLUAX4S7LCOYNNEXUCD3Q,AHARTLP3RPKXFY37PX5Z5T4JHUEQ,AHJQYBWVOKGBO6SND232KLREKCSA,AHJYRK56SVRBAQZMLOZWPBQU2FFQ,AF5ORZNIXXXLMFXXPZYZLTGPTQAA", "user_name": "Diamond heart,Amazon Customer,Pritish Biswas,Sriram Ramanathan,Srinivasan Subramanian,zubair,Amazon Customer,Amit Chotrani", "review_id": "R3TQ32UCRS81WR,R2QPXXMX0YH89H,R2NBUIKICW6ASD,R3KIQZ1W9FWK3P,R1R9QY3F8M6CXP,R2DNZV0AH311P1,R2ZAGKBTL8IEMI,RGMYTIRB3LWEA", "review_title": "Nice and soft product,IN PICTURE SHOWS AS 16 NOS BUT IN COVER ONLY 8 NOS,Usefull! Bought 3 packs in Rs 99 each containing 4 pieces,Quality Product at affordable price,It helps to hold the joints. But not from the USB level,Very third grade quality,Only two packs came,Cool Product", "review_content": "Very nice product and easy to use as well as very soft to cable.,IN PICTURE SHOWS AS 16 NOS BUT IN COVER ONLY 8 NOS,Easy to attach with usb cable. Bought total 12 pieces in Rs99. Loved it ❤️,Quality product,So far ok. Will hold the wire connecting after the USB joints. But couldn't stop it from bending,Don’t even think of buying this by just looking at the cheap price of this product as it has been made by cheap quality plastic which can not protect your cables as it is not at all sturdy so please don’t buy,Only two packs came,The product is cool. Value for money. Love it", "img_link": "https://m.media-amazon.com/images/I/41nf9n-v3pL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Sounce-Charger-Protector-Charging-Protective/dp/B085HY1DGR/ref=sr_1_64?qid=1672902997&s=computers&sr=1-64"}
{"product_id": "B00MFPCY5C", "product_name": "GIZGA essentials Universal Silicone Keyboard Protector Skin for 15.6-inches Laptop (5 x 6 x 3 inches)", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Keyboard&MiceAccessories|DustCovers", "discounted_price": "₹39", "actual_price": "₹299", "discount_percentage": "87%", "rating": "3.5", "rating_count": "15,233", "about_product": "Universal Silicone Keyboard Protector Keyguard Skin cover for 15.6 Inch Laptop|With the Laptop keyboard protector, your laptop remains protected against any wear and tear|Protection against food or drink spillage|Easy to attach, remove and wash|With a transparent colour, it retains the original texture and look of the keyboard", "user_id": "AETHN2CGVNPVX5Y6SAWO6IO7QOEA,AFIZ6OD2C7QAISE7FEEQR4C2NBGQ,AGE43ATINMGDC2ODRZNEM4Q2SEVQ,AE2QGBWD4NHT3VTKAS4TCZY6S7DA,AGKWDNWN4W7YDLRGGLQ2W43GW5AQ,AHPZNS35WCST6ATG2RKUV5UMGU3A,AEETUHPLSOLA55TPPWJWAQ7DZK5A,AFQJDMJNV2HMS7L5OAQRNXKVOVOQ", "user_name": "Selva sibi,Apparao Yarra,priyanshu jha,Ashish Patel,karthickraj,Amazon Customer,Muzammil Parkar,Unknown", "review_id": "R3NB1CQXEVVQIT,R2I6VLGIXFKKU,R1G8SZJG03IY67,R2A1KUYD1M88Q4,R6TRKFTKS65XK,R1QNTQB56PMUJL,RMRNID3H5V0O4,R18D5AL11YJ9ON", "review_title": "Good,Affordable and best,Check the size !,value for money,Reached too late,Not good for keyboard. Not transparent,Not bad but,Big size", "review_content": "Value for money,Grt product,Please ensure the size of your keyboard is fit for this cover. Secondly, it has bad adhechesive.,got the keyboard protector at 39 Rs. So i am satisfied with product.But, the size is little big for my 15\" laptop keyboard,Product is average,Keyboard is not visible.,As you can see I'm using a 15.6 inch Dell laptop , and it's slightly bigger in size but it's good enough, i got two of these for 78/- and they're good, they don't stick at all and easily come off even if u blow air at it, but at this price what can u expect,It can aslo be fit in 16 inches laptop easily", "img_link": "https://m.media-amazon.com/images/I/51YPXDh78VL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Universal-Silicone-Keyboard-Protector-15-6-inch/dp/B00MFPCY5C/ref=sr_1_65?qid=1672902997&s=computers&sr=1-65"}
{"product_id": "B07JJFSG2B", "product_name": "SanDisk Ultra 128 GB USB 3.0 Pen Drive (Black)", "category": "Computers&Accessories|ExternalDevices&DataStorage|PenDrives", "discounted_price": "₹889", "actual_price": "₹2,500", "discount_percentage": "64%", "rating": "4.3", "rating_count": "55,747", "about_product": "USB 3.0 enabled (USB 2.0 compatible)|Transfer up to 10 times faster than standard USB 2.0 drives; up to 100MB/s read speed|Secure file encryption and password protection|Stylish and portable design|SanDisk secure access software keeps files private|Country of Origin: Malaysia", "user_id": "AGEN4ASYZOLVEWYV3Q2CJR42ZOEQ,AGQMPOU46LE2C4Q5COR7RRACQZ7A,AFDOB6ZOXEPJSTD5TYLQTRXTFSMA,AGDEK4RWKXOP4OS377LV7WQ2O72Q,AELVIMURPMROWIZHRTYGSLXA2SJA,AERMCSAKPLOJGCA3UDMWD3VRR2QA,AHIKZM3LUGBBQKMPY4BSYBCUI6FA,AHUBLOQI56TLETS3LQ3YZIYR5Z5A", "user_name": "Brijesh Kamani,venkatesh.R,Saidur rahaman,Amandeep Singh,Rakshith A Gowda,Jeet darade,Prathap Thavan,Dhinesh Sridhar", "review_id": "R1MOAI12S1FJV1,R1HS4KCJJK9X3U,R248HCB4KB42LJ,R153L369EOHI65,RGTTBAUNEDZSX,R22ICK5OX9INOG,R3ODU59WZ94MGN,R2BGICLNKXFAZH", "review_title": "Speed is not as expected.,SanDisk Ultra 128 GB USB 3.0 Pen Drive,Good,Good,Nice product,Good but....,Nice but slow,some glich happening otherwise good", "review_content": "Speed is overall good as per its price. But not as good as its claim and as per 3.0.,மூன்று வருடங்களுக்கு முன்பு 16 ஜிபி சண்டிஸ்க் பென் டிரைவ் வாங்கியபோது ,அதில் Reading and writing ன் பொது orange colour பிளின்கிங் லைட் இருந்தது, இப்பொழுது 128ஜிபி-ல் இல்லாதது பின்னடைவை கொடுக்கிறது,https://m.media-amazon.com/images/I/11mPdnwyGSL._SY88.jpg,Good,Nice product,(Fast transfer speed) will only work in usb 3.0 and above portsOtherwise it's awesome,Quality is very good. But transfer speed is slow.,some glich happening otherwise good", "img_link": "https://m.media-amazon.com/images/I/31YFd-LQ8rL._SY300_SX300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/SanDisk-Ultra-128-Drive-Black/dp/B07JJFSG2B/ref=sr_1_66?qid=1672902997&s=computers&sr=1-66"}
{"product_id": "B09NR6G588", "product_name": "Boult Audio ZCharge Bluetooth Wireless in Ear Earphones with Mic, 40H Playtime and Super Fast Charging, Environmental Noise Cancellation for Pro+ Calling and IPX5 Water Resistant (Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹1,199", "actual_price": "₹4,999", "discount_percentage": "76%", "rating": "3.8", "rating_count": "14,961", "about_product": "Note : If the size of the earbud tips does not match the size of your ear canals or the headset is not worn properly in your ears, you may not obtain the correct sound qualities or call performance. Change the earbud tips to ones that fit more snugly in your ears", "user_id": "AESKYYTGWJ7VJASMOE6QQUDXSITQ,AH6RJFHNEDVIFN34SEYOWEGNXG5Q,AEE2HCL5QT6A7E3BE2FDJ4OLCSQQ,AEQTCWOCB3X4GQI7K2RBNLVRCCRA,AF5XYEIQYYW2O3NPIGGGE22ZQDSQ,AFX3TRRDLRW7VDIT7AJQ4WFA6FOA,AEQOIDOT2CNMB2L6ZFFZ3KSUWBBQ,AH7IU6PPKPCOBZXCSAJRBQMD4SGA", "user_name": "Kevin Nathan S,Subha,Jatin Raikwar,Sarvesh Yadav,Nilesh Chavhan,Shivam,pawan  kumar,Minal", "review_id": "R274KY6VMEYJ66,R28WM6HPG5V7YO,R3TAACQ304V0Q5,R1R498JDWJDUOK,R1891ACMV6D38V,RVGO6MWYIVZIU,RIR1M6FLP836E,R1K17D4QNJXNP6", "review_title": "Worst Customer Support , Most Regretted Purchase,The product is a looking good but not a good sound quality, and then packaging is a very poor,Good,Missing Eartips disappointing but its a good headphone.,Connecting only one device,getting off after3 minute,WhatsApp incoming call not working proper,One side is not working in this,Good,Good", "review_content": "Update: Now after this review they have told me to give them atleast a 4 star review just to even consider arranging for the replacement, not even  guaranteed. Now lets see if they actually do as promised.Original Review:  After 6 months it stopped working, so raised a request for it. But.. i have to courier it to them cost Rs 100, then they found that it was a problem with the PCB they changed it, ok good but they replaced it with the PCB of ProBass which is an older and lower priced model. When i shared them the screenshots  and asked them for an explaination they just asked it to be couriered back paying for their mistake. No Reimbursment, No Quality Suppport,  No resposnse to emails apart from the standard script. One of the Most Regretted Purchase.,The product is a looking good but not a good sound quality, and then packaging is a very poor I think People open the product when it is packaged. For that the package is cut and things are different,I think that these companies make people think a little ....,,Spare eartips were missing from the package I received so that was disappointing.Sound quality is good for the price.ENC is decent.The eartips are excellently designed so the earphones fit well. You can run without any issues.It doesn't feel stuffy into the ear.I already have a bose qc30 and sennheiser BT headset but was looking for light neckband headphones for the convenience it offers and I am really satisfied with this.Good buy over all. I would recommend to Go for it.,Connecting only one device,getting off after3 minute,WhatsApp incoming call not working proper ,caller couldn't hear receiver voice.,I have issue in this product... One side is not working so please look into this,Good,Good", "img_link": "https://m.media-amazon.com/images/I/31-1GGUrjUL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/Boult-Audio-Bluetooth-Environmental-Cancellation/dp/B09NR6G588/ref=sr_1_67?qid=1672902997&s=computers&sr=1-67"}
{"product_id": "B07JPX9CR7", "product_name": "Dell WM118 Wireless Mouse, 2.4 Ghz with USB Nano Receiver, Optical Tracking, 12-Months Battery Life, Ambidextrous, Pc/Mac/Laptop - Black.", "category": "Computers&Accessories|Accessories&Peripherals|Keyboards,Mice&InputDevices|Mice", "discounted_price": "₹569", "actual_price": "₹1,299", "discount_percentage": "56%", "rating": "4.4", "rating_count": "9,275", "about_product": "Enjoy the freedom of an easy and reliable wireless connection|Designed to enhance daily productivity|Long, efficient battery life|Power Source Type: Battery Powered", "user_id": "AGKMK57A4J54JG5OUHPMVGGPVUKQ,AGZAT3N2CULLOY47CAPOZIZ4IWEQ,AGDVKUWO3IY3NBBLOGIPEYI7AQGA,AG3GZQUNY2SEAOLYGGMUN36D36HA,AGYVTXWWOOWXGPOCDER3AH6ZTTSA,AF2ESYW7THWXOTQLOYLOR24YMU7A,AGEECPGW53BWDVGR3FIUX54YCUWQ,AEX3W4D5UHGTLDCIO6KWMSD3QYIA", "user_name": "Gopinadh.P,BANDARU SAIDULU,S.Sankaranarayana Iyer,Suneel,Yogesh kumar verma,Vipul Gupta,Amazon Customer,sagar", "review_id": "R27S4UNXONW7O4,R3KK8G1AC7URCR,R23LAM247GXXJT,R2IO3IQHTV9ISU,R2IF9WKFZNCZOQ,RXMRCXZ0C6AO1,RUP9QA599PULX,RE3SVGKZFVW84", "review_title": "It's is working is super,one of the most good product,A good prduct.,Scroller,Fully satisfaction thank you so much,Usage is easy,Good product,Overall the mouse is good.", "review_content": "Product is good and I like that . Performance is good 😊,its working good . nice product.... its worthable for this rate!,The wireless mouse  is working well. There is one problem. Those who start using the mouse have to switch on  and they should  switch off  when their work over. If they forget to switch off( which can happen to many users) the battery may get drained. The manufacturer should  find another method  in the place of the on/off switch.,Scroller movement is not good,It is best useful mouse bcoz wireless mouse for work from my shop.I am csc shopper so it's need to me. so smooth work for laptop or pc thank and again thanks for Amazon delivery services.This wireless mouse is very smoothly working. Thank you so much,Good product, worked fine...,It's good and very handy,The mouse is easy to use. But I expected a little bigger mouse at this price range.", "img_link": "https://m.media-amazon.com/images/I/31959YGwwiL._SX300_SY300_QL70_FMwebp_.jpg", "product_link": "https://www.amazon.in/DELL-WM118-Wireless-Optical-Mouse/dp/B07JPX9CR7/ref=sr_1_68?qid=1672902997&s=computers&sr=1-68"}
{"product_id": "B08D11DZ2W", "product_name": "Boult Audio AirBass PowerBuds with Inbuilt Powerbank, 120H Total Playtime, IPX7 Fully Waterproof, Lightning Boult Type-C Fast Charging, Low Latency Gaming, TWS Earbuds with Pro+ Calling Mic (Black)", "category": "Electronics|Headphones,Earbuds&Accessories|Headphones|In-Ear", "discounted_price": "₹1,499", "actual_price": "₹8,999", "discount_percentage": "83%", "rating": "3.7", "rating_count": "28,324", "about_product": "One Touch Control & Voice Assistan:] With one multifunction button, you can play/pause, previous/next track and answer/hang-up calls.Voice assistant function lets you access siri/Google Assistant. 20m Transmission Distance. Driver Size : 6mm, Auto pairing|[Auto pairing ] Automatically pair with your device as soon as you take them out of the case. No need to manually pair to your device each time|Offers playback time of up to 6 hours for every charge. Carrying case can give 4 additional charges to the earbuds making total play-time of up to 120 Hours|Monopod Feature] The earbuds can be used separately after successful pairing. Not only listening to both earbuds in stereo mode, but also it can be used as monopods to enjoy the music & take calls|IPX7 waterproof- earbuds and charging case inner Nano-coating makes it possible to waterproof for 1 meters deep for 30 minutes.Ideal for sweating it out at the gym. Even Wash the earbuds and base|Designed with latest Bluetooth 5.0, the wireless earbuds own fast and stable transmission without tangling. Improved high quality mic for both earbuds bring a better call performance. 20m Transmission Distance", "user_id": "AEHQYGI5L4FFALBMC5XMT5KXSZCA,AGRR24ZLDUPIJY24ZNQ6KIOYPY4A,AHM342MR54IYOKXJGG5MN53GQQDQ,AFOE32RXBAXIE4XHWXU564FUZT5Q,AF4EXZGWO5Y622TNNQ4LPS6LLG5A,AF3VOU2M55QKFJVDQDNOWKFKOBCA,AGXDNBVCES7HTOHR2K4UBUFUAI3A,AH3XUGDVTNMIHGLJDQIRLHEY54HA", "user_name": "Vivek,Anas CA,trivendram pal,ARUN KUMAR G,MOHAMMAD KHALID,Hari Kiran M,vishwajeet kharade,Nehal Jain", "review_id": "R2TM1SQ2JK9S7K,R12CJ7K0V22F2T,R3PZ9OABVKGYOQ,R1RTA2FATK1OYI,R1ALJXQ6Z6WJSQ,R3LQ7TCDIBG7QE,R3NF49K5GAY77U,R3HR0LBECGBXXA", "review_title": "Really good for the price [6/8 months update], but with a late appearing issue,After 2 months,Right bud is not performing well,Good value for money!,Working as expected,Best at price,Good built quality, functions need improvement,Product is good but battery not as expected", "review_content": "--------------Update after 8 months--------------Update 1: The problem mentioned in the earliest review is becoming more and more dire with time. Now right earbud gets discharged in hour and a half, whereas left one keeps going, so reducing one star. Will contact them for replacement and update here.Update 2: Called service center, they asked to bring it, but am lazy. I expected they'd replace at home. Paid more attention towards the issue above. The stable situation is that just after full charge, right bud can go upto 4 hrs, but left one always goes for 30-60mins more, and the difference is more if there is a standby of a day or two (when the left one loses juice rapidly it seems), so I guess I can still use the buds but with certain restrictions :) Will happily restore 5 stars if the issue stays stable for next 3 months.--------------Update after 6 months--------------No change in quality, still the pack charges the buds like a boss. During this period, they were once kept in mouth by my infant nephew for over half an hour (very dangerous, thankfully he couldn't swallow them!), full of saliva and whatnot, and on another occasion I threw one of my earbuds on the floor with full force (undisclosed depressing reason) due to which the touch panel with the logo got detached, which I then re-attached. After all this, buds are still rocking with same sound quality as on day 1. I think these are pretty darn sweet deals! Lack of volume control, etc. etc. is all forgiven. Happy customer. Although the issue of left earbud discharging earlier than right persists.-------------------Original review-------------------Using for last 2 months.I am an audiophile and also an instrumentalist. But I hadn't used any tws yet, so wanted to dip my toes and didn't want to invest much, but also not something throwaway. So settled for boult (no boat etc. due to their highly adultered sound signature), since I have previous experience with it. I like my music flat at studio quality. More recently, I've been using a low cost headphones with mindblowing performance: oneodio pro50. Go ahead and search it. It is really one of a gem for all those purist sound fans.Coming to this tws.Connectivity. Right out of the box, only left one was working after connecting to my iphone. Maybe right one didn't pair correctly to left. Did that reset thing as suggested (which also took some effort), but after that, both started working and since then, no issues. I am using both my phone and laptop (linux). Ofcourse you need to disconnect one to use another. But perfect connectivity now. I can move around in my 1300 sqft apt and no connection loss, which is great.Call quality is decent, faced no disconnects yet, and the other party is also ok with my voice, but you cannot talk in a hushed voice, you always need to speak up in a medium volume to let the other party understand you.Features. Tapping is oddly sensitive, I mean it responds even if I am adjusting the bud, and not touching the central area, but surprisingly takes a decent tap punch to play/pause. I can get used to that though. One thing, track aage peeche is ok. But these don't have anything which can control the volume. Bummed on that.Battery. Decent backup. It's been nearly 2 months. I use buds on an average of 2-3 hours daily, and I just had to charge the main case just 3-4 times. In an emergency I also used it to charge my iphone which it did really quickly. I was happy to see that. One weird thing to notice is that the right earbud always discharges more quickly than the left, infact I can use the left one 20-30 mins more that the right. But anyways, I put them both in the case once any one of them starts to complain of low battery.Sound quality.Bass frequencies: Very decent bass. Surprisingly great low bass (songs like 'the humma song', 'i wanna love you' sound pretty good), but a bit lacking in other frequencies of bass ('lut gaye' by Jubin doesn't sound that punchy as it should for a flat signature). Overall for the most part, you should be fine.Other frequencies: I'll review this from vantage point of studio quality signature. For mids, the spectrum is tilted towards bit of high bass (but surprising absence of very specific high bass frequencies as mentioned above), but its bearable. For highs, initially I felt the presence [a bit] lacking, which takes away that warmth and fidelity from a few tracks, but after using it for a few days, I started feeling alright in that aspect, maybe some burn in? God knows. Also remembering that I paid just 1800 bucks for these! I mostly will be using these while my walking and workout sessions, so I think my mind won't be nitpicking then. I'll soon be upgrading though.Overall, really a very decent purchase with good sound quality provided you can get these for under 2k. Cheers!,Hey.  .This one item has a built quality is like a stone..and also the working condition and sound quality it is marvelous, but only one problem is the noise cancellation that not working properly which means when we are in a crowded area while recording something or a call to another person the unwanted noises are coming they cannot hear properly our voice that's the only disadvantage on this one..,Right buds not performs well, I am trying to change music to next but it still plays the same which should not happen according to manual,Been using these for a month now. Can't massively complain, the sound quality is decent enough (may not be good enough for big music heads, not enough bass) and provides good noise isolation. Very impressed by the battery life with the charging case, and I use it every day. If you can snag it on a deal for ~1500 bucks it's a fantastic deal.,My only issue is,  we can't change the connection to 2 devices by 1 click.  Every thing else is fine.,Best at price. and require some button for operation.,call pick up /rejection function, next song play function not working on single touch,Product is good but battery not as expected", "img_link": "https://m.media-amazon.com/images/I/41vEB+mY55L._SY300_SX300_.jpg", "product_link": "https://www.amazon.in/Boult-Audio-PowerBuds-Wireless-Waterproof/dp/B08D11DZ2W/ref=sr_1_69?qid=1672902997&s=computers&sr=1-69"}